{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 05:45:32", "date_modify": "2025-05-21 05:45:32", "date_publish": "2025-04-02 13:52:30", "description": "Daizen Maeda's 'frightening' movement going unnoticed, says manager Brendan Rodgers", "filename": "sport_articles_cr5dm38rnzjo_1747806332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c6a/live/449d94f0-0fc4-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr5dm38rnzjo_1747806332.html", "title": "Daizen Maeda's 'frightening' movement going unnoticed, says manager Brendan Rodgers", "title_page": "Daizen Maeda's 'frightening' movement going unnoticed, says manager Brendan Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daizen Maeda's \"frightening\" movement is a quality that goes under the radar, says Celtic manager Brendan Rodgers.\nThe Japan striker is enjoying a dazzling campaign for the runaway Scottish Premiership leaders, taking his tally for the season to 30 goals in Saturday's win over Hearts.\nFifteen of those strikes have come in the league, which is more than any other player, and he has now scored in his past six apperances.\nA positional change has played a crucial part in the 27-year-old's free-scoring form, with the forward now being deployed through the middle of Celtic's attack following the winter exit of Japanese compatriot Kyogo Furuhashi.\nMaeda's intensity and endurance had often been praised higher than his ability on the ball, but that has changed this season.\nThe relentless defensive work is still there, evidenced by the fact he has made more recoveries and interceptions than any other Celtic attacker this term.\nNow Maeda is matching his off-the-ball effort with attacking output, but manager Rodgers believes the improvement in the Japan forward's movement is perhaps going unnoticed.\n\"The thing that doesn't get mentioned so much - everyone talks about his pressing and his goals - but his movement is frightening,\" Rodgers told Celtic TV.\n\"His movement in the game is as good as you'll see. He's just an absolutely phenomenal player and he will get some more goals by the end of the season, I'm pretty sure.\n\"His anticipation and his reading of the game is so good. You see it in his pressing and you also see it in how he reads the game to get into the positions.\n\"He's playing at a really, really high level and it's just a joy to see him play because he has so much joy.\"", "url": "https://www.bbc.com/sport/articles/cr5dm38rnzjo"}