{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 07:59:44", "date_modify": "2025-05-21 07:59:44", "date_publish": "2025-01-13 10:14:54", "description": "Arne Slot press conference: Nottingham Forest vs Liverpool", "filename": "sport_football_articles_cx2jl8l80jyo_1747814384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a528/live/b7d03a00-4921-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2jl8l80jyo_1747814384.html", "title": "Arne Slot press conference: Nottingham Forest vs Liverpool", "title_page": "Arne Slot press conference: Nottingham Forest vs Liverpool - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Gomez remains \"quite far away\" from a return from injury, with Slot adding: \"He will definitely not be training with the team yet.\"\nMeanwhile, Darwin Nunez will miss Tuesday's game through suspension but Diogo Jota \"is ready to play 90 minutes\" after a period of managing minutes.\nSlot said Wataru Endo, who came on as centre-back against Tottenham, \"is a very important player in the team\" and \"always gives everything he has.\"\nOn the academy players who have featured in cup competitions: \"It is very important for every club but especially this club. This club has always brought talent through the ranks and it is nice to see a few having an impact in training sessions and in games. It gives a good energy in the training ground and team when they are doing well.\"\nSlot said \"it is going to be a very difficult challenge\" to get a result against Nottingham Forest as they are \"definitely\" capable of competing for the Premier League title.\nOn the reverse fixture, Liverpool's only home defeat of the season: \"To lose on that day was hard to take. Now, looking back and seeing where they are in the league, it is not such a shock result as it felt then. They had a good game plan and made us play a poor game. We have to do better. We have to look into the details.\"\nHe said he expects \"the atmosphere to be fired up from the start,\" so they will have to be switched on from the whistle to avoid giving the home crowd being any more vocal.", "url": "https://www.bbc.com/sport/football/articles/cx2jl8l80jyo"}