{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:42:55", "date_modify": "2025-05-21 05:42:55", "date_publish": "2025-04-04 00:00:00", "description": "Middlesbrough give their Championship play-off hopes a massive boost as they comfortably beat Blackburn to move up to fifth in the table.", "filename": "sport_football_live_cx20ldxvxy7t_1747806175.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx20ldxvxy7t_1747806175.html", "title": "Blackburn Rovers 0-2 Middlesbrough: Boro up to fifth in Championship", "title_page": "Blackburn Rovers 0-2 Middlesbrough: Boro up to fifth in Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Middlesbrough gave their Championship play-off hopes a massive boost as they eased to a 2-0 win at out-of-form Blackburn Rovers to move up to fifth in the table.\nBoro got off to a flier in eight hapless defensive minutes for Blackburn - Tommy Conway's sensational strike opening the scoring inside 90 seconds and Samuel Iling-Junior's shot cannoning home off Danny Batth for the visitors' second.\nMichael Carrick's side had a flurry of chances in the second half to put the game to bed - first when Delano Burgzorg's cut-back to an unmarked Conway missed its intended target and again when Finn Azaz bobbled his effort wide.\nOther than second-half efforts from Todd Cantwell and Yuki Ohashi, Blackburn rarely threatened Middlesbrough's lead as they sank to a fifth consecutive defeat and extended their winless run to seven games.\nThe win is Middlesbrough's fifth victory in their past seven matches and pushes them into the play-off places - and three points clear of seventh position - with six games remaining.\nBlackburn, meanwhile, are still without a win in Valerien Ismael's tenure and offered little to suggest they can make up the seven-point deficit on the top six before the season's end.\nOn the evidence of their performance on Friday, it will take a seismic upturn in form for Blackburn to make up ground on the play-off positions, and it was a nightmare start for Ismael's men.\nA flowing move, created by Kelechi Iheanacho, led to Conway taking a sumptuous touch and turn before firing Boro ahead with his 12th Championship goal of the season - and the visitors were not done there.\nCarrick's side cantered into a 2-0 lead without even breaking a sweat, Rovers keeper Aynsley Pears wrong-footed after Iling-Junior's effort initially looked to be sailing off target before Batth diverted the ball into his own net.\nThe opening stages proved to be tough viewing for Blackburn chief executive Steve Waggott, chief operating officer Suhail Pasha and head of football operations Rudy Gestede - with the trio in the stands despite fan groups urging them not to attend the remainder of Rovers' home games this season.\nWaggott told BBC Radio Lancashire earlier this week he intended to maintain engagement with the club's fanbase despite criticism of the way the club was run - but, after the torrid start, chants against Venky's ownership rang around Ewood Park.\nBlackburn did at least show some attacking threat after the break as Cantwell shot narrowly wide from the left of the box and Ohashi's powerful effort from a tight angle forced a fine save from Boro keeper Mark Travers.\nBut Boro saw out a well-earned win and kept a clean sheet to prove their play-off credentials and lay down a marker with their top-six rivals all in action on Saturday.\nBlackburn Rovers head coach Valerien Ismael told BBC Radio Lancashire:\n\"When you don't start the game properly and you end up 2-0 down, this is the big disappointment tonight. The end of the first half and especially the second half, this is how we wanted to play.\n\"Credit to the players to come out with more desire and belief and to dominate the game again. We had the chance to come back. At half-time I said we need to stay calm.\n\"It's not easy to deal with but the next game will be the chance to rectify things and make sure that we learn from those situations. I said to the players, if you give yourselves the chance to compete at 0-0 then your quality at the end will make the difference, because we finished the game very strongly.\"\nMiddlesbrough boss Michael Carrick told BBC Tees:\n\"Every game you try to go out and do the right things. It was the ideal start. I thought it was a fantastic goal and a really good move and I thought it was a hell of a finish by Tommy.\n\"It put us in a really good spot. We caused them a few issues early on and then we got the second goal but credit to them, the game was alive the whole time really.\n\"We never really totally settled and I thought the boys coped with it really well in seeing it out and I was just as happy with the defending as I was with the whole team.\"", "url": "https://www.bbc.com/sport/football/live/cx20ldxvxy7t"}