{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:00", "date_modify": "2025-05-21 05:25:00", "date_publish": "2025-02-12 00:00:00", "description": "Daizen Maeda's header keeps Celtic's hopes of reaching the Champions League last 16 alive, despite defeat against Bayern Munich in Glasgow.", "filename": "sport_football_live_cdjdpj007y3t_1747805100.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cdjdpj007y3t_1747805100.html", "title": "Celtic vs Bayern Munich: Uefa Champions League LIVE report, reaction & stats", "title_page": "Celtic vs Bayern Munich: Uefa Champions League LIVE report, reaction & stats - BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England captain Harry Kane was left, inexplicably, unmarked at the back post to volley in his 29th goal in 29 games this season and seventh in this competition.\nKane supplied warning shots in the first half, smashing into the side netting and forcing Schmeichel into a superb save – though he was ruled offside – but Celtic didn't take heed.\nThe Bundesliga leaders did of their earlier warning, though. They had been stunned inside 30 seconds when former Bayern youngster Nicolas Kuhn shifted inside and swept past Manuel Neuer from 25 yards.\nHowever, an offside flag halted the cacophonous celebrations inside Celtic Park after the offside Adam Idah was deemed to have obstructed Neuer's view.\nIt proved a precursor to a frustrating evening for Celtic but one from which they emerge with their hopes of reaching the last 16 still, just, alive ahead of Tuesday's second leg.\nCeltic's first defeat in the competition this season was a drubbing in Dortmund. A match where they fell behind to a German giant and folded.\nBut as this campaign has continued, they've grown in quality and character. The latter of those was especially on show here.\nOnce again they came under intense pressure from feted European side, but this time they didn't buckle.\nMaeda flashed a ball across the face after darting in front of Neuer, while Reo Hatate also had a sight of goal, as Rodgers' side attempted to yank themselves back into the tie.\nFor a few moments, Arne Engels even thought he might have an opportunity from the spot when he was caught by Dayot Upamecano but, after a lengthy VAR wait, that possibility disappeared.\nIt could have been so very different had Idah shimmied out of the path of Kuhn's strike inside the first minute, but even the start in itself was a sign of progress.\nCeltic didn't start scared or respectful - they kicked off with intent.\nIt's still a mountain to climb in Munich next week, but, they head out with a hint of hope instead of fearing another hiding in Germany.\nThe play-offs weren't in the plans for Bayern and, at times, Kompany's classy bunch showed why.\nOlise was outstanding, and on another night could have scored more than once. Kane continued his relentless run of goalscoring. Leroy Sane starred among stars.\nBayern did to Celtic what Celtic do to most other teams domestically. They passed with speed, moved with elegance, and stretched their opponents repeatedly.\nThey have struggled on the road this season in Europe, with defeats at Aston Villa, Barcelona and Feyenoord, but a fourth wasn't on the cards here.\nThe final of this competition is in Munich and, while Bayern have had to take a bit of a detour via these play-offs, they will still fancy their chances of ending the season in the showpiece game in their home ground.\nCeltic manager Brendan Rodgers: \"We make the changes and were much better in our pressure at the top end of the pitch. We started to move like we normally do.\n\"Then we get the goal and everything changes. By the end, Bayern are happy for the final whistle.\n\"For a lot of our players, it's the first time at this level. This season has been about getting confidence and, after that last 25 minutes, they'll feel a lot better about themselves going into next week.\"\nBayern Munich head coach Vincent Kompany: \"It's cliche to say, but it's the first half of the game. Overall, it's a really great result.\n\"I know this place, I know it transcends performance sometimes. We dealt really well with it for long spells of the game, didn't let the game go crazy.\n\"The last 10 minutes we had to defend and we did that well. Of course, you can feel in those moments, if the game comes alive it is a special place.\"", "url": "https://www.bbc.com/sport/football/live/cdjdpj007y3t"}