{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 07:27:03", "date_modify": "2025-05-21 07:27:03", "date_publish": "2025-05-20 19:53:53", "description": "Southampton identify Lens manager Will Still as their leading candidate for the vacant position at St Mary's Stadium.", "filename": "sport_football_articles_cr7zz91ykn9o_1747812423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/35a4/live/edc8eb20-35ac-11f0-b092-712f055def2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr7zz91ykn9o_1747812423.html", "title": "Will Still: Southampton identify Englishman as leading candidate for manager vacancy", "title_page": "Will Still: Southampton identify Englishman as leading candidate for manager vacancy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton have identified Lens manager Will Still as their leading candidate for the vacant position at St Mary's Stadium.\nThe 32-year-old, born in Belgium to English parents, announced last weekend he is leaving French side Lens to move back to the UK.\nThe move is complicated by negotiations that need to take place to free Still from his contract at the Ligue 1 club, which runs until 2027, as Lens could be due compensation.\nIn March, his partner Emma Saunders, a presenter on Sky Sports who previously worked for BBC Sport, said she was recovering from encephalitis, an infection of the brain.\n\"For multiple reasons, the main reason behind my decision is that I need to go back home,\" Still told reporters on Saturday.\nStill would be a permanent replacement for Ivan Juric, who was sacked in April after the club were relegated from the Premier League with a record seven games left to play.\nThe Englishman built his football career in Belgium at Lierse and Beershot before moving to France, where he became the youngest coach in Europe's top five leagues when he was appointed by Reims, aged 30, in October 2022.\nHe joined Lens on a three-year deal in June and led them to an eighth-place finish in Ligue 1. His brothers Nicolas and Edward, who are assistants at Lens.\nLens have yet to confirm Still's departure. BBC Sport has contacted the club for comment.\nSouthampton were previously tipped with a move for Sheffield Wednesday manager Danny Rohl but the compensation package to move to a club within the same division is thought to be too expensive.", "url": "https://www.bbc.com/sport/football/articles/cr7zz91ykn9o"}