{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:53:52", "date_modify": "2025-05-20 12:53:52", "date_publish": "2023-08-02 00:00:00", "description": "Follow live text updates as Jamaica face Brazil and Panama play France in the Group F deciders at the 2023 Women's World Cup.", "filename": "sport_live_football_66157604_1747745632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FCEF/production/_130615746_whatsubject.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66157604_1747745632.html", "title": "Fifa Women’s World Cup 2023 LIVE: Jamaica vs Brazil & Panama vs France score, commentary & updates from Group F", "title_page": "Fifa Women’s World Cup 2023 LIVE: Jamaica vs Brazil & Panama vs France score, commentary & updates from Group F - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's the end of this live text now, thanks for joining us today.\nCome back tomorrow for the last two group games.\nOr if you want the live text action to keep going follow our transfers and pre-season friendlies one here.\n'One of the best feelings I have ever had in my life'\nFT: Jamaica 0-0 Brazil\nJamaica manager Lorne Donaldson speaking to ITV1: \"I tell you what, this is one of the best feelings I have ever had in my life. To see these girls from Jamaica to do this.\n\"I thank the girls to do this for the country and the girls should be proud. To be able to do this, it is unbelievable to watch this while I am standing here alive watching.\n\"It was a war and we stayed in the battle and we won the war. We have some more work to do but we will just enjoy tonight. Not much celebration, I need a couple of beers and I'm good. I will enjoy it.\"\n'Marta will go down in history for all the right reasons'\nFT: Jamaica 0-0 Brazil\nEmma Hayes\nChelsea manager on ITV1\nWhat an emotional moment for Marta. It's not the way she would want to bow out at a World Cup but what memories she has made for lots of us who have witnessed an incredible footballer over a long period of time. She deserves at least that farewell to the fans.\nShe is one who will go down in history for all the right reasons.\n'Jamaica believed'\nFT: Jamaica 0-0 Brazil\nEmma Hayes\nChelsea manager on ITV1\nYou know what, I feel really teary because I wanted Jamaica to win.\nYou could see how the coach Lorne Donaldson set the team up. They believed.\nDrew Spence shouted to the crowd at the end, \"we told you so\". That team believed they had the ability to do it and they thoroughly deserve to be in the next round.", "url": "https://www.bbc.com/sport/live/football/66157604"}