{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:18", "date_modify": "2025-05-21 04:16:18", "date_publish": "2025-04-05 18:13:03", "description": "Sheffield United boss Chris Wilder has said he has no complaints following his side's 1-0 defeat at Oxford United.", "filename": "sport_football_articles_cd6j4vvl07eo_1747800978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fac8/live/a567bd70-1248-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6j4vvl07eo_1747800978.html", "title": "Chris Wilder: Sheffield United boss reacts to Oxford United loss", "title_page": "Chris Wilder: Sheffield United boss reacts to Oxford United loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United boss Chris Wilder has said he has no complaints following his side's 1-0 defeat at Oxford United.\nThe Blades drop to second in the Championship table below Burnley and will be grateful for the efforts of Luton Town who prevented Leeds United from also leapfrogging Wilder's side by picking up a 1-1 draw at Kenilworth Road on Saturday.\n\"We didn't do enough so there's no arguments about the result,\" Wilder told BBC Radio Sheffield.\n\"They started better than us - a team fighting for their lives, they stuck it on us with long throws.\n\"There was an opportunity to gain three points but well done to Gary [Rowett], they deserve their win and obviously an amazing away record comes to an end.\n\"It's not an attitude problem, we just made some bad decisions. It was a slow pitch, a dry day, and we have to recognise we have to play a little bit quicker and more direct.\n\"We've got to make better decisions, to do something different - its not FIFA! We didn't do the basics right.\n\"The game's not won on a coupon, the game's won on a pitch, and we didn't do enough to win.\"", "url": "https://www.bbc.com/sport/football/articles/cd6j4vvl07eo"}