{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:03:39", "date_modify": "2025-04-26 04:03:39", "date_publish": "2025-03-03 19:59:03", "description": "Club Brugge vs Aston Villa: John McGinn on having 'no excuses'", "filename": "sport_football_articles_c86p1zlv5q3o_1745640219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d90/live/2d13edb0-f869-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c86p1zlv5q3o_1745640219.html", "title": "Club Brugge vs Aston Villa: John McGinn on having 'no excuses'", "title_page": "Club Brugge vs Aston Villa: John McGinn on having 'no excuses' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aston Villa captain John McGinn says they have a \"no-excuse mentality\" under boss Unai Emery.\nHaving impressed last season to qualify for the Champions League in fourth place, Villa have struggled to replicate that form in the Premier League this campaign.\nHampered by injuries to key players, Villa currently sit 10th, five points off Manchester City in fourth and having played a game more.\nHowever, in Europe, they impressed by finishing in the top eight of the new-look league phase.\n\"I don't know [why we are inconsistent]. You can use all the excuses like injuries, lots of games in a short space of time,\" McGinn said. \"But, last season we adopted a no-excuse mentality. The manager didn't allow us to [have any excuses]. So not hitting the same levels as last season is on us.\n\"Competing in elite competition in Europe has maybe taken its toll on performances domestically in the league. We will be doing everything to put it right. We have got it in us to put a run together.\n\"We have proven in the past few seasons that we can get a run [together] and a bit of momentum.\n\"We are excited to get some players back in the squad and there is a bit more of a spark. This squad is going to get healthier towards the end of season, so we have no excuses.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c86p1zlv5q3o"}