{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 04:12:14", "date_modify": "2025-05-21 04:12:14", "date_publish": "2025-01-15 08:27:40", "description": "Plymouth Argyle head coach Miron Muslic says he was impressed with new left-back Tymoteusz Puchacz.", "filename": "sport_football_articles_ce3l1dk2eelo_1747800734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b310/live/4fa644c0-d2cd-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3l1dk2eelo_1747800734.html", "title": "Tymoteusz Puchacz: Plymouth Argyle's new left-back wins plaudits", "title_page": "Tymoteusz Puchacz: Plymouth Argyle's new left-back wins plaudits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Miron Muslic says he was impressed with new left-back Tymoteusz Puchacz.\nThe Poland international made his first start for Argyle in their 1-1 draw with Oxford United - Muslic's first game in charge.\nHe became the club's second January signing last week when he moved from German side Holsten Kiel on loan with the option of a permanent deal in the summer.\nPuchacz set up Argyle's only goal, having also had a hand in two of the Pilgrims' other good chances in the first half.\n\"We saw what kind of player he is,\" Muslic told BBC Sport.\n\"A typical Eastern Bloc player, very aggressive with the heart in the right spot, but also very technical.\n\"The biggest goalscoring opportunities and the biggest threat was actually always from his side.\n\"The goal was beautiful, well prepared, but also that there was an urgency defending.\n\"I think this position fits to him so he can show all his offensive qualities, and I think if you're purely look the two profiles, Tymo on one side and Bali (Mumba) on the other side, these are players that can perfectly play this wing back position.\"", "url": "https://www.bbc.com/sport/football/articles/ce3l1dk2eelo"}