{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 04:07:31", "date_modify": "2025-05-21 04:07:31", "date_publish": "2025-02-01 15:52:21", "description": "Galopin Des Champs storms to victory in the Irish Gold Cup at Leopardstown for the third year running.", "filename": "sport_horse-racing_articles_c3e1014npzqo_1747800451.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f863/live/cf6790d0-e0b8-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_c3e1014npzqo_1747800451.html", "title": "Galopin Des Champs wins third Irish Gold Cup at Leopardstown", "title_page": "Galopin Des Champs wins third Irish Gold Cup at Leopardstown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Galopin Des Champs stormed to victory in the Irish Gold Cup at Leopardstown for the third year running.\nThe 1-2 favourite, ridden by Paul Townend, comfortably saw off the challenge of eventual third Fact To File, while Grangeclare West grabbed second in a one-two-three for trainer Willie Mullins.\nStrains of 'Ole, Ole, Ole' broke out in the crowd to salute the treble winner.\n\"Something that never before happened to me, when we were jumping the last ditch, I could feel and hear the roar from the stands,\" said Townend.\nMullins said: \"He jumped and galloped for three miles and it didn't look like he was stopping coming up to the winning post. He's just a real champion.\n\"He's the best chaser I've trained and Hurricane Fly the best hurdler.\"\nGalopin Des Champs is now 4-6 favourite to follow up with a third consecutive Cheltenham Gold cup triumph in March.\nHe joins Jodami and Beef Or Salmon as a triple Irish Gold Cup winner, and is one away from the record four victories of Florida Pearl, also trained by Mullins.\nVictory for Galopin Des Champs on day one of the Dublin Racing Festival was his 11th career success over fences and seventh at Leopardstown.\nLast year's Triumph Hurdle victor Majborough was another Grade One winner for Mullins, taking the Irish Arkle to remain on course for a meeting with Nicky Henderson's Sir Gino in the English version at Cheltenham.\nGavin Cromwell enjoyed a double thanks to juvenile hurdler Hello Neighbour and Perceval Legallois, in the handicap hurdle, who is now 20-1 from 33s for the Grand National at Aintree in April.", "url": "https://www.bbc.com/sport/horse-racing/articles/c3e1014npzqo"}