{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-20 11:59:04", "date_modify": "2025-05-20 11:59:04", "date_publish": "2023-08-06 08:51:57", "description": "David Turnbull takes full advantage of a surprise start to score twice and set up another goal in Celtic's 4-2 win over Ross County.", "filename": "sport_football_66416980_1747742344.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3D32/production/_130666651_-3b42cfce-8a2a-4afc-9a14-3d89d41f1a34.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66416980_1747742344.html", "title": "Celtic 4-2 Ross County: Forgotten man David Turnbull in timely reminder to returning manager", "title_page": "Celtic 4-2 Ross County: Forgotten man David Turnbull in timely reminder to returning manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At the top end of the Scottish Premiership, supporters tend to demand new faces and big fees over the summer months.\nOff the back of a domestic treble, Celtic fans have seen the arrivals of Maik Nawrocki, Odin Thiago Holm, Hyun-jun Yang, Marco Tilio and Hyeok-kyu Kwon.\nBut, at times, a solution for improving the team may already be there.\nOn Saturday against Ross County, it was David Turnbull who lit up flag day for the defending champions. The former Motherwell midfielder was given a huge show of faith by manager Brendan Rodgers at the expense of Reo Hatate, one of last term's stand-out performers.\nMany inside the stadium would have been surprised by that call.\nHow Turnbull repaid Rodgers. The 24-year-old played a part in Celtic's opening three goals, netting two, before being replaced to very generous applause. There was a sense of: \"Oh, that Turnbull's pretty decent, forgot about him.\"\nThe Scotland international demonstrated the ability we all know exists. The ability that convinced Celtic to shell out around £3m despite a protracted process involving recuperation from long-term injury.\nWith just one year left on his contract, his retention may have turned into a priority, adding to the long-term extensions for Kyogo Furuhashi, Daizen Maeda and captain Callum McGregor.\n\"He's got that quality and ability,\" Rodgers told BBC Sportsound. \"I can only assess from what I've seen. He's been excellent in training and in games.\n\"What I do for players is create an environment. He'll determine how far he goes. He's at an age now where, if he can take that on, he can become a very, very important player for us. Hopefully this is a nice confidence boost for him.\"\nRodgers added: \"I remember seeing him when I was first up here and I liked his game and he maybe just hasn't quite hit the heights of what his talent is.\n\"I love his care with the ball, his passing, and his efficiency. He gets in the box, he gets goals, and he maybe could have had a hat-trick.\"\nFor Scotland and head coach Steve Clarke, Turnbull's early season reminder may also offer an effective option in the international set-up.\nTurnbull's technique is unquestioned, his finishing ability is top drawer and he has a threat from set pieces. He has a football brain that buys him a second at vital moments.\nLast season, the midfielder's impact was limited. He featured often, but mostly from the bench.\n\"It was great to be back out there,\" he told Sky Sports. \"I'm delighted for myself and the team. Game time has been hard to come by, so it's been good to be back in there and repay the faith the manager has shown in me.\"\nMatt O'Riley followed that up by saying his team-mate is \"too good not to play football\".\nOne trademark of Rodgers' first spell at Celtic was his ability to develop players. James Forrest was one of the standout examples, the winger going from a player that was looking slightly lost to a key man in an all-conquering side.\nIt is perhaps fitting that Forrest has just enjoyed his testimonial, hoisted the title flag in the season opener and then played his part off the bench.\nTurnbull may have taken note of that earlier transformation in Forrest's fortunes. He performed with confidence and absolutely took his chance with a player-of-the-match display.\nAmid the popular clamour for new faces, Rodgers may just have identified a key starting option he can develop further.", "url": "https://www.bbc.com/sport/football/66416980"}