{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:08:09", "date_modify": "2025-05-20 12:08:09", "date_publish": "2023-08-05 11:22:01", "description": "Harry Leonard and Dilan Markanday score on their first league starts to give Blackburn victory over West Brom.", "filename": "sport_football_66345304_1747742889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4A84/production/_130667091_leonard3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345304_1747742889.html", "title": "Blackburn 2-1 West Bromwich Albion: Rovers get opening day victory", "title_page": "Blackburn 2-1 West Bromwich Albion: Rovers get opening day victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry Leonard and Dilan Markanday scored on their first league starts to give Blackburn victory against West Brom.\nThe opening day of the Championship season was a miserable one, however, for Baggies manager Carlos Corberan, who was sent off for two yellow cards as his team's second-half fightback was not quite enough.\nTeenage striker Leonard and 21-year-old winger Markanday scored within two minutes of each other in the first half for an excellent start to their season as Rovers looked to build on last season where they just missed out on the play-offs.\nMatt Phillips pulled one back for the visitors in a much brighter performance after the break but the West Midlands side could not find the equaliser.\nThe opening round of Championship games had pitted two sides who were seemingly heading in different directions at the end of last season, against each other.\nRovers slipped out of the play-off places with a dismal finish to that campaign, while the Baggies had shown promotion form after Corberan had taken the reins as they sat in the relegation places - and only finished three points behind their opponents.\nThe loss of key players Ben Brereton Diaz, Bradley Dack, Thomas Kaminski and Ash Phillips had further deepened the gloom at Ewood Park, while optimism was rife at The Hawthorns.\nRovers were quickest out of the blocks, however, as Markanday won the ball to start a counter-attack, Leonard and Lewis Travis carrying on the move before Markanday - who spent much of last season at Aberdeen on loan - finished well.\nFrom the re-start, Sammie Szmodics intercepted and played in Leonard, given his chance after the summer departures, for his first senior goal.\nThe travelling Baggies fans voiced their displeasure at half-time and within five minutes they had fresh hope as Phillips finished a slick move with a curling finish.\nCorberan was yellow-carded for protesting that an arm had been used as Joe Rankin-Costello made one of two crucial blocks to deny Jayson Molumby, and was red-carded soon afterwards for more dissent.\nBlackburn manager Jon Dahl Tomasson told BBC Radio Lancashire:\n\"It was an exceptional win and performance. We scored two great goals and should probably have had a third, fourth, maybe a fifth goal as well, against one of the best teams in the league.\n\"The intensity of the team was very good and we played some good football as well. We gave a stupid goal away, an unnecessary goal, and I was not happy with that one.\n\"I think we were just below 24 in our average age today. Harry [Leonard] started at the academy when he was 10 and the first thing he said after the game, when I told him, 'Well done, you played a good game and scored a great goal', was, 'I should have had a hat-trick'.\n\"I said, 'Yes, you should have had a hat-trick' - that's the ambition of the boy.\n\"It was also good to see Dilan [Markanday]. We all know Dilan had a difficult period as well but he came back in pre-season with the right attitude and has been working hard and doing the right things in pre-season.\"\nWest Brom captain Jed Wallace told BBC Radio WM:\n\"We had a lot of control for the first 25 minutes and were probably the better team and then, the nature of the beast in the Championship, [they scored] a quick couple of goals.\n\"A bit sloppy from us to give away two goals within a minute away from home. It makes it difficult, the crowd get up on their behalf.\n\"We did show great character to come out in the second half, and you could see the desire we put into the game.\n\"We scored a great goal and had a couple of goalmouth scrambles that we couldn't quite get our way, and naturally they're going to have a couple of chances themselves on the break.\n\"It's a day of disappointment but it's not a day that will define our season with more than 100 points to play for.\"", "url": "https://www.bbc.com/sport/football/66345304"}