{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-04-26 06:39:19", "date_modify": "2025-04-26 06:39:19", "date_publish": "2025-03-02 16:14:52", "description": "India will face Australia in the first semi-final of the Champions Trophy on Tuesday, having beaten New Zealand to finish top of Group A.", "filename": "sport_cricket_articles_cy4vel3mg4eo_1745649559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/118a/live/9b06bc50-f77c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cy4vel3mg4eo_1745649559.html", "title": "Champions Trophy 2025 results: India beat New Zealand to set up Australia semi-final", "title_page": "Champions Trophy 2025 results: India beat New Zealand to set up Australia semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "India beat New Zealand by 44 runs in the final group match of the Champions Trophy to set up a semi-final against Australia.\nHaving been set 250 to win on a slow surface in Dubai, the Black Caps were bowled out for 205 after a masterful performance from India's spinners with Varun Chakravarthy taking 5-42.\nKane Williamson's 81 kept New Zealand in contention, but the required run-rate mounted through the middle overs and the last seven wickets fell for 72 runs.\nIndia are playing all of their matches in Dubai having chosen not to travel to Pakistan, and will face Steve Smith's Australia in the first knockout match on Tuesday.\nNew Zealand, who had also already qualified before this match, will play South Africa in Lahore on Wednesday.\nIndia's batters also struggled for fluency as they slipped to 30-3, including another sensational catch from Glenn Phillips at point to remove Virat Kohli for 11.\nA patient stand of 98 between Axar Patel and Shreyas Iyer, who top-scored with 79, led India's recovery before Hardik Pandya's run-a-ball 45 helped post a competitive total.\nNew Zealand were exceptional in the field while seamer Matt Henry starred with 5-42, but it was an ominously brilliant display from the India spinners on a favourable Dubai surface where the final will also be played if they qualify.\nBoth teams were unbeaten in the group coming into this encounter, which presented a fascinating opportunity how they would fare under significant pressure for the first time.\nIndia were immediately on the back foot with Shubman Gill pinned lbw by Henry for two, skipper Rohit Sharma fell to Kyle Jamieson for 15 and the crowd was silenced by another of Phillips' one-handed acrobatic efforts.\nBut Axar and Shreyas, whose partnership came from 136 balls, expertly rotated the strike calmly and adjusted to the tricky surface which enabled Hardik to play more expansively in the closing overs.\nWhile it was not explosive, it was the significant partnership that New Zealand's innings lacked as nobody was able to support Williamson, with the stand of 44 between himself and Daryl Mitchell the highest contribution.\nThey did not collapse or lose wickets in clusters but Rohit utilised his four spinners cannily, with each offering a different challenge and none of the batters were able to settle.\nAt 133-3 with 18 overs remaining, the match was intriguingly poised but when Tom Latham was trapped in front by Ravindra Jadeja, India had their opening and Chakravarthy burst through.\nHaving earlier removed opener Will Young for 22, he had Phillips and Michael Bracewell lbw, Mitchell Santner was bowled for 28 and Henry was caught at mid-off for two.\nNew Zealand will still be confident as they head back to the batter-friendly surface of Lahore, but India's spin quartet looks like it will be the biggest challenge for any team to overcome.\nIndia captain Rohit Sharma: \"It was very important for us to finish on a high against a very good team. New Zealand are a very good side but we played perfect cricket today.\n\"In such a short tournament you have to try and win every game that's in front of you. Australia have a rich history but it's about us.\"\nNew Zealand captain Mitchell Santner: \"It was a slower wicket than what we have come up against but we knew that coming in.\n\"If you had said we'd have to get 250, we'd have been happy. It spun more than we thought but their four quality spinners makes it pretty tough.\"\nFormer New Zealand wicketkeeper Katey Martin on BBC Test Match Special: \"New Zealand looked clueless against the spin and it was a challenging innings for Kane Williamson.\n\"It felt like they never got out of gear. They have to learn as much from this game as they can if they do come back to play here again.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cy4vel3mg4eo"}