{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:14:39", "date_modify": "2025-05-19 15:14:39", "date_publish": "2015-02-19 17:13:04", "description": "Great Britain's men and women's quartets lose to Australia & New Zealand in Track World Championships team pursuit finals.", "filename": "sport_cycling_31535810_1747667679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81115000/jpg/_81115499_cyclists.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_31535810_1747667679.html", "title": "Track World Championships: GB women and men's teams win silver", "title_page": "Track World Championships: GB women and men's teams win silver - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's women were beaten as Australia broke the world record by nearly three seconds in the Track World Championships team pursuit final.\nThey denied Katie Archibald, Elinor Barker, Laura Trott and Joanna Rowsell a fifth straight gold and inflicted on them their first defeat in four years.\nAustralia won gold with a blistering time of four minutes 13.683 seconds.\nThe GB men's pursuit team also had to settle for silver after a desperately close battle with New Zealand.\nEd Clancy, Steven Burke, Andy Tennant and Owain Doull recorded an impressive time of 3:54.687 in a final in which they had opened up a lead of more than half a second.\nHowever, a final-lap surge from New Zealand saw the Kiwi quartet edge back ahead to take the gold in a time of 3:54.088 and deny Britain a first gold in the event since 2012.\nBurke and Doull were both involved in a training accident in Mallorca last month, and Clancy said the team deserved credit for the way they had performed - especially when judged against their eighth-place finish in 2014.\n\"It was only a month ago Burkey was lying in the road with a broken collarbone, Doull was cut to ribbons and I didn't think we were coming here,\" he said.\n\"We had a shocker of an event in 2014. Understandably we got a fair bit of flack for that. This was a massive improvement.\"\nClancy said their performances in Paris had bolstered their belief that they will be in contention for gold at the Olympic Games in Rio next year.\n\"We can't guarantee we'll get out and win, but we believe we've got a chance,\" he said.\nThe performance of the evening came from Australia's women Annette Edmondson, Ashlee Ankudinoff, Amy Cure and Melissa Hoskins as they demolished Britain's previous world record of 4:16.552.\n\"I'm a bit gutted, I guess,\" said Trott, who had previously won gold in the event in every year since her Track World Championships debut in 2011.\n\"It's the first one we've lost so a bit of a shock but they rode a 4:13 which is unbelievable. We've never gone anywhere near doing that so hats off to them,\" she added.\n\"It's disappointing. We are used to being on the top step so it was a different feeling. But we rode a PB, quicker than we've ever been before at sea level, and for us that is a massive step. It also shows we have work to do.\"\nEarlier Britain's Jason Kenny, the 2013 world champion, failed to qualify in the men's keirin.\n\"I was just a spectator and never really got involved in the race,\" he said.\n\"Once they went down to three riders when Ed Clancy dropped out, I thought I was going to lose my voice doing the commentary.\n\"Panic can set into the team. The Kiwis went down to three riders too but had so much left over the GB riders.\n\"When you get into the position of a final it's not about the performance, it's about the win. The performance was great, they can hold their head up high with the way they've performed but I know that will be of very, very little consolation.\"", "url": "https://www.bbc.com/sport/cycling/31535810"}