{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-05-20 13:07:43", "date_modify": "2025-05-20 13:07:43", "date_publish": "2023-08-02 15:05:32", "description": "Are Saints playing hard ball or playing fair? BBC Radio Solent's Adam Blackmore shares his insight and analysis.", "filename": "sport_football_66381674_1747746463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EE99/production/_130618016_gettyimages-1230678349.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66381674_1747746463.html", "title": "Adam Blackmore column: Southampton determined to get fair return for top players", "title_page": "Adam Blackmore column: Southampton determined to get fair return for top players - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Southampton manager Russell Martin has described all the transfer rumours swirling around St Mary's as \"noise\".\nBut there is no doubt the signing period for a club like Saints is something that can't end quick enough.\nIt's bad enough for the clubs who aren't in the top five or six in the country that the window closes four weeks after the season starts.\nBut it is especially bad when you are a relegated Premier League team and the vultures are circling to pick the best meat from your carcass.\nWe all know that Southampton's top players may well be back in the top flight of English football at least a year before the club and there's been a calm level of acceptance of that from the manager and the hierarchy, which has made it easier for fans to stomach.\nNo fan in their right mind would begrudge James Ward-Prowse a shot at European football and a return to the bright lights of the Premier League. Touch wood (knocks on the table), unlike some summers when the club has had stand-offs with players - think Virgil Van Dijk - that have unsettled the dressing room and made the manager's job harder. This summer has for the most part seen the players go about pre-season without any drama.\nThat is despite the club taking a tough stance on player valuations, a strategy in itself that fans love, but one that could also end up with disgruntled players still at St Mary's in September. It's a tightrope Saints are walking and one that I admire.\nThis strategy of not letting players just leave for little return shows strength from the board, new chief executive Phil Parsons and director of football Jason Wilcox. Most importantly it is a strategy and not a desperate fire sale.", "url": "https://www.bbc.com/sport/football/66381674"}