{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:48", "date_modify": "2025-05-21 07:25:48", "date_publish": "2025-01-22 10:59:29", "description": "Peterborough boss Darren Ferguson insists his team have shown a \"marked improvement\" despite failing to win either game since bringing in two recruits.", "filename": "sport_football_articles_c2d35e21nkyo_1747812348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2b8/live/7d50f6c0-d8ab-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2d35e21nkyo_1747812348.html", "title": "Darren Ferguson: Peterborough shown 'marked improvement' with signings", "title_page": "Darren Ferguson: Peterborough shown 'marked improvement' with signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Peterborough United boss Darren Ferguson believes his team have shown a \"marked improvement\" despite failing to win either league game since bringing in two new defenders.\nPosh last week signed Sam Hughes and Tayo Edun for the rest of the season but have drawn both League One games since then.\nThey remain 19th in League One following Tuesday's 1-1 home draw with Exeter City, but with a six-point buffer to the relegation places.\n\"I'm disappointed for the players because they just can't catch a break at the moment,\" Ferguson told BBC Radio Cambridgeshire.\n\"The boys are giving everything. It's that kind of season where it's just frustrating.\n\"But I think everyone can see, that's been watching us all season, the marked improvement in the two games, from the new players (arriving).\"\nEdun, though, gave away the stoppage-time penalty from which Exeter scored their equaliser, Millenic Alli knocking in the rebound after Nicholas Bilokapic saved his initial spot-kick.\nDespite that, Ferguson said: \"He's been excellent. He's a good footballer. I tried to sign him years ago when we got into the Championship, and he went to Blackburn.\n\"He's got a really good footballing brain, good energy, he's aggressive, very rarely gives the ball away.\n\"I've been delighted with the ones that have come in. It's been hard for them, they came in on a Thursday, trained, game straight away, hardly any recovery, and game again.\"\nFerguson is hoping for more new recruits before the end of the transfer window but believes he already has a squad capable of winning more games than they lose between now and the end of the season.\nOn Bilokapic saving the penalty against Exeter, he added: \"I wish his team-mates would bail him out now and again.\n\"I had a feeling he'd save it but they had four players ready to put it in the net in front of any of our players, and that's disappointing.\n\"That's just the way it is at the moment but we can't feel sorry for ourselves, we've just got to keep going. I've seen improvement. We're not maybe at home going to be as fluent as we have been, but I see a team having a right go.\"\nPeterborough are away to Lincoln City on Saturday before a home game against Wigan Athletic next Tuesday.", "url": "https://www.bbc.com/sport/football/articles/c2d35e21nkyo"}