{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:07", "date_modify": "2025-05-21 07:48:07", "date_publish": "2025-05-18 18:44:36", "description": "Tex Hoy scores a hat-trick for Castleford Tigers in their Super League victory over struggling Salford Red Devils at The Jungle.", "filename": "sport_rugby-league_articles_c4ge3ewpdq7o_1747813687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fc3d/live/47348ff0-3415-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c4ge3ewpdq7o_1747813687.html", "title": "Super League: Castleford 46-18 Salford Red Devils", "title_page": "Super League: Castleford 46-18 Salford Red Devils - Tex Hoy scores hat-trick in thumping win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Castleford Tigers claimed eight tries for a dominant third Super League win of the season to pile more pressure on basement strugglers Salford Red Devils.\nA match played in bright sunshine at The Jungle was illuminated further by a dazzling display from home full-back Tex Hoy, who rattled in a superb hat-trick and had a hand in three more tries.\nZac Cini, Innes Senior, Muizz Mustapha, Alex Mellor and Daejarn Asi all went over as 10th-placed Cas kept clear distance between them and their troubled visitors, who fought back in the second period with a try from Matty Foster and two from Nene Macdonald.\nVictory allowed Castleford to pull four points clear of the battle at the bottom with Huddersfield Giants and Salford anchored in their own private battle at the foot of the table.\nSalford's off-field troubles following the eve of season takeover, with unpaid wages, big-name exits and chief executive Chris Irwin resigning three months into the job, have had obvious knock-on effects.\nThe Red Devils had won only once in 10 Super League games before their trip to the Tigers, and what was obvious from the opening moments was that, while there is talent and drive in this squad, there is little confidence.\nSalford got close to Castleford's goalline in a bright opening on a number of occasions but they just could not find the right pass or make the right decision against a stubborn Tigers defence.\nIn contrast, the hosts went over with their first real chance as Hoy spun his way out of trouble to ground the ball after seven minutes. They doubled their lead to 12-0 halfway through the first period when Cini picked up Asi's kick and went over.\nThe try brought up a 400th league point conceded by Salford this season, and it got worse before the end of the first period when Hoy's break from his in-goal area set up a machine gun set of passes which Senior finished off.\nAnd two minutes before the half-time hooter Hoy scored his side's fourth try after a brilliant break and exchange of passes with Senior.\nAt 24-0, Salford left the field haunted by the spectre of a sixth 'nilling' of the season, but they emerged energised and claimed two tries in eight minutes from Foster and powerhouse Macdonald.\nSalford had given themselves a chance but as they approached the hour mark a converted try from Mustapha took the score to 30-10.\nAmid a creeping inevitability, Hoy won a foot race to ground the ball for a sixth try and his own treble.\nMellor and Asi added tries seven and eight, yet it was to Salford's credit they kept battling to the hooter.\nMacdonald went over for his second in between those two Cas tries which, given the circumstances of the match and his side's season, was understandably barely celebrated.", "url": "https://www.bbc.com/sport/rugby-league/articles/c4ge3ewpdq7o"}