{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:14:38", "date_modify": "2025-05-21 07:14:38", "date_publish": "2025-01-13 18:17:20", "description": "Flanker Peter O'Mahony will be monitored for selection ahead of Munster's final European Pool match as he continues his recovery from a calf injury.", "filename": "sport_rugby-union_articles_cqx9w00n587o_1747811678.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66e3/live/6df21450-d1d7-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cqx9w00n587o_1747811678.html", "title": "Peter O'Mahony: Ireland flanker to be monitored for selection after calf injury", "title_page": "Peter O'Mahony: Ireland flanker to be monitored for selection after calf injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland flanker Peter O'Mahony will be monitored for selection before Munster's final European Pool match as he continues his recovery from a calf injury.\nMunster travel to Northampton Saints, who have already qualified, in the final round of Pool Three fixtures in the Investec Champions Cup.\nThe Irish province say O'Mahony, 35, will \"increase his training load\" and a decision on his availability will be made \"later in the week\".\nThe potential return of O'Mahony will be a boost to Ireland interim head coach Simon Easterby, who names his Six Nations squad on Wednesday.\nHowever, Munster will be without wing Shane Daly, who is following return to play protocols after failing a head injury assessment during Saturday's win over Saracens.\nScrum-half Conor Murray, back row Jack O'Donoghue and hooker Diarmuid Barron are all available for selection after returning to action in the 17-12 win over the English side, which put Munster into second place in the Pool.\nWing Diarmuid Kilgallen has also returned to full training following a wrist injury and prop Mark Donnelly has recovered from an ankle injury sustained on Emerging Ireland duty in September.\nVictory over Northampton would secure a place in the knock-out stages and a home last-16 tie.", "url": "https://www.bbc.com/sport/rugby-union/articles/cqx9w00n587o"}