{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:07", "date_modify": "2025-05-19 14:41:07", "date_publish": "2017-08-11 15:24:06", "description": "Lewis Grabban scores twice for Sunderland and also nets an own goal as the Black Cats beat Norwich 3-1 at Carrow Road.", "filename": "sport_football_40841330_1747665667.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5501/production/_97316712_grabban2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40841330_1747665667.html", "title": "Norwich City 1-3 Sunderland", "title_page": "Norwich City 1-3 Sunderland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Grabban scored twice for Sunderland and also netted an own goal as the Black Cats beat Norwich for their first league win of the season.\nGrabban, a former Norwich striker, latched on to James Vaughan's flick-on to open the scoring before half-time.\nAiden McGeady added a superb second from 20 yards and crossed for Grabban to nod in his second at the far post.\nGrabban poked into his own net after Sunderland failed to clear a set-piece, while Norwich also hit a post late on.\nCaptain Russell Martin struck the woodwork as Norwich sought a second goal that would have set up a dramatic finish, but the Canaries fell to their first defeat under new boss Daniel Farke.\nSimon Grayson's Sunderland, meanwhile, have taken four points from their two league games since being relegated from the Premier League last season.\nSummer signing Grabban, on a season's loan from Bournemouth, scored on his Sunderland debut as they drew their opening Championship match 1-1 at home to Derby, and was on form at Carrow Road.\nNorwich dominated possession for much of the contest but Sunderland's clinical finishing proved the difference between the sides.\nNorwich boss Daniel Farke: \"I thought it was a really good performance - we had 75% of possession in the first half, just over 70% in the second, it was 13-1 in corners and we had a lot more chances than them.\n\"But in this game it doesn't matter about your philosophy or your performance, it is about the results and it is down to the small things that we lost this game.\n\"It is very frustrating but the fact that we dominated a game against a side who have only just come down from the Premier League is a good sign.\"\nSunderland manager Simon Grayson: \"This is a tough place to come to and we knew they would be putting us under pressure in their first home game of the season, but I thought the lads stuck to the game plan really well.\n\"It's a great win and it has been a strongish start for us - but that's all it is, a good start, and no-one is getting carried away.\n\"What has happened here is in the past - it's all about what happens in the future now and what I will say is that I have got a good, hard-working group here - it's a working class city and that's what the people demand.\"", "url": "https://www.bbc.com/sport/football/40841330"}