{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:56", "date_modify": "2025-05-21 05:25:56", "date_publish": "2025-01-05 09:00:06", "description": "Spanish interest in out of favour Celtic attacker and conflicting reports on future of Scotland defender...", "filename": "sport_football_articles_cy9q3eqg113o_1747805156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/871f/live/d007b1e0-cb42-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy9q3eqg113o_1747805156.html", "title": "La Liga club chase Celtic winger - gossip", "title_page": "La Liga club chase Celtic winger - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "La Liga side Rayo Vallecano want to sign Celtic and Honduras winger Luis Palma on a six month-loan. (The Herald), external\nScotland full-back Greg Taylor wants to join Dinamo Zagreb from Celtic reports Croatian outlet Sportske novosti. (Herald - subscription), external\nGreg Taylor makes it his priority to stay at Celtic – despite the club's pursuit of former hero Kieran Tierney. (Daily Record), external\nScotland defender Kieran Tierney has rejected interest from Leicester City, Brentford, and West Ham as he nears a return to Celtic from Arsenal. (The Telegraph via Daily Record, external)\nCrystal Palace midfielder Jadan Raymond is a target for Dundee and Colchester United in this month's transfer window. (Football Insider), external\nRangers defender Adam Devine, out of contract in the summer, is being looked at by West Bromwich Albion and could be available for a small fee. (Alan Nixon - subscription), external\nRoss County want to sign Watford goalkeeper Myles Roberts, who is on loan at Partick Thistle. (Daily Record), external\nDutch free agent attacker Jean-Paul Boetius is being looked at as a possible signing by St Johnstone. (Not the Old Firm), external\nDefender Sean Kelly is expected to move abroad after leaving Dundee. (Courier - subscription), external\nWith Scotland full-back Nathan Patterson eager to secure a loan move away from Goodison Park amid speculation over a return to Rangers, Everton are preparing to submit an official offer for Galatasaray defender Elias Jelert. (Tavkim via Daily Record, external)", "url": "https://www.bbc.com/sport/football/articles/cy9q3eqg113o"}