{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:19:59", "date_modify": "2025-05-20 13:19:59", "date_publish": "2023-08-02 09:17:02", "description": "Felix White discusses how England's win in the final Test provided remarkable moments fans will be able to relive forever.", "filename": "sport_cricket_66373711_1747747199.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EA68/production/_130080006_bbc-sport-project-chameleon-columnist-banner--8a5d7923-9962-4e69-88f9-6661cc6a01d5.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66373711_1747747199.html", "title": "The Ashes 2023: England's win in fifth Test full of moments to cherish - Felix White", "title_page": "The Ashes 2023: England's win in fifth Test full of moments to cherish - Felix White - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Felix White is a musician, author and co-host of the BBC's Tailenders podcast.\nIn his sixth column for BBC Sport this summer, he discusses watching England win the final Test at The Oval - a match full of special moments for fans to live and relive.\nLiving in the moment. A state of active, intentional dedication to the present.\nIt has never been more sought after and has, no doubt, never been more rarely achieved.\nWhat is it to live in the moment, without contrive or artifice these days? What with modern living rife with anxiety, distraction, and catastrophising, who is carrying the tools anymore to do it?\nIn the world we live in, can anyone hand on heart lay claim to experience time slow, stretch and extend and sense yourself as part of something that others are experiencing too?\nAs unprecedented, mercurial and enveloping this men's Ashes turned out to be, ending in ludicrously joyous circumstances, the living in the moment part had not been a part of its lure.\nThis series, with its innumerable storylines getting offered up and then blown up into thin air, its discourse reaching manic states, its strangely confrontational post-match interviews, its cricket as a sugar-high thrill causing disruptive levels of philosophical debate on process and what winning is anyway, has offered not that connected type of escape we crave from Test cricket, instead more the kind that comes through veins bulging, eyes popping and states of extreme high alert.\nThis is where the genius was as England won at The Oval to draw the series 2-2. The final piece we were missing fitted mercifully into place at last.\nFor that, we have Stuart Broad to thank.\nAs soon as he announced his retirement on the evening of day three, sending everyone scrapping for last-minute career overviews and reflections while television unleashed a near-feature length biopic with immediate effect, he almost single-handedly lulled this curtain call into a concentration of singular moments for us all to forget the noise and just live in as they happened.\nFrom his superstitious bail-turning antics, twice proving eerily clairvoyant, to putting his arm over long-time partner in crime Jimmy Anderson as they both walked out onto the field on Sunday morning, to the usual revving up of the crowd, there were as many as you dared find; little invitations through his sheer enthusiasm to get all snug inside for one last time.\nAn Oval Test is, of course, a famous home for goodbyes. West Indies greats Curtly Ambrose and Courtney Walsh walking towards the pavilion arm in arm in 2000, Alastair Cook's parting century in 2018 and Andrew Flintoff's run out of Ricky Ponting in 2009 are some of many ghostly apparitions imprinted in the mind as you stare across it at any given time.\nBroad's farewell here, already feeling like a goodbye to match any, having hit his last ball for six and taken a wicket with his last delivery, shot a poignant perspective across south London.\nThere was much more to say goodbye to during the final session than just Broad, as the rain that had deadened so much momentum abated to allow us one more crack.\nMoeen Ali for one. As languid and beautiful as he has ever looked with the bat, now bowling England into contention. He walked off next to Broad, for the last time too at Test level. An English cricketer has rarely been so beloved.\nChris Woakes, somehow more grey by the day, bowling the spell of his life to break the back of Australian resistance. He, barring a miracle of Anderson proportions, will not be around when Australia return here either. An English cricketer has rarely been so cared for.\nThese final acts of uplift by the game's good guys swelled the near-capacity Monday late afternoon crowd into supernatural hushing before breaking into noise in genuine unison, like a single set of lungs.\nThey did so sat in front of the gas works that appeared to suck the arriving dark clouds out of danger and away from the playing expanse. The large, interconnected, cylindrical vessels will be gone this time next year. In their place, new build flats.\nThere was much to be sad about when you thought about it. All the change and endings. This whole thing being over. Our lives somehow unfurling from all this and carrying on independently.\nIt was cause for momentary melancholy reflection as the Test neared the conclusion we all dreamed it might, all four results possible as it reached the last hour of the last day of the last Test.", "url": "https://www.bbc.com/sport/cricket/66373711"}