{"authors": ["Martin Watt", "www.facebook.com"], "date_download": "2025-05-20 12:08:53", "date_modify": "2025-05-20 12:08:53", "date_publish": "2023-08-05 10:24:46", "description": "David Turnbull inspires champions Celtic as Brendan Rodgers' second tenure begins with a season-opening Scottish Premiership win over Ross County.", "filename": "sport_football_66194481_1747742933.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/62B2/production/_130666252_20810414.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194481_1747742933.html", "title": "Celtic 4-2 Ross County: Brendan Rodgers makes winning start to second tenure", "title_page": "Celtic 4-2 Ross County: Brendan Rodgers makes winning start to second tenure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Turnbull emerged from the shadows to inspire champions Celtic as Brendan Rodgers' second tenure began with a season-opening Scottish Premiership victory over Ross County.\nAttacking midfielder Turnbull - a peripheral figure last season under Ange Postecoglou - netted a double and helped tee up Kyogo Furuhashi as Celtic raced 3-0 ahead by half-time.\nJordan White looped in a header to reduce the deficit, but Matt O'Riley smashed Celtic's fourth to ensure a winning start for Rodgers before James Brown replied for County with the last kick.\nThere was no sign of hostility at Celtic Park towards manager Rodgers, whose return in June met resistance from some supporters because of his abrupt departure to Leicester City four years ago.\nThe stadium was a riot of noise and colour as the title flag was hoisted by long-serving winger James Forrest pre-match amid an ebullient atmosphere for the season opener.\nMaik Nawrocki, the Polish centre-back signed from Legia Warsaw this summer, made his Celtic debut in place of Carl Starfelt, who Rodgers confirmed may be on his way out of the club.\n\"He's a player we'd to keep but if he doesn't want to be here, we have to close the deal,\" said Rodgers. \"That's something that'll develop next week. If you lose someone of his quality, you need to replace that.\"\nCeltic's defence was quickly under pressure as County - who survived relegation with a miraculous comeback in last season's play-off final - came tearing at them.\nMalky Mackay's men harried Celtic and were the better side early on. Yet they still found themselves effectively dead and buried by half-time.\nSimon Murray twice went close for the visitors and they were screaming for a penalty when Joe Hart tangled with the striker after struggling to deal with an awkward Anthony Ralston backpass.\nHaving weathered the storm, Celtic began to click through the gears and Turnbull was the driving force.\nThe 24-year-old slotted the opener from the penalty spot, after Greg Taylor was tripped by Josh Sims, and was key to the second goal with a deft header that sent Liel Abada bursting clear down the right to cross for Kyogo to finish first time.\nTurnbull might have had a first-half hat-trick and Ross Laidlaw's double save kept him out before he added his second with a half-volley from Matt O'Riley's cross to the back post.\nCounty weren't going quietly, though, and White met Yan Dhanda's corner to send a dipping header just inside the post.\nCeltic responded with verve and a delicious flick from Kyogo set up O'Riley to lash in the fourth.\nThere was a debut for Yang Hyun-jun - another of Celtic's five new signings - off the bench and fellow substitute Forrest was denied a goal in his testimonial week by a smart Laidlaw save.\nBut County had the final say as Brown netted a strike that flew past Hart via a deflection off Starfelt, which could well be the defender's last act as a Celtic player.\nCeltic manager Brendan Rodgers: \"First game there's always a wee bit of nerves, so it's good win for us. We didn't start the game well and County made it really difficult for us.\n\"Once we found our space and combinations we scored a couple of really good goals and played some fantastic football. The two goals we gave away are soft.\"\nRoss County manager Malky Mackay: \"I thought we started well. We get those chances in the first 15 minutes and should have scored. If it's an international team, Celtic are 2-0 down.\n\"Our shape and system were good, our discipline were good, and we give away a stupid penalty. Then we don't defend a cross in the last minute of the first half and next minute we are 3-0 down at half-time.\"", "url": "https://www.bbc.com/sport/football/66194481"}