{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:03:18", "date_modify": "2025-05-21 06:03:18", "date_publish": "2024-12-26 00:00:00", "description": "Follow action from eight games on Boxing Day in the Premier League including Man City v Everton, Chelsea v Fulham, Wolves v Man Utd and Liverpool v Leicester.", "filename": "sport_football_live_c1wj8438wlxt_1747807398.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1wj8438wlxt_1747807398.html", "title": "Premier League: Eight games including Man City v Everton, Chelsea v Fulham, Wolves v Man Utd, Liverpool v Leicester", "title_page": "Premier League: Eight games including Man City v Everton, Chelsea v Fulham, Wolves v Man Utd, Liverpool v Leicester - radio & text - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gakpo's goal 'lifted us'\nFT: Liverpool 3-1 Leicester\nLiverpool\nLiverpool manager Arne Slot, speaking to BBC Match of the Day: “Quite happy in general. During the whole game we played the way we wanted.\nThe only thing we didn’t want was to go down one nil after 10 minutes. First time they threatened it was immediately a goal. Sloppy defending. That’s why it was a hard game until we scored the third one.\nOn the importance of levelling before the break: \"It definitely was. During the first 45 minutes we were many times around their box and created enough to score a goal but if you don’t do it, you don’t know what the end result will be. That immediately lifted us.\n“The first and third goals were quite similar and these players have the quality to dominate these situations and have a great finish as well. I liked the second as well, more of a team goal and Curtis Jones arriving in the box doing something that in my opinion he has to do a lot more. As a midfielder at Liverpool you have to score goals and that is what he did today.”\nOn topping the league table: “Of course we look at the table but we also know how hard this league is. Two months ago we were one point behind Manchester City. What this league can do if you get injuries and suspensions...This can happen to any team. We have to stay on top of our game.\nOn festive fixtures: \"It does not feel like it is Christmas at all. Normally you go on holiday but I think there will be many people in Holland watching it and liking it like I did before.\"\n'A proud moment'\nFT: Liverpool 3-1 Leicester\nLeicester City\nLeicester goalkeeper Jakub Stolarczyk, speaking to BBC Match of the Day after making his Premier League bow: \"It was a dream come true. Something you always work for and you imagine this moment. For it to finally happen is such a proud moment for me and my family. To do it also at Anfield, I am nothing but proud.\n\"I was told this morning and a bit of excitement but I felt ready and just wanted to show what I could do.\n\"Conor is a great character and a very good leader. He always talks to you and gives you courage. I was pleased to make my debut with someone like him it made it easier.\"\n'The points need to be collected'\nFT: Liverpool 3-1 Leicester\nLeicester City\nLeicester boss Ruud van Nistelrooy, speaking to Amazon Prime: \"We know when you come here you want the start that we wanted.\n\"We knew we had to be compact and defend well. Which we did and we had a couple of breaks. We were in the game for a long time and at 2-1 we had the Daka chance - these are moments.\n\"In these games you have got to take them.\n\"When you are 1-0 up and we had a break with Stephy Mavididi on the break which led to a goal kick.\n\"A quick take from Allison and they combined into Gakpo. Him coming onto his right foot can be dangerous.\"\nOn Jakub Stolarczyk debut: \"Well done for Jakub coming in. He come back from a long injury, he recently played in the under-21s and he had a great game.\"\nOn three defeats in a row: \"It is up to us to keep developing and creating gameplans for every opponent.\n\"The gameplan was there, players knew what to do and acted too it, but today was the maximum possible.\n\"Anfield is not the place where we usually collect the points, but for our development we have to do it as the points need to be collected.\"\nOn January window: \"It is a great possibility to look at. It's a tool to look at as a club.\n\"It's a good option.\"\nOn Liverpool being title favourites: \"You never know in the Premier League and many things have happened before, but looking at this team and how stable they are and the depth of their squad they have a great chance.\"\nPost\nFT: Liverpool 3-1 Leicester\nLeicester City\nLeicester City manager Ruud van Nistelrooy, speaking to BBC Match of the Day: “Definitely [some positives]. Good performance. We knew coming to Anfield against this Liverpool, the game plan had to be right, had to be clear and the players executed it excellently. We had a great start, go one nil up it was a shame we could not get into half time with the lead.\n“And straight after as well conceding the second but we stayed in the game. We knew we would create something which came with the Patson Daka chance on the break but you have to take these chances if you want something out of the game but all credit to the players and our goalkeeper who had an excellent game.\n“He made an excellent debut and helped us stay in the game that long. I had a very good conversation with Wardy and it is not easy what happened and if the disappointment goes to one person it gets difficult.\n“We had to look at Jamie (Vardy). He played through injuries and knocks and it was the best thing today to let him recover and see if we can get him fit for Sunday.\nOn getting out of relegation trouble: “We believe we can but it will take a lot of hard work, improvement, training, staying together and performing and collecting points. The foundation is the work ethic of the team and spirit and we showed that over the last weeks and I think at the end of the road we can be where we want to be.”\n'As a manager you go game by game'\nFT: Liverpool 3-1 Leicester\nLiverpool\nLiverpool boss Arne Slot, speaking to Amazon Prime: \"Sounds weird, but we had a really good start.\n\"But then one moment where we underestimated the situation that led to a chance and a goal. You have to work really hard to come back into the game, it really helped that we scored the equaliser before half-time.\n\"In the last few games every chance we concede they go in.\n\"I think there was a second chance in the second half and those were the only times they even come close. We created enough, but because we went 1-0 down it was a game.\n\"Then you saw how good we are and they didn't want to come back into the game.\n\"I liked the second goal, for me that was a team goal with the overlapping run.\n\"We want to bring our wingers into threatening situations.\n\"Deep runs are the most important thing in football. You would not always have to play the player who makes the deep run.\"\nOn being favourites for the title: \"Bit of a boring answer and as a manager you go game by game - you know how many games you have to play.\n\"So many teams have so much quality. If this happened in the Eredivisie I would say OK that is true.\"\nOn Trent Alexander-Arnold, Mo Salah and Virgil Van Dijk contract extensions: \"We don't talk about contracts in public.\n\"It is not up to me to talk about those situations in public. Mo Salah had a good game, Virgil had a good game, Trent, especially in the second half was very good.\"\n'We just want to win each game'\nFT: Liverpool 3-1 Leicester\nLiverpool\nLiverpool midfielder Curtis Jones, speaking to BBC Match of the Day: “We have still got a long, long way to go. There are plenty of games to come. We’ll take each game as it comes and try and win all the games.\n“It was a hard game. They sat back and defended well. Especially for me it was hard to find space inside. It was more of a patient game and not trying to play into their plan. In the first half we were crossing the ball a load and that is what they want. In the second half we changed it round, kept it more and that’s where the goals came.\n“We are a goal down it’s almost half-time but we don’t stop, we score. In the second half we start strong and score again. The thing is with us we just want to win each game.\"\nOn 100 Premier League appearances: \"I came in then and normally text family and I saw a text off [Jurgen] Klopp saying 'congratulations on 100 games and here’s to 500. I was like what is he on about?' I just checked then and I am proud. It was him who set up the team we have now. The foundation was there and Arnie Slot has carried it on.\n“It looks good but there are plenty of games to come. You can play a team at the bottom, middle or top and it is a hard game. It is about trying to win every single game and if we do that everybody knows what comes at the end.”\n'We have to keep improving'\nFT: Liverpool 3-1 Leicester\nLiverpool\nLiverpool's Cody Gakpo, speaking to Amazon Prime: \"We do practice a lot on the crosses and the shots. Practice makes perfect.\n\"We come from behind and we had to fight to get level, we had good chances and I got the ball from Macca [Alexis Mac Allister] and I saw some free space and did what I do in training.\"\nOn going behind: \"We know the qualities we have, but it's not nice to go behind.\n\"We are working on that so we are not sloppy in the beginning. We started the game very good, but then had two moments where we were sloppy - we have to keep improving.\"\nOn feeling at home: \"Obviously I feel at home. We have a very good team which makes me accelerate as well and it let's me show my qualities. I keep working hard to show more of that every game.\"\nOn Arne Slot's style: \"Especially when we have the ball it is a bit more structured. A little less direct and we play more from possession.\n\"We only think about the next game.\n\"We cannot deny we are in a good place, but still one of the strengths of the team is we approach each game as a new one.\n\"That keeps us humble.\"\n'Hopefully we win the Premier League'\nFT: Liverpool 3-1 Leicester\nLiverpool\nLiverpool's Mohamed Salah, speaking to Amazon Prime: \"It is a good result they were very tough in the first half and in the second half the way they prepared themselves they were very good.\n\"We managed to score three goals and it was a great result.\nOn Cody Gakpo's equaliser: \"Great. It gives us confidence in the second half to go win the game. 1-0 down and you need to focus on equalising.\n\"He scored a great goal.\n\"It is something he practices a lot in training. It was a great finish from him.\"\nOn scoring 100 home goals in the Premier League: \"Something I am very proud of. We keep working hard and hopefully I can go a bit further.\"\nOn his form: \"The most important thing is the team winning - hopefully we win the Premier League.\n\"It is great, but we focus on each game and hopefully we carry on like that.\n\"It feels different, but the most important thing is we need to stay humble.\n\"This one is very special, hopefully we win the Premier League and for this club it is something I dream of.\"", "url": "https://www.bbc.com/sport/football/live/c1wj8438wlxt"}