{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:20", "date_modify": "2025-05-21 04:16:20", "date_publish": "2025-04-05 18:12:32", "description": "Tom Banton made history at Taunton as his record 344 not out put Somerset in a dominant position on day two of the County Championship match against Worcestershire.", "filename": "sport_cricket_articles_c8x8j04y7qjo_1747800980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48c5/live/aa7169b0-1248-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c8x8j04y7qjo_1747800980.html", "title": "Brilliant Banton batters Pears in record 344 not out", "title_page": "Brilliant Banton batters Pears in record 344 not out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Banton made history in Taunton as Somerset assumed a position of dominance on day two of the County Championship First Division match against Worcestershire.\nThe 26-year-old batter made the highest first-class score in the county's history, his unbeaten 344 surpassing the 342 made by Justin Langer against Surrey at Guildford in 2006.\nThe right-hander faced 381 balls, struck 53 fours and a six and batted for just over eight hours. He became only the eighth Somerset player to register a triple century and the first since James Hildreth in 2009.\nIn a dramatic finale, Banton pulled Kashif Ali to the mid-wicket boundary off the penultimate ball of the day to break the record and make it a day to remember for all Somerset supporters.\nOn a day when records tumbled, Banton and James Rew staged a mammoth stand of 371 in 86.3 overs as the home side amassed 637-6, a substantial first-innings lead of 483.\nRew raised 152 from 275 balls, striking 14 fours and two sixes, as he and Banton established the highest fifth-wicket partnership in Somerset history, eclipsing the 320 made by John Francis and Ian Blackwell against Durham UCCE at Taunton in 2005.\nIt was a day to forget for Worcestershire, who toiled in the sun and now face a mammoth task if they are to save the game over the course of the next two days.\nAll notion of a Worcestershire fightback on day two was dispelled in a morning session that went altogether in Somerset's favour, Banton and Rew extending their partnership to record-breaking proportions.\nBanton set the tone, moving from his overnight score of 84 to post his fourth first-class century in quick time from 124 balls, glancing Tom Taylor off his legs to raise that landmark with his 20th four.\nWorcestershire deployed seven different bowlers during the session, but Ben Allison was the only one to inconvenience the batsmen.\nWhen Rew, having advanced his score to 31, took on the seamer and top-edged a pull shot to deep mid-wicket, Tom Hinley contrived to drop a sitter.\nThereafter, Worcestershire ambition unravelled with indecent haste.\nEnsuring the Pears were made to pay for their profligacy, Rew went to 50 from 102 balls, dispatching a short-pitched delivery from Allison through midwicket for his eighth boundary as Somerset's lead entered three-figure territory.\nThe hundred stand occupied 165 balls, while Banton clipped Adam Finch to fine leg to register his career-best first-class score, eclipsing the 133 he made against Kent at Taunton 11 months earlier.\nIf Worcestershire hopes were invested in the new ball, which was taken shortly after lunch, they were sorely disappointed as the Banton and Rew show continued unabated, these extending their alliance to 200 from 298 deliveries.\nBanton's maiden double-hundred, came from 241 balls with 33 fours and cut Taylor for four to establish a new Somerset record fifth-wicket partnership with Rew.\nHaving banked maximum batting bonus points, there was still time for Banton and Rew to extend their partnership to 300 from 413 balls before tea was taken with Somerset on 482-4, a substantial lead of 328.\nEthan Brookes afforded Worcestershire overdue relief when taking a brilliant return catch to end Rew's five and-a-half hour innings, after which Banton took centre stage during a dramatic final hour.\nECB Reporters Network supported by Rothesay.", "url": "https://www.bbc.com/sport/cricket/articles/c8x8j04y7qjo"}