{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:31", "date_modify": "2025-05-19 14:31:31", "date_publish": "2017-08-13 23:11:58", "description": "Who has Jose Mourinho falling about laughing and whose performance was like a throwback to the 1970s? It's Garth Crooks' team of the week.", "filename": "sport_football_40918410_1747665091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F6D7/production/_97319136_didierdrogba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40918410_1747665091.html", "title": "Garth Crooks' team of the week: Romelu Lukaku, Wayne Rooney, Dele Alli, Kyle Walker, Steve Mounie", "title_page": "Garth Crooks' team of the week: Romelu Lukaku, Wayne Rooney, Dele Alli, Kyle Walker, Steve Mounie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Red cards, dream debuts and high-scoring encounters - the Premier League is back.\nChampions Chelsea had two players sent off as Antonio Conte's side lost at home to Burnley.\nNew signing Romelu Lukaku scored twice as Manchester United got their campaign off to a flying start with a big win against West Ham.\nPremier League debutants Huddersfield produced the perfect away performance to beat Crystal Palace but there were defeats for fellow new boys Newcastle, against Tottenham, and Brighton, at home to Manchester City.\nYou can see the thinking behind my team below but, first, here's who BBC Sport readers have picked in their team of the week:\nI thought that Wilfried Zaha missed a glorious chance to put Palace back into their game against Huddersfield. However, when I saw the television replay, it was crystal clear that Jonas Lossl somehow got his foot to the ball to divert what was actually an excellent strike around the post for a corner.\nIf that wasn't a game changer, then the header from Christian Benteke that followed was. It was vintage centre-forward play from the Belgian striker but equalled only by a superb save from the Danish keeper.\nIt was obvious to me that Lossl's intention was to keep a clean sheet at all costs. Lots of goalkeepers may have that intention when they start a match but it's not always matched by their performance. Lossl was sensational and another excellent addition to a side who will need a few more results like this one at Selhurst Park if they intend to retain their Premier League status.\nAs for Palace, losing at home to Liverpool, for example, is one thing but a 3-0 defeat by Huddersfield is another matter entirely. The newly installed Frank de Boer only lasted 85 days as manager of Inter Milan - and if the Eagles suffer many more defeats like this, the Dutchman could find himself surpassing even that dismal record and staring at another P45 very quickly.\nI would no sooner have paid £50m for Kyle Walker than I would to fly to the moon but I can see why Pep Guardiola did. How else was Guardiola going to get Spurs to let this particularly athletic full-back join their rivals? Unless, of course, he was prepared to offer Tottenham something quite outrageous in order to bolster his chances of winning the Premier League title? After all that's what's at stake.\nAgainst a courageous Brighton and Hove Albion, who defended as though their lives depended on it, Walker looked every inch the player Guardiola would have wanted: comfortable on the ball, patient in defence and in no particular hurry to demonstrate to the viewing audience that he was worth the money.\nThat said, Brighton didn't do an awful lot to test him but that wasn't the defender's fault. This is a massive season for Walker, especially with him having walked out of Spurs. To win nothing now, having taken such a serious step, would be a disaster for both manager and player.\nThere were a number of sparkling performances for Spurs against Newcastle at St James' Park.\nChristian Eriksen practically ran the show, Kyle Walker-Peters looks like a star in the making but it was Toby Alderweireld's quiet authority at the back that set the tone for Tottenham's victory.\nIn the absence of marquee signings at Tottenham this summer, it must come as a relief to many that they have retained the services of the Belgium international.\nDanny Rose may have been forced to apologise for his remarks regarding a lack of summer spending at the club and I have some sympathy with his position. The transfer window is not yet closed but the point has been made.\nIf, as media reports suggest, Spurs are to spend something in the region of £85m, external during the next couple of weeks, then it could be another impressive season for them. It was an impressive away victory on Sunday.\nIt was good to see Phil Jones fit and playing in a Manchester United shirt again.\nHe has suffered more than his fair share of injuries over the years but if Jose Mourinho intends to challenge for the title this season then he is going to need a fully-fit Jones.\nThe former Blackburn defender can no longer go crashing into every challenge as though his life depends on it. Of course, it's every defender's dream to leave something on his opponent but Jones has to wise up. Picking his tackles is a vital pre-requisite if he intends to be part of a title-winning team under Mourinho.\nOf all the central defenders at Old Trafford, Jones is the most comfortable on the ball. Chris Smalling is a warrior and Eric Bailly a great support act but if Jones can start to play with his head and not just his heart, United could be in for one hell of a season.\nIt was an excellent performance by Stephen Ward at Chelsea.\nThe full-back played with a confidence and composure reminiscent of another former Burnley left-back and England international, Keith Newton.\nWard took his goal brilliantly on Saturday, in what was anything but a spiteful game; nevertheless seven players were booked and two sent off.\nWhat this game signified to me was that players such as Newton (as good as he was) could not play in the modern era because of the inflexibility of referees such as Craig Pawson, who seem incapable of recognising a mistimed tackle as opposed to a dangerous one. Frankly, I've seen better decisions made by a Grade 4 referee on a Sunday afternoon.\nPawson couldn't possibly have played the game at any serious level, having made the decision to send off Chelsea captain Gary Cahill for what was no more than a clumsy challenge. A yellow card was all that was required.\nWhile Pawson may be popular with his peers for appearing brave, his hubris has put Stephen Ward and all defenders at risk of an early bath because of nothing more than their impetuousness.\nIs that the future?\nIf you blinked then you would have missed it. Wayne Rooney's 'hand off' on Stoke midfielder Joe Allen as he ran into the box to score Everton's winner was simply genius. It propelled Rooney forward towards the penalty area - and it denied Allen the momentum to stop the Everton man getting the return pass that lead to a brilliantly taken header.\nIt is the finer details that make all the difference in a tightly contested Premier League encounter, and the game against Stoke couldn't have been much finer.\nRegular readers of my team of the week will know only too well the high regard in which I hold Rooney. His services to game and country have been exemplary over the years and it is fitting that he should return home to Goodison Park, where it all started for him, to signal the coming to an end of an illustrious career.\nEverton fans deserve this finale.\nWhen I read that Manchester United had bought Nemanja Matic, I thought it was a misprint.\nAs far as I was concerned, it was inconceivable that Chelsea would sell a player of Matic's calibre, particularly as they have four major competitions to contest this season. Why on earth would Antonio Conte sanction such a thing? Matic must be among the top 10 best holding midfield players in the world. Why would you sell him, especially to one of your arch-rivals?\nI watched Matic on numerous occasions during his time at Stamford Bridge, and while he didn't have a blistering season, he played a fundamental role in Chelsea winning the title.\nNo sooner had the hangover from the title celebrations subsided, than Matic was off to United producing what can only be described as a majestic debut performance. West Ham were blown away as Matic provided Paul Pogba with the freedom to roam, Henrikh Mkhitaryan with the freedom to probe and Juan Mata to do just whatever he liked.\nLanding Matic has been an extraordinary piece of business by Manchester United and that is why I have tipped them for the title.\nWe saw flashes of this form from Stefano Okaka last season. However, his performance against a resilient Liverpool was a step up from anything I have seen from the Italian before. His goal was well-taken but his overall play was very impressive.\nThis was another one of those performances where Watford appeared to be punching above their weight - and at times making mincemeat, especially on set-pieces, out of a team with far greater resources.\nThe Hornets have secured the services of Marco Silva to see them through this season's activities. It would be refreshing to see the executives at Watford exercise a little restraint when deciding the future of their managers. This incessant chopping and changing of the boss for no apparent reason is becoming tiresome.\nThis was quite a performance by Romelu Lukaku on his Premier League debut for Manchester United.\nIf you were an Everton fan, it must have been a difficult watch seeing your former hero putting the finishing touches to an impressive team performance for the Red Devils. However, I can't help feeling it was the right move for all concerned.\nEverton got the money (and his goals) while United got their man. The Belgian's game reminds me of Didier Drogba the more I see him, and that was precisely why Jose Mourinho bought him. Who knows the value of a player with Drogba's potential better than Mourinho?\nTo snatch the Belgium international from under the gaze of Chelsea, who clearly wanted him, must have left a very sweet taste in Mourinho's mouth. He knows only too well what Antonio Conte could do with a player such as Lukaku at his disposal.\nNow Chelsea have lost the striker and look like losing Diego Costa into the bargain - all because of Conte's impetuousness and inability to resist sending his top goalscorer a text stating his services were no longer required before he knew he had Lukaku in the bag. Mourinho must be falling about with laughter.\nIf a promoted side are going to stand any chance of survival in the Premier League, they need to have a goalscorer.\nSteve Mounie scored plenty at Montpellier but whoever decided that the Benin international could perform the same duties in the Premier League must really know a striker when they see one.\nMounie was superb against Crystal Palace. There were a number of clubs in England who took a look at him but weren't prepared to take a chance. David Wagner did and we all can see why now.\nThe striker scored two brilliant goals and should have crowned his performance with a hat-trick. It wasn't just his goals that impressed either, it was his all-round general hold up play.\nThat will prove a very important feature especially when the goals dry up - and they will at some stage. He wasn't the only player that caught my eye in the Huddersfield line-up either. Aaron Mooy looks a player and, along with Mounie, could be Huddersfield's ticket to another season in the big time.", "url": "https://www.bbc.com/sport/football/40918410"}