{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:40", "date_modify": "2025-05-21 06:44:40", "date_publish": "2025-03-30 18:17:06", "description": "Antrim and Fermanagh secure promotion and spots in the Ladies Football League Division Four Final after high-scoring wins on Sunday.", "filename": "sport_articles_cj9elrezpmpo_1747809880.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1fe/live/2f7ccde0-0d92-11f0-80e2-6f5e46851467.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj9elrezpmpo_1747809880.html", "title": "Antrim and Fermanagh promoted to Division Three", "title_page": "Ladies National Football League: Antrim and Fermanagh promoted to Division Three - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Antrim and Fermanagh secured promotion and spots in the Ladies Football League Division Four Final after victories in high-scoring contests on Sunday.\nThe Saffrons earned a 5-8 to 3-10 win over last year's All-Ireland Intermediate champions Leitrim at Kingscourt with Fermanagh beating Sligo 5-12 to 3-13 at Tarmonbarry in county Roscommon.\nEarly goals from Omolara Danhunsi, Anna Mulholland and skipper Bronagh Devlin helped the Saffrons lead Leitrim 3-6 to 2-5 at half-time.\nNicole Jones fired in Antrim's fourth major in the second half with Devlin completing a 2-3 haul as she fired in the Saffrons' closing goal three minutes from time.\nFermanagh were determined to achieve promotion after losing in the Division Four semi-finals last season and Eimear Smyth's 1-8 and Joanne Doonan's 2-1 helped them battle past Sligo.\nSligo hit the opening three points but Doonan's opening goal in the 11th minute was soon followed by Smyth finding the net which helped the Erne women into a five-point advantage.\nThe Yeats County were back in front after Ciara Walsh and Cara King netted but their lead didn't last long as Doonan's second goal and a Cliodhna Martin strike left Fermanagh 4-4 to 2-6 up at the interval.\nFermanagh put further daylight between the teams after the resumption with a run of 1-3 which included their fifth goal from Sinead Barrett.\nAs the impressive Smyth continued to tag on points, Fermanagh were never really under threat in the closing quarter despite Carol Coleman's late Sligo goal and they can now look forward to the Division Four Final on 13 April.\nIn Division Two, Donegal were beaten 1-8 to 0-8 by Cork, who will face Galway in the decider, with the Rebels and Tribeswomen having secured promotion to Division One.\nCavan will meet Wexford in the Division Three Final safe in the knowledge that promotion has been secured.\nThe Breffni defeated Limerick 0-10 to 0-9 on Sunday in what was a dead rubber with both promotion and their final spot already achieved.\nLidl National Ladies Football League results\nDivision One\nDublin 2-12 Kerry 2-10\nKildare 4-10 Tyrone 2-8\nMeath 2-12 Armagh 4-5\nWaterford 2-13 Mayo 1-6\nDivision Two\nCork 1-8 Donegal 0-8\nGalway 4-22 Clare 0-5\nWestmeath 2-11 Monaghan 0-13\nTipperary 1-12 Roscommon 0-10\nDivision Three\nLouth 7-12 Offaly 1-8\nCavan 0-10 Limerick 0-9\nDown v Carlow - Down walkover\nWexford 3-9 Laois 0-10\nDivision Four semi-finals\nFermanagh 5-12 Sligo 3-13\nAntrim 5-08 Leitrim 3-10", "url": "https://www.bbc.com/sport/articles/cj9elrezpmpo"}