{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 05:28:37", "date_modify": "2025-05-21 05:28:37", "date_publish": "2025-04-03 10:06:44", "description": "Arne Slot press conference: Fulham vs Liverpool", "filename": "sport_football_articles_cr78np88j4po_1747805317.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a528/live/b7d03a00-4921-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr78np88j4po_1747805317.html", "title": "Arne Slot press conference: Fulham vs Liverpool", "title_page": "Arne Slot press conference: Fulham vs Liverpool - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Slot confirmed Trent Alexander-Arnold and Joe Gomez \"will not be back in the coming weeks\" and Conor Bradley \"will have to wait and see if he will be with the squad on Sunday.\"\nOn Alisson's fitness: \"For Ali, it is a concussion so you have to follow the protocol and tick boxes. The moment he does, he will be in goal.\"\nAsked if Curtis Jones could continue at right-back after playing there in Wednesday's win over Everton, Slot said: \"Curtis is an option because he did well. It depends if players are coming back. It is good to have versatile players in different positions, Curtis is definitely one of them and has a skillset where he can defend and attack. Some want to stay in their comfort zone but Curtis wants the challenge.\"\nHe added a squad fitness update: \"The boys still haven't come in yet [for training]. I hope because [Alexis] Mac Allister finished the game that it's all good but sometimes adrenaline can help you and when you've had a sleep you do feel something. I hope everyone is ready to play again from the ones who were on the pitch yesterday.\"\nOn Wednesday's goalscorer Diogo Jota's \"special quality\": \"For most players, if they think they can score, they get mixed up in their head. He stays calm in those moments and knows where he has to shoot and what the goalkeeper might expect.\"\nOn the PGMOL saying the decision not to send off James Tarkowski for the challenge on Mac Allister was a mistake: \"It's always good that if they think they made a mistake, they acknowledge that. We all know mistakes are being made in a football match and it's good they acknowledged. But it was so clear - so many pundits who are not Liverpool fans were clear about it as well.\"\nOn how close Liverpool feel to winning the Premier League: \"We felt yesterday how hard it is to win a Premier League game. It tells you that with eight games to go, every game is a challenge - starting with Fulham, who are having a very good season as well. We are not working on theories about how many points - we are taking the challenge of Fulham.\"", "url": "https://www.bbc.com/sport/football/articles/cr78np88j4po"}