{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:25", "date_modify": "2025-05-21 07:25:25", "date_publish": "2025-03-28 14:51:22", "description": "Burnley boss Scott Parker says he was \"wrong\" after being given a one-match touchline ban following his red card against West Brom.", "filename": "sport_football_articles_c20101d45yqo_1747812325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56f7/live/f6e77740-0bc6-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20101d45yqo_1747812325.html", "title": "Scott Parker: Burnley boss says he did 'wrong' after one-match touchline ban", "title_page": "Scott Parker: Burnley boss says he did 'wrong' after one-match touchline ban - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley boss Scott Parker says he was \"wrong\" after he was given a one-match touchline ban following his red card against West Bromwich Albion.\nThe ban means Parker will miss Burnley's game against Bristol City on Saturday as they chase down a spot in the top two.\n\"Obviously disappointed but at the time, I did wrong. I approached the referee at the end of the game and I didn't realise you can't go and approach a referee and I did that,\" Parker told BBC Radio Lancashire.\n\"Never was I once abusive or aggressive, I was just asking a question, but I understand fully it was probably the wrong image.\"\nParker will return for Burnley's match away to Coventry City on 5 April.\nHowever, good news for the Clarets is that midfielder Aaron Ramsey will be adding some match minutes to a season rocked by injury.\nThe 22-year-old has not featured for Burnley since February 2024 after suffering a long-term knee injury but Parker is eager to get the midfielder game time.\n\"While I'm excited and enthusiastic about Aaron in terms of how he's progressing, I'm always conscious of someone whose been out so long,\" Parker said.\n\"There's different hurdles you need to jump and the next hurdle for him is a live game, either with the [under] 21's or the reserves, hopefully see him come out of that and see where he gets to before the end of the season.\"", "url": "https://www.bbc.com/sport/football/articles/c20101d45yqo"}