{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:23:55", "date_modify": "2025-05-21 06:23:55", "date_publish": "2025-01-04 17:01:19", "description": "Irish Premiership champions Larne are knocked out of the Irish Cup in the fifth round by Championship side Limavady United.", "filename": "sport_articles_c89xjzj1z2ko_1747808635.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7439/live/ce079960-cac4-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c89xjzj1z2ko_1747808635.html", "title": "Championship Limavady knock out Larne in Irish Cup", "title_page": "Irish Cup: Championship Limavady knock out Larne in Irish Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish Premiership champions Larne have been knocked out of the Irish Cup in the fifth round by Championship side Limavady United.\nRuairi Boorman headed home the only goal of the game in extra-time after it ended goalless in normal time, to secure a famous cup upset.\nHolders Cliftonville began their defence of the Irish Cup with a fifth round 4-0 victory against Premier Intermediate side Banbridge Rangers at Solitude.\nMatthew Fitzpatrick netted a hat-trick and Robbie McDaid scored his first goal in two years as Linfield beat Wellington Rec 4-0.\nIn both sides' first game since his passing, Cliftonville and Linfield paid tribute to defender Michael Newberry, who died suddenly earlier this week.\nCrusaders booked their place in the sixth round with a routine 3-0 triumph against Championship Knockbreda in the early kick-off.\nThere were also comfortable wins for Premiership sides Coleraine against Armagh City and Dungannon Swifts against Rathfriland Rangers, both top flight sides securing 5-0 victories.\nElsewhere, Championship sides Annagh United and Ards progressed to the sixth round alongside Carrick Rangers and Ballinamallard United.\nThe sides were deadlocked until five minutes from the end when Boorman reacted quickest after Larne failed to deal with a free-kick into their box.\nRohan Ferguson was unable to gather the ball underneath his crossbar and there was the 23-year-old defender to poke the ball over the line from close range.\nIt was no less than the Roesiders deserved for a fully committed performance against a misfiring Larne side.\nConor McKendry went close on a number of occasions immediately after the restart following a low-key opening half while another former Coleraine player.\nLewish Tosh tested the palms of Larne 'keeper Rohan Ferguson with a long range shot in the first period of extra-time before Boorman's strike in the 115th minute.\nGary Haveron's side threw everything at Limavady United in the closing stages, but the day belongs to the Championship side and their ambitious young manager Paul Owens.\nGormley and Rory Hale both went close to giving Cliftonville an early lead but both efforts were off target.\nSoon after, the hosts took a deserved lead as winger Corrigan made no mistake from close range after being teed up by Gormley on 12 minutes.\nDespite dominating proceedings, Cliftonville had to wait until the 51st minute to add to their lead when midfielder Piesold's shot from 20 yards found the net via a deflection from Rangers defender Mark McCullough and the post.\nGormley then made the game safe on the hour mark with a tidy finish from Stephen McGuinness's cross before substitute Lowe finished from close range in the final minutes.\nThe hosts broke the deadlock on 18 minutes as Fitzpatrick headed home a Kirk Millar cross from the right-hand side.\nThe Blues doubled their lead just before the break as McDaid netted his first goal since 7 January 2023 on what was his first start in 758 days for the south Belfast side,\nFitzpatrick grabbed his second goal of the afternoon on 77 minutes, as he fired home from inside the box.\nThe Linfield striker completed his hat-trick in stoppage time with a tidy finish from a tight angle from the right-hand side, wrapping up a 4-0 victory for the Blues.\nThe home side broke the deadlock in the 21st minute when debutant Brandon Bermingham, unmarked, headed home Kealan Dillon's looping delivery.\nDillon was the provider once again for Dungannon's second goal with his cross from the left-wing finding Adam Glenny, who burst into the box before sending a strong strike towards goal. Steven Maguire got a touch on his effort, but not enough to stop it finding the back of the net.\nRathfriland made a bright start to the second half, but it was Rodney McAree's side who scored again when Andrew Mitchell beat his marker to head home Glenny's delivery.\nJohn McGovern made it 4-0 just after his introduction when he did well to keep a long delivery in play, dribbled forward and took a clever touch before firing into the top corner.\nJust before full-time, McGovern netted his second of the afternoon when he headed home fellow substitute Leo Alves' cross into the box.", "url": "https://www.bbc.com/sport/articles/c89xjzj1z2ko"}