{"authors": ["Matty Fairnie", "www.facebook.com"], "date_download": "2025-05-21 06:30:45", "date_modify": "2025-05-21 06:30:45", "date_publish": "2024-12-24 10:48:13", "description": "Hibs fan's voice: 'We head to Tynecastle in far better shape than seemed likely'", "filename": "sport_articles_c3wez682q2no_1747809045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4522/live/a6b6b6d0-c163-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3wez682q2no_1747809045.html", "title": "'We head to Tynecastle in far better shape than seemed likely'", "title_page": "Hibs fan's voice: 'We head to Tynecastle in far better shape than seemed likely' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibs scored three goals for the fourth time in five matches as we brushed Aberdeen aside, coming from behind to win consecutive games for the first time this season.\nIt was probably our best performance of the season, as the team showed a togetherness and fight that had been posted missing in earlier games.\nDespite falling behind to a goal that was far too easy for Aberdeen to score, Hibs levelled quickly though Elie Youan, before Nicky Cadden stole the show with a thumping volley from Martin Boyle's deep cross.\nBoyle had come back into the team after losing what looked to be a virtually guaranteed starting spot in recent weeks, and he played like someone with a point to prove.\nHe was back to his talismanic best, tormenting the Dons defence and playing a key part in all three Hibs goals, with two assists preceding a fine finish of his own to seal the game early in the second half.\nHibs didn't do much in an attacking sense after that third goal, with injuries to Joe Newell and Warren O'Hora contributing to the drop in fluency, but what we lacked in attacking intent, we more than made up for in determined defending as we held out to secure another vital three points.\nYouan celebrated with the large travelling support at the end as he and the players took the plaudits, and we now head to Tynecastle on Boxing Day in far better shape than seemed likely a few short weeks ago.\nDavid Gray deserves immense credit for the turnaround. I thought he was effectively a dead man walking after the defeat to Dundee, but I'm delighted he's put together a run of results to quieten the noise around his future.", "url": "https://www.bbc.com/sport/articles/c3wez682q2no"}