{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-20 11:53:15", "date_modify": "2025-05-20 11:53:15", "date_publish": "2023-08-05 20:40:14", "description": "Wales head coach Warren Gatland says he is content with the opening World Cup warm-up win over England.", "filename": "sport_rugby-union_66419189_1747741995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9976/production/_130668293_gettyimages-1594309201.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66419189_1747741995.html", "title": "Wales 20-9 England: Warren Gatland content with opening World Cup warm-up game win", "title_page": "Wales 20-9 England: Warren Gatland content with opening World Cup warm-up game win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales head coach Warren Gatland says he was content with the opening World Cup warm-up win over England.\nAfter trailing 9-6 at half-time, the home side dominated the second-half with tries from Gareth Davies and George North and 10 points from Leigh Halfpenny on his 100th Wales cap.\n\"It was a good start but there's still lots to work on,\" said Gatland.\n\"It was a pleasing result. Getting some debuts and those scores in the second-half was the most pleasing aspect.\"\nGatland has stated in the week that Wales were going to \"surprise people\" and do \"something special\" at the World Cup after a poor season which saw a fifth-place finish in the Six Nations.\n\"There's no doubt the WRU and the team have gone through a lot and the Six Nations was challenging,\" added Gatland.\n\"I made the decision then to let that go and then build after with my own stamp.\"\nGatland admitted he was entering the unknown going into the first game of the season.\n\"I was a little bit apprehensive this morning as I wasn't quite sure how things were going to go,\" he said.\n\"I know the players have been working hard and I was looking for a performance and it was a good start today.\n\"[Winning] wasn't important at all, it was the performance I was more interested in and thought those guys out there gave us a performance.\n\"There were some good individuals on show and the last 20 minutes we just looked comfortable.\"\nGatland was happy not to concede any tries as England - whose coach Steve Borthwick said the loss would be \"positive\" in the long term - were limited to three Marcus Smith penalties.\n\"Defence is, as Shaun Edwards [former Wales defence coach] often said, just 80% about being fit,\" said Gatland.\n\"The boys showed the work we've done over the past eight weeks or so that we are in a pretty good place physically.\"\nWales suffered some worrying injury concerns with Scarlets hooker Ryan Elias (hamstring) and Exeter lock Dafydd Jenkins (knee) forced off the field.\n\"They'll be scanned on Monday,\" added Gatland.\n\"Ryan looks like a slight hamstring tear but it's not too bad. I thought the two second-rows [Will Rowlands and Dafydd Jenkins] were great today so with Daf we are hoping it isn't too serious a knee injury.\"\nGatland says Taulupe Faletau, Johnny Williams, Joe Roberts, Owen Williams and Alex Cuthbert remain in the World Cup selection mix despite missing the training in Turkey and being unavailable for this England game.\nGatland praised the performance of new captain Jac Morgan and his back-row colleague Aaron Wainwright, who shone at number eight.\nWales are looking for a World Cup skipper and Morgan made his mark with a man-of-the match display.\n\"I thought Jac was outstanding,\" said Gatland. \"Aaron Wainwright had his best game in a Wales jersey. We've spoken a lot about Jac and where he'll play.\n\"We had a conversation earlier on in this campaign about where he sees himself - we see him as a seven.\n\"There's good competition there with Tommy Reffell and Taine Basham. Going forward, it's about making sure we have that balance of physicality and size that's needed in the back-row.\n\"We also needed sixes who are good line-out options. We aren't blessed with numbers and choices in the past but we are working towards that.\"\nWales again face England at Twickenham next weekend in what will be a much-changed side as Gatland looks to nail down his 33-man squad and opening side to face Fiji in the World Cup opener on 10 September in Bordeaux.\n\"If we were to name a starting team tomorrow [for Fiji] then we'd probably only have about three names nailed on,\" said Gatland.\n\"There's some serious competition in this squad. It's a nice position to be in and we'll get some good confidence from that game today going into next week.\n\"In 2019 when we won the Grand Slam, we had a settled side and we knew what a large number of our World Cup squad was going to be. The team today did exceptionally well and the players put a marker down.\n\"The pleasing thing is there's a group of players who will get an opportunity next week who are desperate to perform.\"\nHalfpenny admitted he could not believe he had become the ninth player to play 100 internationals for Wales.\n\"It's been a special week,\" Halfpenny told Amazon Prime.\n\"I would like to thank the players and the staff, it's been absolutely outstanding and they have made it a special occasion, I can't thank them enough.\n\"It's beyond my wildest dreams [to get 100 caps]. The dream as a kid was to play for Wales and I dreamt of getting one cap, let alone 100. It hasn't quite sunk, it's pretty surreal.\n\"It's been a bit of journey but I have so many people to thank.\"", "url": "https://www.bbc.com/sport/rugby-union/66419189"}