{"authors": ["Emlyn Begley", "www.facebook.com"], "date_download": "2025-04-26 06:38:59", "date_modify": "2025-04-26 06:38:59", "date_publish": "2025-03-02 16:53:17", "description": "Newcastle 1-2 Brighton (aet): Seagulls keep trophy dream alive", "filename": "sport_football_articles_cd0nln5yendo_1745649539.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b0a/live/b2d2c310-f786-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd0nln5yendo_1745649539.html", "title": "Newcastle 1-2 Brighton (aet): Seagulls keep trophy dream alive", "title_page": "Newcastle 1-2 Brighton (aet): Seagulls keep trophy dream alive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton and Newcastle are both teams for whom winning the FA Cup would mean the world to their fans.\nAlbion, eighth in the Premier League, are clearly the best current team in England to have never won a major trophy.\nFabian Hurzeler's side are now two wins from reaching their first FA Cup final since 1983, the year they famously lost to Manchester United in a replay.\nThey were not at their best here and could have been more than a goal behind before Gambian Minteh levelled.\nMinteh – who had brought down Tino Livramento for Newcastle's penalty opener - did not celebrate his goal on his first return to St James' Park, despite never playing a game for Eddie Howe's side before his departure last summer.\nHe joined the Magpies in the summer of 2023, but joined Feyenoord on loan on the same day. On returning, Minteh was sold for £30m to Brighton on 1 July.\nBrighton had several chances to score – and when Gordon was sent off it looked as if they had the edge. But just before the end of normal time, Lamptey clattered into Murphy and followed the England forward down the tunnel.\nWhen Schar volleyed in from the resulting Bruno Guimaraes' free-kick, the Seagulls looked to be out.\nBut semi-automated offside technology showed the Newcastle defender was offside and Brighton had a reprieve – which they took full advantage of.", "url": "https://www.bbc.co.uk/sport/football/articles/cd0nln5yendo"}