{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:57:26", "date_modify": "2025-04-26 03:57:26", "date_publish": "2025-03-04 14:01:01", "description": "Newcastle would be \"crazy\" to to sell top players like striker Alexander Isak after posting a significant reduction in losses in their 2023-24 accounts, according to chief executive Darren Eales.", "filename": "sport_football_articles_c4g7d71kklno_1745639846.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/72a6/live/79b9c300-f928-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g7d71kklno_1745639846.html", "title": "Newcastle United: Club would be 'crazy' to sell Alexander Isak", "title_page": "Newcastle United: Club would be 'crazy' to sell Alexander Isak - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle would be \"crazy\" to to sell top players like striker Alexander Isak after posting a significant reduction in losses in their 2023-24 accounts, according to chief executive Darren Eales.\nNewcastle have announced a loss of £11.1m in their 2023-24 accounts, compared to a loss of £71.8m in the previous season.\nThe improved figures were helped by a 28% increase in revenue to £320m, largely down to their participation in last season's Champions League, and a £70m profit from player sales.\nNewcastle sold Allan Saint-Maximin to Saudi Arabian side Al-Ahli in July 2023, while Elliot Anderson and Yankuba Minteh departured shortly before the accounting deadline of 30 June 2024.\nThat helped balance out a significant summer 2023 transfer spend on the likes of Harvey Barnes for £38m from Leicester, Sandro Tonali from AC Milan for £55m, Tino Livramento from Southampton for an initial £32m and Lewis Hall from Chelsea for £28m.\nEales said that Newcastle's actions to reduce their losses mean that they are under no pressure to sell any of their prized assets, including Isak.\n\"They're all under long-term contracts. We have no intention at all of those players being moved on. We're not under the gun or anything like that,\" Eales said.\n\"As you know, we've got an ownership that is ambitious and wants the best for the club. So from that perspective, it would be crazy for us to consider it.\"\nIsak, who has scored 19 goals in the Premier League this season, was linked with several clubs in England and across Europe during the January transfer window.\n\"He [Isak] has multi years left [on his Newcastle contract] so as with all of these things, we will have the discussions in terms of a new deal just like we did with Joelinton, Bruno [Guimaraes], or Anthony Gordon. That's something that we will approach in the summer,\" Eales added.\n\"We're striving, as a club, to be at the top table. We want our best players here.\n\"I think it shows the value of Isak that they talk about him all the time. We're not looking to move any player on.\"\nThe Magpies say the improved figures ensure the club has complied with Premier League profit and sustainability (PSR) rules.\n\"We are committed to sustainable success and we have started 2025 in a strong position,\" Eales said.\n\"Our progress has been supported by diligent work on and off the pitch. Returning to the Champions League for the first time in more than 20 years was hugely memorable for everyone connected with the club, and it has a clear upside financially as we continue to grow.\"\nEales warned the club may have to sell players when announcing their 2022-23 figures last year, which followed a £70.7m loss in 2021-22, when the club was taken over by the Saudi Public Investment Fund.\nUnder PSR, Premier League clubs are allowed to post losses of up to £105m over a three-year reporting cycle, though spending on academies, infrastructure and community projects are exempt from calculations.\nNewcastle finished seventh in the Premier League in 2023-24, narrowly missing out on a place in Europe. They also reached the quarter-finals of both domestic cup competitions, but were eliminated from the Champions League at the group stage.\nEales said the latest financial results are \"good news\" as the club looks to continue their growth on the field too.\n\"It is a new (PSR) cycle, so that's good news for us,\" Eales said.\n\"Ultimately, it's about getting the players that Eddie [Howe] wants in his positions. There's real alignment in that respect. So we're excited about the summer ahead.\"\nNewcastle have been considering a move away from St James' Park since the Saudi-led takeover in 2021.\nManager Eddie Howe said it would feel like a \"betrayal\" to leave venue they have called home since 1892, but plans have been moving forward and they are expected to enter the \"decision stage\" early this year.\n\"We appreciate the patience on this matter,\" Eales said.\n\"It's a once-in-a-generation decision. We want to make sure we've got everything right. We don't want to rush and just do something and then think in 20 years' time, 'If we'd just spent a little bit more time'.\n\"We want to make sure we take everybody on the journey. So it's about narrowing which of those is the best option in the long term for the club. But also bearing in mind how important Newcastle United is to the city and the region.\n\"So this is something that, if we can get it right, we feel can be something that benefits not only the club, but the wider region.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g7d71kklno"}