{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:56", "date_modify": "2025-05-20 12:25:56", "date_publish": "2023-08-04 11:42:08", "description": "'It made up for the embarrassment of last week'", "filename": "sport_articles_c3gz3vn6dv7o_1747743956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f00/live/dee95d60-32b1-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3gz3vn6dv7o_1747743956.html", "title": "'It made up for the embarrassment of last week'", "title_page": "'It made up for the embarrassment of last week' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views after Hibs hammered Andorrans Inter Club d'Escaldes in the second leg to reach the third qualifying round of the Europa Conference League.\nHere's what some of you said:\nKen: It was a-much improved performance, particularly going forward. I’m not convinced that defence will stand up to league opposition, we need to get a settled and well marshalled defence sorted out quickly. The goalkeeper situation is definitely a worry if both first-team goalkeepers are injured.\nMartin: It made up for the embarrassment last week. Great attitudes from the players, we need more of those performances in the next round please and we will have Dylan Vente on board.\nFergis: I can’t argue with that, I thought we were excellent, really solid from everyone. Joe Newell was outstanding in the middle, Josh Campbell keeps getting goals from midfield, and Christian Doidge looked really fit and sharp. We look like a different attacking team when Martin Boyle plays, it was a great response from the disappointment last week.\nAllan: A professional job by the players. I thought they treated the first leg like a pre-season game but everyone was right up for it. It was great to see Boyle back but we played and won as a team. I have to give credit to Lee Johnson and the staff. They shielded the boys last week but clearly got it right this time, resulting in a great atmosphere! On to Switzerland.\nJohn: The players put on a performance, which the fans deserved after last week. The atmosphere was great from the start, which the team fed off. Our new signings played well and with Vente to come in, I’m so cautiously optimistic for the season. If we beat Luzern, Andorra will be long forgotten.\nColin: Hopefully people have learned a lesson about us in European competitions! Hibs turned the tie around with a very good performance backed by our loyal supporters. We move on confidently into the new league season and next round in Europe with an improved squad.", "url": "https://www.bbc.com/sport/articles/c3gz3vn6dv7o"}