{"authors": ["Andy Cryer", "www.facebook.com"], "date_download": "2025-05-21 04:11:43", "date_modify": "2025-05-21 04:11:43", "date_publish": "2025-01-15 08:56:54", "description": "As Arsenal prepare to host Tottenham in the Premier League, BBC Sport looks at why frustration is beginning to grow at the club.", "filename": "sport_football_articles_cwy1997xzylo_1747800703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/40d8/live/511f7b20-d1b8-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy1997xzylo_1747800703.html", "title": "Arsenal vs Tottenham: Why is frustration growing at Mikel Arteta's Gunners?", "title_page": "Arsenal vs Tottenham: Why is frustration growing at Mikel Arteta's Gunners? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The frustration is growing at Arsenal.\nTrailing Newcastle 2-0 in their EFL Cup semi-final after the first leg and now knocked out of the FA Cup by 10-man Manchester United, it has been a forgettable week for the Gunners.\nOn Wednesday, Mikel Arteta's men host north London rivals Tottenham in the Premier League, seven points off leaders Liverpool.\nArteta has now been in charge of Arsenal, a club he made more than 100 appearances for as a player, for five years and is the Premier League's third longest-serving manager.\nHe has helped them recover from mediocrity to consistent challengers at the top of the game but - with just the 2020 FA Cup to his name - is patience beginning to fade among some fans?\nIt has to be pointed out they are third in the league, still in the Champions League and in the semi-final of the League Cup - having been Manchester City's closest title challengers in recent years.\nBut, with questions again growing about Arsenal's inability to sign a prolific goalscorer and their, at times, functional style of play, Arsenal fans appear divided when it comes to whether Arteta can deliver success.\nTV presenter and Arsenal fan Robert Peston wrote on X the \"heart had gone from the team\" and there was \"no strategy to transform Arsenal into trophy-winners from honourable runners-up\".\nEx-Arsenal forward Theo Walcott added on BBC Radio 5 Live: \"They are dominating the ball and look strong at the back but they have lost the hunger of opening up teams.\"\nMeanwhile, Athletic journalist Rory Smith said: \"Arsenal are a system team and when it doesn't work and they can't find a way though, other than Saka and Martin Odegaard, who is thinking 'I'm going to take this into my own hands?' Against a team that is happy to absorb pressure they seem to run out of ideas.\"\nBolarewaju: Mikel Arteta's stubbornness is the reason why we are not progressing well as a team.\nVince: I've been a staunch follower of Arteta's policy that eschews the need to splurge on a natural forward. This Man Utd loss, and the one to Newcastle in the EFL Cup, tell me I've been severely myopic, if not downright blind. We're still in the January transfer window and with Jesus sidelined, please go get that striker before the month ends and our hopes with it.\nQuinton: I will always love Arsenal and the entire stature of the club, I will never question a manager or a player because they give it everything day in day out. Winning tournaments is the hardest thing to do, but I'm not too fussed if we don't - it is not all about silverware. Arteta has rebuilt the club and culture, I enjoy watching the club no matter what happens. I'll support him until the end just like I did with Arsene Wenger. Loyalty is a lost cause in this day and age.\nPaul: Again, build-up is too slow against teams coming to defend and hit us on the break. We seem to want to play four passes when one would do. It was same against Brighton and Newcastle. We won't win anything playing like this. Mikel needs to rethink our tactics as this slow play is frustrating for the fans and I suspect the players too. We have become very predictable.\nLinda: I think criticism towards Arteta is slightly unfair. Once again he coached a performance that should win us the game. It's not his fault Kai Havertz and co are missing chances any top-level forward should be expected to score consistently.\nRory: Disappointed. Clearly the manager has no nous when it comes to substituting underperforming players, a situation that can only get worse if it's not immediately rectified.\nAlan: Slow, boring football is all that Arsenal produce now - they have gone backwards in the last two or three seasons. They are always passing backwards and sideways - nothing through the middle at all. They have no proven goalscorers and it shows. I think Arteta has gone as far as he can and has run out of ideas and tactics. This is why they now rely on set-pieces to score. The fans are now starting to turn on him and you cannot blame them with the cost of going to see Arsenal, their prices are scandalous.\nGraham: Yet another gutless performance, running out of ideas. Arteta seriously has to go. We will never win anything under him. They need to spend this month but I bet they won't.\nArsenal's problems are obvious if you listen to most people. Scoring goals.\nAnd, while the basic stats don't make this obvious, with the Gunners the third top scorers in the league this season, a deeper look highlights their problems in front of goal.\nWhile they have the best defensive record in the league, they are only sixth in terms of big chance conversion rate all season, and eighth since 1 December. And they are the only side in the top six to not have a goalscorer in double figures.\nTheir lack of ruthlessness was shown in recent cup games.\nThey had 23 shots with only three on target against Newcastle, and 26 with seven on target against Manchester United in 120 minutes.\nIt must be noted they are without their key creative force, Bukayo Saka, and his potential replacement Ethan Nwaneri because of injury, but that will not soften the call for Arteta to bring in a new striker - especially following a serious injury to Gabriel Jesus.\nFormer Manchester City defender Micah Richards told Match of the Day: \"The difference between Arsenal winning the league or winning these ties is just a centre-forward.\"\nSince Arteta was appointed, the Gunners have a net spend of £500.14m, according to data from Football Transfers,, external while City's is just £59.75m in that same period, helped by sales of young talent.\nIn the five years previous to Arteta's appointment their net spend was £235.4m.\nBut a lack of a striker remains the burning criticism.\nTheir ruthlessness in front of goal was also highlighted as an issue last season, but their only attacking addition in the summer was Raheem Sterling from Chelsea - and his impact has been minimal.\nThe last time Arsenal had a player score 20 goals or more in the Premier League was when Pierre-Emerick Aubameyang did it in 2018-19 and 2019-20.\nWhile 20 of Arsenal's 62 goals in all competitions this season, 32% have come from set-pieces.\nBBC Sport's Arsenal correspondent, Alex Howell:\nIt is not in question that Mikel Arteta has transformed Arsenal since taking over as manager in 2019.\nThat progress had renewed optimism in north London and, after pushing Manchester City to the final day of the Premier League season in the last campaign, many thought this would be the year that Arsenal finally lifted silverware.\nBut on Sunday there was a unique atmosphere of desperation created in the ground.\nSome supporters left when the team was trailing with a decent chunk of time left against Newcastle, and that frustration also spilled into the Manchester United game.\nTwo losses back-to-back at home in cup competitions has started to create a feeling that it may be another campaign where Arsenal miss out on the top prizes.\nLaura Kirk-Francis, Latte Firm podcast:, external\nThe fanbase is now at odds over where to lay the blame. This team does not look markedly different from last year, where the same personnel produced a record-breaking season.\nFundamentally, Arteta isn't the one fluffing chances and missing penalties - it's more a story of individuals underdelivering. The players are the same, the performances are not.\nCritics of Arteta, though, will point to his failure to strengthen Arsenal's attacking line in recent transfer windows. The vocal 'Arteta out' brigade are revising the previous seasons' successes as either luck, or a dramatic overachievement that actually just masked fundamental issues with Arsenal's squad.\nThat misplaced faith in things like Kai Havertz's consistency, which I think is a symptom of inexperience, not arrogance or stubbornness, has left the team ill-equipped to handle fluctuations in form.\nNow, our attention turns to Wednesday's north London derby with a significant level of dread. Win, and Arsenal will at least stop the rot. But if Spurs leave the Emirates with three points, there will be absolutely no hiding place for Arteta.", "url": "https://www.bbc.com/sport/football/articles/cwy1997xzylo"}