{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:48", "date_modify": "2025-05-21 06:01:48", "date_publish": "2025-04-01 16:49:39", "description": "The Premier League is to introduce semi-automated offside technology for the round of fixtures starting on Saturday 12 April.", "filename": "sport_football_articles_cgenyp53plpo_1747807308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/967f/live/c6bc5f40-f5be-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgenyp53plpo_1747807308.html", "title": "Semi-automated offside: Premier League to introduce technology on 12 April", "title_page": "Semi-automated offside: Premier League to introduce technology on 12 April - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Premier League is to introduce semi-automated offside technology for the round of fixtures starting on Saturday 12 April.\nThe decision follows non-live testing in the Premier League and its launch in English football during the FA Cup fifth round at the end of February.\nSemi-automated offside technology is designed to make the judgement of tight offside calls easier for officials by rendering key parts of the process automatic.\nIt automates key elements of the offside decision-making process to support the video assistant referee (VAR), and the Premier League said it \"enhances the speed, efficiency, and consistency of offside decision-making\".\nThe technology was first used in elite-level football at the 2022 World Cup in Qatar, and featured in Serie A and La Liga, as well as the Champions League.\nThe first Premier League match to benefit from its introduction will be Manchester City's home game against Crystal Palace (12:30 BST)\nThe system aims to remove some elements of human subjectivity by replacing decisions made by officials with automated ones taken by technology.\nAs things stand, when a player scores after a borderline offside situation, officials in the video assistant referee (VAR) room must decide on three key things - when the ball was kicked, where - and at what angle - the defender's body was when the ball was kicked, and where - and what angle - the attacker's body was.\nAll three of those decisions will now be automatically taken by the technology.\nBespoke cameras, which will monitor a variety of key elements involved in any tight offside decision, have been installed beneath the roof at all 20 Premier League stadiums.\nThe cameras will track the exact movement of the ball as well as 10,000 surface mesh data points on the bodies of all 22 players, meaning it can be automatically determined whether or not an attacking player's body was beyond the last defender's at the exact time the ball was played.\nArtificial intelligence manages the process, monitoring ball and player movement, before coming up with a decision as to whether the player was onside or offside.\nVAR officials check the system has correctly determined the three key points it measures before confirming the decision. The on-field officials then inform the players.\nA 3D animation of the decision produced by the artificial intelligence will then be played on television for viewers at home and on big screens in the stadium.", "url": "https://www.bbc.com/sport/football/articles/cgenyp53plpo"}