{"authors": ["Jay Freeman", "www.facebook.com"], "date_download": "2025-05-21 03:58:11", "date_modify": "2025-05-21 03:58:11", "date_publish": "2025-04-07 08:34:59", "description": "St Helens boss Paul Wellens says he cannot fault his side for how they adapted to losing key players during their Challenge Cup quarter-final defeat by Warrington Wolves.", "filename": "sport_rugby-league_articles_ckg2dw3eryqo_1747799891.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bba/live/f2efe9c0-1386-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_ckg2dw3eryqo_1747799891.html", "title": "Paul Wellens: St Helens head coach cannot fault his depleted side in Challenge Cup loss", "title_page": "Paul Wellens: St Helens head coach cannot fault his depleted side in Challenge Cup loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Helens boss Paul Wellens says he cannot fault his side for how they adapted to losing key players during their Challenge Cup quarter-final defeat by Warrington Wolves.\nSecond rower Curtis Sironen had to leave the field for a head injury assessment (HIA) - which he eventually passed - leading to Jake Wingfield coming on from the bench before he was sidelined for a HIA of his own which he eventually failed.\nSaints then lost Mark Percival to another HIA and despite a second-half fightback, Wire captain George Williams eventually scored the decisive try to send the hosts through.\n\"You don't envisage losing players in the manner that we did. It can happen. We had two second rows playing centre and middle units in the back row,\" Wellens told BBC Radio Merseyside.\n\"I'm really proud of the players and the way they handled that disruption. But obviously the overriding emotion is huge disappointment in not making it through to the semis.\n\"We were moving the ball really effectively to an edge to space, but if you've got back rows in the centre, you can't expect Joe Batchelor and Matt Whitley to do what Harry Robinson and Mark Percival will do.\n\"The two guys were putting their hand up for the team and doing a good job so we can't really fault anybody in that respect.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/ckg2dw3eryqo"}