{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:13:59", "date_modify": "2025-05-21 07:13:59", "date_publish": "2025-03-29 07:46:37", "description": "Swansea City: Alan Sheehan's new-look staff 'get through work' before Leeds", "filename": "sport_football_articles_cly6yr8d560o_1747811639.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1b9/live/df214f00-0bdf-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly6yr8d560o_1747811639.html", "title": "Swansea City: Alan Sheehan's new-look staff 'get through work' before Leeds", "title_page": "Swansea City: Alan Sheehan's new-look staff 'get through work' before Leeds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan has described himself as \"a bit of perfectionist\" – and says his new-look management team will help Swansea City thrive in the final stages of the season.\nSheehan will be flanked in the dugout at Leeds United on Saturday (15:00 GMT) by new coaches Mark Fotheringham and Richard Stearman.\nThe duo arrived on short-term contracts this week, joining Kristian O'Leary and goalkeeping coach Martyn Margetson on Swansea's first-team staff.\nSheehan says he is delighted to be working with two former team-mates who showed \"so much desire to come in and help\" Swansea secure their Championship status for next season.\n\"I'm incredibly pleased to have two people and then Marge (Margetson) and Kris, to have that team where we can get through work because I am quite demanding and I do work long hours and we do discuss a lot,\" Swansea's caretaker head coach said.\n\"We want to improve this team as much as we can in every moment of every game and every training session.\n\"I'm a bit of a perfectionist so you're doing a lot of stuff. It's wonderful to have this calibre of coaches that are willing to come in for six weeks.\"\nThe new faces go straight in at the deep end at this weekend, with Swansea aiming to become only the second visiting team this season to win a second-tier game at Elland Road.\nSwansea have won only one of their past nine away matches, while Leeds have won 15 of their 19 home league fixtures in 2024-25.\nWhile his side will start as underdogs, Sheehan says Swansea's players have responded well to the new voices on the training ground.\n\"We've got a really good relationship with the players. They are very good to us, they give everything,\" he said.\n\"I think there's no question of their application and desire to work hard for each other.\n\"Yes we fell short against Burnley and I take ownership of that. Now we get ready for really a difficult test against Leeds, but in terms of the players, I think so highly of them.\"", "url": "https://www.bbc.com/sport/football/articles/cly6yr8d560o"}