{"authors": ["Laura Kirk-Francis", "www.facebook.com"], "date_download": "2025-05-21 07:46:23", "date_modify": "2025-05-21 07:46:23", "date_publish": "2025-05-20 11:35:51", "description": "Arsenal news: Opinion - 'You can't underestimate the value of a keeper like Raya'", "filename": "sport_football_articles_cyvmq242jy0o_1747813583.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbf6/live/712e8270-b626-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cyvmq242jy0o_1747813583.html", "title": "Opinion - 'You can't underestimate the value of a keeper like Raya' - BBC Sport", "title_page": "Arsenal news: Opinion - 'You can't underestimate the value of a keeper like Raya' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Before Sunday's crucial game at the Emirates, Arsenal's record against Newcastle this season had been dreadful. Not only had they lost three times, they had failed to score in all three fixtures. The games themselves had been one-sided. For the first 45 minutes on Sunday, it looked to be a similar story.\nDavid Raya had other ideas. Making multiple crucial saves to deny Newcastle, including a magnificent double save to thwart Dan Burn and then Sven Botman in the 18th minute, he single-handedly (pun-intended) kept Arsenal in the game.\nCuriously, there have been rumbles from some fans that his kicking and distribution over the past few fixtures have put Arsenal under unnecessary pressure. Two errant kicks early in the first half on Sunday were perhaps evidence of a slight drop in Raya's excellent standards, but his performance throughout the rest of the game won him a deserved man of the match.\nAs the transfer window beckons, it is worth remembering how Raya came to be Arsenal's goalkeeper. This is only his second full season with the Gunners since he was brought in to replace Aaron Ramsdale at the start of last season. Some called it ruthless, but manager Mikel Arteta clearly wanted an upgrade on an already very good goalkeeper.\nRaya's performance on Sunday serves not only as a reminder that Arsenal have a world-class keeper as their number one, but that it was through ruthless and emotionless decision making that got him there. It is this type of attitude fans will be hoping the club displays when it assesses where else on the pitch they will need to upgrade this summer.\nThe Spaniard is now one clean sheet from securing back-to-back Golden Gloves. It might not be the trophy Arsenal fans wanted, but you simply cannot overestimate the value of a goalkeeper like Raya.", "url": "https://www.bbc.com/sport/football/articles/cyvmq242jy0o"}