{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:33:06", "date_modify": "2025-05-19 15:33:06", "date_publish": "2015-02-03 23:03:47", "description": "Wales will find it harder to beat England in Friday's Six Nations opener in Cardiff than in 2013, says Will Carling.", "filename": "sport_rugby-union_31123667_1747668786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80775000/jpg/_80775428_wales_sam_warburton.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31123667_1747668786.html", "title": "Six Nations 2015: England harder to beat - Will Carling", "title_page": "Six Nations 2015: England harder to beat - Will Carling - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England legend Will Carling says Wales are \"pretty intimidating\", but will find it \"much harder\" to beat England in Cardiff on Friday than in 2013.\nWales won 30-3 to deny Grand Slam chasing England on their last Millennium Stadium visit.\nCarling says the pressure is on Wales as England coach Stuart Lancaster prepared to name his team on Wednesday, 4 February.\n\"They know what they're going to walk out into,\" said Carling.\n\"I don't think they'll be dominated as much as they were in the scrum two years ago and that's what really broke them and led to the big points.\n\"I think they're going to be much harder from a Welsh point of view...if they [England] get a few breaks in the first half, who knows?\n\"And there's a huge amount of pressure on the Welsh.\"\nWales coach Warren Gatland named his side on Monday for the 2015 Six Nations opener, two days earlier than expected.\nThat was viewed as a psychological ploy in some quarters as Lancaster pondered who to pick amid myriad injuries.\nBut Gatland's actions have not impressed ex-England centre and former captain Carling, who said: \"Come the final whistle, no-one's going to care about any of this stuff.\"\nCarling also feels New Zealander Gatland is at a degree of disadvantage because he cannot plan fully for the \"unknown combinations\" Lancaster has now named his team.\n\"It's real backs to the wall stuff because you're going down to Cardiff which is one of the hardest places to play as an Englishman,\" said Carling.", "url": "https://www.bbc.com/sport/rugby-union/31123667"}