{"authors": ["David Pottier", "www.facebook.com"], "date_download": "2025-05-21 06:16:36", "date_modify": "2025-05-21 06:16:36", "date_publish": "2025-03-31 08:57:10", "description": "Bristol City fan and podcaster David Pottier believes their Championship destiny is still in their own hands despite a defeat by Burnley.", "filename": "sport_football_articles_c2ewd84lrl4o_1747808196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce6f/live/b7062360-0e0a-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2ewd84lrl4o_1747808196.html", "title": "Fans view: Bristol City's destiny is still in their own hands", "title_page": "Fans view: Bristol City's destiny is still in their own hands - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "City's unbeaten run of seven games came to an end and Burnley extended theirs to 26 matches. The scoreline had a predictable element with the Clarets' opponents scoring '0' for the 28th time in 39 league games!\nBurnley were better than City, there is no argument about that, but for all their intricate passing and pressing, they only had one goal to show for it and Max O'Leary did not have a busy afternoon.\nWhen you are 1-0 down, you are very much still in the game but it would have been seen as an unexpected point had Yu Hirakawa's snapshot found the net with seconds remaining.\nCity's travelling fans have a right to feel disappointed as at no time during the game did they go for it. Even Liam Manning said aspects of the team's play was \"sloppy\" and too many of the players had flat rather than outright poor performances.\nApart from Middlesbrough getting three points against Oxford to leapfrog City, the results left the table very much in an 'as you were' status.\nFifth and sixth is being fought over by four clubs: Coventry, Middlesbrough, West Brom and City.\nThe outcome is still in the Robins' hands right now but come 10pm on Tuesday, 8 April, the picture will be a lot clearer as by then City will have entertained Watford and then WestBrom at Ashton Gate. Anything less than four points from those games and City will then be relying on other clubs dropping points as well as getting at least another 10 of their own from the five matches remaining.", "url": "https://www.bbc.com/sport/football/articles/c2ewd84lrl4o"}