{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 06:57:42", "date_modify": "2025-05-21 06:57:42", "date_publish": "2025-02-08 08:50:20", "description": "The Pittsburgh Steelers will play the first ever NFL regular season game in Dublin later this year, but the trip will represent a return to Croke Park for the famous franchise.", "filename": "sport_american-football_articles_c2eg290m2z7o_1747810662.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/479a/live/b30a4650-e589-11ef-874f-d10a22ea77ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_c2eg290m2z7o_1747810662.html", "title": "NFL: 'Dream come true'", "title_page": "NFL: 'Dream come true' - Irish fans' joy as Pittsburgh Steelers confirm Dublin return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The build-up to the Super Bowl in New Orleans this weekend has brought a historic announcement for fans of American football in Ireland.\nIt was there on Friday that it was confirmed that the Pittsburgh Steelers will play in Dublin's Croke Park this year in what will be the first regular season National Football League (NFL) fixture ever to be played on the island.\nWhile seemingly unprecedented, for long-term fans of the Steelers on this side of the Atlantic, the news brought back memories of a similar moment almost three decades prior.\nIt was 28 years ago, again in the build-up to a Super Bowl in the city of New Orleans, that the NFL first signalled their intention to send one of their most iconic franchises to play in Ireland for what was dubbed the 'American Bowl'.\nOn that occasion the Steelers, whose owner's ancestors hailed from County Down, would travel for a pre-season game played against the Chicago Bears on 27 July 1997.\nLocal supporter Tom McCormack found it \"surreal\" to see the team he had followed from afar for so long suddenly arrive on his own doorstep.\nThe 63-year-old fell in love with the game when University College Dublin's freshman rugby team toured Florida in 1979, adopting the Steelers at the end of a run of four Super Bowl titles in six seasons.\nIn contrast to the widespread coverage available today, the Dublin native remembers following the team through a weekly highlights program broadcast a week after the games had taken place.\n\"I was the back-up tight end on the Dublin Celts,\" he remembered, joking that his access to local rugby pitches likely helped him cling to his spot on the bench a little longer than merited.\n\"They were a team run by a couple of people from the American embassy [in Dublin] and in one of the houses around there they had American television.\n\"There were US marines based there and we could see a match every three or four weeks depending on their security detail.\n\"Otherwise, it was very difficult. You had to listen to American Forces radio on a Sunday night.\"\nMcCormack's own links to the Steelers would be strengthened in later years when, in his role as a communications consultant, he would work closely with the Steelers then owner, the late Dan Rooney, to promote his charity work with the Ireland Fund.\nStill, having previously been drip-fed news of their on-field exploits, McCormack could hardly believe he would soon be seeing future NFL Hall of Famers like Jerome Bettis and Dermontti Dawson in the flesh, and was especially pleased to have the team's stars drop by his local rugby club for a meet and greet.\nCome the day of the game itself, those same Steelers front-liners remained in the game far longer than is customary for the opening series of the season's first pre-season game.\nMcCormack, through those links to the Rooney family, had some insight as to why the side's head coach Bill Cowher seemed especially determined to secure victory in the sort of game where the result is not usually paramount.\n\"There was a nice trophy for the American Bowl and Mrs Rooney liked the Waterford crystal,\" he recalled.\n\"She said she wanted it in Pittsburgh so the coach was given the imprimatur to keep the team on the pitch a bit longer to make sure the points spread was okay before the third and fourth choices ran onto the park.\"\nThe Steelers would win 30-7 with star running back Bettis collecting a rushing touchdown to provide McCormack with his personal highlight of the evening.\nMore than that moment would leave an impression, though. He would later work in communications within rugby and would attempt to emulate some of the pomp he had witnessed in Croke Park.\n\"The NFL were the predecessors of modern sport.\n\"I remember seeing them photograph the coin toss and it was all ceremonial. In rugby that was done in a cloakroom.\n\"The big thing was that, at this stage there were no screens in stadiums here, and they had this huge one wheeled into Croke Park for the first time. Lo and behold, three years later I was doing the same thing in Donnybrook with Leinster.\"\nIf there was a dampener put on the occasion, McCormack was \"disappointed in one sense\" that more did not turn out for the contest with the stadium less than half full for the fixture.\nThe contrast will be stark this time around with a crowd in excess of 75,000 expected to attend and plenty more sure to miss out on tickets.\nEven with the surge in interest in the sport, for a new generation of Steelers fans in Ireland this week's announcement felt just as surreal as the one 28 years ago.\n\"To have it go from a dream to reality was really special,\" says Jimmy English, creator of the Gaelic Gridiron platform and co-host of the Irish Steelers podcast.\n\"I got the nod during the week that there would be something announced this week.\n\"Even though I kind of knew it was going to happen, my heart was racing. I was shaking with the excitement. It was pretty special.\"\nEnglish has witnessed attention on the sport skyrocket locally in recent years, going \"from the niche to the mainstream\", and believes having Irish-born players like Dan Whelan, Jude McAtamney and Charlie Smyth in the league has been the primary driver.\nStaging a regular season game, however, will be a huge next step.\n\"It shows the force that Ireland has become in the NFL space. For such a tiny island, we have such a passionate fanbase,\" he added.\n\"We spent so long chasing this, what do we do now?\n\"I'm still in shock, the dream has come true. Hopefully when I wake up tomorrow it's still going ahead.\"", "url": "https://www.bbc.com/sport/american-football/articles/c2eg290m2z7o"}