{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:06:15", "date_modify": "2025-05-20 12:06:15", "date_publish": "2023-08-05 11:29:30", "description": "Coleraine manager Oran Kearney says he wants to entertain the club's supporters as well as win matches in the Irish Premiership.", "filename": "sport_football_66415621_1747742775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12210/production/_130665247_kearneyindex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66415621_1747742775.html", "title": "Oran Kearney: Coleraine manager wants to 'entertain as well as win'", "title_page": "Oran Kearney: Coleraine manager wants to 'entertain as well as win' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coleraine manager Oran Kearney has emphasised that he wants to entertain the club's supporters, along with winning games in the Irish Premiership.\nThe Bannsiders began their league campaign with a 2-1 comeback win over derby rivals Ballymena United at Ballycastle Road on Friday night.\n\"We've worked really hard as a club to get bums on seats,\" said Kearney.\n\"We've got a job to do to entertain people as well as win football matches,\" added the Coleraine boss.\nThe hosts looked dangerous in attack for long spells of the season opener at the Showgrounds, their frontmen persistently causing difficulties for a Ballymena side having their first competitive outing under new manager Jim Ervin.\nTwo goals from Matthew Shevlin saw Kearney's charges come from a goal behind to win after Colin Coates had given the Braidmen the lead, although it was lively winger Conor McKendry who was awarded the man-of-the-match accolade.\n\"The first game is all about getting up and running. In past seasons it has taken us two or three games to get our first win. You never quite feel like you are up and running until you get those first three points,\" explained Kearney.\n\"Ballymena have a new manager, new players, new mindset, it's a derby, then when you go behind it makes it tough.\n\"It was frustrating to give them a head start but but it's a brilliant piece of improvisation from Conor and Glacks [Jamie Glackin] that gets us our equaliser and after that we really settled down.\n\"But all credit to our guys, I thought we stuck to our task. We were a bit scrappy in the first 20 but I thought after that the longer the game went on the more dominant we became.\"\nMcKendry and Andy Scott posed problems for the United rearguard, while Glackin struck the woodwork in the second half.\n\"We have a lot of good players in that area and we want good players in that area,\" said Kearney of his attackers.\n\"I thought Jamie was outstanding, particularly when we were behind, he really grabbed it by the scruff of the neck and showed a really good level of maturity.\n\"Conor was unplayable. Everything that was good about him is good about us and it was a good all-round performance.\n\"We've still a bit to go. We can still polish up a bit on parts of our performance but we've got our three points in the bag and will crack on for next week.\"", "url": "https://www.bbc.com/sport/football/66415621"}