{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-21 07:58:04", "date_modify": "2025-05-21 07:58:04", "date_publish": "2025-03-27 18:25:21", "description": "McInnes thrilled to have fit-again Stuart Findlay back for Kilmarnock", "filename": "sport_articles_ce98k73k5xdo_1747814284.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7235/live/b86ad000-0b37-11f0-80cd-45d386f77565.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce98k73k5xdo_1747814284.html", "title": "McInnes thrilled to have fit-again Stuart Findlay back for Kilmarnock", "title_page": "McInnes thrilled to have fit-again Stuart Findlay back for Kilmarnock - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derek McInnes has hailed the returning Stuart Findlay as one of Kilmarnock's most crucial players, saying: \"The evidence is there, when he's in the team, we're better.\"\nThe 29-year-old central defender is in contention to make the squad for Saturday's game at St Mirren after five months out with an ankle injury, during which time he has been kept busy at the club, often featuring on their in-house commentary team.\n\"Obviously my eagerness to get him back involved is clear, but I need to be fair to him, but [it is] magic to have him out the commentary team, he has been doing a bit for Killie TV on match days so it's better he's helping us rather than them,\" manager McInnes said.\n\"But I don't want to pre-empt any of that. I don't want to put too much pressure on him in that sense until I have another conversation with him tomorrow.\n\"He's got the advantage of, the evidence is there, when he's in the team, we're better.\n\"It's been a long road for him. When he picked up the injury at Dens, we knew it was significant. It was such a nasty incident, so great to have him back.\n\"There's no doubt we missed his leadership qualities and experience, his know-how. He was a huge part of what we did right last season in conceding so few goals.\"\nStriker Kyle Vassell has also been out injured since the turn of the year, leaving McInnes without two of the most experienced members of his team. Vassell is \"not quite there yet\" in terms of a return to full training.\nMcInnes added: \"Both Stuart and Kyle will be massive for us in terms of getting those two back.\n\"Not just for what they give on the pitch but their leadership qualities. Both of them have been pivotal for us in the past.\"", "url": "https://www.bbc.com/sport/articles/ce98k73k5xdo"}