{"authors": ["David Lockwood", "www.facebook.com"], "date_download": "2025-05-20 14:48:58", "date_modify": "2025-05-20 14:48:58", "date_publish": "2023-07-28 05:21:59", "description": "Wrexham's glamorous pre-season playing Premier League clubs in the US has caught the eye, but BBC Sport found they were also flying to domestic National League fixtures last season.", "filename": "sport_football_66287294_1747752538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15630/production/_130500678_wrexhamflights.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66287294_1747752538.html", "title": "Wrexham: Study finds club took 16 domestic flights in National League promotion season", "title_page": "Wrexham: Study finds club took 16 domestic flights in National League promotion season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham's Premier League ambitions have seen them rubbing shoulders with some of the world's biggest clubs on a pre-season tour of the United States, taking on Chelsea and Manchester United in front of packed stadiums in Florida and San Diego.\nFlying to North America for high profile fixtures would appear to make commercial sense for the newly promoted Welsh side riding the wave of interest generated by their high-profile owners Ryan Reynolds and Rob McElhenney.\nBut as Wrexham returned to the football league after a 15-year absence last season, BBC Sport research showed they also took eight domestic return flights to non-league rivals including Eastleigh, Gateshead and Barnet.\nFourteen of those 16 journeys departed from and returned to Manchester Airport. The shortest flight was just 29 minutes and the average flight time was 43.5 minutes.\nMany Premier League clubs choose to fly to domestic games to aid with player recovery around a crowded fixture schedule, but the environmental damage caused by short-haul flights means they have become increasingly controversial in sport in recent years.\nThe BBC found no evidence of any other clubs flying in the National League last season.\nIn addition to the 16 flights with the Wrexham players on board, BBC Sport also found evidence of a further 16 'positioning' flights. A 'positioning' flight is where a plane is flown into the airport it is collecting its passengers from. These flights are often empty and therefore sometimes called 'empty leg flights' - and create additional emissions.\nKatie Cross runs Pledgeball, who work with clubs to \"engage fans and lower their footprints\", said Wrexham's rapid trajectory risks being \"overshadowed\" by a \"surging environmental impact\".\nCross said: \"The club, with the full backing of their new owners, seem to be following the well-carved out track of measuring success through global expansion and financial success.\"\nWrexham have been approached for comment by BBC Sport.\nThe co-owners' mission statement, external on the club website pledges a \"commitment to a more ecologically-sustainable version of the club and stadium\".\nLike many Premier League clubs, Wrexham have signed a lucrative sponsorship deal since their takeover. They have partnered with United Airlines, the world's largest airline, at a time when there are calls for football to distance itself from fossil fuel industries as sponsors.\nAccording to its own baseline figures for the pre-Covid year of 2019, the airline was responsible for more than 42 million tonnes of CO2e - roughly the same as the footprint of the entire Welsh nation in the same year.\nIn a social media video, Reynolds and McElhenney said: \"We seek out sponsors that match the spirit of both Wrexham AFC and the people of Wrexham. We could think of no better sponsor.\"\nFrank Huisingh runs campaign group Fossil Free Football and said: \"Football has a clear interest in stopping the climate crisis from escalating further. It is therefore sad to see that so many young world-class players are asked to promote a very polluting activity like flying.\n\"Wrexham AFC shouldn't have followed their [Premier League clubs] lead. They should do what is best for fans around the world and stop advertising air travel.\"\nWrexham's four-game US tour also includes matches against LA Galaxy's second XI and Philadelphia Union. In total they will cover around 9,086 air miles, equivalent to around 30 tonnes CO2e for an estimated 30 players and staff.\nCross thinks an opportunity is being missed \"Imagine the impact if Wrexham chose to prioritise environmental sustainability in their decision-making and used their huge profile to push it up the football agenda?\" he said. \"It would be a game-changer and would cause heads to turn.\"\nAdditional reporting by Matt Hickson", "url": "https://www.bbc.com/sport/football/66287294"}