{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:31", "date_modify": "2025-05-21 06:52:31", "date_publish": "2025-01-22 14:06:21", "description": "Manchester City sign Brazil forward Kerolin from North Carolina Courage on a three-and-a-half-year contract.", "filename": "sport_football_articles_cz9ey57x99wo_1747810351.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9c65/live/08e82940-d8a9-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz9ey57x99wo_1747810351.html", "title": "Kerolin: Manchester City sign Brazil forward from North Carolina Courage", "title_page": "Kerolin: Manchester City sign Brazil forward from North Carolina Courage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City have signed Brazil forward Kerolin from North Carolina Courage for an undisclosed fee.\nThe 25-year-old, who has 45 caps, has agreed a three-and-a-half-year contract.\nShe is City's third signing of the January transfer window after Rebecca Knaak and Aemu Oyama.\nThe National Women's Soccer League Most Valuable Player in 2023, Kerolin won a silver medal with Brazil at last year's Olympics in Paris.\n\"I'm so excited to be here,\" she said. \"There were a lot of reasons why I chose City and one of those was to play in the Champions League.\n\"I think the players [in the Women's Super League] are really technical and the team is compact. I want to be better, to learn different things and to come here to be challenged.\"\nCity women's director of football Therese Sjogran said: \"Kerolin comes to Manchester City with a wealth of experience under her belt at just 25 [and] with a real desire and hunger to take her game to the next level.\n\"Kerolin is creative, quick and will add even more firepower to our forward line. We have a shared ambition to be the best not only in England but also in Europe.\"\nCity are fourth in the table, nine points behind leaders Chelsea.\nThey face Manchester United for the second time in four days in Wednesday's WSL Cup quarter-final.", "url": "https://www.bbc.com/sport/football/articles/cz9ey57x99wo"}