{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:47:55", "date_modify": "2025-05-19 14:47:55", "date_publish": "2015-02-13 13:40:15", "description": "Ryan Jarvis' 90th-minute penalty gives Aldershot victory against Welling and ends a five-game Conference losing streak.", "filename": "sport_football_31423651_1747666075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/58250000/jpg/_58250270_football-464x261.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31423651_1747666075.html", "title": "Aldershot Town 2-1 Welling United", "title_page": "Aldershot Town 2-1 Welling United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A 90th-minute penalty from Ryan Jarvis gave Aldershot victory against Welling and ended a five-game losing streak.\nThe hosts took the lead when a corner was headed down by Brett Williams and slotted in by Jim Stevenson.\nWelling equalised before half-time through Dominic Vose, who crashed a shot in via the underside of the bar.\nJarvis kept his cool to convert from the penalty spot after Tristan Plummer was fouled by defender Chris Bush in the final minute.\nMeanwhile, Welling have signed defender Sam Berry on loan from Sheffield United, who was an unused substitute.\nAldershot Town caretaker manager Chris Barker told BBC Surrey:\n\"It's about changing the ways that have been there in the last few months, which haven't been good enough on the field. I don't think it was fantastic today but it's a win and if you told me we were going to get three points I would have taken it.\n\"The fitness level was good, we kept going and going until the last minute when we got the penalty. I am very proud of the boys because they've given me everything and we start again on Monday morning.\n\"We've won now and hopefully we can continue at Alfreton next week, which is an even bigger game. Hopefully the luck has changed and if we can get seven points from our next home games, that will make a huge difference.\"", "url": "https://www.bbc.com/sport/football/31423651"}