{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 04:44:15", "date_modify": "2025-05-21 04:44:15", "date_publish": "2025-01-15 00:36:35", "description": "Can 'heroic' Dundee use Celtic draw to fuel top-six push?", "filename": "sport_football_articles_cy7gdrylg8zo_1747802655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b45c/live/bca036c0-d2d8-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy7gdrylg8zo_1747802655.html", "title": "Can 'heroic' Dundee use Celtic draw to fuel top-six push?", "title_page": "Can 'heroic' Dundee use Celtic draw to fuel top-six push? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Tony Docherty said Dundee's display in their thrilling six-goal draw with Celtic was \"bordering on heroic\" - but can they use a statement performance to fuel a top-six finish?\nLess than a week after earning an impressive point against Rangers, the Dens Park side were two minutes away from consigning the Scottish Premiership leaders to just a second league defeat of the season.\nArne Engels' stoppage-time penalty would ultimately deny Dundee a first victory over Celtic in more two decades - and a first at Dens in 36 years - but Docherty was still \"immensely proud\" of his young team.\n\"We made a Champions League team wobble,\" he told BBC Scotland. \"We sensed it, we went for it and gave everything to win that match.\n\"I thought my players deserved that.\"\nDundee went into Wednesday's encounter with several first-team players out injured amid a hectic schedule of seven games in 24 days.\nDocherty said in the build-up he had \"asked the squad to go over and above\" and fielded a team including two teenagers and seven players aged 23 and under.\nAfter suffering throughout the majority of the opening period, during which former Dundee captain Luke McCowan headed in a sublime opener, a youthful home side were not overawed by the champions.\nThe resilient hosts fought back superbly on two occasions and Aaron Donnelly's header looked certain to win it before Engels' spot kick.\nWhile Celtic were throwing on multi-million pound talent to rescue the game, Docherty was asking substitute Lyall Cameron \"to get off his sick bed\".\n\"I watched Celtic put on [Nicolas] Kuhn, [Arne] Engels, [Luis] Palma,\" the Dundee boss said.\n\"Finlay Robertson hasn't trained, [Cesar] Garza has had to come off. So to put in that level of performance against that opposition is bordering on heroic.\"\nDundee striker Simon Murray added on Sky Sports: \"The boys really stuck together. It gives us belief going forward. We have got to take confidence from that.\"\nThe next game does not get much bigger for Dundee as they welcome their city neighbours on Monday for a mouth-watering Scottish Cup tie.\nRevenge will be on the minds of Docherty's side, given their last defeat came in a late loss to United at Dens two weeks ago.\nAside from grabbing bragging rights and a place in the next round of the cup, Dundee must also look to use Wednesday's display to aid a push for the top half.\nBut, albeit it was a fine performance, Docherty will not get carried away with the point.\nHis team arguably provide the most entertaining games in the league. That is not necessarily a good thing, though.\nThe Dens Park club have scored the third most goals in the Premiership this term but have conceded the second most goals.\nThey have also won 10 points from losing positions but have lost 17 from winning positions, more than any other team.\nIt is now about a finding a balance for Docherty, whose side have only kept one clean sheet in the league this season.\nBut if he can find a way to tighten things up at the back, his young and vibrant team could could make a promising season a memorable one.", "url": "https://www.bbc.com/sport/football/articles/cy7gdrylg8zo"}