{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:33:18", "date_modify": "2025-04-26 07:33:18", "date_publish": "2025-02-27 16:14:03", "description": "Crystal Palace news: Fan views on one thing nobody is talking about", "filename": "sport_football_articles_c87dwl2n2xjo_1745652798.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c87dwl2n2xjo_1745652798.html", "title": "Crystal Palace news: Fan views on one thing nobody is talking about", "title_page": "Crystal Palace news: Fan views on one thing nobody is talking about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the one thing going on at Crystal Palace that is being overlooked.\nHere are some of your comments:\nFreddie: Daniel Munoz. From the moment of joining last January, he's added another dimension to our attack, ever present in the opposition box and full of energy in both attack and defence. Finishing has improved over recent weeks as well but for the best part of last year, it rarely got a mention. It wouldn't surprise me if other clubs come \"swooping\" for one of the most consistently performing Eagles.\nRichard: Chris Richards. When Chelsea suddenly recalled Trevoh Chalobah in January, we thought this was going to be a serious problem for a defence that didn't seem to have much strength in depth. But Chris has now become a fixture in a back three that is performing as strongly as ever. He has played an outstanding role in this.\nBill: The massive improvement of Will Hughes. He has been a real anchor in midfield since he has had a run in the side. So much so that he has made himself undroppable. The only fly in his ointment is his disciplinary record, which, with a two-match ban coming up, threatens his continued place in the team.\nRichard: I think huge credit has to go to Hughes this season. He's been crucial to the way the team has managed to navigate through the injuries we suffered earlier in the season. He's been a real warrior and leader in the middle of the pitch. While, he lacks pace, he's actually a great footballer, well balanced, good feet, with an eye for a pass and great positional awareness. He is often overlooked when talking about the mercurial talents around him but he pins it all together. Every good team needs a Will Hughes.\nJon: No-one is talking about how good Dean Henderson has been for Palace since he's come in. A lot of fans were sceptical about a large outlay on a goalkeeper who at times had been hit and miss. Especially since we had a decent keeper in Sam Johnstone already. But, since coming into the team, he has done an amazing job and has been a large part in why our defence has been solid with his organisational skills. Not to mention that he makes big saves when he needs to. Getting a few in the face for his troubles.", "url": "https://www.bbc.co.uk/sport/football/articles/c87dwl2n2xjo"}