{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:13", "date_modify": "2025-05-21 07:36:13", "date_publish": "2025-05-20 15:48:52", "description": "Saracens prop Fraser Balmain will leave the Premiership club at the end of the season to join the revamped Worcester Warriors.", "filename": "sport_rugby-union_articles_cz7009842x9o_1747812973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e18c/live/5aeca8e0-358f-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cz7009842x9o_1747812973.html", "title": "Fraser Balmain: Saracens prop to leave club for Worcester Warriors", "title_page": "Fraser Balmain: Saracens prop to leave club for Worcester Warriors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saracens prop Fraser Balmain will leave the Premiership club at the end of the season to join the reconstituted Worcester Warriors.\nHe is the third signing by Worcester, who will resume professional rugby next season in the second tier, having gone into administration in 2022.\nBalmain previously played for Leicester, where he won the Premiership title in 2013, and Gloucester, before joining Sarries last year.\nHis time at the StoneX Stadium has been disrupted by injuries, but he has made eight appearances so far this season.\n\"Fraser has been brilliant for our group and has become a very popular member of the squad. I'm sure he will be a great signing for Worcester and we wish him well,\" said director of rugby Mark McCall.\nBalmain follows Warriors legend Matt Kvesic and Ealing and former Wales scrum-half Lloyd Williams in joining the squad being built at Sixways ahead of next season.\n\"Fraser is someone I have known since being a teenager, and firstly and most importantly, he is a great human,\" said head coach Matt Everard.\n\"Secondly, with his experience of over a decade in the Premiership, he will bring a huge amount of leadership to the group.\"\nThe Championship has been rebranded Champ Rugby for 2025-26 and will feature 14 teams, with promotion and relegation.\n\"It's incredibly exciting to join Worcester Warriors at such a pivotal moment and I'll give my all to get the club back where it belongs,\" Balmain said.", "url": "https://www.bbc.com/sport/rugby-union/articles/cz7009842x9o"}