{"authors": ["Jay Freeman", "www.facebook.com"], "date_download": "2025-04-26 07:02:58", "date_modify": "2025-04-26 07:02:58", "date_publish": "2025-02-28 08:13:29", "description": "As rugby league prepares for a history-making trip to Las Vegas, BBC Sport looks at why the sport is trying to crack a formidable US market.", "filename": "sport_rugby-league_articles_ckg8x4zx38zo_1745650978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0248/live/a8ca02e0-f45a-11ef-8420-bd21274f258f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_ckg8x4zx38zo_1745650978.html", "title": "Super League: Why are Wigan and Warrington playing in Las Vegas?", "title_page": "Super League: Why are Wigan and Warrington playing in Las Vegas? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rugby league history will be made on Saturday as the sport ventures stateside to try to crack the American market.\nWigan Warriors' Super League fixture against Warrington Wolves, itself a hotly-anticipated game between two titans of the code, will open up a bumper weekend at Las Vegas' Allegiant Stadium.\nIt is the first regular Super League fixture to take place in the United States and will be followed in the schedule by England's Women taking on Australia's Women in a huge night for the sport.\nBut why is rugby league investing so much time and capital into a set of games that will take place thousands of miles from its heartlands?\nBBC Sport has taken a look at what is on the line-up and what is to be gained from putting the sport in front of a potentially lucrative audience.\nSaturday's festival of rugby league in Las Vegas is the continuation of an event Australia's National Rugby League (NRL) organised in 2024.\nSimply titled \"Rugby League Las Vegas\", Manly Warringah Sea Eagles beat South Sydney Rabbitohs and Sydney Roosters defeated Brisbane Broncos in the first event.\nJust over 40,000 spectators were in attendance at Allegiant Stadium, home of NFL side Las Vegas Raiders.\nThat event triggered Wigan CEO Kris Radlinski to send a speculative email off to the NRL's organisers to see if his side could take part in 2025.\nAn expanded event in 2025 means the usual season-opening World Club Challenge fixture between the reigning Super League champions and NRL Premiers will not take place.\nWigan will open this year's proceedings against Warrington in a repeat of last season's Challenge Cup final, which was won by the Cherry and Whites. It is one of four games taking place:\nWigan Warriors v Warrington Wolves (kick-off 21:30 GMT - live on BBC Radio 5 Sports Extra and BBC Sounds from 21:15 GMT)\nCanberra Raiders v New Zealand Warriors (kick-off 00:00 GMT)\nAustralian Jillaroos v England Lionesses (kick-off 02:15 - live on BBC Radio 5 Sports Extra and BBC Sounds from 0200)\nPenrith Panthers v Cronulla-Sutherland Sharks (kick-off 04:30 GMT)\nAt attendance of 40,746 at last year's event was heralded as a success and saw almost two thirds of Allegiant Stadium filled, with a usual capacity of 65,000.\nIt is unclear how much of a dent it made, however that has not stopped the sport - and other sports - from trying to broaden their horizons away from their traditional markets.\nAlmost nine years ago, rugby union's Premiership held a game in New Jersey as Saracens beat London Irish in the first match to be held overseas.\nThat fixture, played out with \"plenty of empty seats\" at the 25,000-capacity Red Bull Arena, was followed by just 6,000 attending Newcastle Falcons' game against Saracens in Philadelphia in 2017.\nMeanwhile in rugby league, Catalans Dragons faced off against Wigan in front of 31,555 at Barcelona's Nou Camp in 2019 as the Perpignan-based club tried to capitalise on the success of winning the Challenge Cup the previous year.\nOn the face of it, it is an unusual move to try to break into the United States market when the predominantly working class sport of rugby league has tried - and arguably failed - to expand much in the UK outside of the M62 corridor.\nRugby league will have a tough task to mimic that achievement, but if the move pays off, it could translate into increased brand recognition for the sport and its clubs in a lucrative part of the world.\nThe sport had planned to hold the Rugby League World Cup in the United States during the 2020s, but that move fell through.\nIn contrast, Formula 1 spent decades trying to gain a US audience and currently holds three races a season there - including Las Vegas - and recently opened a multi-million dollar purpose-built pit lane facility near to the Vegas strip, external which will open year-round.\nF1 benefited from a pre-established global fanbase, eye watering levels of financial backing and American ownership of the commercial arm of the sport.\nEven with the recent surge in US interest, however, Formula 1 still pales in comparison to the popularity of American football, basketball, baseball and ice hockey.\nWhether rugby league can raise long-term interest with this year's expanded event in Las Vegas remains to be seen - but an expanded event in 2025 shows the sport is taking the task seriously.\nWhile in Las Vegas, all teams involved have used the UFC's Performance Institute as a training hub.\n\"The UFC is a huge brand in Las Vegas and this is home for us,\" senior vice president of performance at the UFC Dr Duncan French told the BBC.\n\"When these teams were looking for training spaces and how to prepare for gameweek - whether that's recovery, strength and conditioning sessions, film study, catering - we can do that all under one roof so it was a no brainer for lots of these teams.\"\nIn addition to three domestic fixtures between the NRL and Super League taking place, England's Lionesses will face Australia's Jillaroos for the first time since the 2017 World Cup.\nThe fixture is primed to help women's rugby league develop, however England will be hoping to do better than the 38-0 thrashing they were handed the last time they met Australia.\nPart of the charm of using the UFC facility is sharing knowledge across sports, something French says has been particularly useful.\n\"It's always great to get other sporting codes to be around our athletes so they can see how others prepare,\" he added.\n\"There's a lot of synergy between rugby league and fighting, particularly with the demand on the body and there's a huge psychology component going into tackling or wrestling takedowns.\n\"The guys and girls have been sharing ideas and how they train. The brand of the UFC is strong in rugby and the teams coming in are all fans of the UFC so it's been a great week for everybody.\"\nSaturday's fixture presents a unique problem to both Wigan and Warrington.\nThe game takes place eight days after Wigan's win against Hull FC and the Wire's win against Catalans.\nMeanwhile, Wigan will then face Huddersfield on 9 March and Warrington take on Wakefield on the same day.\nA 10,000-mile round trip for one fixture in a crowded schedule is not ideal, Wigan assistant coach Sean O'Loughlin admitted.\n\"Sports science is almost taking a back seat to what this can do for the game,\" he told BBC Sport.\n\"We'll try to do all the things by the book and what the sports scientists said but we know prep-wise it's not perfect or ideal.\n\"It'd be better if we were playing it at home but if you ask any of the lads what they wanted to do, they'll all be putting their hands up saying they'd love to play in Vegas.\"\nThis sentiment is something echoed by fellow assistant coach Tommy Leuluai.\n\"It is gonna be hard, but it's the same for both teams. We decided to do it,\" Leuluai added.\n\"We're excited about it. It's never going to be perfect in terms of preparation and how the boys feel.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/ckg8x4zx38zo"}