{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:30:08", "date_modify": "2025-04-26 06:30:08", "date_publish": "2025-02-27 10:48:27", "description": "Liverpool 2-0 Newcastle: Fan views", "filename": "sport_football_articles_c5y000w32xxo_1745649008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y000w32xxo_1745649008.html", "title": "Liverpool 2-0 Newcastle: Fan views", "title_page": "Liverpool 2-0 Newcastle: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Newcastle's Premier League match at Liverpool.\nHere are some of your comments:\nKrish: When you play at Anfield you need to take chances or make the keeper work and we couldn't do that. We limited Liverpool to only a few chances but there's a clear divide in quality without Alexander Isak, Joelinton and Sven Botman. We need positive performances ahead of the final\nRobert: Sadly it's going to be more than 70 years of winning a trophy in this country for Newcastle United. It seemed like men against boys.\nDavid: We never laid a glove on Liverpool. The tactics were sound, but when you give possession away whilst attacking probably the best side in Europe they will hurt you. Some of the fringe players look like they are going through the motions now. So a summer reshuffle must be on the cards in the summer to mount a sustainable top four challenge.\nAnth: It was disappointingly lame to be honest. The players didn't look convinced they could do anything and Liverpool seem to sense that and did just enough to get over the line. It felt like if we had a little more belief, we could have done some damage, but it was not to be. Not one shot on target tells the whole story. Isak missing out was a kick in the teeth before it even started, but I get a faint whiff of a little 'poker' being played by our Eddie, with one eye on the Carabao Cup final? We shall see.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y000w32xxo"}