{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:55", "date_modify": "2025-05-21 05:23:55", "date_publish": "2025-01-14 15:14:21", "description": "Former Liverpool goalkeeper Loris Karius joins German second-tier side Schalke until the end of the season.", "filename": "sport_football_articles_c8d9m2m22qro_1747805035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c60/live/06c76ca0-d289-11ef-85b4-cfd5b07d0a4a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8d9m2m22qro_1747805035.html", "title": "Loris Karius: Former Liverpool goalkeeper signs short-term deal with Schalke", "title_page": "Loris Karius: Former Liverpool goalkeeper signs short-term deal with Schalke - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Liverpool goalkeeper Loris Karius has joined German second-tier side Schalke until the end of the season.\nKarius, 31, had been without a club since his contract with Newcastle expired at the end of the 2023-24 campaign.\nSchalke were relegated from the Bundesliga in 2022-23 and sit 13th in Bundesliga 2.\n\"I had very good discussions with the Schalke officials and I'm looking forward to training with the team,\" Karius said.\n\"Schalke 04 is a big club with passionate fans, I've always felt that at my games in the arena.\"\nKarius was at Liverpool between 2016 and 2022, making 49 appearances, including starting their 2018 Champions League final defeat by Real Madrid.\nAfter loan spells at Besiktas and Union Berlin he signed for Newcastle as a free agent in September 2022, however he featured just twice.\nThe German will compete with Justin Heekeren for the number one spot.\n\"We didn't want to see any loss of quality in the goalkeeper team,\" director of professional football Youri Mulder said.\n\"We managed to do that by signing Loris Karius. He has many years of experience at the top level.\n\"Loris is fit and can start team training straight away. He is the challenger, with Justin Heekeren as number 1.\"\nSchalke return from their winter break with a trip to Braunschweig on Saturday.", "url": "https://www.bbc.com/sport/football/articles/c8d9m2m22qro"}