{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 06:35:14", "date_modify": "2025-05-21 06:35:14", "date_publish": "2025-01-04 11:01:26", "description": "The Miami Heat suspend Jimmy Butler for seven matches because of \"conduct detrimental to the team\" and will listen to trade offers.", "filename": "sport_basketball_articles_c0476k5wpp6o_1747809314.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b1a/live/5a061b00-ca87-11ef-9bc2-7be38881685f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_c0476k5wpp6o_1747809314.html", "title": "NBA: Jimmy Butler suspended by Miami Heat after trade request", "title_page": "NBA: Jimmy Butler suspended by Miami Heat after trade request - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Miami Heat have suspended forward Jimmy Butler for seven matches because of \"conduct detrimental to the team\" and will listen to trade offers for him.\nThe 35-year-old, a six-time NBA All-Star, has said he would \"probably\" not be content playing for the Heat again.\n\"We have suspended Jimmy Butler for multiple instances of conduct detrimental to the team over the course of the season and particularly the last several weeks,\" read a statement from the Heat.\n\"Through his actions and statements, he has shown he no longer wants to be part of this team.\n\"Jimmy Butler and his representative have indicated that they wish to be traded, therefore, we will listen to offers.\"\nLast week, the Heat's team president Pat Riley said there no was intention of making Butler available for trades.\nButler has made 377 appearances for the Heat since joining in 2019.\nHis most recent game was the 128-115 defeat against the Indiana Pacers on Thursday night, when he recorded nine points, four assists and two rebounds.\nThis season, Butler has averaged 17.6 points, 5.5 rebounds and 4.7 assists per match.\nHe has previously played for the Philadelphia 76ers, the Minnesota Timberwolves and the Chicago Bulls.", "url": "https://www.bbc.com/sport/basketball/articles/c0476k5wpp6o"}