{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:44", "date_modify": "2025-05-21 07:59:44", "date_publish": "2025-01-13 10:03:50", "description": "Yorkshire appoint Mick Lewis as their men's first team bowling coach on a three-year contract as he moves from Essex.", "filename": "sport_cricket_articles_cgmyv7ek3w7o_1747814384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b655/live/17591840-d192-11ef-8338-e1043e56241a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cgmyv7ek3w7o_1747814384.html", "title": "Mick Lewis: Yorkshire appoint Essex bowling coach ahead of 2025 season", "title_page": "Mick Lewis: Yorkshire appoint Essex bowling coach ahead of 2025 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yorkshire have appointed Mick Lewis as their men's first team bowling coach on a three-year contract.\nThe 50-year-old former Australia fast bowler joins from Essex, where he previously worked with White Rose head coach Anthony McGrath.\nBefore joining Essex, Lewis helped state side Victoria to four Sheffield Shield titles and as a player he took 460 wickets across all formats.\n\"I'm thrilled to be joining Yorkshire at what is such an exciting time for the club,\" he said.\n\"I'm looking forward to working with a great cohort of bowlers to help them achieve success in Division One and cannot wait to get started.\"\nLewis, who claimed figures of 3-56 on his one-day international debut for Australia against New Zealand in 2005, will be in post in time for Yorkshire's pre-season tour to Abu Dhabi in March.\n\"Mick will bring immense experience to the role and will undoubtedly add incredible value to all our bowlers who I know will benefit from his vast wealth of bowling knowledge,\" McGrath said.\n\"His record is there to see, and it is testament to the ambitions we have as a club that we are able to bring Mick to Headingley.\"", "url": "https://www.bbc.com/sport/cricket/articles/cgmyv7ek3w7o"}