{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:06", "date_modify": "2025-05-21 06:52:06", "date_publish": "2025-03-29 20:24:56", "description": "Dundee 3-4 Rangers: What Barry Ferguson said", "filename": "sport_articles_cn7v73vyyxko_1747810326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a4f/live/80371390-0c9c-11f0-ab49-f3f2440ca034.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn7v73vyyxko_1747810326.html", "title": "Dundee 3-4 Rangers: What Barry Ferguson said", "title_page": "Dundee 3-4 Rangers: What Barry Ferguson said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers interim manager Barry Ferguson to Sky Sports: \"Really happy with the three points, but I saw so many old habits creeping in. I'm not going to allow that to happen.\n\"We've got a full week now [to prepare] and that's something we'll look at. At stages of the game I was baffled.\n\"They showed character, though, they never gave in. I just felt when we got the goal to go 3-2 that we could get three points.\n\"They were warned you have to be physical and match your opponent and we never did that in the first half. I made changes, but I shouldn't have to.\n\"We can't be happy with the performance. I need to get to the bottom of it and I will get to the bottom of it.\n\"We need to sort a few things going forward before Hibs come to Ibrox.\n\"I felt towards the end, the momentum was with us and thankfully we got the winning goal.\n\"I felt Cyriel [Dessers] was unlucky with his chances. He gives you everything he's got. There are things he can improve, but he's up for it.\n\"I'm certain they would have lost it [a couple of months ago]. The guys are receptive, they understand parts of the game were way off what we expect.\n\"We rolled our sleeves up and got the result in the end.\"", "url": "https://www.bbc.com/sport/articles/cn7v73vyyxko"}