{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:12:26", "date_modify": "2025-05-20 12:12:26", "date_publish": "2023-08-04 19:03:13", "description": "Ellis Genge says any England player can \"wholeheartedly open up\" to him, as he prepares to captain the side against Wales in Cardiff on Saturday.", "filename": "sport_rugby-union_66408197_1747743146.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8646/production/_130647343_8adbe094fc50b75bfdfaf302e0ea0e58559459e0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66408197_1747743146.html", "title": "Wales v England: Ellis Genge says players can 'wholeheartedly open up' to him", "title_page": "Wales v England: Ellis Genge says players can 'wholeheartedly open up' to him - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ellis Genge says any England player can \"wholeheartedly open up\" to him, as he prepares to captain the side against Wales in Cardiff on Saturday.\nWith regular skipper Owen Farrell sitting out the match, Genge will lead England for the second time.\nPlayers are under extra scrutiny with the World Cup squad named on Monday.\n\"When you get the captaincy, players sometimes don't speak their mind as they feel it might get back to people,\" Genge, 28, told BBC Sport.\n\"The boys wholeheartedly can open up to me so I will go and have a few conversations.\n\"Not necessarily about selection on Monday but more about the match on Saturday in terms of what I want from people and what they want from me.\"\nGenge, who first captained England in the record home defeat by France in March, says he will do things differently to Farrell.\n\"He is a real good guy to lean on and obviously has done it numerous times - a lot more than me - but we are different characters,\" he said.\n\"I am probably a bit more emotive than Faz [Farrell]. He is very emotional in the way he plays, he is a competitor, which everyone loves about him and is why we love playing with him.\n\"However, he probably doesn't have as big a social compass as I do. I am a bit younger than him as well, although I don't look it.\n\"I might go round and speak to a few more people than he might but he is a serious leader and helped me massively this week.\"\nThe Bristol Bears prop, who has 48 caps, went to the 2019 World Cup as the third choice loose-head prop behind Mako Vunipola and Joe Marler before establishing himself in the team.\nHe is one of the vice-captains under Farrell and is used to having difficult conversations with players.\n\"It is just my role,\" he added \"It is harder to do when you are captain as you have a few more responsibilities like media. It is a bit easier when you haven't got these responsibilities because you are around people a bit more.\n\"I will go round and have those chats when they are needed.\"\nMuch of the socialising between players happens in camp around the pool table, dartboard or on rare occasions while playing chess.\n\"Manu [Tuilagi] and Jonny May stay on the chessboard 24-7 so you have no luck getting on there,\" Genge said.\n\"Darts is continental - you can dip in and out - and then the pool table is dominated by Jonny Hill and Alex Dombrandt. Elliot Daly has put his name into the hat and has been on fire.\"", "url": "https://www.bbc.com/sport/rugby-union/66408197"}