{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:37:53", "date_modify": "2025-04-26 07:37:53", "date_publish": "2025-02-27 13:59:28", "description": "Hull City midfielder Eliot Matazo is been ruled out for the rest of the season after suffering an anterior cruciate ligament knee injury.", "filename": "sport_football_articles_c8x44vkl17qo_1745653073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e9b/live/abbc0590-f511-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8x44vkl17qo_1745653073.html", "title": "Hull City: Eliot Matazo out for rest of season with ACL injury", "title_page": "Hull City: Eliot Matazo out for rest of season with ACL injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hull City midfielder Eliot Matazo will miss the rest of the 2024-25 season after suffering an anterior cruciate ligament knee injury.\nThe 23-year-old was forced off after just 20 minutes of the 1-0 defeat at Cardiff City on Tuesday night.\nMatazo has made six appearances since signing for the Tigers from Monaco in January and has scored one goal, which came in a 2-1 loss at home to Stoke City on 1 February.\n\"The club will support Eliot throughout his rehabilitation period, and we all send him our best wishes,\" Hull said in a statement on the club website, external.\n\"With you all the way, El,\" the club added on X.\nThe Belgian becomes the third Hull player to suffer an ACL injury this season along with Liam Millar and Mohamed Belloumi, who are not expected to return until July at the earliest.\nIt comes as another blow for head coach Ruben Selles after loanee Louie Barry returned to Aston Villa this week to undergo rehabilitation for a knee injury suffered in the 1-0 win at Sunderland last weekend.\nHull are 21st in the Championship and three points above the relegation zone with 12 games remaining.\nThey welcome fellow strugglers Plymouth Argyle to the MKM Stadium for a vital game in their next fixture on Tuesday, 4 March.", "url": "https://www.bbc.co.uk/sport/football/articles/c8x44vkl17qo"}