{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:06:15", "date_modify": "2025-05-20 13:06:15", "date_publish": "2023-08-02 15:44:34", "description": "Undisputed super-lightweight champion Chantelle Cameron will face Katie Taylor in a rematch in Dublin on 25 November.", "filename": "sport_boxing_66388003_1747746375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5191/production/_130618802_taylorthreecameron.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66388003_1747746375.html", "title": "Chantelle Cameron v Katie Taylor: Rematch confirmed for Dublin in November", "title_page": "Chantelle Cameron v Katie Taylor: Rematch confirmed for Dublin in November - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Undisputed super-lightweight champion Chantelle Cameron will face Katie Taylor in a rematch at the 3Arena in Dublin on Saturday 25 November.\nThe English boxer, 32, will put her four titles on the line again after beating previously undefeated Taylor on points in their first fight in May.\nCameron was awarded the verdict over the Irishwoman on a majority verdict.\nNews of the second meeting was confirmed by Eddie Hearn's Matchroom, which promotes both fighters.\n\"I'm delighted the rematch has been made and really can't wait for another huge night in November,\" said Taylor, 37, who had won each of her previous 22 professional fights and remains the undisputed lightweight champion.\n\"I relish challenges like this and these are the occasions I live for,\" continued the Bray woman, who had last suffered defeat at the 2016 Rio Olympics.\nLast month Cameron, undefeated in 18 pro contests, told the BBC Radio 5 Live boxing podcast that she would have preferred to challenge for her rival's lightweight belts, but indicated a rematch to defend her own belts at 140lbs was the more likely option than reverting to the 135lbs division.\nShe is England's first undisputed champion in the four-belt era, holding the WBC, WBA, IBF and WBO light-welterweight titles.\n\"To go over to Ireland for her homecoming with my belts on the line and beat her was a brilliant experience, but beating her on 25 November will surpass that as I know what to expect now,\" said Cameron.\n\"I've boxed at that high level with a huge amount of pressure on me and the crowd against me. Going into 25 November.\n\"I'm going in there with more aggression and energy and I'm confident of getting the job done in better fashion.\"\nThe Northampton fighter continued: \"I'm going to be a lot better in the rematch. In the gym we're correcting mistakes that I've made. There were little things that I was doing during the first fight that led to me being headbutted a lot - that's why my face was very bruised up at the end of the fight.\n\"Going back to Ireland to beat Katie Taylor twice in a row will show that it wasn't just a lucky night for me and an off night for Katie.\n\"I think I'm all wrong for Katie. I'm too big, I'm too strong and my will to win is too strong. I'm going to be there all night long. Katie picked the wrong fighter to fight.\"", "url": "https://www.bbc.com/sport/boxing/66388003"}