{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:32:24", "date_modify": "2025-05-19 15:32:24", "date_publish": "2017-07-03 17:56:01", "description": "Sebastian Vettel will face no further action following his collision with Lewis Hamilton at the Azerbaijan Grand Prix.", "filename": "sport_formula1_40488056_1747668744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17E55/production/_96677879_hamilton_vettel_reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_40488056_1747668744.html", "title": "Sebastian Vettel to face no further punishment after Azerbaijan GP collision", "title_page": "Sebastian Vettel to face no further punishment after Azerbaijan GP collision - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sebastian Vettel will face no further action after his collision with Lewis Hamilton at the Azerbaijan Grand Prix.\nFormula 1's governing body, the FIA, met Vettel and Ferrari team principal Maurizio Arrivabene in Paris on Monday.\nThe 29-year-old four-time world champion admitted full responsibility for the incident, which happened during the race in Baku on 25 June.\nVettel \"has extended his sincere apologies to the FIA and the wider motorsport family\", the FIA said.\nThe FIA said that because of \"the severity of the offence and its potential negative consequences\", Vettel has been told that any repeat of his actions \"would immediately be referred to the FIA International Tribunal for further investigation\".\nChampionship leader Vettel accused Hamilton of 'brake-testing' - deliberately slowing in front of him - as they prepared for a restart behind a safety car.\nVettel then pulled alongside Hamilton and drove his car into the Mercedes so they banged wheels.\nThe German was given a 10-second stop-and-go penalty during the race after being found guilty of dangerous driving.\nHamilton, who was cleared of any wrongdoing, said Vettel's driving was \"disgusting\" and \"not sportsman's conduct\".\nVettel finished a place ahead of Hamilton in fourth extending his championship lead to 14 points after the Briton was forced to pit to change a loose head restraint.\nThe FIA held a meeting on Monday to \"further examine the causes of the incident to evaluate whether further action is necessary\".\nIt said in a statement: \"Following detailed discussion and further examination of video and data evidence related to the incident, Sebastian Vettel admitted full responsibility.\n\"Sebastian Vettel extended his sincere apologies to the FIA and the wider motorsport family. He additionally committed to devote personal time over the next 12 months to educational activities across a variety of FIA championships and events.\n\"The FIA notes this commitment, the personal apology made by Sebastian Vettel and his pledge to make that apology public.\n\"In light of these developments, FIA president Jean Todt decided that on this occasion the matter should be closed.\"", "url": "https://www.bbc.com/sport/formula1/40488056"}