{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:50", "date_modify": "2025-05-21 07:37:50", "date_publish": "2024-12-23 19:17:12", "description": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?", "filename": "sport_football_articles_cy0np0pwql1o_1747813070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aff4/live/41f67720-c15f-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0np0pwql1o_1747813070.html", "title": "Troy Deeney's Team of the Week: Mohamed Salah, Luis Diaz, Trent Alexander-Arnold, Alexander Isak, Thomas Partey", "title_page": "Troy Deeney's Team of the Week: Mohamed Salah, Luis Diaz, Trent Alexander-Arnold, Alexander Isak, Thomas Partey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After every round of Premier League matches this season, BBC football pundit Troy Deeney will give you his team and manager of the Week.\nHere are this week's choices. Do you agree? Give us your thoughts using the comments form at the bottom of this page.\nTrent Alexander-Arnold (Liverpool): Alexander-Arnold has been unbelievable. Some of his passes have been brilliant. Defensively, he is still doing Alexander-Arnold things but, because of how good he has been going forward and his assists, I had to put him in.\nOla Aina (Nottingham Forest): Another great win for Nottingham Forest, beating Brentford at their place. He looks solid defensively and is a great option going forward as well, as shown by his goal.\nJames Tarkowski (Everton): He is quietly going about his business in defence, like Everton are quietly going about their business. They messed things up for Arsenal and Chelsea in recent weeks and actually look like they could have nicked more against them.\nDean Huijsen (Bournemouth): He scored the goal obviously for Bournemouth but it is more than that. I've watched the 19-year-old a few times this season and he has been really impressive.\nDominik Szoboszlai (Liverpool): Even though he scored against Tottenham, it's not just that. His last couple of performances have been really good, we have started to see the potential Liverpool thought they were getting when they signed him.\nMatheus Cunha (Wolves): No matter what has been going at Wolves, Cunha has been the one player whose level of performance has been consistent. The new manager, Vitor Pereira, has come in and got them a great victory against Leicester. I felt they were calm and composed under him.\nThomas Partey (Arsenal): He is becoming Arsenal's Mr Reliable. Put him at centre-half, it doesn't matter, put him a right-back and it doesn't matter, holding midfielder and it doesn't matter. He just plays where the team need him, goes about his business relatively quietly and he helped Arsenal get a huge win against Palace.", "url": "https://www.bbc.com/sport/football/articles/cy0np0pwql1o"}