{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:37:44", "date_modify": "2025-05-19 15:37:44", "date_publish": "2017-08-03 06:06:18", "description": "One of Usain Bolt's main rivals for the world 100m title at London 2017 is ruled out for the rest of the season after suffering a hamstring tear.", "filename": "sport_athletics_40810832_1747669064.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EA8F/production/_97174006_degrasse.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40810832_1747669064.html", "title": "World Championships 2017: Usain Bolt rival Andre de Grasse suffers hamstring tear", "title_page": "World Championships 2017: Usain Bolt rival Andre de Grasse suffers hamstring tear - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Canadian sprinter Andre de Grasse will miss the World Athletics Championships with a hamstring tear.\nThe 22-year-old was regarded as one of Usain Bolt's main challengers for the 100m title in London.\nDe Grasse won 200m silver, 100m bronze and 4x100m relay bronze at Rio 2016 and ran a wind-assisted 9.69 seconds, external in Stockholm in June.\n\"Injuries are a part of the sport, and the timing of this one is especially unfortunate,\" he said.\n\"The entire year this 100m race in London was my focus. I am really in the best shape of my life and was looking forward to competing against the best in the world. To not have this opportunity is unimaginable to me but it is the reality I am now faced with.\"\nHis manager Paul Doyle added: \"We tried to do everything we could to have him ready but he's just not going to be ready.\n\"Further MRI results today showed it's probably going to be another four to six weeks before he's fully recovered.\n\"So unfortunately he's out of the 100m, 200m and the relay and done for the season.\"\nThe World Championships run from 4-13 August.", "url": "https://www.bbc.com/sport/athletics/40810832"}