{"authors": ["Sandy Smith", "www.facebook.com"], "date_download": "2025-05-21 05:47:51", "date_modify": "2025-05-21 05:47:51", "date_publish": "2025-01-14 14:23:24", "description": "Edinburgh fan voice: 'Victory in Vannes leaves fate in own hands'", "filename": "sport_articles_cn8ylpzd43do_1747806471.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bed3/live/c2289b70-d281-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn8ylpzd43do_1747806471.html", "title": "Edinburgh fan voice: 'Victory in Vannes leaves fate in own hands'", "title_page": "Edinburgh fan voice: 'Victory in Vannes leaves fate in own hands' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "First up let me say in the spirit of BBC's Holiday programme, what a great town Vannes is.\nFriendly, picturesque and well worth a visit. Their ground Stade De La Rabine has a stunning entrance and if you haven't been, look it up.\nThey are mad for their rugby club and as I explored the town, loads of locals said hello and wished us bonne chance.\nAnd on the day we took the chance.\nIt started out like it was going to be straightforward as we scored two early tries , but at the end we were hanging on to a four-point margin.\nIt was a huge effort. The top eight tacklers in the game were all Edinburgh players and Vannes dominated the territory and the possession. The Breton side were big and powerful but the flair all came from the men in orange. Yes, you read that right.\nThere wasn't a single article before this game that didn't highlight the fact that Vannes are bottom of the Pro14. That has to be seen through the optic of that league being one of the toughest around and Edinburgh haven't exactly been setting the heather alight on the road this season, so I'd be wary of dismissing this narrow victory.\nInstead, let's focus on the five points gained and the fact that we are top of pool three going into the last game of the group stages.\nFun fact, readers: Three games into Edinburgh's Challenge Cup campaign and we have scored 13 tries. All of them have come from the backline. Not one forward try.\nWhich leads neatly to our next game against the Richard Cockerill led side, Black Lion.\nThe Tbilisi-based side who are a sort of Georgian Barbarians are bottom of pool three and in keeping with stereotypes, three of the four tries they have scored in their games have come from forwards.\nIt's worth noting that they have scored 56 points in their three games and 30 of those points have come from penalties. Discipline, people.\nCockers return to Edinburgh, Black Lion's poor record and Edinburgh's ability to throw a spanner into our own works could point to the kind of upset that the bookies might dread, but I'm hopeful that our home form, a noisy crowd at the Hive and the prospect of a home tie in the round of 16 will be enough to keep everyone focussed.\nThe outcome is entirely in our own hands which is a luxury we need to capitalise on.", "url": "https://www.bbc.com/sport/articles/cn8ylpzd43do"}