{"authors": ["Michael Pearlman", "www.facebook.com"], "date_download": "2025-05-19 14:41:09", "date_modify": "2025-05-19 14:41:09", "date_publish": "2017-08-11 11:24:13", "description": "Mauricio Pellegrino's first competitive game in charge of Southampton ends in frustration as his Saints side draw at home with Swansea City.", "filename": "sport_football_40835420_1747665669.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/120A2/production/_97309837_pellegrino.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40835420_1747665669.html", "title": "Southampton 0-0 Swansea City", "title_page": "Southampton 0-0 Swansea City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton manager Mauricio Pellegrino praised the \"quality and spirit\" of his side despite being held by Swansea City in the Argentine's first competitive match in charge of the Saints.\nThe wasteful hosts created the better opportunities in an entertaining stalemate but were denied by poor finishing and good goalkeeping as chance after chance was spurned, particularly in a one-sided first half.\nStriker Manolo Gabbiadini hit a post with a header after only 90 seconds, Dusan Tadic fired wide from four yards and Maya Yoshida failed to find the target with an acrobatic volley and a late close-range header, while Swansea goalkeeper Lukasz Fabianski also denied James Ward-Prowse.\nSub Charlie Austin hit the side-netting with a chance deep in stoppage time.\n\"We did everything to win the game but we couldn't,\" added ex-Alaves boss Pellegrino, who replaced the sacked Claude Puel in June. \"We controlled the ball, created chances but this is football - you have to get goals and we couldn't do so.\n\"Sometimes it is really difficult to score - we had 29 shots. We have quality and spirit in the team and it is best to keep going, keep training.\"\nThe Swans failed to have a shot on target and their best opportunities were spurned when Tammy Abraham headed wide after 10 minutes and Leroy Fer blasted a volley off target just after the interval.\nHowever, boss Paul Clement was pleased to have gained a hard-fought point.\n\"It was a hard afternoon, they had a massive amount of chances, set-play after set-play, and we suffered at times,\" added Clement.\n\"I'm happy we ended up with a point and it could have been a lot worse. The last-gasp defending was good but we didn't use the ball well enough further up the pitch.\n\"We are pleased we have got out of here with a draw. I'm sure they will be disappointed and think 'how have we not won'.\"\nThe Saints have not won a home opener since 1988-89 and have been victorious only twice in 19 seasons of Premier League football on the opening day.\nFor the Saints, there is instant pressure on manager Pellegrino to not only consolidate at a club that finished eighth last season and reached a cup final, but to do so playing a more entertaining brand of football than his predecessor Puel.\nThe Premier League's third Argentine manager will be seeking to match his efforts last year in Spain, having led Alaves to ninth in La Liga and the Copa del Rey final.\nSouthampton have finished in the top eight of the Premier League in each of the last four seasons, but they did not score in their final five home league fixtures last season and only managed 17 home goals all term at home.\nHowever, there was no shortage on chances created by his side against Paul Clement's men, with Gabbiadini heading against the woodwork within 90 seconds and Tadic missing a sitter from close range after superb link-up play from Ryan Bertrand and Nathan Redmond.\nEven in failing to score, there was at least a sense with the Saints fans that they were seeing a keener commitment to attacking football and they might have won it at the end, had Yoshida not headed wide from close range.\nIn the absence of last season's top scorer Fernando Llorente, who has a broken arm, and Everton transfer target Gylfi Sigurdsson, the Swans were without their top two attacking talents and they struggled to create much at all.\nFor both clubs, the contest was notable as much for who did not feature as for who did, with both sides forced to do without their star players.\nFor Southampton, there remains a degree of uncertainty about defender Virgil Van Dijk, who has made clear his intention to leave St Mary's despite Saints' insistence he is unavailable for transfer. The club said he missed the big match with a virus.\nAfter the match, Pellegrino said he hoped the Dutch centre-half still had a future at St Mary's.\n\"He is part of the squad. I can't talk about something that right now, I can't manage,\" said the Argentine. \"Hopefully we are waiting for him to train with the team and be part of the team again.\n\"It is good news that he was here, like all his teammates. You have to be here supporting them.\n\"I have talked with him twice and the club was clear with him. We repeat again the same thing. All of us know Virgil is an important part of the club.\"\nSwansea, of the two sides, will probably feel they have the most work to do in order to avoid a season of struggle after their remarkable escape from relegation last season.\nMuch of their hope will rest on young shoulders, with two players with an outside chance of forcing themselves into England World Cup contention likely to be pivotal.\nCentral defender Alfie Mawson started the season as he finished the last, in superb form, while on-loan Chelsea striker Tammy Abraham will reflect on what might have been.\nHe headed wide with Swansea's best opportunity and will need more consistent service if he is to match his tally of 27 goals for Bristol City in the Championship last term. A partnership between him and Llorente will tantalise Swans fans.\nHowever, the Swans will be content with how they defended in their opening encounter, having absorbed large spells of pressure, but they have now failed to score in seven of their 11 meetings with the Saints in the Premier League.", "url": "https://www.bbc.com/sport/football/40835420"}