{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:06:11", "date_modify": "2025-05-20 13:06:11", "date_publish": "2023-08-02 16:03:42", "description": "Light-heavyweights Joshua Buatsi and Dan Azeez will put friendship aside after agreeing to fight at London's O2 Arena on 21 October.", "filename": "sport_boxing_66387767_1747746371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1403D/production/_130618918_bbc-sport-index-imagery-2-split-images-gradient-51fa7554-098b-4ea9-b5fa-48d145529e1d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66387767_1747746371.html", "title": "Joshua Buatsi v Dan Azeez: British light-heavyweights to meet at London's O2 Arena", "title_page": "Joshua Buatsi v Dan Azeez: British light-heavyweights to meet at London's O2 Arena - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Light-heavyweights Joshua Buatsi and Dan Azeez will put friendship aside after agreeing to fight at London's O2 Arena on 21 October.\nBuatsi, 30, is ranked first with the WBA, with 33-year-old Azeez second.\nThe undefeated Londoners started out at the same amateur boxing club in South London.\n\"We've been friends for years but there's too much on the line here for either of us to say no to this fight,\" Buatsi said.\nThe 2016 Olympic bronze medallist, who has won all 17 of his pro fights, added: \"We can be friends again afterwards but on 21 October it's all business.\n\"I'm preparing to beat the best version of Dan Azeez and I'm doing everything I need to do to achieve that, whether that's by decision or knockout.\"\nAzeez's career has taken a very different path, having started off in small shows, but he too is undefeated with 20 straight wins.\n\"I've earned my way to get to this stage of my career and there's still more to earn and prove,\" he said.\n\"This fight is another step closer to the top and it means a lot to me so I'm preparing like I always do.\"\nBoxxer promoter Ben Shalom says the winner could face Russia's WBA (Super) world champion Dmitry Bivol.", "url": "https://www.bbc.com/sport/boxing/66387767"}