{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:52:42", "date_modify": "2025-05-19 14:52:42", "date_publish": "2017-07-05 00:00:00", "description": "Re-live day three of the latest Championship matches as it happened, with Middlesex and Warwickshire setting up an exciting finish.", "filename": "sport_live_cricket_40461298_1747666362.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_cricket_40461298_1747666362.html", "title": "County Championship - Middlesex begin Edgbaston run-chase", "title_page": "County Championship - Middlesex begin Edgbaston run-chase - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all folks\nThat's the lot for day three (or day one if you're Sussex v Leicestershire inclined).\nWe've seen some cracking cricket, with Rory Burns' epic unbeaten 174 for Surrey against Hampshire and Northants' Max Holden (152) and Adam Rossington (112) leading the batting stakes.\nAway from The Oval, Division One has two well-poised games, with Middlesex needing a further 198 runs in their final innings to beat Warwickshire at Edgbaston and Somerset well on top of Yorkshire at Scarborough.\nWe'll be here again tomorrow morning at 10:30 BST. We hope you will be too.\nGripping finish at Edgbaston\nWarwickshire 334 & 233 v Middlesex 334 & 36-2 (13 overs)\nAfter the shock of losing two wickets with only one run on the board, Dawid Malan and Nick Compton steer a safe course for Middlesex through the final eight and a bit overs at Edgbaston.\nThe normally adhesive Compton (17*) even hits a six and four off Boyd Rankin in the day's final over, which the visitors end requiring another 198 for victory.\nWarwickshire skipper Jonathan Trott was dismissed for 99 in their second innings, but they still have a good chance of a first win of the season if their bowlers rise to the challenge on day four.\nClose of play at Arundel\nSussex 262 v Leicestershire 77-2 (24 overs)\nThe end of an excellent day for Leicestershire, who have Colin Ackermann and Mark Cosgrove unbeaten on 21 at the close.\nClint McKay (4-59) and Mathew Pillans (3-63) were the pick of the bowlers after Sussex won the toss and chose to bat, meaning the Foxes will begin day two 185 runs behind with eight wickets in hand.\nClose of play at The Oval\nHampshire 648-7d v Surrey 410-7 (126 overs)\nRory Burns completes an epic day of batting on 174 not out. His 62-run partnership with Tom Curran (35 not out) steadied things after Fidel Edwards shot out Ben Foakes and Sam Curran.\nBurns has spent all three days in the field and will sleep well tonight, ahead of some more batting tomorrow! Surrey still need 89 runs to avoid the follow-on.\nFrustrating finish for Somerset\nSomerset 268 & 234-3 (68.3 overs) v Yorkshire 213\nThe umpires decide there is no prospect of a resumption at Scarborough and call off play 11.3 overs early, with Somerset 289 runs ahead. James Hildreth is 85 not out, with Adam Hose on seven, but skipper Lewis Gregory now faces a dilemma of whether to declare overnight.\nHaving started the match next to bottom and 29 points behind seventh-placed Middlesex, Somerset badly need a first victory of the summer at North Marine Road. Yorkshire, meanwhile, will be happy to finsh the match without further injuries, having already lost Ryan Sidebottom and Liam Plunkett.\nDurham opening pair intact\nDerbyshire 368 & 214 v Durham 301 & 36-0 (17 overs)\nDurham's openers survive three overs from South Africa leg-spinner Imran Tahir at the end of the third day's play at Chesterfield where the visitors need another 246 for victory.\nAlex Hughes made 108, and was the last man dismissed, in Derbyshire's second innings, but they would probably have been hoping for a slightly larger lead. Nevertheless, this is a game that could go either way.\nTough day for Kent bowlers\nKent 701-7 dec v Northamptonshire 528-7 (144 overs)\nNorthants lose three wickets in the final session at Beckenham, including centurions Max Holden (153) and Adam Rossington (112), and still need another 24 runs on the final morning to be sure of not having to follow-on. Matt Hunn has been Kent's best bowler with 3-90 so far, while Pakistan leg-spinner Yasir Shah has sent down 51 overs for his 2-151. Don't bet against a draw here - that would be throwing money away.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nBBC Sport app users may need to click 'view more' to see this tweet.\nWICKET Eskinazi (c Ambrose b Barker) 0\nWarwickshire 334 & 233 v Middlesex 334 & 1-2 (4.2 overs)\nIt's an exciting end to the day at Edgbaston. Nick Compton finally puts a run on the Middlesex scoreboard, but Stevie Eskinazi is caught behind from Keith Barker's next delivery. After a superb 178 in the first innings, that's a four-ball duck for the right-hander.\nWith eight and a bit overs left, Middlesex eschew the option of a nightwatchman and in comes skipper Dawid Malan to lead from the front.\nWICKET Robson (lbw Clarke) 0\nWarwickshire 334 & 233 v Middlesex 334 & 0-1 (3.3 overs)\nIt's a pair for Sam Robson, as he goes lbw for the second time in the match. This innings lasted nine balls, six more than in his first effort, but that will boost the self-belief of the Warwickshire team, who have yet to win a Championship game this summer. Stevie Eskinazi, who was batting at the start of play, comes out to do so again.\nSecond hold-up at Scarborough\nSomerset 268 & 234-3 (68.3 overs) v Yorkshire 213\nWill that be it for the day at North Marine Road as a combination of the light, and the fact that Yorkshire's tow fit fast bowlers Ben Coad and Tim Bresnan are operating together, prompts the umpires to take the players off for the second time.\nPerhaps a surprise as Adam Hose hit a boundary of the last delivery, but Somerset are 289 ahead, and James Hildreth is 85 not out. There are still, in theory, 11.3 overs remaining.\nHampshire's over-rate leaves 11 left\nHampshire 648-7d v Surrey 381-7 (115 overs)\nThere are still 11 overs left to play at The Oval, as Hampshire have somehow managed to have an over-rate of -2.\nThis is despite Mason Crane bowling for much of the day. Sit tight - they're still looking for wickets, with Rory Burns 163 not out and Tom Curran on 17.", "url": "https://www.bbc.com/sport/live/cricket/40461298"}