{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:56", "date_modify": "2025-04-26 03:40:56", "date_publish": "2025-03-05 09:21:28", "description": "Torquay United manager Paul Wotton says their 3-1 win at Chippenham Town is a 'big result' for his side.", "filename": "sport_football_articles_cdx257xjlgko_1745638856.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/052c/live/db8126e0-f9a1-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdx257xjlgko_1745638856.html", "title": "Torquay United boss Paul Wotton hails 'big result' at Chippenham Town", "title_page": "Torquay United boss Paul Wotton hails 'big result' at Chippenham Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Torquay United manager Paul Wotton says his side's 3-1 win at Chippenham Town was a 'big result' for his side.\nThe Gulls had won just one of their previous five matches and had slipped to seventh place in National League South before the game.\nMatty Carson provided the perfect start when he headed his side into a ninth-minute lead.\nCaine Bradbury levelled for Chippenham just before half-time, but Offrande Zanzala scored his first goal since joining Torquay earlier this month to put the visitors back in front 12 minutes after the break.\nMatt Jay sealed the victory with a goal deep in stoppage time as he found the net for a fourth successive game.\nThe Gulls move up to sixth in the table, five points off leaders Dorking Wanderers, as they reacted well after conceding two late goals in a 2-2 draw with fellow high-fliers Boreham Wood on Saturday.\n\"It's a tough place to come. They play a really awkward shape, the pitch was difficult, the slope makes a big difference, so I'm really happy,\" Wotton told BBC Radio Devon.\n\"We haven't won away from home for a while, so that's important.\n\"We've reacted from the bitter disappointment of Saturday really well and I think you could see first half that little bit of disappointment.\n\"We had a bit of a heart to heart and a little bit of a reality check at half-time, stop feeling sorry for yourselves, and second half I thought we stepped it up.\n\"It's one of those games that in the course of the season I don't think anyone's going to look back and say 'that was a classic' or 'we were excellent today',\" he added.\n\"I think it's about getting here, getting the three points, getting home, recovering and being ready to go full tilt for Tonbridge.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cdx257xjlgko"}