{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:19:09", "date_modify": "2025-05-21 06:19:09", "date_publish": "2025-01-14 00:00:00", "description": "All the latest football news, Premier League manager news conferences and build-up to Nottingham Forest v Liverpool at the top of the table.", "filename": "sport_football_live_cz7ewq5r4d3t_1747808349.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cz7ewq5r4d3t_1747808349.html", "title": "Football & transfers latest: Manager news conferences and Premier League build-up", "title_page": "Football & transfers latest: Manager news conferences and Premier League build-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all from us!\nIs that the time already? Time really does fly when the football keeps coming.\nIt's been a busy day of news, here's a brief summary of what's happened:\nAll clubs compliant with PSR rules - What are the PSR rules?\nArsenal forward Gabriel Jesus ruptures ACL - reports\nArteta on 'terrible consequences' of accepting Havertz abuse\nPostecoglou condemns 'vile and detestable' abuse at Tamworth\nMan City legend Book dies, aged 90\nDon't forget you can follow the action from tonight's Premier League fixtures, including Nottingham Forest v Liverpool on the BBC Sport website and app.\nHave a great evening!\nMalen deal depends on Philogene sale - Emery\nEverton v Aston Villa (Wed, 19:30 BST)\nAston Villa\nUnai Emery confirmed in his news conference today that Aston Villa cannot complete the signing of Borussia Dortmund's Netherlands forward Donyell Malen until Jaden Philogene's expected departure to Ipswich Town has been finalised.\nEngland Under-21s winger Philogene, 22, has been linked with a move to Ipswich for an initial £20m, while reports suggest Malen would cost Villa around £18m.\nWhen asked if it was a case of one in, one out, the Aston Villa boss said: \"Of course, it's a change. A clear change. One player leaving, one player joining us.\"\nVisit BBC Sport's dedicated Villa page for full details of Emery's news conference.\nSutton's prediction: Leicester City v Crystal Palace\nSutton's prediction: 1-2\nLeicester enjoyed a big win in the FA Cup but they are on a run of five successive defeats in the league and it feels like they have got to get something from this game.\nIt won't be easy for the Foxes. Crystal Palace have been much improved in the past few weeks and have built a bit of momentum after only losing one of their past nine league games.\nI definitely don't see the Eagles losing this and although it will be tight, they are the team who I think will find a way of winning it, probably through Jean-Philippe Mateta.\n'Everything is going in the right direction'\nLeicester City v Crystal Palace (Wed, 19:30 GMT)\nCrystal Palace\nCrystal Palace boss Oliver Glasner on his squad's selection availability: \"The flu is gone fortunately. So all the players who were ill [last week] are now available. JP Mateta is fine, Maxence Lacroix and Tyrick Mitchell are available. They have trained without any problems.\n\"Another positive is that Will Hughes is now available. He has trained two days with us. So Will is going to be in the squad tomorrow.\n\"Adam [Wharton] will not be in [in the squad] but he is making progress. Everything is going in the right direction, I expect him back training with the team, maybe end of January, but probably the beginning of February.\"\n'Money doesn't play football'\nNottingham Forest v Liverpool (20:00 GMT)\nLiverpool manager Arne Slot was not about to let Nottingham Forest play the part of plucky underdogs after highlighting the costly squad assembled at City Ground.\n\"If you look at the money they spent, it's not a complete surprise,\" said the Dutchman, as he pegged Forest as genuine title challengers.\nForest boss Nuno Espirito Santo responded by saying that \"money doesn't play football\", but how does the spending at the two clubs compare?\nThe reality is, Forest have had a net spend of -£217m on transfers over the three seasons since they won promotion to the Premier League, although the bulk of that spending came when they first joined the top flight.\nOver the same period, Liverpool have had a net spend of -£144m, although they actually recouped £5m more than they spent since Slot was appointed in the summer.\nOf course, there's a disclaimer that this is only going back three years, with some current players having been acquired before this time.\nHow points are needed to win the league?\nNottingham Forest v Liverpool (20:00 GMT)\nNottingham Forest\nAre you dreaming, Forest fans? Could you actually win the Premier League? If you're already dreaming, imagine what a win would do later.\nBut what's needed?\nForest are on 40 points after 20 games.\nOn the 70 occasions that teams have earned 40 points or more from their first 20 games in a Premier League campaign, only four sides have failed to finish inside the top four at the end of the season.\nSince 2000, the average points needed to win the Premier League has been 89.2, with 81.6 for second, 74.5 for third, 69.5 for fourth and 65.6 for fifth.\nDespite that, Opta's predictions model still gives Forest 0% chance of winning the title and only 0.7% of finishing second, which contrasts the confidence within the squad.\nCounter-attacking? Low possession? The stats behind Forest's season\nLiverpool v Nottingham Forest (20:00 GMT)\nForest have been described as the Premier League's best counter-attackers, but the statistics say otherwise.\nTheir 33 fast breaks have culminated in 29 shots but just four goals. It is a surprisingly low number considering how dangerous Forest have been.\nTottenham have scored the most breakaway goals - 10 - while Chelsea, Liverpool and Wolves have all scored more than Forest.\nElanga has three goals in his past five games - but they were his first since last February. He has four assists, too, while Hudson-Odoi has two goals and two assists. There is little doubt there needs to be more end product from both.\nForest have a conversion rate of 31.9% for their big chances, scoring 15 of their 47. Elanga and Hudson-Odoi have created six such chances between them, the same number as Morgan Gibbs-White.\nTheir possession is also the lowest in the Premier League at 39.4% and only the bottom five of Everton, Ipswich, Leicester, Wolves and Southampton have a worse xG - their expected goals tally - than Forest's 25.9.\nNuno's side have made just 929 passes into the final third, with only Southampton [887] and Ipswich [925] managing fewer. Arsenal top that chart with 3,192.\nForest definitely in competition with us - Slot\nNottingham Forest v Liverpool (20:00 GMT)\nManchester United, Fulham, Newcastle, Arsenal and Nottingham Forest - these are the only teams to have taken points from Liverpool in the Premier League this season, but only one has beaten them.\nArne Slot referenced that loss to Forest at Anfield in his pre-match news conference and said that Nuno Espirito Santo's side deserved to be considered as title rivals.\n\"I've always said that you can judge the table best halfway through the season, and that moment is there now, so if Forest is up there with us, with Arsenal, Chelsea, Manchester City and all the others, then they definitely are a team that's in competition with us and with the other teams,\" said the Dutchman.\n\"And they deserve to be treated like this if you look at the way they play, if you look at their results. So it's going to be a very difficult challenge to get a result.\"\n'Something has to give'\nNottingham Forest v Liverpool (20:00 GMT)\nDavid James\nFormer England goalkeeper on BBC Radio 5 Live\nFormer Liverpool and England international goalkeeper David James on the history between Liverpool and Nottingham Forest: \"As a former Liverpool player I don't think I ever won at Forest so there's a bit of history there that goes back to the beginning of the Premier League.\nOn tonight's fixture: \"Nottingham Forest are not a free-flowing scoring team at home but Liverpool are a free-scoring team away, so this is going to be a very strong and confident Liverpool side against a very stubborn Nottingham Forest side. Something has to give.\"\nget involved\nGet Involved - would a Forest win make them title challengers?\n#bbcfootball, via WhatsApp on 03301231826 or text 81111 (UK only, standard message rates apply)\nKeep your messages coming.\nAre you a Forest fan going to the City Ground later? Is this the most excited you've been for a game for a while?\nAre you a Liverpool fan? Is there any concern or are you confident in getting past a difficult team who don't concede many goals? After the draw against Manchester United, how much do you need a win here?\nGet in touch in the usual ways above.\nLack of expectation can help Forest - Morgan\nNottingham Forest v Liverpool (20:00 GMT)\nNick Mashiter\nBBC Sport football news reporter\nLeicester City's title-winning captain Wes Morgan believes the Premier League big boys should underestimate Nottingham Forest at their peril.\nThe defender, who made 403 appearances for Forest before joining the Foxes in 2012, insists it could play into their hands in any title race.\nMorgan lifted the Premier League trophy after Leicester's 5,000-1 title win in 2016 and Forest will move to within three points of leaders Liverpool if they beat Arne Slot's side at The City Ground on Tuesday.\n\"That's probably where it's quite similar with Forest and Leicester. No-one expects you to sustain that push at the top. So you are not really taken seriously,\" said Morgan, now back with the Reds as a national scout for the emerging talent recruitment team.\n\"You go under the radar a little bit, which is great for the players because they've not got that pressure.\n\"You can do your work without that expectation.\"\nSutton's predictions: Nottingham Forest v Liverpool\nSutton's prediction: 1-1\nArne Slot's side are still six points ahead of Arsenal and Forest, with a game in hand, but I think they could drop more points here too.\nThe Forest defence has been formidable and 'The Wood Chopper' [Chris Wood] up front has been superb. The likes of Morgan Gibbs-White have really impressed me as well.\nBasically, this is going to be a very tight game with not many goals in it, and I am not going to back against Forest even if there are many ways where I think Liverpool might sneak a victory.\nWhat happened between Forest and Liverpool earlier this season?\nNottingham Forest v Liverpool (20:00 GMT)\nWhat a day that was for Nottingham Forest fans.\nA 1-0 win away at Liverpool in September ended Arne Slot's perfect start at Anfield.\nCallum Hudson-Odoi scored in the 72nd minute to secure the points. At the time, who would've predicted they'd be one of Liverpool's biggest challengers in mid-January?\nWill Tuesday's encounter be similar to that game earlier in the campaign? Forest had just 31% of the ball and five shots compared to Liverpool's 14.\nBut it worked. Will it work again later?\nBeat Liverpool and Champions League a 'distinct possibility'\nNottingham Forest v Liverpool (20:00 GMT)\nNottingham Forest\nMartin O'Neill - a two-time European Cup winner with Nottingham Forest during the Brian Clough era - believes tonight's match at home to Liverpool will determine whether or not his former club will be pushing for a Champions League place come the end of the season.\nHe told BBC BBC Radio Ulster: \"You have to start believing if you’re a Forest fan that European football in itself, I'm talking about maybe top six, is certainly a possibility and if they happen to win at home tonight, Champions League football, daft as it may seem or daft as it may have seemed at the start of the season, is a distinct possibility.\n\"They are sitting there after 20 games with 40 points. They’ve got more points now than they had all of last season. It's been a terrific achievement by them.\"", "url": "https://www.bbc.com/sport/football/live/cz7ewq5r4d3t"}