{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-04-26 07:41:39", "date_modify": "2025-04-26 07:41:39", "date_publish": "2025-02-26 21:24:49", "description": "Real Madrid's match against Real Sociedad was halted after chants directed at defender Raul Asencio.", "filename": "sport_football_articles_c93kqv296p6o_1745653299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30b3/live/2e615d80-f501-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c93kqv296p6o_1745653299.html", "title": "Raul Asencio: Real Madrid match halted after chants against defender", "title_page": "Raul Asencio: Real Madrid match halted after chants against defender  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Real Madrid's 1-0 win at Real Sociedad on Wednesday was briefly stopped just before half-time by the referee after home fans directed chants at Los Blancos defender Raul Asencio.\nChants of \"Asencio, die!\" were aimed at the 21-year-old and he was substituted at half-time of the Copa del Rey semi-final first-leg with manager Carlo Ancelotti later saying the player had been \"affected\" by the incident.\nMadrid captain Vinicius Jr informed referee Jose Maria Sanchez of the chants and he made managers and the police aware of the situation and activated Spain's 'anti-hate protocol'.\nA message of: \"No to racist, xenophobic or intolerant chants. Support the team and respect the opponent,\" was aired over the stadium Tannoy and the game restarted.\nThe announcement was greeted by whistles from a section of fans, who also started targeting Vinicius Jr with abuse.\n\"He did the right thing. Vini Jr spoke to the referee and he stopped the game. He applied the protocol and did a good job,\" said Ancelotti.\n\"I brought Asencio off at half-time because he was a bit wound up and had a yellow card.\n\"It's not very nice for anyone to have an entire stadium chanting 'die' at you, so that had an effect on him. I opted to bring him off because his feelings may have got to him during the game.\"\nIt is not clear what led to the chants, but it has been reported that Asencio is part of a police investigation in Spain.\n\"We condemn the insults,\" Real Sociedad captain Mikel Oyarzabal said.\n\"We don't like it. I think there are other ways of condemning what happened, or acts that may have been committed, but this isn't the right way to do it.\"\nAsencio, a product of the Real academy, made his debut for the European champions in November and has played 26 senior games this season.\nOn the pitch, Endrick scored the only goal of the game to give Madrid a 1-0 aggregate lead going into the second leg of the Copa del Rey semi-finals.\nThe teenager latched on to a brilliant ball over the top from Jude Bellingham in the and slotted home to open the scoring.\nReal Madrid have won the Copa del Rey 20 times and are strong favourites to reach the 2025 final, with the second leg taking place on 1 April at the Bernabeu stadium.", "url": "https://www.bbc.co.uk/sport/football/articles/c93kqv296p6o"}