{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 04:48:05", "date_modify": "2025-05-21 04:48:05", "date_publish": "2025-02-01 04:21:58", "description": "Ex-England coach Mark Robinson says the England and Wales Cricket Board (ECB) made mistakes in their management of young fast bowler Issy Wong.", "filename": "sport_cricket_articles_cwyegy640r3o_1747802885.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3920/live/7e61bf50-e052-11ef-b129-dfc3f5f0afac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cwyegy640r3o_1747802885.html", "title": "Issy Wong: England mishandled fast bowler, says Mark Robinson", "title_page": "Issy Wong: England mishandled fast bowler, says Mark Robinson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World Cup-winning coach Mark Robinson believes England need to learn from the poor management of young fast bowler Issy Wong.\nWong made her debut in all three formats as a 20-year-old in 2022 and with her pace and aggression, was seen as one of England's most exciting prospects.\nShe has since fallen out of favour after a slump in form since 2023 and Robinson says all of the hype and marketing of her did not help at such a young age.\n\"We thrust her forward without the foundations to cope,\" Robinson, who won the World Cup with England in 2017, told TNT Sports.\n\"She was the pin-up girl of the ECB as a youngster, as a baby, and then when things got a bit difficult she didn't have the tools to survive.\"\nWong has been given a development contract from the ECB for 2024-25 and most recently played in the white-ball series against Ireland last September, when most of the first XI were preparing for the T20 World Cup.\nDuring the Ashes series of 2023, Wong featured prominently in England's advertising campaigns but eventually did not play a single game as she struggled for consistency.\nA difficult Hundred competition with Birmingham Phoenix followed where she was dropped from their side because of issues with her run-up.\nShe then surprisingly made her one England appearance of that year against Sri Lanka, and conceded 24 runs from two overs with three front foot no-balls.\nWong will play for Warwickshire in 2025 as part of the new professional domestic set-up, where Robinson coaches the men's side.\n\"Issy is doing really well and working hard - she's still young at 22 and she's quick, so her time will come again,\" Robinson added.\n\"That's something to learn - how to handle players when we expose them and when to take them out, when to protect them.\n\"It's not just from the game, but to protect them from the media as well who sometimes want a piece of them.\"", "url": "https://www.bbc.com/sport/cricket/articles/cwyegy640r3o"}