{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:47", "date_modify": "2025-05-21 04:05:47", "date_publish": "2025-02-01 13:46:56", "description": "Clovers make it four wins from five in the Celtic Challenge as they comprehensively defeat Brython Thunder 58-0 at Kingspan Stadium.", "filename": "sport_rugby-union_articles_cvglpn62836o_1747800347.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b746/live/56fc4cb0-e09c-11ef-a544-6d6714619779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvglpn62836o_1747800347.html", "title": "Celtic Challenge: Clovers secure convincing 10-try win over Brython Thunder", "title_page": "Celtic Challenge: Clovers secure convincing 10-try win over Brython Thunder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Clovers scored 10 tries as they comprehensively defeated Brython Thunder 58-0 at Kingspan Stadium to make it four wins from five in their Celtic Challenge campaign.\nThe Irish side crossed six times in the first half, including a hat-trick of scores from second row Jane Clohessy, who was named player of the match.\nClohessy barged over for the opening touchdown in the third minute to set the tone for the game, with Anna McGann running in to extend the lead three minutes later after a weaving run by wing Chisom Ugwueru.\nClohessy burst through the Welsh team's defence midway through the half to add her second try, then prop Sophie Barrett rumbled over for the bonus-point score.\nThunder enjoyed spells of possession and were competitive at the ruck but found themselves further behind when Clohessy completed her hat-trick after McGann set her up by breaching their opponents' defence.\nClovers captain Amee Leigh Costigan got her name on the scoresheet when she completed a flowing move by going over in the corner as her side led 34-0 at the break.\nThe one-sided nature of the contest continued in the second half as Ugwueru darted over two minutes after the resumption, then Barrett, McGann and Costigan all scored their second tries of the game.\nNicole Fowley converted four of her side's tries.\nA fourth straight win then for Denis Fogarty's side while it is six losses in a row for Brython Thunder.", "url": "https://www.bbc.com/sport/rugby-union/articles/cvglpn62836o"}