{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:34", "date_modify": "2025-05-21 04:40:34", "date_publish": "2025-04-03 09:26:28", "description": "Gaelic football's new clock and hooter system will only feature in championship games this year that are being televised or live streamed.", "filename": "sport_articles_cr78n9xyz83o_1747802434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1799/live/19b8f560-1008-11f0-a851-e1dd6a174ba8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr78n9xyz83o_1747802434.html", "title": "GAA rules: Football Review Committee's clock and hooter system only to be used in games broadcast live", "title_page": "GAA rules: Football Review Committee's clock and hooter system only to be used in games broadcast live - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gaelic football's new clock and hooter system will only feature in championship games this year that are being televised or live streamed.\nThe timekeeping change, which sees the clock stopped during breaks in play and a hooter used to signal the last play of the game, was one of the sweeping alterations made to the rulebook by the Football Review Committee (FRC) in time for this year's Allianz League campaigns, but was only used in Divisions One and Two.\nWith provincial championships beginning this weekend, the GAA's Games Administration department has found that not all county grounds will be able to implement the system.\nJim Gavin, the FRC chairperson, feels the clock and hooter has brought \"clarity and transparency\" around timekeeping and said it is \"unfortunate\" that there will only be partial implementation for this year's All-Ireland and Tailteann Cup competitions.\n\"Obviously, from an FRC perspective, we'd like to see it everywhere but the harsh reality of it is some grounds aren't ready according to the Games Admin, so they've taken a pragmatic view,\" he said during a media briefing on Wednesday.\nAfter a published review, the FRC expressed broad satisfaction with the rule changes which were designed to speed up the game and make it a better spectacle.\nAmong the other areas addressed were the new scoring system, the dissent rule, and an independent report on the physical demands on players.\nIt was said that the introduction of a two-point 40-metre arc to encourage long-range shooting had yielded positive results and there had been an increase in the number of goals per game in the Allianz League from 1.9 in 2024 to 2.3 in 2025.\nGavin alluded to lower levels of dissent towards referees in the light of new rules which include permitting only team captains or designated players to present questions and frees being advanced 50 metres in the event of talking back to referees after decisions.\nThe former Dublin manager pointed to an average of six dissent fouls per round across the four divisions and a reduction of 50% in black and yellow cards on the previous year.\nHis observations were endorsed by former inter-county referee and fellow member of the FRC, Maurice Deegan.\nDeegan explained that the feedback the group has received indicated the change had made \"a massive difference to refereeing matches\" and could have a positive effect on attracting new referees to the game.\n\"I can see recruitment of referees becoming a lot easier in football down the line,\" he said.", "url": "https://www.bbc.com/sport/articles/cr78n9xyz83o"}