{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-04-26 07:04:21", "date_modify": "2025-04-26 07:04:21", "date_publish": "2025-02-28 07:15:59", "description": "Eight months after the goalkeeper's sudden death at the age of 26, Matija Sarkic's memory lives on at Millwall.", "filename": "sport_football_articles_cn93w8xjlvro_1745651061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9229/live/475282c0-efba-11ef-8e5c-0d2ce78dcb00.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn93w8xjlvro_1745651061.html", "title": "Matija Sarkic: Goalkeeper's memory lives on at Millwall after death", "title_page": "Matija Sarkic: Goalkeeper's memory lives on at Millwall after death - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's the final day of the 2023-24 season in English football's second tier and Millwall are looking to end their campaign on a high at Swansea City.\nA typical end-of-season affair between two mid-table teams is drifting towards a goalless conclusion when the Welsh side win a penalty after Jake Cooper's foul on Brazilian winger Ronald.\nUp steps the usually reliable Matt Grimes but Matija Sarkic, Millwall's 6ft 4in Montenegro goalkeeper, flings himself to his right to make a fine save to cap a solid debut season with the Lions after joining from Wolves for £1.2m.\nMinutes later Casper de Norre pounces at the other end to earn a 1-0 victory and send Millwall fans into the summer in buoyant mood after a fifth straight win.\n\"Considering we had a turbulent earlier part of the season and three managers and one caretaker, it was a brilliant end to the campaign,\" says Lions season ticket holder Phil Clarke.\nSix weeks later that feeling of optimism was shattered when awful news reached The Den that Sarkic, a well-mannered and highly respected team-mate, had died suddenly at the age of 26 while holidaying in Montenegro.\n\"It was devastating,\" Andy Marshall, Millwall's goalkeeping coach, tells BBC Sport.\nMarshall had forged a close relationship with Sarkic, stretching across nine years and three different clubs.\n\"He was like a son to me. It ripped the club apart.\"\nMillwall, who face London rivals Crystal Palace in the fifth round of the FA Cup on Saturday (12:15 GMT, live on BBC One), are still coming to terms with the loss of the popular keeper who everyone called 'Mati'.\n\"I remember seeing the news come through on social media,\" says Clarke. \"My son and I were in total shock.\"\nMarshall was at home with his partner Jasmine when his mobile phone started ringing early in the morning on 15 June 2024.\n\"It was 06:57. As I went to pick it up it rang off. It was Mati's father Bojan. I texted him 'is everything ok?' and he immediately rang back.\"\nTen days earlier Marshall had been at the King Baudouin Stadium in Brussels to see Sarkic produce a man-of-the-match performance in Montenegro's friendly against a Belgium, external side that included Kevin de Bruyne and Leandro Trossard.\nBelgium won 2-0 but Millwall's goalkeeper, who dreamed of playing in the Premier League, earned rave reviews for his display - with one report noting that it felt like Sarkic had \"come of age\".\n\"We spoke the day after the game,\" adds Marshall.\n\"We were making plans for the following season, how we were trying to push Millwall towards the Premier League and Mati towards the Premier League because that was the long-term goal.\n\"I told him to go and enjoy the summer and that we'd chat when we met up again at Millwall for pre-season training.\"\nIt was their last conversation together.\nSarkic was given permission to miss Montenegro's next game, a friendly against Georgia, to be best man at the wedding of his twin brother Oliver - the former Blackpool and Burton midfielder - in Guimaraes, northern Portugal, on 8 June.\nA week later Sarkic died in the coastal town of Budva on the Adriatic coast.\nHe had been on holiday with his partner Phoebe as well as former Aston Villa defender Oscar Borg and Borg's girlfriend.\nHis family were told he suffered sudden heart failure.\n\"After the phone call with Bojan I was traumatised,\" says Marshall. \"I broke down crying.\"\nSarkic was born in Grimsby in 1997 and spent his early childhood in London before moving to Brussels, where his father was Montenegro's ambassador.\nHe joined Anderlecht's academy at the age of eight and spent 10 years with them before returning to England in 2015 to sign for Aston Villa, where he first encountered Marshall.\n\"My first impression of Mati? A smart young man who was very clever, very well educated and who was eager to learn,\" says Marshall, who was Millwall's 2004 FA Cup final goalkeeper.\n\"Immediately we had a good rapport and a very good understanding of one another. I could see the potential in him.\"\nLoan spells at non-league Stratford Town and Havant & Waterlooville played a part in Sarkic's football education, as did a short stint at Wigan.\nBy now a pattern was beginning to emerge despite his career being at the fledgling stage. Sarkic was well liked wherever he went.\n\"He was just so popular with everybody,\" adds Marshall.\nHe made the permanent switch to neighbours Wolves in 2020, external without making a senior appearance for Villa.\nSarkic was fluent in English, French, Dutch and Montenegrin. When Bruno Lage and Julen Lopetegui were at Wolves, he would translate to the French-speaking players in the team.\nThere have been other acts of kindness from opposition fans.\nWhen Millwall visited Hull City on 24 August, Tigers fan Leo Jamieson presented the team with a painting of Sarkic which now hangs on a wall at the club's Calmont Road training ground.\nMeanwhile, Millwall Supporters' Club funded a mural, external in the Cold Blow Lane concourse at The Den in tribute to their former goalkeeper.\nA tree has also been planted in his memory outside the players' entrance at the ground, while fans will be able to vote for their 2024-25 save of the season, with the winner presented with the Matija Sarkic award.", "url": "https://www.bbc.co.uk/sport/football/articles/cn93w8xjlvro"}