{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:06", "date_modify": "2025-05-21 07:19:06", "date_publish": "2025-05-20 08:42:06", "description": "Leon Balogun: Defender confirms Rangers exit", "filename": "sport_articles_cwynn9egnepo_1747811946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/869d/live/da8d21e0-3555-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwynn9egnepo_1747811946.html", "title": "Leon Balogun: Defender confirms Rangers exit", "title_page": "Leon Balogun: Defender confirms Rangers exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leon Balogun has confirmed his Rangers exit, saying it has been a \"great, great privilege\" to play for \"this massive club\".\nHaving departed in summer 2022 after helping Rangers win the title in his initial two-year spell, the Nigeria defender returned 12 months later and has made 49 appearances in his second stint.\nBalogun is now out of contract and while Rangers are yet to confirm his departure, the 36-year-old has said his farewells in a social media post., external\n\"It's been nothing short of an honour, a pleasure and a great, great privilege to represent this massive club - twice,\" he said.\n\"So many memories, good ones as well as a few tough ones. But it's the latter especially that made my love for the club grow even stronger.\"\nBalogun regrets that he was not given the chance of a goodbye in front of the Rangers support.\n\"Unfortunately I wasn't afforded that opportunity, which saddens me as I would have liked to to have walked round Ibrox one last time and returned all the love and support you've given me during my two stints,\" he added.\n\"I don't know when I'll be back, but I promise I won't be a stranger. You've become more than just my club, you've become family. And for that I will be forever grateful.\"", "url": "https://www.bbc.com/sport/articles/cwynn9egnepo"}