{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:03:49", "date_modify": "2025-04-26 07:03:49", "date_publish": "2025-02-28 07:43:19", "description": "Jake Knapp becomes the 15th player to record a sub-60 round in PGA Tour history with a 12-under 59 in the opening round of the Cognizant Classic.", "filename": "sport_golf_articles_cq5zz6761d1o_1745651029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8504/live/e0dbc880-f59f-11ef-8fb0-67b44ba4a77d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cq5zz6761d1o_1745651029.html", "title": "Cognizant Classic: Jake Knapp shoots 59 to lead in Florida", "title_page": "Cognizant Classic: Jake Knapp shoots 59 to lead in Florida - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jake Knapp became the 15th player to record a sub-60 round in PGA Tour history when he shot a 12-under-par 59 in the Cognizant Classic in Florida.\nThe world number 99 began his opening round with five straight birdies and added a further seven in his remaining 13 holes at PGA National in Palm Beach Gardens.\nThe 30-year-old had the opportunity to tie the lowest round in PGA Tour history but his eagle putt from 19 feet on the 18th rolled wide.\n\"I knew I had it going really early, but that can happen and then it can fizzle out pretty quickly,\" the American said.\n\"I thought I did a good job of just trying to focus on shot by shot and not letting what happened or what could happen affect anything.\n\"Once I made the long putt on 15, it was like, 'OK, now this is kind of here'. But at the same time, I didn't let it affect the gameplan or anything like that.\"\nKnapp's sub-60 round is the fifth in PGA Tour history to have been made in the first round of an event and two of the previous four players to achieve that feat went on to win the tournament.\nHe got to 45th in the world during his rookie campaign in 2024, when he won his maiden PGA Tour title at the Mexico Open and finished in a tie for fourth at the Cognizant Classic.\nDaniel Berger, Russell Henley and Sami Valimaki are four strokes behind Knapp in a three-way tie for second.\nRickie Fowler is among a group of six on seven under with Jordan Spieth one shot further back in a five-way tie for 11th.", "url": "https://www.bbc.co.uk/sport/golf/articles/cq5zz6761d1o"}