{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 05:48:19", "date_modify": "2025-05-21 05:48:19", "date_publish": "2025-04-02 11:39:55", "description": "'Hibs go to Ibrox with belief after scaling top-six mountain'", "filename": "sport_articles_c045l70619yo_1747806499.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f35/live/10b3f5b0-0fb2-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c045l70619yo_1747806499.html", "title": "'Hibs go to Ibrox with belief after scaling top-six mountain'", "title_page": "'Hibs go to Ibrox with belief after scaling top-six mountain' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The victory against St Johnstone was as comfortable a three points as Hibs have earned this season.\nIt's also another indication of just how progressive the club have been over the past few months, with confidence oozing from the players and no fear or doubts in how they play.\nThe win secured the top-six place that in the early part of the campaign looked unachievable given the wretched start. The players gave themselves a mountain to climb and should be proud of what they have achieved since mid-November.\nThe prize now is finishing off the campaign in similar style and securing a lucrative European spot.\nWith stability in the management and behind the scenes, everyone is pulling in the same direction.\nNext up is a trip to Ibrox where it's difficult to know exactly what Rangers will turn up. Under Barry Ferguson the Ibrox side have shown a fragility in defence that Hibs will look to exploit.\nBut in other games, especially in Europe, Rangers have produced some incredible performances that few would have thought possible with their squad.\nHowever, a key aspect is that Hibs now enter these games with a confidence and belief they can triumph. Since the end of November, only Celtic have beaten David Gray's side. That's just two defeats in 21 outings. And in the league, they are unbeaten in 15.\nSo can Hibs maintain their impressive momentum with a first victory at Ibrox in seven years?", "url": "https://www.bbc.com/sport/articles/c045l70619yo"}