{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 06:13:05", "date_modify": "2025-05-21 06:13:05", "date_publish": "2025-04-01 12:07:22", "description": "Pep Guardiola press conference: Man City vs Leicester preview", "filename": "sport_football_articles_cvg8dpq78zeo_1747807985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deec/live/405a9a50-4922-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg8dpq78zeo_1747807985.html", "title": "Pep Guardiola press conference: Man City vs Leicester preview", "title_page": "Pep Guardiola press conference: Man City vs Leicester preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "He has been told Erling Haaland will miss \"five to seven weeks\" by the club's medical staff.\nOn another injury blow: \"Sometimes there are years when these kinds of things happen. It has happened all season.\"\nHe said they \"have to adapt and find a solution\" to not having the number nine, but added: \"We don't have another player with his skills or specific qualities. His numbers have been exceptional and he is our incredible threat for many things.\"\nOn the planned fan protest over ticketing: \"Of course, I have sympathy. The club has its ways and arguments. They [the fans] can express what they truly want and I prefer that to them being passive.\"\nAsked what his message to the fans is, Guardiola said: \"All I can say is that we need them from minute one. I know how tough Leicester is [going to be]. We desperately need them to achieve our success to be in the Champions League again.\"\nHe said City have to win their home games if they are to qualify for Europe's top competition, but it is still not the toughest challenge he has faced in his nine years at the club as winning titles is harder.\nOn whether he has seen enough from his players to think they can go on one of their infamous unbeaten runs: \"I would like to say yes, but I don't know. In previous seasons we have done it, but this season we have not been consistent.\"", "url": "https://www.bbc.com/sport/football/articles/cvg8dpq78zeo"}