{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:58:32", "date_modify": "2025-05-20 14:58:32", "date_publish": "2023-07-27 05:16:35", "description": "Jude Bellingham scores in a man-of-the-match performance as Real Madrid beat Manchester United in a pre-season friendly in Houston.", "filename": "sport_football_66321914_1747753112.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/134F4/production/_130529097_gettyimages-.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66321914_1747753112.html", "title": "Real Madrid 2-0 Manchester United: Jude Bellingham scores in man-of-the-match performance", "title_page": "Real Madrid 2-0 Manchester United: Jude Bellingham scores in man-of-the-match performance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Real Madrid midfielder Jude Bellingham scored his first goal and was named man of the match in a 2-0 win over Manchester United in a pre-season friendly in Houston, Texas.\nThe 20-year-old England midfielder, playing just his second game since an £88m move to the Spanish champions, produced a delicate lob in the sixth minute to beat United's debutant keeper Andre Onana.\nAn acrobatic Joselu finish sealed the win two minutes from time in front of a 67,801 crowd at the NRG Stadium.\n\"There is a lot to aim for,\" Bellingham said after the match. \"It is the biggest club with the best players. The expectations are high, as they should be.\"\nOn the evidence of his debut performance against AC Milan on Sunday and now United, Bellingham has settled in already.\nA price tag that could eventually reach £115m is not weighing him down. He has excelled in his new position at the tip of an attacking diamond and his brilliant goal showed he has the class to excel at the Bernabeu Stadium.\nHis goal came from a well-timed run to instantly control Antonio Rudiger's long pass and then chip the advancing Onana from the edge of the penalty area.\n\"I look like I am enjoying it, I like to think,\" he said.\n\"I was confident coming here because I knew how good the players were. I know the qualities I can bring and I feel like I have slotted in.\n\"I am enjoying playing with this team, learning from so many great players. I am definitely not getting carried away just yet. There are big challenges to come and I just want to keep up the rhythm going into the season.\"\nBellingham dismissed a first-half altercation with United defender Lisandro Martinez as the pair clashed following a nasty tackle from the Argentine.\nBellingham pushed his opponent, who responded before Mason Mount stepped in to calm the situation.\n\"It was one of those things,\" he said. \"I came in at half-time and I was unhappy. But when he came over to wish me all the best when he came off, I really respected it.\n\"It was two players trying to win for their team and sometimes it spills over. That is part of the game. He is a great competitor and a great player.\"\nBack in 2020, Bellingham was given a tour of United's training ground as part of a sustained pitch to sign him from Birmingham City.\nIt was realistic to think the then teenager might go to Old Trafford. Instead he went to Borussia Dortmund.\nNow, Real Madrid feels a more natural setting for one of the world's best young players.\nWith Carlo Ancelotti deploying him in the number 10 role, Bellingham is set to have a major influence on their push for glory.\nAside from his goal - which was borderline offside in a game without VAR - Bellingham took up some intelligent positions and played some neat passes.\nOn the evidence of one 90-minute appearance, it is hard to form too many judgements on £47m goalkeeper Onana.\nHowever, it is obvious the 27-year-old's distribution far exceeds that of his predecessor David de Gea.\nHe is capable of playing short passes fluidly to his full-backs with both feet and is very confident moving out of his penalty area. When United's defence was struggling to cope in the early stages, Onana was clearly demanding more from the men in front of him.\nHe also made a solid feet-first save from Joselu, which should provide some comfort to those with questions about his shot-stopping, although he did seem a bit static when the Real Madrid man put the second goal into United's bottom corner with an overhead kick near the end of the match.", "url": "https://www.bbc.com/sport/football/66321914"}