{"authors": ["Andy Cryer", "www.facebook.com"], "date_download": "2025-05-21 07:54:54", "date_modify": "2025-05-21 07:54:54", "date_publish": "2024-12-23 18:03:33", "description": "Mohamed Salah broke three more records in Liverpool's demolition of Tottenham - but how good are his figures compared to the great Premier League forwards?", "filename": "sport_football_articles_c62z31yxyzro_1747814094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2571/live/78f564f0-c12a-11ef-9f09-23b1103db065.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62z31yxyzro_1747814094.html", "title": "Mohamed Salah: Goals, assists, records", "title_page": "Mohamed Salah: Goals, assists, records - where does he rank among Premier League greats? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another week, another Mohamed Salah show.\nThe Liverpool forward scored another two goals in Sunday's 6-3 demolition of Tottenham in the Premier League to overtake Manchester City's Erling Haaland in the race for the Golden Boot.\nOn top of his 15 goals this campaign, Salah also tops the charts for assists, with two on Sunday for the league leaders taking him to 11.\nThe Egypt star is now on course to repeat his 2022 feat of winning both the Golden Boot and Playmaker awards.\nWhile Salah's Anfield future remains a big subject for debate - his contract expires this summer - he continues to break records.\nBut where does the 32-year-old rank when it comes to all-time Premier League great forwards?\nFormer Newcastle, Man City and Aston Villa goalkeeper Shay Given told BBC Match of the Day: \"He's unbelievable. He's a special, talented player.\n\"The big news around him is if he is going to stay or go. I don't think they can afford to let him go.\"\nIt has been an incredible start to the season for Salah, who has scored 12 goals in the past 12 matches.\nWith 33 goal involvements in all competitions this season (18 goals, 15 assists), he has at least four more than any other player from Europe's top five leagues.\nHis heroics at Tottenham gave him three Premier League records.\nHe became the first player to reach double figures for goals and assists before Christmas\nHe is the first player to reach double figures for goals and assists in four consecutive seasons\nThis is a record sixth season Salah has achieved the feat, overtaking Wayne Rooney's five\nSalah will now be fancied to equal at least one more record this season, with his eyes on finishing Premier League top scorer for a fourth time - something only Arsenal's Thierry Henry has done.\nSalah has scored 18 league goals in each of his seven seasons at Liverpool.\nFive more goals this season and he will become only the fifth player to have five 20-goal Premier League seasons.\nSalah's prolific form is in complete contrast to last season's Golden Boot winner, Haaland.\nThe Norwegian scored 27 goals last season and 36 the campaign before to become the first player since Tottenham's Harry Kane to win the award outright in back-to-back seasons.\nHaaland looked on course to do it again this campaign when he scored 10 goals in his first five games, but a run of three in his past 12 has allowed Salah to jump above him.\nWhere do all these numbers leave Salah when we talk about some of the Premier League's great forwards?\nSalah can already be thought of as a Liverpool legend, having won every major trophy with the club.\nHe is fourth on their list of all-time scorers with 229 goals in 373 appearances, only 12 behind third-placed Gordon Hodgson.\nRoger Hunt (285) and Ian Rush (346) are some way aheah and, at his current goals-per-game average, Salah would need another 190 appearances to break that record. Unlikely.\nIn terms of Premier League greats, Salah is already right up there with 172 goals, the eighth top scorer.\nIn fact, his 229 goals in all competitions for Liverpool have come four games quicker than Thierry Henry's 228 for Arsenal.\nSalah is only 15 goals behind fourth top scorer Andrew Cole - not an impossible target by the end of this campaign.\nWhat about assists? Salah pulled level with David Beckham's 80 in 10th place on Sunday. He is only 34 assists behind second-placed Kevin de Bruyne.\nThe Premier League's leading assist-maker, Ryan Giggs, is way ahead on 162 but played 353 more games than Salah currently has.\nWhen you put the goals and assists together, Salah ranks even higher.\nHis 252 goal involvements in 279 Premier League appearances is seventh in the all-time list and his rate of a goal involvement every 1.1 games is better than every player ahead of him.\nAt his current rate, Salah would catch Alan Shearer's record of 324 goal involvements in 65 more appearances.\nSign a new contract and it's not impossible, surely?", "url": "https://www.bbc.com/sport/football/articles/c62z31yxyzro"}