{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:29:11", "date_modify": "2025-04-26 04:29:11", "date_publish": "2025-03-02 00:00:00", "description": "New Zealand face India in the Champions in Dubai - follow live cricket scores, text updates, in-play video clips and radio commentary", "filename": "sport_cricket_live_c77r58n2z7kt_1745641751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4fa/live/d2815d70-f781-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_live_c77r58n2z7kt_1745641751.html", "title": "Relive all the action as India beat New Zealand to top Group A at Champions Trophy", "title_page": "Relive all the action as India beat New Zealand to top Group A at Champions Trophy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye\nMonday is a rare cricket-free day, but fear not, we will be back on Tuesday ahead of that mouthwatering India v Australia clash, which will start at 09:00 GMT with all the usual coverage right here.\nIn the mean time, check out Ffion Wynne's match report as India beat New Zealand, but thanks for joining us today!\n'Spinners squeezed us'\nIndia win by 44 runs\nNew Zealand captain Mitchell Santner: \"It was a slower wicket than what we have come up against but we knew that coming in, India controlled that middle phase with the bat nicely, Shreyas played a great knock, and a great knock by Hardik then they squeezed us with the spinners.\n\"If you had said we'd have to get 250, we'd have been happy. It spun more than we thought, more than the other games here, but when they squeezed the power play and then squeezed on from there, it is a bit of a challenge. Four quality spinners makes it pretty tough.\n\"Getting wickets in the power play for us was key, going forward to the game in Lahore it could be flatter so wickets at the start and throughout the middle will be massive, and Kane in form is always nice.\"\nOn the challenge of South Africa: \"They are a quality side. With those wickets having pace and bounce, they haver gone in with four seamers. we will wait and see if it is used or a fresh one but we know they are a good outfit, especially in these events.\"\n'We were perfect'\nIndia win by 44 runs\nIndia captain Rohit Sharma: \"It was very important for us to finish on a high against a very good team. New Zealand are a very good side but we played perfect cricket today.\n\"We lost three early wickets and needed a partnership or two and the total we got was good enough, we thought. We knew we could defend that total, we had confidence.\n\"Varun has something different, no doubt about it, we wanted too see what he can offer. We have to think about what we want to do in the next game but it's a good headache to have. When he gets it right it's very difficult to read him.\n\"In such a short tournament you have to try and win every game that's in front of you. Australia have a rich history but it's about us.\"\nIndia win by 44 runs - reaction\nMan of the match, India bowler Varun Chakravarthy: \"They were telling me to calm down throughout, I found out I was playing last night. I was expecting to play for my country and looking forward to it but I was a little nervous.\n\"It was not a real turner of a pitch but if you bowled in the right areas there was help. It was a total team effort.\"\nPost\nKatey Martin\nFormer New Zealand wicketkeeper on BBC Radio 5 Sports Extra\nNew Zealand looked clueless in the spin.\nI think it's the first time five of the top six have been caught out lbw.\nIt was a challenging innings for Kane Williamson.\nIt felt like they never got out of gear. New Zealand have to get as much out of the game as they can if they do come back here.", "url": "https://www.bbc.co.uk/sport/cricket/live/c77r58n2z7kt"}