{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:17", "date_modify": "2025-05-21 03:41:17", "date_publish": "2025-02-09 18:18:38", "description": "Rangers manager Philippe Clement: \"We had more efforts on target today than we have had all season, but we didn't manage to score - not even with a penalty. We lacked quality in the last decision-making and last action.", "filename": "sport_articles_cj02gl7l90qo_1747798877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65b7/live/08090090-e712-11ef-adec-35cc81d74164.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj02gl7l90qo_1747798877.html", "title": "Rangers 0-1 Queen's Park: What did the manager say?", "title_page": "Rangers 0-1 Queen's Park: What did the manager say? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers manager Philippe Clement: \"We had more efforts on target today than we have had all season, but we didn't manage to score - not even with a penalty. We lacked quality in the last decision-making and last action.\n\"Maybe the team wanted to react too much. I was not happy at half time, but they need to keep composure in these moments.\"\n\"It's a big frustration for all of us. The biggest difference is the efficiency between the Europa League and today. We have to do much better in the final third.\n\"In domestic games, there's been consistency in the last two months. This was a setback today.\n\"It was one moment. I won't take conclusions about the whole season from one moment. We wanted it too much, because of that there was no composure.\n\"Results like this, I'm frustrated about it. The only way for this club to get consistency for the future, to build something, is to keep consistency.\n\"The fans are right to be angry now. I'm angry also. It's unacceptable and the players know that.\"", "url": "https://www.bbc.com/sport/articles/cj02gl7l90qo"}