{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:54", "date_modify": "2025-05-21 04:40:54", "date_publish": "2025-04-03 09:03:08", "description": "Manchester City 2-0 Leicester: Fan views", "filename": "sport_football_articles_cq5z1dn2dxzo_1747802454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5z1dn2dxzo_1747802454.html", "title": "0 Leicester: Fan views", "title_page": "Manchester City 2-0 Leicester:  Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Manchester City's win over Leicester City in the Premier League.\nHere are some of your comments:\nMan City fans\nGene: This wasn't much of a match against a team destined for relegation that sat back and seemed to just want the final whistle. Josko Gvardiol looks comfortable on the inside with Ruben Dias and I would've liked to have seen Oscar Bobb earlier. A win is a win, but there should've been more goals against a much weaker opponent.\nBrian: Man City got the job done. Yes Leicester are a poor side at present and their mistakes in possession gave City the opportunities to score but City were sharper than in previous games.\nJohn: Good in the first half, but second half lacked the same intensity.\nLeicester fans\nMichael: We line up like a bunch of coconuts and sit there waiting to be knocked down. No passion, no endeavour, no shots, no ideas and no hope. I love my team but sadly my team does not love the badge it wears. I truly cannot remember a Leicester team in the past 40 years that week after week comes up with spineless clueless performances.\nKerry: Utter dross. No points, no goals, same formation and starting XI. Sorry Ruud, but you've lost the plot completely and you're totally out of your depth. We need a goal so at half time you take a striker off and sub him with a holding midfielder. Patson Daka up front on his own? He's National League quality!", "url": "https://www.bbc.com/sport/football/articles/cq5z1dn2dxzo"}