{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 07:28:49", "date_modify": "2025-05-21 07:28:49", "date_publish": "2025-05-20 17:30:00", "description": "Ange Postecoglou press conference: Tottenham vs Man Utd preview", "filename": "sport_football_articles_c8jggez2wnyo_1747812529.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8jggez2wnyo_1747812529.html", "title": "Ange Postecoglou press conference: Tottenham vs Man Utd preview", "title_page": "Ange Postecoglou press conference: Tottenham vs Man Utd preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Postecoglou confirmed the squad is \"pretty much the same as last week\" as Lucas Bergvall will not be available.\nThe Spurs boss said it is a \"big game\" on Wednesday and his 100th game in charge provides the opportunity to \"fulfil at least the main task I was given [when I arrived] which was to bring trophies to the club\".\nOn whether winning the trophy or Champions League qualification was more important, he added: \"It is a great prize. You know the significance of Champions League qualification and what comes with it. You get to play against the best on the continent. But the club has been in the Champions League before, they have not won a trophy for a long time - so that is the most important thing.\"\nPostecoglou said \"irrespective of tomorrow, I'm not a clown and never will be\" in response to a question from a journalist who had recently written an article about the Spurs boss: \"You really disappointed me that you used such terminology to describe a person that for 26 years, without any favours from anyone, has worked his way to a position where he is leading out a club in a European final.\"\nOn talk around this being his penultimate game in charge: \"It doesn't matter really. The reality of it is, the opportunity is the same. For me and more importantly for the club. Whatever happens beyond tomorrow is irrelevant when you think about the opportunity that exists right now and that is to provide something special for this football club, its supporters and everyone that has worked so hard for a trophy.\"\nHe added: \"If I was worried about my tenure at this football club, it's fair to say we wouldn't be in this position because I would have been distracted long ago. I'm pretty good at ensuring my focus is on giving this football club its best opportunity that it has had for a while to do something special. Whatever happens after that, I'm very comfortable that I will continue trying to win trophies wherever I am.\"\nIt is a \"a big motivation and driver\" for himself and the team to win the trophy for captain Son Heung-Min: \"He is so important to the group. He is so important as a leader and he is such an important figure at this football club. It would be great to cap that [career] off with a trophy for him.\"\nPostecoglou told reporters \"don't stress\" about what happens to him as his \"future is assured\". He added: \"I have a beautiful family, got a great life, I will keep on winning trophies until I finish - wherever that is.\"", "url": "https://www.bbc.com/sport/football/articles/c8jggez2wnyo"}