{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 07:23:29", "date_modify": "2025-05-21 07:23:29", "date_publish": "2025-05-20 06:36:06", "description": "After the most turbulent period of her career, Iga Swiatek is facing questions about her clay-court game before her French Open title defence.", "filename": "sport_tennis_articles_cx262jd2x83o_1747812209.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a460/live/5361c690-318a-11f0-9caa-a3bee7fb3d52.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cx262jd2x83o_1747812209.html", "title": "French Open 2025: Can Iga Swiatek still reign as 'Queen of Clay' at Roland Garros?", "title_page": "French Open 2025: Can Iga Swiatek still reign as 'Queen of Clay' at Roland Garros? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iga Swiatek's recent dominance at the French Open - and the tournaments leading up to it - has led to a regal nickname: the Queen of Clay.\nThe 23-year-old Pole has won four of the past five Roland Garros women's singles titles and arrives in Paris as the three-time defending champion.\nBut this year there are considerable doubts about if she can continue her reign.\nFor the first time since 2020 - when she claimed her maiden title as an unheralded teenager - Swiatek arrives without winning a WTA tournament in the first five months of the season.\nAs a result, the former long-time world number one has dropped to fifth in the rankings.\nIt begs the obvious question: can she still be considered the favourite to lift the Coupe Suzanne Lenglen?\nMost players on the WTA Tour would be envious of Swiatek's record this season.\nShe has won 27 of her 36 matches so far, reaching four semi-finals and contesting another three quarter-finals in eight tournaments.\nBut Swiatek has rarely reached her dominant best over the past few months.\nShe has often looked tense, tightly wound with emotion, and it has poured out after tough defeats.\nSwiatek was inconsolable after losing in the Olympics semi-finals at Roland Garros last summer, saying she cried for \"six hours\" afterwards.\nTwo weeks later came a bombshell - Swiatek had failed a doping test.\nIt was announced in November she had tested positive for heart medication trimetazidine (TMZ) in an out-of-competition sample and was subsequently given a one-month ban after the International Tennis Integrity Agency (ITIA) accepted the result was caused by contamination.\n\"Truth to be told, over the last months, there has always been something,\" Swiatek told BBC Sport in Madrid earlier in May.\n\"My life went upside down in November. It wasn't easy and wasn't easy to accept afterwards.\n\"It took me a long time to do that, but now I feel like I have space just to work and hopefully I'm going to use that.\n\"I'm looking for a peaceful time and just waiting for it to happen.\"\nSwiatek was alluding to a series of issues that have cropped up this year.\nIn March, Swiatek was criticised for reacting angrily towards a ball boy at Indian Wells, then given extra security after being verbally abused by an \"aggressive and taunting\" fan in Miami.\nShe made a short trip back to Warsaw last month for the funeral of her grandfather before her Madrid Open title defence began.\nDuring a heavy semi-final defeat by Coco Gauff, Swiatek broke down at a changeover and sobbed beneath her towel.\nAnd in Rome, she was visibly upset during a brief chat with the media after a chastening third-round loss to Danielle Collins.\n\"For sure it hasn't been easy. For sure I'm doing something wrong,\" she said afterwards.\n\"I need to regroup and change some stuff.\"\nWith these issues lingering in the background, Swiatek has been nowhere near her best level throughout the clay-court swing.\nHer destructive forehand - arguably her most effective tool - has lost its reliability, while her service game has been picked apart by big-hitting opponents.\nThe mistakes, according to Swiatek, are because of slight technical tweaks she is making.\nBut there is also an element of uncertainty in her usually sharp footwork, hinting at her crisis of confidence.\nThe manner of the early exit in Rome - a 6-1 7-5 loss to Collins - was particularly concerning, with Swiatek converting just two of 10 break opportunities.\n\"I'm making decisions that are not really good at the moment because I just remember how it felt in previous tournaments or previous years,\" Swiatek said.\n\"I kind of assume it's going to go in and then I make mistakes.\n\"It's not the same - I'm confused.\"\nSwiatek's speed and agility of movement give her time to unleash her Rafael Nadal-esque top-spin forehand - a key component in her success.\nAmerican world number two Gauff, one of the main contenders for the trophy, insists it would be foolish to rule Swiatek out.\n\"I always think if someone wins a tournament that many times, regardless of what shape they're in, they can definitely figure out a way to win again,\" Gauff said.\nBut immediately after her Rome defeat, Swiatek seemed unsure.\nShe curtly dismissed suggestions that returning to Roland Garros could rekindle positive feelings.\nYet her early arrival in Paris - practising on Court Philippe Chatrier at the end of last week - showed she hopes familiarity will breed success.", "url": "https://www.bbc.com/sport/tennis/articles/cx262jd2x83o"}