{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:58", "date_modify": "2025-04-26 03:37:58", "date_publish": "2025-03-08 00:00:00", "description": "Joao Pedro scores early for Hull but is sent off 96 seconds later in their Championship draw at Bristol City.", "filename": "sport_football_live_crlxjllpejjt_1745638678.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_crlxjllpejjt_1745638678.html", "title": "Bristol City 1-1 Hull City: Tigers hold on with 10 men", "title_page": "Bristol City 1-1 Hull City: Tigers hold on with 10 men - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Joao Pedro scored early but was sent off 96 seconds later as Hull City were unable to hold off play-off chasing Bristol City's relentless pressure in a thrilling draw at Ashton Gate.\nPedro's glorious turn and finish deservedly put the lowly Tigers ahead as they looked for a third win in four Championship matches - and a seventh away league win this season.\nBut a nasty looking lunging tackle on George Tanner forced the hosts to play the next 76 minutes a man down.\nThe Robins battered the visitors thereafter, levelling the scores through Anis Mehmeti's calm penalty nine minutes after the break.\nAnd although the Robins continued to dominate and create chances, some questionable finishing, brilliant defending and inspired goalkeeping by Ivor Pandur earned Hull a point.\nThe home side's frustrations were obvious but they remain seventh in the table, two points off sixth-placed West Brom.\nHull had only won nine Championship games this season but six had come away from home and their blistering start backed up their more than respectable away record.\nIt also threatened the home side's fine form which seen them beaten only twice in 11 Championship matches this year.\nThe Tigers managed four attempts on goal and had almost 80% possession inside the first 10 minutes.\nA fifth early chance - and as it transpired their last of the entire game - brought deserved reward for their confidence and pressure.\nPedro showed his quality and composure, collecting Abu Kamara's pass and turning in one delightful spin, before stroking home his sixth goal of the season.\nBut the Italian and Hull's dream start was pushed to the back of boss Ruben Selles' mind within two minutes as Pedro's rash and dangerous challenge brought a red card from referee James Linington.\nHull's dominance instantly disappeared, with the Robins peppering Croatian keeper Pandur's goal thereafter to such an extent that they went from no attempts on goal after 15 minutes to 26 by the end of the game and had 79% of the ball.\nIt took 40 minutes for Bristol City to level, Mehmeti finding the corner after Sinclair Armstrong was felled by Alfie Jones, but the rest of action was a procession of chances and close calls for the hosts.\nArmstrong headed over on two occasions, Tanner had three shots blocked, Scott Twine had multiple sights of goal - twice having excellent long-range strikes saved by the overworked Pandur.\nRob Dickie also wasted a golden headed opportunity while Max Bird, Jason Knight Mehmeti were all denied by the goalkeeper.\nBut Hull City, who have now won just one of their previous 27 away league games against Bristol City since 1965 - the exception coming in a 2-1 win in October 2012- held on to deny the Robins an eighth home victory in 10 matches.\nBristol City assistant Chris Hogg told BBC Radio Bristol:\n\"Frustration is the word - that's the true emotion. With them being down to 10 men for so long people will think we should have steamrollered them.\n\"Having 10 men can galvanise teams but we just weren't quite at our best in breaking them down and that's the most frustrating thing.\n\"They defended their box really well but it came down to belief and our quality. The penalty gave us a lift and gave the whole stadium a lift but we struggled to break down their block and that is something we will have to have a look at.\n\"There were some good bits and some nearly bits but the boys need to back themselves. We know we could have done better in some moments. We didn't start the game with our usual intent.\"\nHull City boss Ruben Selles told BBC Radio Humberside:\n\"We will take the point but we came here with the clear intention of getting three.\n\"We showed domination in the first 15 minutes and were the best team by far but the red card changed everything. We were unlucky with that situation. But I am proud of the effort.\n\"The overall performance from the very beginning - winning the ball high and trying to play vertical with the build-up - showed the boys were ready to make a good performance and be competitive and the goal was a clear example of that. It was an amazing action from Joao with his technical ability.\"\nOn Pedro's red card, Selles said he had not had time to think about appealing against the decision but \"would look into it\".\n\"Things happen for you and against you so I am going to keep my opinion and talk about the performance of the boys. We should talk about the warriors on the pitch.\n\"It really doesn't matter what I feel. I need to coach. I try not to speak too much about decisions.\"", "url": "https://www.bbc.co.uk/sport/football/live/crlxjllpejjt"}