{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:33:02", "date_modify": "2025-05-21 07:33:02", "date_publish": "2025-05-20 14:54:42", "description": "Wales add The New Saints' newly retired former goalkeeper Connor Roberts to their squad for a training camp in Spain.", "filename": "sport_football_articles_cm2665jm5reo_1747812782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10b6/live/cdccc9a0-3588-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2665jm5reo_1747812782.html", "title": "Connor Roberts: Wales add ex-The New Saints goalkeeper to training squad", "title_page": "Connor Roberts: Wales add ex-The New Saints goalkeeper to training squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales have added The New Saints' newly retired former goalkeeper Connor Roberts to their squad for a training camp in Spain.\nThe 32-year-old revealed last week he had called time on his professional career because of mental health issues after his father took his own life.\nBut Wales head coach Craig Bellamy has added Roberts to a 29-strong travelling party featuring a mixture of senior players and those from the under-21 and under-19 squads.\n\"Connor is someone I have been aware of for a while and he has been on the cusp of being involved over the last year. He is a resilient and hard-working person both on and off the pitch,\" said Bellamy.\n\"What he has achieved in Welsh football is admirable and his retirement will be a big loss to the game in Wales.\n\"His call-up is well deserved and he will have a positive impact on camp this week with the rest of the squad. I look forward to working with him and I hope the experience is one that Connor will treasure as he transitions to life outside of playing.\"\nWales have not stipulated exactly what role Roberts will play during the training camp in Alicante, but it could be that he combines playing with coaching.\nThe former Wales Under-21 international plans to pursue a coaching career, and other players – such as senior Wales captain Aaron Ramsey – have helped the backroom staff on an unofficial basis during periods of injury.\nRoberts, who was born in Wrexham, started his career at Everton and, following spells at clubs including Fulham, Cheltenham Town and Bangor City, he joined The New Saints in 2018 and won several trophies there, including the Welsh domestic treble this season.\n\"I would like to thank the manager and the FAW [Football Association of Wales] for giving me this incredible opportunity,\" said Roberts.\n\"Thank you to my club, TNS, as without them and our achievements this season, this certainly wouldn't have been possible. I shall cherish every minute and, again, I'm so grateful for this opportunity.\"\nCardiff City forward Tanatswa Nyakuhwa, 19, is another addition to the original group, but David Harrington, Elliot Myles and Joel Cotterill have not travelled.\nWales are without their Premier League players in Spain because the final round of games will take place on Sunday.\nPlayers involved in English Football League play-offs are also unavailable for the four-day trip to Alicante.", "url": "https://www.bbc.com/sport/football/articles/cm2665jm5reo"}