{"authors": ["Simon Stone", "Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 04:11:46", "date_modify": "2025-05-21 04:11:46", "date_publish": "2025-02-01 13:14:03", "description": "Aston Villa are closing in on a loan deal for Manchester United striker Marcus Rashford.", "filename": "sport_football_articles_cx2pypyj2g7o_1747800706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d230/live/b0ef0340-e0ae-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2pypyj2g7o_1747800706.html", "title": "Marcus Rashford: Aston Villa closing in on loan deal for Manchester United striker", "title_page": "Marcus Rashford: Aston Villa closing in on loan deal for Manchester United striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa are closing in on a loan deal for Manchester United forward Marcus Rashford before Monday's transfer deadline.\nSources have told BBC Sport talks are at an advanced stage, but there is work to be done to finalise the move.\nThe prospect of working with Villa boss Unai Emery is understood to be an attractive one for the 27-year-old.\nRashford has not featured for United since being dropped by head coach Ruben Amorim for the Manchester derby on 12 December.\nLast week Amorim suggested he would rather give a place on the bench to his 63-year-old goalkeeping coach because of a perceived lack of effort by the striker.\nOn Wednesday the United boss said he felt his side would be better with Rashford in it, but the player had not met the standards he demands of his squad.\n\"Imagine a talent like Rashford, our team should be so much better with him - but he has to change,\" explained Amorim.\n\"If he changes, we are more than welcome [to include him] - and we need it. But in this moment we have to set some standards. We are waiting for Rashford, if he wants it really bad.\"\nRashford has been with United since the age of seven, made more than 400 appearances, won the Europa League, two FA Cups and two EFL Cups.\nHe has scored 138 goals for United including a season-high of 30 in the 2022-23 season.\nHe scored in Amorim's first game in charge, a 1-1 away draw at Ipswich on 24 November, before netting twice in a 4-0 win over Everton a week later.\nBut the forward was left out of the squad for United's 2-1 victory at Manchester City on 15 December and subsequently told journalist Henry Winter he was \"ready for a new challenge\".\nVilla have signed Spanish full-back Andres Garcia from Levante and Netherlands forward Donyell Malen from Borussia Dortmund so far in this window.\nOn Friday, they sold Colombia striker Jhon Duran to Saudi Pro League side Al-Nassr in a deal that could be worth up to £71m.\nThey have also rejected an approach from Arsenal for their England striker Ollie Watkins.\nThe Midlands side are currently eighth in the Premier League and finished in the top eight of the new Champions League group stage to qualify for the last 16.\nFormer Manchester United and Aston Villa striker Dion Dublin says the deal would be a \"great move\" for Rashford.\nHe told Football Focus: \"It is such a stable club with a very, very good manager. There would be some world-class players around him and he would be going into a very happy camp.\n\"Marcus needs a big hug and for someone to tell him, 'Listen, you're an excellent player'. I think Unai Emery could be the coach to get the best out of him. Let's see what happens.\"\nFormer Arsenal forward Ellen White added: \"A move to Aston Villa would be something new and fresh for Marcus Rashford. We know he can be a great goalscorer and he is a great player. He just needs something different, a new environment.\"", "url": "https://www.bbc.com/sport/football/articles/cx2pypyj2g7o"}