{"authors": ["Dafydd Pritchard", "www.facebook.com"], "date_download": "2025-05-20 13:30:04", "date_modify": "2025-05-20 13:30:04", "date_publish": "2023-08-02 05:03:25", "description": "After narrowly avoiding relegation last term, Cardiff City turn to new boss Erol Bulut for the 2023-24 Championship season.", "filename": "sport_football_66329938_1747747804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A9EA/production/_130289434_cdf_010723_cf_cardiff_v_penybont_003.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66329938_1747747804.html", "title": "Cardiff City 2023-24 Championship season preview: Erol Bulut leads latest new era", "title_page": "Cardiff City 2023-24 Championship season preview: Erol Bulut leads latest new era - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The more things change at Cardiff City, the more they stay the same. A new season means another new manager and another new era.\nAfter a 2022-23 campaign in which three bosses came and went, Erol Bulut is the latest man to take the reins in the Welsh capital.\nUnder Steve Morison, Mark Hudson and Sabri Lamouchi, Cardiff came close to relegation in the Championship last season.\nNow, having overseen a promising summer in the transfer market, Bulut will be aiming to guide the Bluebirds to the higher reaches of the table.\nIn Aaron Ramsey, Cardiff have made one of the most eye-catching signings in Championship history.\nAnd with the Wales captain back at the club where his illustrious career began, Cardiff fans may allow themselves to dream that better times lie ahead.\nPut simply, it was one to forget.\nAhead of Morison's first full season in charge, Cardiff's squad had undergone major surgery as 13 players came in and 10 left.\nDespite some encouraging signs of a more progressive style of football early in his tenure, Morison lasted only 10 games in the 2022-23 campaign before he was sacked in September.\nFormer club captain Hudson was his successor but was dismissed four months later, leaving Cardiff one place and three points above the relegation zone.\nEx-Nottingham Forest manager Lamouchi then came in on a short-term contract and steered the Bluebirds to safety, with wins over Bristol City and Watford among the highlights.\nSecuring Championship survival was a grind, with Cardiff finishing the season in 21st place as the Championship's second lowest scorers.\nAll that mattered, however, was avoiding relegation, and Lamouchi fulfilled his brief. But after talks over a new deal broke down in May, the Frenchman departed and left Cardiff searching for a fourth manager in just eight months.\nSpeak to most Cardiff fans and you'll get a broadly positive view of the Bulut appointment.\nThe former Turkey Under-21s international may not be a household name having never coached outside his homeland but, having worked at Fenerbahce and Alanyaspor among others, Bulut boasts considerable managerial experience.\nThe 48-year-old seems encouraged by the quality of squad he has to work with at Cardiff and he has been pleased with the signings he has made so far.\nAlthough a transfer embargo means Cardiff cannot pay fees for players, the club have made some shrewd free and loan signings such as forwards Yakou Meite and Karlan Grant.\nConsidering how blunt the Bluebirds were in front of goal last season - only bottom side Wigan scored fewer - improving the attack has been Bulut's primary target in pre-season.\nThe likes of Ramsey, Grant, Meite, Josh Bowler and Ike Ugbo should do that, while Greece centre-back Dimitrios Goutas will add to the depth in defence.\nMaking any prediction in the Championship runs the risk of making you look foolish but, with their transfer dealings and Bulut's appointment in mind, it would seem fair to expect that Cardiff will improve on last season's dismal display.\n\"Generally, our [pre-season] games that we played, they were good. The games in Portugal, I was very satisfied. We lost the games, but in general, what I want to see from the team, I saw it.\n\"What we give to the players, they put it on the pitch well, but we've missed the goals. We create a lot of chances, but have not taken them.\n\"Some players are still new... they are trying to adapt to the team. For the coming weeks, we have to manage much better, of course. This will come I think.\n\"Our ambitions have to be high, I put always my target on the highest level, I was always like this, so at least we will know what we are fighting for.\"", "url": "https://www.bbc.com/sport/football/66329938"}