{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:20:38", "date_modify": "2025-05-21 06:20:38", "date_publish": "2025-01-04 16:00:05", "description": "Guernsey FC secure a 1-1 draw at mid-table Southall in Isthmian League South Central.", "filename": "sport_football_articles_crk08rjy65do_1747808438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8d0/live/814c5eb0-cab2-11ef-8fb8-75874e244aea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crk08rjy65do_1747808438.html", "title": "Guernsey FC hold out for 1-1 Southall draw", "title_page": "Guernsey FC hold out for 1-1 Southall draw as upturn in form continues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A depleted Guernsey FC side held out to secure a 1-1 draw at mid-table Southall in Isthmian League South Central.\nJacob Fallaize tapped in Fin du Port's low free-kick to give Guernsey a second-minute lead before Southall failed to take a host of chances.\nDebutant goalkeeper Seb Sheppard saved efforts from Anthony O'Connor, Remy Bennison and Romey Meoded before Jaden Thompson-Brissett shot wide when clear on goal.\nSouthall finally broke Guernsey's resistance 12 minutes after the break as Brendan Matthew tapped in Zak Joseph's cutback before Sheppard made another good save from O'Connor.\nThe hosts then missed a 63rd-minute penalty as Thompson-Brissett fired wide after a Dave Merris handball in the box.\nFallaize and Merris saw late shots blocked as both sides tried hard to get a winner.\nThe point extended Guernsey's recent good form which has seen them lose just once in their past five matches.\nThey remain second-from-bottom of the table but are now four points from safety with three games in hand on the three sides above them.\n\"I'm very happy given the circumstances, we were missing a lot of players today,\" coach Kevin Gilligan told BBC Radio Guernsey.\n\"This is probably one of the youngest teams we've ever fielded, I think the average age was 24 and that was only because of Dave Merris and Matt Loaring who brought it up a little bit.\n\"We had a 16-year-old up front with an 18-year-old, so all things considered we're delighted with the draw today and the point.\"", "url": "https://www.bbc.com/sport/football/articles/crk08rjy65do"}