{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:12:10", "date_modify": "2025-05-20 13:12:10", "date_publish": "2023-08-01 07:26:54", "description": "Leeds United: Why tragedy chanting needs to stop", "filename": "sport_articles_c6prd3xl1eeo_1747746730.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae5c/live/56374740-3034-11ee-a66b-b7928b595fb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c6prd3xl1eeo_1747746730.html", "title": "Leeds United: Why tragedy chanting needs to stop", "title_page": "Leeds United: Why tragedy chanting needs to stop - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United supporter Gareth Senior has campaigned for tougher punishments to be handed out for offences such as tragedy chanting - like the ones announced in a new charter on Monday.\nSenior was friends with Leeds fans Chris Loftus and Kevin Speight, who were killed in Istanbul on the eve of the club's Uefa Cup semi-final against Galatasaray in 2000 - and told BBC Radio Leeds why tragedy chanting needs to stop at football matches.\nHe said: \"I'd urge people just not to do it, just to reflect on what's happened to us as a club and also realise the human impact of tragedy chanting. These people wouldn't do it in their nine-to-five lives in the week, or in the pub, so why is football any different?\n\"As a club we've suffered with the loss of two of our fans who were murdered 23 years ago. That pain will never go away from many people, from their families and the club will always remember them and will always respect them.\n\"That's what us, as a group of fans, need to do. We need to respect Christopher and Kevin, respect their memories, respect their families and respect all of the people who carry the scars from that night as well.\n\"That, in itself, should be enough to ensure that people never get involved in tragedy chanting again, at Elland Road or away games.\"", "url": "https://www.bbc.com/sport/articles/c6prd3xl1eeo"}