{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:43:46", "date_modify": "2025-05-21 07:43:46", "date_publish": "2025-03-28 10:00:28", "description": "Organisers of the World Figure Skating Championships apologise after displaying the flag of Taiwan in place of the Chinese Taipei emblem.", "filename": "sport_articles_c99n9yn2v40o_1747813426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e112/live/f107d4d0-0baf-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c99n9yn2v40o_1747813426.html", "title": "World Figure Skating Championships: ISU apologises for Taiwan flag error in Boston", "title_page": "World Figure Skating Championships: ISU apologises for Taiwan flag error in Boston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Organisers of the World Figure Skating Championships have apologised after displaying the flag of Taiwan in place of the Chinese Taipei emblem.\nTaiwan competes at most international sports events as Chinese Taipei to avoid objections from neighbours China, which claims the democratically governed island as its own territory.\nHowever, Taiwan's government rejects China's sovereignty claims.\nThe Taiwan flag was displayed on a video screen behind Li Yu-Hsiang when the skater was introduced ahead of the short program in Boston, Massachusetts on Thursday.\nA public address announcer at the venue read out the International Skating Union's (ISU) apology ahead of the pairs event later in the day.\n\"The ISU would like to sincerely apologise for the display of the incorrect flag for Chinese Taipei during the ISU World Figure Skating Championships event today,\" it said.\n\"We fully understand the sensitivity of this mistake and deeply regret any offence or confusion this may have caused.\"\nLi failed to qualify for the finals in the short program event after finishing 30th.", "url": "https://www.bbc.com/sport/articles/c99n9yn2v40o"}