{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:54", "date_modify": "2025-04-26 06:16:54", "date_publish": "2025-03-01 18:59:30", "description": "After Dungannon Swifts' comeback 3-1 win against Carrick Rangers, BBC Sport NI catches up with Swifts goalscorer John McGovern and Carrick Rangers defender Mark Surgenor.", "filename": "sport_articles_c5y467k06zno_1745648214.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/acc6/live/75bace00-f6cd-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c5y467k06zno_1745648214.html", "title": "Irish Cup: 'The Irish Cup is wide open for Dungannon now'", "title_page": "Irish Cup: 'The Irish Cup is wide open for Dungannon now' - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After Dungannon Swifts' comeback 3-1 win against Carrick Rangers, BBC Sport NI caught up with Swifts goalscorer John McGovern and Carrick Rangers defender Mark Surgenor.\nMcGovern on the victory:\n\"We weren't at the races at the first half, Rodney [McAree] said that at half-time and we turned it round. We came out the second half, played well, took our chances and won the game.\"\nOn adjusting their style of play:\n\"Throughout the year we have got a name for ourselves of playing good football and many people don't fancy us playing on a grass pitch like here at Carrick, but it goes to show we can play a bit of football, and we can adapt. Second half we adapted really well and fought really well.\"\nOn his second goal:\n\"For the second one, when I chopped inside, I just thought get this on target and anything can happen, thankfully I put it near post in the corner of the net and I was overcome with emotion.\"\nOn the potential to win the Irish Cup:\n\"The Irish Cup is wide open for us now, but at this stage of the competition you don't take anything for granted. We said at the start of the season that if you win five games you win the Irish Cup. We have won three so there is three steps forward, but we still have two to go.\"\nSurgenor on the defeat:\n\"We got the goal from playing well, Dungannon got back into the game but at half-time there was no panic. In the second half, the manner of the goals we conceded was so disheartening.\"", "url": "https://www.bbc.co.uk/sport/articles/c5y467k06zno"}