{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:03:04", "date_modify": "2025-05-21 07:03:04", "date_publish": "2024-12-27 00:00:00", "description": "Falkirk stretch their lead at the top of the Scottish Championship to six points as Dunfermline Athletic come from behind three times to draw a six-goal thriller.", "filename": "sport_football_live_cjr2jjwpdyvt_1747810984.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cjr2jjwpdyvt_1747810984.html", "title": "Dunfermline Athletic hold leaders Falkirk after six-goal Scottish Championship thriller", "title_page": "Dunfermline Athletic hold leaders Falkirk after six-goal Scottish Championship thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "G'night\nFT: Dunfermline 3-3 Falkirk\nThat's all from me on live text duties, as Dunfermline and Falkirk play out a six-goal thriller in Fife.\nThe Bairns lead the Scottish Championship by six points, while Dunfermline stay ninth.\n'Players need to take responsibility' - Benedictus\nFT: Dunfermline 3-3 Falkirk\nDunfermline captain and player of the match Kyle Benedictus tells BBC Scotland: \"I don't score many goals, so great to get that one at the end. I'm knackered.\n\"It was hard getting the news on Monday [of James McPake's sacking], and we need to take full responsibility. We showed a bit of character. Two rivals going at it and it was a cracking game for the cameras.\n\"I think I cracked my rib against Raith two weeks ago, and first half I landed on it. Any time I get a knock on it, it's gut wrenching.\n\"We need to make sure we stick together. There's a long way to go this season.\"\nFULL-TIME\nDunfermline 3-3 Falkirk\nA captivating game of football comes to an end.\nThese rivals put on a real show in front of the BBC Scotland cameras.\nThree times Falkirk took the lead, three times Dunfermline responded.\nI'm off to have a quick breather before we get all the post-match reaction.\nGOAL Dunfermline 2-3 Falkirk\nLiam Henderson\nDelight for Falkirk, who are going eight points clear as it stands!\nBrad Spencer's corner is right on top of goalkeeper Tobi Oluwayemi, he makes a mess of it and Liam Henderson pokes home from close range.\nThere's fans on the pitch, and who can blame them.", "url": "https://www.bbc.com/sport/football/live/cjr2jjwpdyvt"}