{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:39:10", "date_modify": "2025-04-26 06:39:10", "date_publish": "2025-03-02 00:00:00", "description": "Relive how teenage world champion Luke Littler won the 2025 UK Open in Minehead.", "filename": "sport_darts_live_cyvem702646t_1745649550.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33ea/live/8c604db0-f7a9-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_darts_live_cyvem702646t_1745649550.html", "title": "UK Open 2025 darts final: Luke Littler's win over James Wade as it happened", "title_page": "UK Open 2025 darts final: Luke Littler's win over James Wade as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye!\nResult: Littler 11-2 Wade\nThanks for joining us tonight, you can read all about Luke Littler collecting another piece of major darts silverware in Timothy Abraham's report here.\nSee you soon.\nMore darts!\nResult: Littler 11-2 Wade\nWell, that was over pretty sharpish. But if you're still craving a darts fix, never fear - we'll be back on Thursday.\nThere will be live coverage of Premier League Darts night five in Brighton.\nLuke Littler will be in action then too, facing Chris Dobey in the quarter-finals before a potential semi-final clash with Michael van Gerwen.\n'Littler was the far superior player'\nResult: Littler 11-2 Wade\nJames Wade, speaking to ITV4 after his final loss to Luke Littler in Minehead:\n\"He absolutely bashed me to bits but what can you do against that?\n\"He was the far superior player, as much as it kills me to admit it, but it is what it is. For me, it's a great step in the right direction.\n\"Fair play to Luke - at the moment, he's probably the best or the second-best darts player in the world comfortably.\"\nPost\nResult: Littler 11-2 Wade\nJames Wade did well to get this far, but there might be a slight sense of what might have been.\nLuke Littler was good, but not perfect. His highest checkout was only 91 and he only finished 11 of 28 checkouts.\nBut Wade's finishing was frankly awful - two of 17 for a 11.76% conversion rate, with a highest checkout of 85.\nIt wasn't good enough for a final.\n'One I can tick off the list'\nResult: Littler 11-2 Wade\nUK Open champion Luke Littler, speaking to ITV4 after his victory over James Wade:\n\"It's one I've wanted to win. It's my third time here, I came here two years ago as a 16-year-old, last year I was in the quarter-final and now I've gone two better this year to win it.\n\"I had a job to do, I just wanted to pick up the trophy and it's one I can tick off the list now.\n\"I'm looking at the Premier League, making sure I'm in the top four and making sure I go to the O2. I've got the Pro Tour, the Players Championship and back to the Premier League. It's going to be a long few weeks.\"\nPost\nResult: Littler 11-2 Wade\nWade describes Littler as \"comfortably the best or second-best darts player in the world right now\". Accurate and respectful words.\nLittler then gets his hands on the very sizeable UK Open trophy, and lifts it high as the tickertape falls.\nFull quotes from both players to come shortly.\nPost\nLittler 11-2 Wade\nIn fairness, James Wade gets £50,000 as a runner up prize. I'd be smiling at that too.\nHe gets a good reception from the crowd. The veteran has played some fine darts this weekend, particularly in the quarters and semis earlier today.\nThat win over Luke Humphries will live long in the memory.\nLittler one leg from UK Open title\nLittler 10-1 Wade (First to 11)\nLuke Littler was made to wait by James Wade after the last interval, and looked unimpressed. He takes out his frustration by throwing 180 with his first visit to the oche upon resuming.\nLittler can't make a Shanghai finish however, leaving Wade needing 78 to break... but he misses double 20.\nThe Nuke doesn't need a second invite, and he's one leg from another title.\nPost\nLittler 9-1 Wade\nChris Mason\nFormer PDC World Championship quarter-finalist on ITV4\nLuke stamped his authority early in the game. There was an opportunity for James in leg four to get a foothold in the match, but from that point on it's been a tough night for Wade.\nEverything Luke is doing is in five visits or les, while James is needing a sixth or seventh visit.", "url": "https://www.bbc.co.uk/sport/darts/live/cyvem702646t"}