{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:14", "date_modify": "2025-05-20 11:57:14", "date_publish": "2023-08-06 11:27:46", "description": "Torquay United manager Gary Johnson says his side cannot play as poorly as they did away to Dover Athletic again.", "filename": "sport_football_66421739_1747742234.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AD13/production/_130670344_garyjohnsondoveraug2023rex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66421739_1747742234.html", "title": "Torquay United boss Gary Johnson unhappy after 2-2 Dover Athletic draw", "title_page": "Torquay United boss Gary Johnson unhappy after 2-2 Dover Athletic draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torquay United manager Gary Johnson says his side cannot play as poorly as they did away to Dover Athletic again.\nThe Gulls began their National League South campaign with a 2-2 draw in Kent, having led 2-0 inside the first 20 minutes thanks to an own goal and a strike from Asa Hall.\nBut goals either side of the break from Dover ensured a share of the points.\n\"That's the lowest standard that we should be at for the rest of the season,\" Johnson told BBC Radio Devon.\n\"We can't be that low in our performance, we've got much higher hopes for this group than the game today.\n\"But football's football, and that's what happens sometimes.\n\"If you can get a couple of good results in your home games and show the supporters what we've shown them in the pre-season home games then they'll get back and be a bit more confident in us.\"\nHaving been relegated from the National League last season, the Gulls are one of the favourites for promotion this term as they aim to emulate Johnson's debut season in charge in 2019 when they won the title in the sixth tier by 10 points.\n\"Some of our lads are learning about the National League South, it's not a mug league, we've got some young lads who are a little bit inexperienced but it wasn't only them,\" added Johnson.\n\"Not one person in the team played their best game and we've had a chat about that already in the dressing room, and we'll hopefully they'll find their form for the two home games like our home supporters have seen.\n\"It feels like a bit of a defeat for all of us, if we were 2-0 down and drew 2-2 it wouldn't have been so bad, but we were well in the ascendency and then they scored and it just gave them oxygen.\"", "url": "https://www.bbc.com/sport/football/66421739"}