{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:53:23", "date_modify": "2025-05-20 13:53:23", "date_publish": "2023-07-31 16:13:34", "description": "Leigh Wood will defend his WBA featherweight world title against fellow Briton Josh Warrington in Sheffield on Saturday, 7 October.", "filename": "sport_boxing_66364180_1747749203.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6E1D/production/_130598182_bbc-sport-index-imagery-2-split-images-gradient-9890f0d6-fae0-4b00-92df-e8c13c83c4ef.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66364180_1747749203.html", "title": "Leigh Wood: WBA featherweight champion to defend title against Josh Warrington", "title_page": "Leigh Wood: WBA featherweight champion to defend title against Josh Warrington - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leigh Wood will defend his WBA featherweight world title against Josh Warrington in Sheffield on Saturday, 7 October.\nWood, 34, gained revenge on Mauricio Lara with a unanimous points decision to become a two-time world champion in his last bout in May.\nThe Nottingham fighter knocked down Mexican Lara in round two and never looked in trouble thereafter.\nWarrington will aim to become a three-time featherweight world champion.\nLeeds-born Warrington, 32, lost his IBF belt to Mexico's Luis Alberto Lopez following a narrow points defeat last December.\nWood says the domestic bout could produce the biggest British rivalry in the sport.\n\"I'm extremely excited,\" he added. \"In terms of the followings we've got, the football clubs and the cities, this is arguably the biggest British rivalry in the sport.\n\"For me, it doesn't really get any bigger. Our styles will gel and that should make for a very exciting and entertaining fight. It should go down in British history.\n\"Josh has some great wins on his record and is obviously a two-time world champion, but this is a fight that he cannot lose. He's never really been in a boring fight - but neither have I. This fight will be all-action and the fans should be in for a great night.\"\nWarrington added: \"It doesn't get much better than a domestic dust up for a world title. I'm obsessed in becoming a three-weight world champion, to get back on top and that is going to show on the night.\n\"I will bring an army of fans to Sheffield and the atmosphere will be special. Leigh has had a good run and put some good wins together but I just don't believe he can live with me.\"", "url": "https://www.bbc.com/sport/boxing/66364180"}