{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 07:44:29", "date_modify": "2025-05-21 07:44:29", "date_publish": "2025-05-20 12:31:55", "description": "Chelsea boss Enzo Maresca criticises the decision to bring Real Betis' final La Liga fixture forward to allow them extra time before the Conference League final.", "filename": "sport_football_articles_clyvv7evqzno_1747813469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2aa/live/d7b05700-3571-11f0-a288-d583f745f4b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyvv7evqzno_1747813469.html", "title": "Conference League final: Chelse's Enzo Maresca unhappy with Real Betis change", "title_page": "Conference League final: Chelse's Enzo Maresca unhappy with Real Betis change - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea manager Enzo Maresca says he is \"not happy\" that opponents Real Betis have been given two days of extra preparation for next week's Conference League final.\nLa Liga has accepted a request from Betis to bring their final league match against Valencia - originally scheduled for Sunday - forward to Friday evening (20:00 BST).\nChelsea, by contrast, travel to Nottingham Forest - who, like the Blues, are chasing Champions League football - on Sunday, three days before the final in Wroclaw, Poland on Wednesday, 28 May.\nSunday's final round of Premier League games must all kick off at the same time (16:00 BST) to prevent any side gaining an unfair advantage over their rivals.\nBut Maresca said: \"I'm not happy, 100%, you cannot allow another team 48 hours more when you play a European final.\n\"[Either we play Friday] or they play Sunday like us. I don't know if it is from La Liga, the Premier League or Uefa, but if you ask people in this room if it is normal to play a final where another team has 48 hours more to prepare, it is not normal.\"", "url": "https://www.bbc.com/sport/football/articles/clyvv7evqzno"}