{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:13:45", "date_modify": "2025-05-21 04:13:45", "date_publish": "2025-01-15 08:01:28", "description": "Liverpool news: Pundit, player and news paper reaction to Jota's goal", "filename": "sport_football_articles_c3vprrwzgrdo_1747800825.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7c1/live/d30e01b0-d311-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3vprrwzgrdo_1747800825.html", "title": "Liverpool news: Pundit, player and news paper reaction to Jota's goal", "title_page": "Liverpool news: Pundit, player and news paper reaction to Jota's goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"That is what happens when you are a top manager,\" said BBC Radio 5 Live pundit Clinton Morrison. \"You make big decisions.\"\nArne Slot's double change in the 66th minute, replacing Andrew Robertson and Ibrahima Konate with Diogo Jota and Kostas Tsimikas, is probably his most crucial choice of substitutes yet.\nJust 22 seconds later, Tsimikas whipped in a corner that found Jota's head six yards out to draw Liverpool level at Nottingham Forest.\nReds' fastest substitute goal since 2006-07 in a Premier League match.\nSlot was not keen so take the plaudits at full-time and played it down: \"If it had been open play then people could maybe say it was a tactical masterclass, but it was a set-piece so I don't think I deserve any credit for that.\n\"It was a substitution where we brought an attacker on for a defender and the fact it immediately led to a goal you could say was luck.\"\nBut Jota said he and fellow sub Tsimikas went on with the intention to combine and score: \"We were watching the cup goal from a few years ago where he passed it to me - so when we were on the touchline, we said: \"Let's go now and recreate that, you take the corner. And it was a goal.\"", "url": "https://www.bbc.com/sport/football/articles/c3vprrwzgrdo"}