{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:08:55", "date_modify": "2025-05-20 13:08:55", "date_publish": "2023-08-02 13:40:11", "description": "Former Italy goalkeeper Gianluigi Buffon retires from professional football aged 45.", "filename": "sport_football_66378584_1747746535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F23C/production/_130621026_gigi.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66378584_1747746535.html", "title": "Gianluigi Buffon: Italy legend retires aged 45", "title_page": "Gianluigi Buffon: Italy legend retires aged 45 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Italy goalkeeper and World Cup winner Gianluigi Buffon has retired from football aged 45.\nHe wrote on social media: \"That's all folks. You gave me everything. I gave you everything. We did it together.\"\nBuffon brings an end to a 28-year career that saw him lift the World Cup in 2006 along with 10 Serie A titles with Juventus and Ligue 1 with Paris St-Germain.\nHe ends his career where it began in 1995, at Parma, now a Serie B club.\nBuffon, who had a deal with Parma until 2024, made 19 appearances last season as he struggled with injuries.\nHe began his career at Parma's academy and made his Serie A debut for the club in November 1995 before joining Juventus in 2001 in a £32.6m deal - a world record for a goalkeeper at the time.\nBuffon spent most of his career in Turin, despite a stint at PSG in 2018-19. In total he made a record 657 appearances in the Italian top flight and is the most-capped goalkeeper of all time with 176 appearances for Italy.\nBuffon retired from international football in 2018 after Italy failed to qualify for the World Cup that year.\nHis career highlight was winning the World Cup as Italy beat France 5-3 in a penalty shootout, external after a 1-1 draw in Berlin.\n\"Thank you to our number 1. Grazie, Gigi!\" the Italian national team tweeted.\nSerie A posted: \"There is football history. There is also Gigi Buffon. A fairytale career that took off and ended in one place.\"\nFormer PSG team-mate Kylian Mbappe, 24, tweeted: \"It was a huge honour for me to have the chance to rub shoulders with you and cross paths with you in your legendary career.\n\"You are a golden man who gave me precious advice that I will keep with me for the rest of my life.\"\n\"A legend hangs up his gloves today,\" tweeted Juventus. \"Your saves, your smiles, and your character will be forever remembered.\"\nIn a letter to the player, the Turin club added: \"It is incredibly difficult to talk about football on a day when the beautiful game bids farewell to its number one par excellence.\n\"You were not simply the best; you were more than that. You gave the position a face and became THE goalkeeper to beat and aspire to be.\n\"You are the player that has worn our jersey for the longest and won the most trophies. You rank second in the all-time appearance charts and are, of course, the shot-stopper with the most clean sheets to his name. You were our captain and our rock. You were simply Gigi.\"\nParma president Kyle Krause said: \"Throughout his illustrious career, which is unparalleled, Gigi has demonstrated unparalleled skill, relentless determination and unwavering passion on and off the pitch. Parma Calcio sends its heartfelt congratulations to a true champion and friend.\"", "url": "https://www.bbc.com/sport/football/66378584"}