{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 06:25:33", "date_modify": "2025-04-26 06:25:33", "date_publish": "2025-02-28 22:01:01", "description": "Max Dowman: Arsenal teen shines FA Youth Cup quarter-final defeat by Manchester United", "filename": "sport_football_articles_c5y04g7n2p2o_1745648733.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0dd2/live/6bab1d10-f61f-11ef-b331-b70b782ee609.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y04g7n2p2o_1745648733.html", "title": "Max Dowman: Arsenal teen shines FA Youth Cup quarter-final defeat by Manchester United", "title_page": "Max Dowman: Arsenal teen shines FA Youth Cup quarter-final defeat by Manchester United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal's 15-year-old talent Max Dowman showed exactly why there is so much excitement about his potential during the Gunners' 3-2 defeat by Manchester United in the FA Youth Cup quarter-final.\nDowman has been a name on the lips of Arsenal fans throughout the season and he has been pictured training with the first team regularly.\nThe attacking midfielder was also part of the first-team squad that travelled to Dubai for the winter training camp earlier this month.\nAnd the clamour for him to be included in a first-team squad this season has got louder in recent weeks due to Arsenal's attacking injury crisis, with key forwards Kai Havertz, Bukayo Saka, Gabriel Martinelli and Gabriel Jesus out through injury.\nThe match against United was Dowman's first competitive game at Emirates Stadium and his performance against United's Under-18s makes it hard to imagine that this will be the only match he plays in the stadium.\nThe England youth international, who is playing three age groups up with the under-18s, caught the eye early on.\nSurrounded by three United players in his own half, he took control of possession and flicked the ball cleverly to start a counter-attack.\nPlaying in an advanced central midfield role, Dowman showed passing range, a burst of pace and plus the high level of decision-making that has led to Arsenal manager Mikel Arteta calling him a \"huge talent\".\nThe real standout moment came when Dowman picked up the ball on the right side of the pitch, dribbled into the area while having his shirt pulled and beat his marker twice before winning a penalty.\nDowman stepped up and slotted home the spot-kick himself to give Arsenal a 2-1 lead in the second half.\n\"Some of the things he does in training are unbelievable,\" Arteta said speaking ahead of Arsenal's Champions League game against Dinamo Zagreb last month.\n\"He is a player with a huge talent. We have a lot of belief we can develop him to become one of our own.\n\"At the moment, there are a lot of restrictions with his age. He is taking very fast steps. Every time we put him in another challenge, he takes great steps.\"\nThe restrictions Arteta references are the age rules in place for the Premier League.\nThe rules state players included in matchday squads cannot be from a lower age group than the under-16s and Dowman was named in Arsenal's Under-15s at the start of the season.\nThat means that Arsenal supporters will have to wait a little while yet to see the exciting young talent in action.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y04g7n2p2o"}