{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:54:19", "date_modify": "2025-04-26 03:54:19", "date_publish": "2025-03-04 17:39:19", "description": "Ipswich Town boss Joe Sheehan urges his team to treat their first league defeat of the season as a \"blip\" as they look to secure promotion this season.", "filename": "sport_football_articles_c625dn22r1po_1745639659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8405/live/f2fdb4b0-f914-11ef-a4d6-5dacf2efb9fb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c625dn22r1po_1745639659.html", "title": "Joe Sheehan: Ipswich Women's first league defeat must be a 'blip'", "title_page": "Joe Sheehan: Ipswich Women's first league defeat must be a 'blip' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ipswich Town boss Joe Sheehan has urged his team to treat their first league defeat of the season as a \"blip\" as they look to secure promotion this season.\nSecond-placed Town lost 1-0 to leaders Hashtag United in Women's National League Southern Premier - but although they are now six points behind, they do have three games in hand.\nThe club made a series of signings last summer with the aim of taking the first step towards the Women's National League, promotion to the second-tier Championship.\nOnly one side will go up from their division and Ipswich have seven games remaining to try and overhaul Hashtag, starting with a trip to AFC Wimbledon on Sunday.\nThey are, though, waiting for a fitness report on captain Maria Boswell, who was stretchered off in the second half against Hashtag at Canvey Island FC.\n\"The outcome of the season wasn't determined by this, it was just another game to try and pick up points,\" Sheehan told BBC Radio Suffolk.\n\"We just have to keep our focus, accept that we were beaten, stick together, reflect really well as we always try and do, and come back in for a good week of work that will help us try and beat Sunday's opponents.\n\"If we want to achieve something, we have to ensure that it's only a blip and we respond really well to it.\"\nHe added: \"The possibility of being without Bos would be quite damaging, she plays such an important role for us. We hope it's not too serious, but we shall see.\"\nWith four games left to play, the maximum number of points Hashtag can achieve is 54.\nShould they do so, Ipswich would need 19 from their final seven to be certain of promotion, although they have a superior goal difference.\nOf their final seven games, only three are at home, including the final fixture of the season, against Cheltenham Town.", "url": "https://www.bbc.co.uk/sport/football/articles/c625dn22r1po"}