{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-04-26 04:10:55", "date_modify": "2025-04-26 04:10:55", "date_publish": "2025-03-04 19:29:15", "description": "Scotland must bring back Welsh 'demons' - Dalziel", "filename": "sport_articles_c2ljex9jd54o_1745640655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d884/live/f59d6e60-f92b-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c2ljex9jd54o_1745640655.html", "title": "Scotland must bring back Welsh 'demons' - Dalziel", "title_page": "Scotland must bring back Welsh 'demons' - Dalziel - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Forwards coach John Dalziel says Scotland must look to \"bring the demons back\" for Wales when the sides meet in the Six Nations on Saturday.\nWales are on a 15-match losing run, though took heart from a brave showing against Ireland in interim head coach Matt Sherratt's first game in charge.\nThe Scots are also out of title contention after back-to-back defeats by Ireland and England, and Dalziel wants his team to bounce back with victory at Murrayfield this weekend.\n\"We know any Welsh team, when they put that red jersey on, it's pride and passion,\" Dalziel said. \"They've been close encounters over the last few years.\n\"We've got to try and find areas where we can go and pressure them and try and put them into uncomfortable positions and hopefully bring the demons back that have been there in the games prior. That's what we're looking for.\n\"Like every Test match, we're going to look at the opposition and where we can get some sort of advantage.\n\"There will be areas where both teams will be looking at each other to try and do that. It's going to be a very competitive Test match.\"\nScotland have won the last two meetings between the sides and Wales scrum coach Adam Jones suggested in the media the pressure is all on the Scots ahead of the match.\n\"We've heard that before and it's a game where if they want to put the pressure on us, that's fine,\" Dalziel said.\n\"We're just determined that the last home game of the season here at Murrayfield, we want to try and finish well.\n\"I think we've got to build on the real positives from that England game. We went down there and we created a lot of opportunities in that game.\n\"I suppose it's just about being accurate and understanding what accuracy looks like as well in terms of the high-pressure moments and trying to come away with more of them in this weekend's fixture.\"", "url": "https://www.bbc.co.uk/sport/articles/c2ljex9jd54o"}