{"authors": ["Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-21 06:13:16", "date_modify": "2025-05-21 06:13:16", "date_publish": "2025-01-31 13:28:01", "description": "Manager Arne Slot says Liverpool want Mohamed Salah, who is out of contract in the summer, to sign a new deal.", "filename": "sport_football_articles_c05l80y88rjo_1747807996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f584/live/57b12c90-dfd2-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05l80y88rjo_1747807996.html", "title": "Mohamed Salah contract update: Liverpool boss Arne Slot on winger", "title_page": "Mohamed Salah contract update: Liverpool boss Arne Slot on winger - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool manager Arne Slot says forward Mohamed Salah is \"wise enough to make the right decision\" over his future.\nThe 32-year-old is out of contract in the summer and said in January this was his final season at Anfield as he and the club were \"far away from any progress\" over a new deal.\nThe Egypt forward has scored 23 goals this season to help the Reds to the top of the Premier League and the last 16 of the Champions League.\nSalah has been regularly linked with a move to Saudi Arabia and the country's sports minister Prince Abdulaziz bin Turki Al-Faisal has said he was \"a big prize\" and they \"would love to have him\".\n\"Everybody wants him, including us,\" said Slot. \"We want him to extend of course as well - that is clear.\n\"I'm not surprised that Saudi want him but I wouldn't be surprised if other countries want him as well.\n\"He's old enough and wise enough, and has done so many smart things in his career, that he will make the right decision for himself and, hopefully, for us as well.\"\nSalah has 19 goals in the top flight this season, taking his overall tally to 176 and moving him up to seventh in the Premier League's list of all-time top scorers.\nCaptain Virgil van Dijk and right-back Trent Alexander-Arnold are also out of contract in the summer and Slot said he has spoken to the trio about their situations during regular conversations.\n\"Of course, I speak to these players,\" said Slot, in his news conference before the Premier League leaders face Bournemouth away on Saturday (15:00 GMT).\n\"I speak to them, not every day like [sporting director] Richard [Hughes], but quite a lot and it would be ridiculous if in all these times I speak to them we've never spoken about the future. Of course, we do.\n\"As you probably also know, that's not something I'm going to discuss with you.\n\"It's not only with the three that are out of contract, you also talk about future things with the other players as well.\n\"It's a non-stop process talking to your players but it's also a non-stop process that I will not talk about that in public with you.\"", "url": "https://www.bbc.com/sport/football/articles/c05l80y88rjo"}