{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-21 08:00:28", "date_modify": "2025-05-21 08:00:28", "date_publish": "2025-03-27 17:12:33", "description": "Scotland women playing long game in bid to narrow gap to elite", "filename": "sport_articles_cy4l9e34zp7o_1747814428.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88e4/live/2c023900-0b14-11f0-88b7-5556e7b55c5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy4l9e34zp7o_1747814428.html", "title": "Scotland women playing long game in bid to narrow gap to elite", "title_page": "Scotland women playing long game in bid to narrow gap to elite  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland interim head coach Michael McArdle insists the experience of playing elite sides is the only way for the national team to narrow the gap to the top.\nGermany lie in wait in early April at Tannadice in the first of a double-header in Nations League A.\nThe Germans are ranked second in Europe and third in the world rankings, clearly presenting a formidable test as Scotland seek their first points after beginning the group with defeats by Austria and Netherlands.\n\"We've earned the reward of League A, so it's perfect for us now to go out and test yourself against that level,\" McArdle said after revealing the return of Chelsea midfielder Erin Cuthbert for these fixtures.\n\"Testing yourself against the best, especially for our younger players, it's perfect for us to play and see those benchmarks.\n\"You see the difference between League B and League A. You'll get 30% to 50% less chances in and around the box. The opposition will have more against you and it's about that clinical action on both boxes.\n\"The only way we're going to progress to the highest level is playing them more often.\"\nRecent results suggest Scotland will struggle to avoid dropping down to League B after this cycle but McArdle insists if that happens, they will be better equipped to deliver at that level.\n\"Absolutely, you've got to be accountable to that and that pressure is always a reward for how well you're doing,\" he added.\n\"If that was the outcome, then you have to then use that to dominate within, but also that's the last cycle before the [Euro] play-offs. Obviously, opportunity for qualification. So it's about hitting rhythm at that point as well.\"", "url": "https://www.bbc.com/sport/articles/cy4l9e34zp7o"}