{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-04-26 03:54:07", "date_modify": "2025-04-26 03:54:07", "date_publish": "2025-03-03 07:20:54", "description": "Ireland’s women are beaten in a shootout by New Zealand in the final of the FIH Nations Cup in Chile.\nThe game finished 1-1, with New Zealand winning the penalty run-ins 4-2.", "filename": "sport_olympics_articles_cewkdd7keveo_1745639647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d38/live/1ab62900-f7bd-11ef-a937-15ba06a71ea8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_olympics_articles_cewkdd7keveo_1745639647.html", "title": "Ireland denied Nations Cup win in shootout loss to New Zealand", "title_page": "Ireland denied Nations Cup win in shootout loss to New Zealand - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland’s women were beaten in a shootout by New Zealand in the final of the FIH Nations Cup in Chile.\nThe game finished 1-1, with New Zealand winning the penalty run-ins 4-2.\nGareth Grundie’s Ireland trailed to an early goal by Emelia Surridge but dominated possession for much of the game.\nTheir pressure told when Katie Mullan scored a deserved equaliser with just under four minutes remaining.\nMikayla Power and Sarah Hawkshaw scored in the shootout to level it at 2-2 after three attempts for each side but when the Kiwis edged ahead, Michelle Carey hit the outside of the post before Hannah Cotter beat Ireland keeper Ayeisha McFerran to win the tournament.\nThe defeat is a setback for Ireland as it denied them a place in the FIH Pro League next season, which would have been perfect preparation for the 2026 World Cup.\nThey will remain in the second tier of world hockey for another year and will now switch their focus to the EuroHockey Championships in August and qualifying for the World Cup.\n\"It’s disappointing to lose in the shootout,\" coach Grundie said after the final.\n\"I think we played quite well throughout the game and we had a lot more chances that we weren't able to convert and it comes down to the lottery of one v ones, we came off second.\n”We'll learn from it and move on to the next one. It was a really positive tournament. We'll take some time out and then work towards the Europeans later this summer and we have a World Cup to qualify for.\"\nFor almost a decade, the rollercoaster ride taken by the Ireland women’s hockey team has been intertwined with shootouts.\nFrom missing out on 2016 and 2024 Olympic qualification to winning shootouts in the quarter and semi-finals of the 2018 World Cup and making their first Olympics Games in Tokyo in 2021.\nSo perhaps it shouldn’t have come as any surprise that this final would end up the way it did.\nIreland had produced some superb attacking hockey in winning their four games en route to the final, including a 1-0 win over New Zealand in the pool stages.\nHowever, once Surridge‘s reverse stick shot beat an unsighted McFerran in the sixth minute, Ireland were chasing the game.\nNot that there was any panic. The hard work put in by Grundie in his first few months in charge of the squad was clear to see.\nIreland began to build momentum and by the end of the third quarter had forced five penalty corners but converted none.\nIn fact, penalty corner routines were poor with only one of 25 scored in the five games, a statistic that Ireland will need to work on moving forward.\nIn the final quarter, Ireland bombarded the New Zealanders. Power’s shot went just wide and from a corner Hawkshaw was inches away.\nOnce again on the big occasion, it was Ireland’s most experienced player who stepped up.\nMullan twisted in the circle and fired the equaliser into the New Zealand net with three minutes 57 seconds remaining in the game.\nEven then Ireland came close to winning it. New Zealand had nothing left except the sanctuary of a shootout in which they’d had practice the day before by beating Chile in the semi-final.\nThey held their nerve and it was just enough to end Irish dreams in the cruellest way possible - and not for the first time.", "url": "https://www.bbc.co.uk/sport/olympics/articles/cewkdd7keveo"}