{"authors": ["Craig Nelson", "www.facebook.com"], "date_download": "2025-04-26 06:56:42", "date_modify": "2025-04-26 06:56:42", "date_publish": "2025-02-28 14:39:44", "description": "Nuno Espirito Santo press conference: Nottingham Forest vs Ipswich Town", "filename": "sport_football_articles_c5y00yr3x83o_1745650602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y00yr3x83o_1745650602.html", "title": "Nuno Espirito Santo press conference: Nottingham Forest vs Ipswich Town", "title_page": "Nuno Espirito Santo press conference: Nottingham Forest vs Ipswich Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On team news, Nuno said there are \"some\" players who are a cause for concern but would not elaborate.\nHe adds there was \"a lot of contacts\" in Wednesday's goalless draw at home to Arsenal and his full squad would be assessed for injuries today.\nOn whether the FA Cup represents an opportunity for players not considered a regular first-team starter: \"Everybody is first team - there is no difference between players. It's always the approach for each game to see what is best and to assess - to see how the players are, to look at your opponent and try to make the good decision.\"\nOn the challenge posed by Ipswich: \"Ipswich are a good team. They have energy. They have good players and they are very intense so the expectations are for a very tough match.\"\nNuno dismissed any suggestion Forest are favourites against their relegation-threatened opponents: \"There are no favourites in a football match. There are two teams that go against each other in a fair way.\"\nOn whether the mentality changes against a side struggling in the league: \"Not at all. Totally the opposite. Just look at the data and you will see there is no difference in the games. There is no belief that players run more based on their opponent. It is not about that.\"\nOn whether he advocates the use of sports psychologists to help with mental health: \"Of course. All the help is needed, and it's welcome.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c5y00yr3x83o"}