{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:46:26", "date_modify": "2025-05-20 14:46:26", "date_publish": "2023-07-27 17:49:58", "description": "Inter Club d'Escaldes 2-1 Hibernian: What the manager said", "filename": "sport_articles_c843rp7xgjno_1747752386.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c843rp7xgjno_1747752386.html", "title": "Inter Club d'Escaldes 2-1 Hibernian: What the manager said", "title_page": "Inter Club d'Escaldes 2-1 Hibernian: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian manager Lee Johnson told BBC Scotland post-match that individual errors cost his side in Andorra.\n\"It was disappointing, wasn’t it?\" he said. \"I thought first half we were really really poor. I don’t know why, they had all the information the lads, in terms of what the opposition were like and that proved to be that.\n\"I think, I don’t want to give excuses because we just weren’t good enough, but the altitude seemed a bit of a problem in terms of the lads getting a breath in.\n\"Scruffy, sloppy, it was really disappointing to see.\n\"In the second half, we made the shape change and put Christian [Doidge] on and brought Joe Newell on and I thought we were much better in the second half.\n\"Statistically we would have been better, we had more shots, more box entries, more crosses, but obviously we weren’t expecting to concede the second goal like we did and that made out goal really important.\n\"It’s a completely different tie obviously coming back to Easter Road, without fans behind us.\n\"We have a bit to do, there’s no doubt in that but straight away we’ve tried to change the tone very quickly into, ‘Look, now you’ve seen it, now you’ve felt it, I told you it wasn’t a given and that’s a wake-up call for us big time and, therefore, we’ve got to go and produce in the second leg’.\n\"We’ll reflect and review everything. It was a long journey yesterday on matchday minus one and in hindsight, I’d probably come a day earlier now I know. But it’s all excuses, isn’t it?\n\"I don’t feel like we deserve any excuses because individuals just weren’t good enough on the day, making bad decisions.\"", "url": "https://www.bbc.com/sport/articles/c843rp7xgjno"}