{"authors": ["Jerome Sale", "www.facebook.com"], "date_download": "2025-05-20 13:56:11", "date_modify": "2025-05-20 13:56:11", "date_publish": "2023-07-31 10:57:58", "description": "After a dismal 2022-23 campaign what can fans expect from Oxford this season? Thoughts and analysis from the BBC’s Jerome Sale.", "filename": "sport_football_66335301_1747749371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3829/production/_130577341_shutterstock_editorial_14018103ad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66335301_1747749371.html", "title": "Jerome Sale column: What can we expect from Oxford United in the 2023-24 season?", "title_page": "Jerome Sale column: What can we expect from Oxford United in the 2023-24 season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It feels very different at Oxford United compared with a year ago.\nThere are new outright owners, there is a new manager, and there are a lot of new players.\nThis time last year there may have been nagging doubts about Oxford's ability to put together yet another promotion push from League One, but few, if anyone, predicting the wheels spectacularly coming off, as they did, as winter turned to spring.\nThat was a spell of real turmoil - a challenge for the new board, with fans rightly fearing relegation.\nIf he was slow to sack Karl Robinson, United's chairman Grant Ferguson took a perfectly sensible amount of time to replace him with Liam Manning - a calm, measured man who steered the U's to safety in the final week of the campaign.\nUnlike his predecessor, Manning is not a larger-than-life character, but his presence is felt at the club's training ground in other ways - it is business first and foremost, in every part of the building and on every pitch.\nAnother change is that recruitment is almost complete before the season has started - a diverse range of players have come in - young and older, from the Premier League to the National League, but so far none out of left field - think Yanic Wildschut from CSKA Sofia and Djavan Anderson from Lazio late in last summer's transfer window.\nThe club does mean business, and it is acting in accordance with stated aims of being a top-30 club, on and off the field. I can guarantee all supporters will welcome that ambition, though it is inevitable that there will be some abrasion as it changes its business model and alters processes in a bid to control its brand and its message.\nTo oil the relationships, the trick will be to limit any feeling of disenfranchisement for those who, in more straitened times, have been the lifeblood of the football club. The club will still need those people to be foot soldiers in the battle it has to win over political opinion about the merits of building a new stadium just north of the city. Winning football matches inevitably helps.", "url": "https://www.bbc.com/sport/football/66335301"}