{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:47", "date_modify": "2025-05-20 14:06:47", "date_publish": "2023-07-30 17:40:03", "description": "Polvara improvement gives Robson a 'headache'", "filename": "sport_articles_cd1yyejdr95o_1747750007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c570/live/c1228ff0-2eff-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1yyejdr95o_1747750007.html", "title": "Polvara improvement gives Robson a 'headache'", "title_page": "Polvara improvement gives Robson a 'headache' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dante Polvara has “come on leaps and bounds” and could be given a chance to revive his Aberdeen career this season, says manager Barry Robson.\nThe American midfielder joined the Dons in January 2022 on a two-and-a-half-year contract but has managed only 11 appearances so far and spent the final months of last term on loan at Charleston Battery in his homeland.\nHaving returned to Pittodrie this summer, Polvara, 23, played the first 62 minutes on Saturday as Aberdeen raced into a three-goal lead on their way to an impressive 3-2 friendly win over Charlton at The Valley.\n\"Under the two managers that were here before, for whatever reason, he was sent out on loan or whatever,\" Robson told Aberdeen TV.\n\"But myself and my staff saw a football player in there, a good kid who's got good size.\n\"He's athletic, he can pass the ball with both feet, he wants to run, he wants to press, he can affect the game, so we've tried to coach him and help him to see if we can get him to be part of the squad and help the team and you could see he can (against Charlton).\n\"He's come on leaps and bounds and he should be proud of himself. He's given us a headache for coming in to play in the side.\"\nRobson confirmed Rhys Williams will miss Saturday's Premiership opener away to Livingston after and fellow centre-back Angus MacDonald is a doubt after the pair missed the trip to London through injury.\n\"Rhys won't make next weekend, Angus maybe,\" said the manager. \"We're still waiting on him. He's back on the training pitch, he's running so we'll see how he is.\"", "url": "https://www.bbc.com/sport/articles/cd1yyejdr95o"}