{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:33:32", "date_modify": "2025-04-26 04:33:32", "date_publish": "2025-03-06 00:00:00", "description": "Conference League favourites Chelsea take control of their last-16 tie against Copenhagen with a narrow first-leg win in Denmark.", "filename": "sport_football_live_cvg1nyp11lkt_1745642012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a3bc/live/1bd35990-fac2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cvg1nyp11lkt_1745642012.html", "title": "Copenhagen 1-2 Chelsea: Blues take control of Conference League last-16 tie", "title_page": "Copenhagen 1-2 Chelsea: Blues take control of Conference League last-16 tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Conference League favourites Chelsea took control of their last-16 tie against Copenhagen with a narrow first-leg win in Denmark.\nAfter failing to register a first-half shot on target, Enzo Maresca's side took the lead within a minute of the restart.\nMarc Cucurella, on for the injured Malo Gusto, ran down the left and pulled the ball back with captain Reece James scoring with a fine low strike from 30 yards out.\nCopenhagen almost equalised a few minutes later but Viktor Claesson's angled strike bounced off the inside of the post and back into the hands of grateful Blues goalkeeper Robert Sanchez.\nBut Chelsea doubled their advantage in the 65th minute.\nCucurella was again involved as he won the ball close to the left touchline and Christopher Nkunku released Tyrique George whose cut-back was side-footed into the net by substitute Enzo Fernandez.\nCopenhagen did manage to get a goal back when Gabriel Pereira produced a powerful header to convert Marcos Lopez's deep free-kick, although Chelsea are still in a strong position to move into the quarter-finals.\nThe second leg takes place at Stamford Bridge on Thursday, 13 March (20:00 GMT) and the overall winners will play either Norwegian side Molde or Legia Warsaw from Poland in the last eight.\nFollow live text commentary of Thursday's Europa League and Conference League matches\nPoland will host the final, on Wednesday, 28 May at the Wroclaw Stadium in Wroclaw and Chelsea will expect to be there.\nThe Blues won the Champions League as recently as 2021 and have a great chance of more continental success in Europe's third-tier tournament. Victory would guarantee them a place in next season's Europa League at least, although they could still qualify for the Champions League via their league position.\nThey cruised through the league phase, winning all six matches, scoring 26 goals and only conceding five and were able to do that without England midfielder Cole Palmer, who was left out of the squad for that part of the competition to manage his workload.\nMaresca has been able to give his squad members game time in this tournament and named teenage forward Shumaira Mheuka in the starting 11 as the England Under-19 international, at 17 years 137 days, became Chelsea's youngest player to start a match in major European competition.\nHowever, he was ineffective and part of a Maresca triple substitution at half-time, before his side instantly scored in the second half.\nCopenhagen, top of the Danish Superliga, were playing their 15th match of the competition after they began in the second qualifying round in July. They have beaten Scottish duo Kilmarnock and Hearts along the way and edged past German side Heidenheim after extra time of their play-off last month, winning 4-3 on aggregate.\nThere was a fine atmosphere at the Parken Stadium, but the action on the pitch initially disappointed in an uninspiring first half.\nCopenhagen had the only shot on target, Elias Achouri's low shot which was easily saved by Sanchez after only four minutes.\nPalmer, now without a goal in eight matches, volleyed wide from 22 yards, and a George header was well off target in Chelsea's only notable first-half attempts.\nThe action had to improve, and it did with a much better second half as Chelsea now only need a draw in the second leg at home to finish off the job in seven days' time.", "url": "https://www.bbc.co.uk/sport/football/live/cvg1nyp11lkt"}