{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:14:56", "date_modify": "2025-05-19 15:14:56", "date_publish": "2017-07-04 13:59:15", "description": "Scot Eilidh Doyle says the form of her 400m hurdles rivals means the World Championships will be one of the toughest ever.", "filename": "sport_athletics_40496990_1747667696.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15248/production/_96800668_gettyimages-805606430.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40496990_1747667696.html", "title": "IAAF 2017 World Championships: Eilidh Doyle will treat every race like final in London", "title_page": "IAAF 2017 World Championships: Eilidh Doyle will treat every race like final in London - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eilidh Doyle says she will have to be at her best in every heat to have a chance of reaching the 400m hurdles final at the 2017 World Championships.\nThe Scot qualified for the London event by winning the 400m hurdles at the British trials on Sunday in Birmingham.\nBut she knows the form of her rivals, particularly from the USA, will make the event one of the hardest ever.\n\"I'll have to run every race like it's a final and hopefully that'll be enough to sneak into that final,\" Doyle said.\n\"It's going to be really tough this year. The hurdles is really packed.\n\"We saw the Americans had the fastest 400m hurdles race in history at their championships, so it's going to be really hard.\"\nThat final at the US Championships on 25 June set a stunning marker ahead of the World Championships in August.\nDoyle is, however, hoping the upcoming Diamond League meeting, and the Anniversary Games, will be the perfect preparation to take on the impressive Americans in August.\n\"The good thing about the next couple of weeks is I'll be racing these girls, so I'll get the chance to put myself alongside them and, hopefully, it'll put me in the best position come the worlds,\" said the 30-year-old, who will be competing at her fifth World Championships.\nA former European champion and Commonwealth Games silver medallist, Doyle's best performance at the worlds came in 2013, when she finished fifth.\nBut she is hoping a home track and her years of experience will pay dividends in August.\n\"It's really exciting to be going to my fifth world championships,\" she said. \"Each one you're at a different stage of your career, a different stage of fitness, so for me this is such an honour.\n\"My first was back in 2009, so it's nice to be in shape and to get selected.\n\"It's nice to look back, see where you were then and see where you are now.\n\"Even London 2012 (Olympic Games), I feel like I've come on so much since then, so to be able to go back to that stadium and have those memories of what London was like, but to be in a completely different position and be running faster and be more experienced, it's really good for my confidence going forward.\n\"We've been so lucky in the last few years, having a home Olympics, I had a home Commonwealth Games, there's a home world indoors next year and there is just so much going on.\n\"Our generation have been so lucky to have that and I don't think people realise just how much a home crowd helps.\n\"You go out in the stadium and you can hear people shouting for you. It just gives you the extra support.\n\"To now have the opportunity to go back there to that same, iconic stadium and compete at a home world championships is just amazing.\"", "url": "https://www.bbc.com/sport/athletics/40496990"}