{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:50", "date_modify": "2025-05-21 04:18:50", "date_publish": "2025-04-05 16:18:45", "description": "Jersey Bulls are denied the chance to go clear at the top of Combined Counties Premier South after drawing 1-1 at second-placed Redhill.", "filename": "sport_football_articles_cy0x9ezr2z4o_1747801130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4cda/live/fde83210-1228-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0x9ezr2z4o_1747801130.html", "title": "Jersey Bulls concede late on to draw 1-1 at Redhill at the top of table", "title_page": "Jersey Bulls concede late on to draw 1-1 at Redhill at the top of table - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey Bulls were denied the chance to go three points clear at the top of Combined Counties Premier South after drawing 1-1 at second-placed Redhill in a fiery encounter.\nThe hosts played the second half with 10 men and levelled moments after Luke Campbell had put the islanders in front late on.\nIn a tight first-half Miguel Carvalho fired into the side netting after 26 minutes for Bulls before Euan van der Vliet pulled off a superb save soon after as Redhill tried to go ahead.\nTensions had been strained for much of the first half and threatened to boil over shortly before half-time as Bulls striker Lorne Bickley was brought down and players from both sides came together.\nThe hosts had early substitute Sean Swift sent off for a second booking in the fourth of 17 minutes of first-half stoppage time, after a foul on Fraser Barlow before the islanders had an effort deflected wide soon after.\nWith the extra man Bulls created more chances as Luke Watson had a header saved by Luke Roberts, before the Redhill keeper superbly kept out a Joe Kilshaw effort with seven minutes to go.\nBut two minutes later an unmarked Campbell put the islanders in front with a back post header from a corner.\nSeb Tauta-Caballero then equalised in the first minute of stoppage time as he reacted quickest to tap in after Van der Vliet could not hold a Redhill shot.\nThe result leaves the two sides tied on 90 points, although Bulls have a game in hand with third-placed Whyteleafe four points off them.\nRedhill travel to Jersey in a week's time for a game which could prove decisive in where the title will end up.\n\"It's a weird one, because obviously a point in terms of the league table is a really positive result,\" Jersey Bulls manager Elliot Powell told BBC Radio Jersey.\n\"But it's just a bit of a sickener not to have won it.\n\"I thought we did the running in the second half, obviously they're down to 10 and they were going to tire, but when we went 1-0 up it was disappointing that we haven't seen that game out.\n\"It was a great save from Euan and it's just fallen straight back to his feet and he's slammed it in.\n\"I'm disappointed with it, but in the grand scheme of things it's a decent point and sets us up well for next week.\"", "url": "https://www.bbc.com/sport/football/articles/cy0x9ezr2z4o"}