{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:31", "date_modify": "2025-05-21 06:05:31", "date_publish": "2025-01-14 09:47:44", "description": "Italian world number four Jasmine Paolini discusses the renaissance of tennis back home in her first column for BBC Sport at the Australian Open.", "filename": "sport_tennis_articles_c93lplv91pjo_1747807531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/44f8/live/0bfd4f00-d086-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c93lplv91pjo_1747807531.html", "title": "Australian Open 2025: Jasmine Paolini on Italy's tennis boom, Jannik Sinner and Olympic gold", "title_page": "Australian Open 2025: Jasmine Paolini on Italy's tennis boom, Jannik Sinner and Olympic gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When I was a child, tennis was nowhere near as big in Italy as it is now.\nFootball has always been the number one sport in our country - people live for it.\nNow tennis is not far behind catching up with football in popularity.\nThe amount of attention I received started to increase a lot after I reached the French Open singles final last year and again after I did the same at Wimbledon.\nBut I felt the biggest difference after I won a gold medal for Italy in the Olympic doubles.\nIt was crazy when I returned to Italy after Paris. The attention meant I couldn't go out! No, I'm joking with you, but it was intense.\nSo many people were coming up and saying something about the gold medal when I was out in the street.\nI felt it was not just tennis fans who were recognising me now.\nWhen I reached the Roland Garros and Wimbledon finals, it was more tennis fans who were stopping me for a picture, but the gold medal was something more global.\nI haven't needed to hire a security guard yet, though!\nSometime people shake my hand or sometimes they hug me and say \"please, I want to give you a kiss\".\nOlder women in their 60s and 70s, they're the ones who come up and say they love me.\nIt felt a bit strange at first, but I'm trying to enjoy it because I see it as a positive thing.\nI understand because when you see people on TV or social media you feel like you know them - but they don't know you.\nSometimes I will choose a different restaurant instead of another, somewhere where I think people won't recognise me as much.\nBut I'm not in Italy often so it is nice to go back and feel the appreciation of the people.\nI always try to smile and embrace it. It's nice people love you.\nAt the same time we also saw Matteo Berrettini doing great things, including reaching the 2021 Wimbledon final, and then came Jannik.\nIt is a mix of all these things which makes tennis more popular in Italy like never before.\nI also saw in the newspaper article that the number of children joining tennis clubs rose by 30% last year - that's incredible.\nI don't feel like I'm a role model to children, but it is really sweet when some little girls come up to me and say 'you're my idol'.\nWhether it is young children or kissing nonnas, I hope I can give them more reasons to celebrate in 2025.\nJasmine Paolini was speaking to BBC Sport's Jonathan Jurejko at Melbourne Park.", "url": "https://www.bbc.com/sport/tennis/articles/c93lplv91pjo"}