{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 06:11:13", "date_modify": "2025-05-21 06:11:13", "date_publish": "2025-02-08 14:22:53", "description": "Ireland wing Mack Hansen is ruled out of Sunday's Six Nations game against Scotland at Murrayfield because of a hamstring injury.", "filename": "sport_rugby-union_articles_cp82lyx87dno_1747807873.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0083/live/b1cdeaf0-e627-11ef-a00c-b940b4c70dcc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cp82lyx87dno_1747807873.html", "title": "Six Nations 2025: Injured Ireland wing Mack Hansen ruled out of Scotland game", "title_page": "Six Nations 2025: Injured Ireland wing Mack Hansen ruled out of Scotland game  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland wing Mack Hansen has been ruled out of Sunday's Six Nations game against Scotland at Murrayfield because of a hamstring injury.\nThe Connacht back missed training on Saturday and will be replaced on the right wing by Munster's Calvin Nash.\nHansen was an injury doubt earlier this week after cutting his knee in the win over England before being passed fit, but is unavailable because of \"hamstring tightness\".\n\"Not at all really,\" Ireland captain Caelan Doris said when asked if it upsets the team's rhythm on the eve of the game.\n\"It's disappointing for Mack obviously. He's been integral to what we've been about over recent years but I think he's made the right call.\n\"There's a lot of trust in Calvin in how he's been when he's been with us over the last number of years and also with how he's played for Munster this year, so I think it'll be a seamless transition.\"\nIreland will hope the Australia-born 26-year-old, who missed last year's Six Nations because of a shoulder problem, will regain fitness in time for Ireland's trip to Wales on 22 February.\nIreland interim boss Simon Easterby was already without prop Tadhg Furlong and lock Joe McCarthy for Sunday's game.\nNash, 27, started all five of last year's championship games - scoring tries against France and Italy - as well as both Tests against South Africa last summer.\nHe made his Ireland debut in a 2023 World Cup warm-up game against Italy and started for the first time in last year's Six Nations win over France in Marseille.", "url": "https://www.bbc.com/sport/rugby-union/articles/cp82lyx87dno"}