{"authors": ["Iwan Blakeway", "www.facebook.com"], "date_download": "2025-05-21 06:45:47", "date_modify": "2025-05-21 06:45:47", "date_publish": "2025-03-30 16:19:25", "description": "Leaders Hull KR thrash Huddersfield Giants 50-4 to maintain their 100% Super League record with a sixth win out of six this season.", "filename": "sport_rugby-league_articles_czrvg17n8dlo_1747809947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b99d/live/31a526c0-0d7f-11f0-a1c5-cd0d1898b025.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_czrvg17n8dlo_1747809947.html", "title": "Super League: Huddersfield Giants 4-50 Hull KR", "title_page": "Super League: Huddersfield Giants 4-50 Hull KR - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikey Lewis scored a hat-trick as Super League leaders Hull KR notched nine tries in an emphatic victory over struggling Huddersfield Giants.\nLewis bounced a tackle to free Oliver Gildart to open the scoring in the sixth minute but Rovers' lead was quickly cut by a superb try by George Flanagan Jr from deep.\nThe Robins responded soon after, though, with Lewis crossing for the hosts' second score before gaining 70 metres to set up recent signing Arthur Mourgue to score his first try for the club.\nRovers failed to let up in the second half as they dotted down six further tries without reply, with Lewis completing his treble and Jai Whitbread, Jez Litten, Sauaso Sue and Tom Davies also scoring tries.\nThe thrashing maintains Hull KR's 100% win record after six games and moves them three points clear at the top while bottom side Huddersfield suffered a sixth straight defeat.\nIt was always going to be a tough order for Huddersfield to end their poor start to the season against the table-toppers.\nBut if there was ever as big a reminder for Huddersfield's player-turned-coach Luke Robinson of the huge task he faces, then it was this battering by Rovers and stand-off Lewis.\nThe England international had a field day at the John Smith's Stadium, playing a key role in seven of the nine tries, the first of which came as he rose from a tackle and freed his arm under pressure, tip-passing in centre Gildart to begin the drubbing.\nLewis' only blemish was failing to grab hold of the dummying Flanagan Jr for Giants to score their sole try of the afternoon.\nThe 23-year-old soon made amends, stepping inside the Giants half-back and showing his strength to ground the ball despite being spun around by Irish prop Harry Rushton.\nLewis then surged from deep for Peta Hiku to assist Mourgue's maiden try in Rovers colours a couple of plays later.\nAfter the interval, former Wakefield Trinity forward Whitbread crashed over from 10 yards, again thanks to Lewis, who produced a brilliant initial sidestep to break the line.\nJust a few minutes later, the Lewis show continued as he kept his arm free from three defenders to free England colleague Litten to score the Robins' fifth.\nLewis got his second with under 20 minutes to go, finishing off a deep, darting run from Frenchman Mourgue, not long after Sue had got his name on the scoresheet.\nHull's number six finally got the hat-trick he was hunting for in the final 10 minutes. Gildart's big line break and assist returned the favour to his team-mate.\nTo round matters off, Robins winger Davies' catch and try from Tyrone May's grubber kick meant Rovers left West Yorkshire with 50 points on the scoreboard.\nHull KR head coach Willie Peters told BBC Radio Humberside:\n\"I thought the second half was good. The first half we weren't overly happy with and the boys identified that at half-time.\n\"Little things that were off, things that we value, we weren't fully engaged in but then I thought the second half we adapted really well.\n\"We wanted to move the ball more in attack and tidy things up defensively and I thought they did that very well.\n\"I don't think the scoreboard reflected the game. We ran away with it in the back end and that's a really good sign for us to be able to get through tough periods and then score some points late but I don't think Huddersfield were that bad at all.\"\nHuddersfield Giants head coach Luke Robinson told BBC Radio Leeds:\n\"It was a baptism of fire for young George (Flanagan Jr) and not only him but we could not tackle Mikey Lewis.\n\"I had the pleasure of coaching him for one or two games at Yorkshire under-18s and I knew how much of a talent he was then.\n\"He's an unbelievable player but I thought our right edge in particular really struggled with him and Tanginoa when he came on as well.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/czrvg17n8dlo"}