{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:45:41", "date_modify": "2025-04-26 06:45:41", "date_publish": "2025-03-01 15:01:17", "description": "Crystal Palace 3-1 Millwall: What Oliver Glasner said", "filename": "sport_football_articles_c0rz599eyd1o_1745649941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7191/live/005d1d30-f69f-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rz599eyd1o_1745649941.html", "title": "Crystal Palace 3-1 Millwall: What Oliver Glasner said", "title_page": "Crystal Palace 3-1 Millwall: What Oliver Glasner said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace boss Oliver Glasner has provided an update on Jean-Philippe Mateta to BBC Sport: \"He is conscious and he is in hospital. His ear looks terrible. It's a very serious injury so we hope all the best for him. We are not really happy. We can't be really happy. Of course it's a great win and we are into the quarter-finals, but when you lose a player, especially with a foul like this, you have two different feelings in your stomach.\"\n\"Honestly, I didn't want to see it. I just watched it and it's terrible. I'm sure the goalkeeper didn't want to injure JP in this situation, no player wants this. But if you get to the ball with this intensity, with the foot at this height, you cannot do that. It's so dangerous and we all have responsibilities for our health.\n\"I don't want to blame him, but it is a terrible foul. I didn't see it in the game, it was so quick. I could see the goalkeeper had a lot of intensity, but he touched the ball first. I have seen it now in slow motion, and it is worse.\"\nOn his players' reaction after the incident: \"The players did well until the 55th minute in the first half. We controlled the game, the lead was 2-0, we unnecessarily gave them the ball before half-time and then all of a sudden it was 2-1.\n\"They got their belief back. The second half wasn't the best half, we didn't create a lot of chances but Eddie [Nketiah] decided the game. It was an amazing header.\n\"It is tough to talk about game because I have this clip [of the challenge on Mateta] in my mind.\n\"We are going to quarter-finals in the FA Cup, a great achievement. Fingers crossed and hoping all the best for JP.\"\nOn Eddie Nketiah's performance: \"He needs to get back into the rhythm. You need this rhythm in competitive games to keep going, stay in the game and wait as a striker. They played a deep block so he had to wait and then he decided the game for us.\"\nOn whether Crystal Palace can win the FA Cup: \"It is about winning the quarter-final. The draw is tomorrow, let's see what team we will face.\n\"At the moment, we are just waiting good news for JP. Hopefully he is back then.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c0rz599eyd1o"}