{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:53:24", "date_modify": "2025-05-20 12:53:24", "date_publish": "2023-08-03 09:46:37", "description": "Luton Town: Rob Edwards says Wolves draw 'a nice taste of things to come'", "filename": "sport_articles_cxepdxkknnpo_1747745604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6cf6/live/62e171f0-31ce-11ee-8889-77f87eec9f94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cxepdxkknnpo_1747745604.html", "title": "Luton Town: Rob Edwards says Wolves draw 'a nice taste of things to come'", "title_page": "Luton Town: Rob Edwards says Wolves draw 'a nice taste of things to come' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town manager Rob Edwards was happy with his team's performance in their 0-0 friendly draw at Wolves on Wednesday, adding that \"it was a nice taste of things to come\" for the Premier League newcomers.\nHe told the club's media team: \"Overall, it was a really good night for the club.\n\"It was a good run out against Premier League opposition with no injuries and more minutes for a lot of the group, which is good.\n\"We found areas that we can keep improving at, but also can come away from it with some confidence too.\n\"We've got new players who we are building up. Some haven’t had 90 minutes yet, so we will continue to work on the shape.\n\"You can see there is an organised team there, we need to make sure we’re still aggressive in that shape too - we don’t ever want to be passive.\n\"It was a nice taste of what's to come.\"\nEdwards added that he is positive about Luton's summer transfer window as they prepare for their top-flight return.\n\"I think we’ve done and are doing well in the market. I'm really pleased with the lads we’ve got so far and there's more to come, which is great,\" he said.\n\"The core group have also been great - the lads are stepping up, they're fit, energised and ready to play.\"", "url": "https://www.bbc.com/sport/articles/cxepdxkknnpo"}