{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 05:22:41", "date_modify": "2025-05-21 05:22:41", "date_publish": "2025-01-14 15:26:35", "description": "Jurgen Klopp says he has made a \"clear commitment\" that he will not become manager at one of the Red Bull clubs after starting his role as the organisation's head of global soccer.", "filename": "sport_football_articles_c0rqgyg5lgpo_1747804961.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d891/live/ff5aada0-d289-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0rqgyg5lgpo_1747804961.html", "title": "Jurgen Klopp: Ex-Liverpool manager will not coach Red Bull teams in new role", "title_page": "Jurgen Klopp: Ex-Liverpool manager will not coach Red Bull teams in new role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jurgen Klopp says he has made a \"clear commitment\" that he will not become manager at one of the Red Bull clubs after starting his role as the organisation's head of global soccer.\nThe former Liverpool manager was named in the role last year before officially starting at the beginning of 2025.\nHe has not had a managerial role since leaving Anfield last summer following a highly-successful nine year spell.\nKlopp's new role sees him take more of an oversight role across a number of clubs including RB Leipzig, Red Bull Salzburg and New York Red Bulls.\nBut when asked at a media conference on Tuesday whether he might be tempted back into day-to-day management if a role at one of the clubs becomes available, Klopp emphatically said \"no\".\n\"I will not be the coach of a Red Bull team,\" he said. \"That is a clear commitment. As much as you can give a guarantee, I will not be a coach at all.\n\"I am probably the only person in this room who will be asked where are you in five years, I don't have a clue.\n\"But I will not be a replacement of one of the Red Bull coaches. I hope we can create a structure where these questions will not come up at all.\"\nKlopp previously managed Mainz and Borussia Dortmund in his native Germany before joining Liverpool in 2016.\nHe became a hero at Anfield, winning the Champions League in 2019 and the Premier League in 2020, as well as the the Club World Cup, FA Cup, League Cup, Super Cup and Community Shield.\nHis connection with Liverpool saw Klopp asked about the future of Mohamed Salah, who is out of contract with the Premier League leaders at the end of the season.\n\"I hope he stays,\" said Klopp. \"He is the biggest striker of modern times, a fantastic player and fantastic human being.\n\"An outstanding athlete in all departments, so I hope he stays at Liverpool.\"\nUnlike at Liverpool, Klopp will not be involved in day-to-day coaching operations in his new job but will act as advisor for the Red Bull-owned clubs in Germany, United States, Brazil, Japan and Austria, while also supporting the organisation's global scouting operation.\nHe will also contribute to the training and development of coaches, and said he wants to be a valuable asset rather than a token big name.\n\"It's pretty much what I wanted to do. I finished seven months ago at Liverpool. I did that consciously,\" he said.\n\"A few months after that the opportunity came up. I don't want to be a passenger or a prominent person in the room. I really want to put some value on it.\n\"I did not want to do that [be a manager] anymore. I wanted to get a new start and this is an opportunity. To add value. How it will look we will see. There is not one plan that works for all teams.\n\"We want to be the best we can be. In each department, in each club.\"", "url": "https://www.bbc.com/sport/football/articles/c0rqgyg5lgpo"}