{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:03:37", "date_modify": "2025-04-26 04:03:37", "date_publish": "2025-03-03 20:02:16", "description": "Unai Emery press conference: Club Brugge vs Aston Villa", "filename": "sport_football_articles_crmjk9jmkzro_1745640217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6296/live/dbade4a0-4907-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crmjk9jmkzro_1745640217.html", "title": "Unai Emery press conference: Club Brugge vs Aston Villa", "title_page": "Unai Emery press conference: Club Brugge vs Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Emery confirmed that Amadou Onana and Ross Barkley are not available, and Andre Garcia and Donyell Malen cannot play as they are \"not on the list\".\nHowever, Villa's defence gets a significant boost with Pau Torres, Tyrone Mings, Matty Cash and Boubacar Kamara all returning to the squad.\nEmery conceded Club Brugge \"deserved\" to beat Villa in the Champions League group stage in November because his side \"didn't compete like we want to do\". He is hopeful Villa will \"feel strong\" and \"compete better\" this time.\nOn if Villa can win the Champions League: \"I'm not thinking about it. I'm focusing on each match, each moment. It is not the end - it is the process.\"\nOn why European competitions bring out his qualities as a coach: \"Every experience I have had before has been very important, but the most important thing I can have now is with Aston Villa. My experiences can help a little bit but they are not really relevant. What is relevant is how we compete now and then it is to try to build a strong structure in the club, in the squad and on the field with 11 players playing how we want.\"\nHe did accept that Villa have held their own in the competition this season: \"We think we can be stronger and play against every team in Europe. Tomorrow is a key moment for the season, along with the second leg. We have play in a responsible way, with maturity and being emotionally strong.\"\nEmery says January signings Marco Asensio and Marcus Rashford have \"added players with experiences in Europe and in this competition\" that at this level \"will help us a lot\".\nHe is happy with how they have settled at Villa Park: \"The process they are doing is going well. They are getting better in how we want to use them in our structure [but] we are not going to get our objective only through individual players. We are going to get that objective collectively, building our structure to be as strong as possible, so individual players can use and explore their skills.\"", "url": "https://www.bbc.co.uk/sport/football/articles/crmjk9jmkzro"}