{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:57:45", "date_modify": "2025-05-20 13:57:45", "date_publish": "2023-07-31 05:46:21", "description": "Fulham: Marco Silva press conference after Chelsea defeat", "filename": "sport_articles_c9r11479qgvo_1747749465.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c9r11479qgvo_1747749465.html", "title": "Fulham: Marco Silva press conference after Chelsea defeat", "title_page": "Fulham: Marco Silva press conference after Chelsea defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reaction to defeat: \"Our first half was not up to our standards - it wasn't what we normally do. Not just because we conceded sloppy goals, but the way we started, our attack was not so clear. We lost complete control of the game in the first half. The second half was different and we were much more ourselves on the pitch. Overall, it was not a good day for us.\"\nOn Calvin Bassey's first 45 minutes since signing from Ajax: \"I wanted him to keep it simple and get some confidence, and he did. When he is more inside our team and gets to know his team-mates, he can show more things on the ball. Off the ball, he's a strong lad.\"\nTom Cairney came off injured and Silva says he will be analysed on Monday. He also said the shoulder injury suffered by Joao Palhinha increased their issue of a lack of midfielder.\nOn how much Fulham need to sign players: \"It’s really important. It will be crucial. It's a good tournament and competitive matches as well. It is much better when you have at least 80% of your squad to prepare. Next week will be important to integrate these two [Bassey and Raul Jimenez]. Let's hope we have more new faces in soon. We are really short. We cannot keep preparing with seven or eight kids in our sessions.", "url": "https://www.bbc.com/sport/articles/c9r11479qgvo"}