{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-05-21 07:52:55", "date_modify": "2025-05-21 07:52:55", "date_publish": "2025-01-13 15:49:58", "description": "Why Rangers fans are angry and what the club must do to placate their disillusioned supporters.", "filename": "sport_football_articles_cqldr56vgeko_1747813975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a169/live/58dacb20-d1be-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqldr56vgeko_1747813975.html", "title": "Rangers walkout: Why Ibrox fans are angry and what club must do", "title_page": "Rangers walkout: Why Ibrox fans are angry and what club must do - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Discontent has been the common noise surrounding Rangers and their supporters this season and it came to an unprecedented head on Sunday.\nA section of fans left their seats after just 55 minutes of the Scottish Premiership match against St Johnstone in order to demonstrate their unhappiness at events on and off the pitch.\nIt was a small minority of the crowd who left Ibrox, and their actions were booed by others who remained - but, nevertheless, it was a scene that could not be mistaken for a happy fan base.\nThe disaffected supporters were from the 'Union Bears', the group of fans who usually make the loudest noise inside Ibrox by singing and beating drums.\nOn Sunday they made life uncomfortable for their own board rather than the opposition, sitting largely in silence as they unfurled banners with some pointed messages:\n\"Fans gave all while you let our standards fall.\"\n\"Our loyalty is not a free pass for failure.\"\n\"Time for fans to force change.\"\nThen, as they had threatened, came the walkout. It took place on 55 minutes to signify the fact they believe the board \"gave up on Rangers\" after they won their 55th league title.\nRangers conceded a goal during the exit but still won 3-1. It is a victory that is not going to appease any of those who left, though, or indeed many of the fans who stayed given their side are 15 points behind Celtic in the table.\nThe board and manager Philippe Clement will take some heart from the fact most supporters ignored the protest, but they will know results need to improve - with their away form especially dismal.\nDuring a media briefing on Saturday, new chief executive Patrick Stewart did not try to paint a rosy picture. He spoke of the \"deeper issues\" that he hopes a \"deep-rooted review of the entire football department\" will address.\nThe review started on Monday, with an independent company overseeing the task - which will last between six weeks and three months.\nSo what might be the findings of the review be, and what do Rangers need to improve if the discontent is to end?\nFinances are the lifeblood of any football club or indeed any business - and Rangers made a loss of £17m last year.\nStewart admitted \"they are running at a loss\", much of which is the result of transfer fees.\nThe club has had support from shareholders, but the CEO says they \"can't continue to cover the losses\".\nThe club will continue to seek long-term investment, but ultimately wants to be financially self sustaining - and that means implementing a solid player-trading model.\nWhich brings us to...\nStewart talked about the club being previously focused on \"quick fixes\" in the transfer market and conceded that strategy cannot continue.\nRangers have had their fingers burnt with their recruitment, as the likes of Danilo, Cyriel Dessers, Sam Lammers and Ben Davies have arrived for significant outlay but failed to become key players.\nStewart admitted it was not viable to spend millions in this way and stated Rangers need to sign young, promising players who have the potential to improve, contribute then be sold on.\nHe also wants a Scottish core in the squad, working in tandem with some experience.\nIt sounds a potent mix and a sustainable model. The only problem? More or less every club in Europe is trying to do the same thing, and is therefore trying to unearth these unpolished diamonds.\nRangers have felt rudderless for much of this season, with former CEO James Bisgrove leaving Rangers back in May 2024 to take a role in the Middle East and John Bennett relinquishing the role of chairman on health grounds in mid-September.\nHowever, the boardroom is one area where change has already been witnessed.\nFraser Thornton has come in as the new chairman in place of John Gilligan, who took on the role in an interim basis after Bennett's departure and Stewart has now succeeded Bisgrove.\nIt is already clear Stewart has strong ideas about which direction he wants the club to go in, and he will surely lean on his experience from his long spell at Manchester United.\nAt the club's AGM, the possibility of including non-shareholders and non-executives on the board was announced. This is being viewed as a positive, allowing for a diversity of ideas when making decisions across the board.", "url": "https://www.bbc.com/sport/football/articles/cqldr56vgeko"}