{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:20:43", "date_modify": "2025-05-20 13:20:43", "date_publish": "2023-07-26 11:07:59", "description": "Wales scrum-half Ffion Lewis reveals her endometriosis was so severe it almost left her infertile.", "filename": "sport_rugby-union_66311992_1747747243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0BA5/production/_130518920_cdf_290423_ge_italy_women_v_wales_women_023.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66311992_1747747243.html", "title": "Ffion Lewis: Endometriosis a 'reality check' for Wales scrum-half", "title_page": "Ffion Lewis: Endometriosis a 'reality check' for Wales scrum-half - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales scrum-half Ffion Lewis has revealed her endometriosis was so severe it almost left her infertile.\nLewis was diagnosed with the condition after experiencing \"bad periods, bloat, back pain and severe fatigue\".\nEndometriosis sees tissue similar to the lining of the womb growing in other areas of the body, such as the ovaries.\nLewis shared on social media, external that had she not had surgery her chances of conceiving a baby \"were literally single figures\".\n\"My surgeon originally thought he may find a small amount under an ovary because they thought I was at the lower risk,\" the 27-year-old said.\n\"But his words post-surgery were that you were 'riddled with endo'.\n\"It was that bad (please appreciate this transparency) that I literally became infertile from having endometriosis.\n\"Luckily he was able to remove it all so it has hopefully been restored.\n\"But it got me thinking, I hadn't prioritised this as being that important... I nearly didn't have this done because I thought it could be a waste of time, but I knew it was affecting my performance.\n\"Imagine I came to it in time and finding out I can't have a baby?\"\nLewis chose to speak out to help raise awareness of the gynaecological condition, which can affect up to one in 10 women.\n\"As female athletes and women in general, we put so much pressure on ourselves to always be so brave and strong,\" said the 33-time capped international.\n\"I don't think we realise how mentally tough we are, but our female health is so important and it's been a real reality check for me.\n\"I didn't have a clue what endo [endometriosis] was until this year and I've been living with it since my teens. I just feel there's so much we deserve to be educated on especially if you're involved in sport.\"\nLewis has been a professional rugby player since January 2022 and admits to struggling to manage her symptoms during fitness sessions.\nShe said she experienced pain similar to labour contractions and would be \"uncomfortably ill\" afterwards.\n\"I always had this fear of being 'that' athlete that drops out during a hard session or being 'that' athlete that would make an excuse, so instead I would just grind through the pain and face the consequences later,\" Lewis said.", "url": "https://www.bbc.com/sport/rugby-union/66311992"}