{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:22:25", "date_modify": "2025-05-20 12:22:25", "date_publish": "2023-08-04 13:41:02", "description": "Reading sign free-agent former Swansea City midfielder Tivonge Rushesha and defender Harlee Dean from Birmingham City.", "filename": "sport_football_66409032_1747743745.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DA62/production/_130660955_shutterstock_editorial_13609759m.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66409032_1747743745.html", "title": "Tivonge Rushesha & Harlee Dean: Reading sign midfielder and defender", "title_page": "Tivonge Rushesha & Harlee Dean: Reading sign midfielder and defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reading have signed former Swansea City midfielder Tivonge Rushesha and defender Harlee Dean from Birmingham City.\nRushesha, a 21-year-old former Wales youth international, has agreed a one-year deal at the Royals with an option for an additional 12 months.\nThe free agent, who left the Swans earlier in the summer, had been on trial at Reading and had featured in a number of the club's pre-season friendlies.\nHis only first team game for Swansea came in an EFL Cup tie in 2019.\n\"Tivonge is a young man who has really impressed us during his trial, not just on the football pitch, but with his attitude,\" Reading's head of football operations Mark Bowen told the club website, external.\n\"He is extremely keen to learn, and always asks the right questions about how he can improve.\"\nDean joins on a two-year-deal having made 16 appearances for the Blues and scored one goal in the Championship last season.\nThe 32-year-old played in 200 games over six seasons for Birmingham and was named both supporters' and players' player of the year in 2020-21. He has been training with the Royals over the summer.\n\"Harlee brings many different qualities to Reading,\" Bowen added, external.\n\"He is another senior character and guiding voice in the dressing room, and he is a born leader with a track record of success.\n\"Most importantly, he is a hard-working, dependable footballer who loves the art of defending.\"\nThe financially troubled club had a transfer embargo lifted on Thursday.", "url": "https://www.bbc.com/sport/football/66409032"}