{"authors": ["Sam Davis", "www.facebook.com"], "date_download": "2025-05-21 06:13:44", "date_modify": "2025-05-21 06:13:44", "date_publish": "2025-04-01 11:46:54", "description": "Bournemouth news: Opinion - 'Even £50m for Dean Huijsen sounds like a bargain for any suitors'", "filename": "sport_football_articles_c5yg0my40dko_1747808024.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc65/live/63c552c0-b627-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yg0my40dko_1747808024.html", "title": "Opinion - 'Even £50m for Dean Huijsen sounds like a bargain for any suitors' - BBC Sport", "title_page": "Bournemouth news: Opinion - 'Even £50m for Dean Huijsen sounds like a bargain for any suitors' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What is the first thing I would do for the run-in if I was the manager of AFC Bournemouth? The simple answer would be - not much!\nWhile the recency bias of a league dip and cup exit suggests that \"disappointment\" should be the key emotion, it should not be forgotten that this is the best it has ever been as a Bournemouth fan, given the Cherries are only a couple of points off the club's best total in the top flight.\nAdd to that the fact that we have just equalled our best ever FA Cup campaign, it would be wild to change too much.\nAlthough it feels alien to us Bournemouth fans, the realistic aim for the run-in genuinely is a stab at getting European football.\nOne of the many key players this campaign has to be Dean Huijsen. The centre-back has been nothing short of a revelation and he is unsurprisingly now being linked to every big club around. Reports suggest he has a £50m release clause in his contract, meaning that any club who bids this amount would have the chance to talk with Huijsen, with little the club can do.\nHaving signed in the summer for about £15m, it would be a healthy profit for Bournemouth, but he has been that good - which suggests that in today's market, even £50m sounds like a bargain for any suitor.\nTherefore, the first thing I would do is demand that the club sort an improved contract for Huijsen, one which removes or changes the £50m release clause. There would be even better vibes around the place if that were to happen, and that may be the little lift to get Bournemouth over the line and ready to bring European football to the south coast.", "url": "https://www.bbc.com/sport/football/articles/c5yg0my40dko"}