{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 03:41:00", "date_modify": "2025-05-21 03:41:00", "date_publish": "2025-04-06 21:30:45", "description": "Stephen Bunting beats fellow Englishman Nathan Aspinall 8-5 to win the International Open in Germany - his first European Tour title.", "filename": "sport_darts_articles_cx2v530kl45o_1747798860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e9d/live/f3653f40-1322-11f0-9bc6-7b8c8db92747.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cx2v530kl45o_1747798860.html", "title": "International Open darts: Stephen Bunting beats Nathan Aspinall to win first European Tour title", "title_page": "International Open darts: Stephen Bunting beats Nathan Aspinall to win first European Tour title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stephen Bunting beat fellow Englishman Nathan Aspinall 8-5 to win the International Open in Germany - his first European Tour title.\nBunting had ended a run of eight match defeats in the Premier League on Thursday when he won night nine in Berlin.\nThe 39-year-old continued his impressive form on German soil with a confident display in Sunday's final at the Sachsen Arena in Riesa as he averaged 100.19 to Aspinall's 91.36.\nBunting raced into a 3-1 lead, but 33-year-old Aspinall got back on level terms with two bullseye finishes, including a 130 checkout.\nAspinall, who had been seeking back-to-back European Tour wins after he lifted the European Darts Trophy in Gottingen last month, was unable to achieve that aim as Bunting took charge of the contest.\nBunting, nicknamed 'Bullet', reeled off the next three legs and even though Aspinall remained in touch he was unable to wrestle back the momentum.\nEarlier, Bunting had claimed a thrilling 7-6 win Luke Humphries - his second win over the over world number one in a week - to reach the final.\nHumphries came from 4-1 down to draw level, but Bunting produced an 11-dart finish to take victory.\nNeither Luke Littler nor Michael van Gerwen took part in the tournament.", "url": "https://www.bbc.com/sport/darts/articles/cx2v530kl45o"}