{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:50:10", "date_modify": "2025-05-20 13:50:10", "date_publish": "2023-07-31 17:58:42", "description": "England come through a physical test to beat Tonga 72-46 and start the second pool phase of the Netball World Cup with an improved display.", "filename": "sport_netball_66365989_1747749010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F09F/production/_130599516_gettyimages-1566825887.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66365989_1747749010.html", "title": "Netball World Cup 2023: England beat Tonga 72-46 in second pool phase", "title_page": "Netball World Cup 2023: England beat Tonga 72-46 in second pool phase - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England came through a physical test to beat Tonga 72-46 and start the second pool phase of the Netball World Cup with an improved display in Cape Town.\nEngland made slow starts during their three wins in the first pool stage but against Tonga they moved quickly and with more cohesion through the court.\nMonday marked the start of the second pool phase, which will determine which teams qualify for the semi-finals.\n\"It was a pretty tough match,\" shooter Eleanor Cardwell told BBC Sport.\n\"We need to keep working on consistency, we're slowly getting there and we're building.\"\nEngland have yet to lose a quarter at this World Cup and after winning the first 19-13 they were particularly effective in the second after Helen Housby and Cardwell switched places at goal shooter and goal attack to take that 19-9.\nSearching for a first World Cup trophy, England's desire has not been in question at this tournament - never more evident than when Cardwell was so determined to keep the ball in court that she knocked a bin over in the process - but their movement through mid-court has been shakier.\nSome brilliant passages of play in the second quarter provided a glimpse of the potential of Jess Thirlby's side, with an energetic Imogen Allison making four intercepts despite her shoulder being heavily strapped after she took a knock in Sunday's match against Scotland.\nDefender Funmi Fadoju was equally impressive in dissecting the Tonga attack, recording nine gains as her rapid rise in the sport continues on the world stage.\nTonga, ranked seventh in the world, increased their tempo, restricting England to a 16-14 third quarter - thanks in large part to the defensive talents of Mo'onia Gerrard - but the world number three side then pulled clear in the fourth to win the Pool F encounter.\nEngland will next face Fiji on Tuesday (19:00 BST), with their toughest test to come on Thursday when they face 11-time world champions Australia.\nYou can watch all the World Cup matches across BBC TV, iPlayer and the BBC Sport website and app.\nMuch of the rhetoric around England has included words like \"building\" and \"improving\" but, with their final Pool F match against world number ones Australia looming, questions remain around whether England have improved enough to challenge them.\nYoung shooter Olivia Tchine has proved an effective option from the bench and combined well with London Pulse team-mates Jade Clarke and Chelsea Pitman, while Geva Mentor and Layla Guscoth provide a steady ship in defence.\nBut issues have come in consistency and former England captain Ama Agbeze, part of the BBC's punditry team, said England have been \"patchy\" and will need to work on being \"more clinical\".\n\"With Australia, you know what you are going to get, they are consistent, they are hard on the body, they put that pressure on. England need to be able to take that,\" said Agbeze, who led England to Commonwealth Games gold in 2018.\n\"At the moment, if they were playing Australia today, I don't that they would be capable.\"\nLike England, Australia and defending champions New Zealand have won all of their quarters but they have also posted bigger margins of victory in some of their matches.\nThe Roses have a rest day on Wednesday before that crucial match against the Diamonds and will look to use the time to recuperate from a gruelling schedule with five games in as many days but also to tidy up mistakes.\n\"Fortunately, they have time, they have two days to slowly get there,\" said Agbeze. \"I know that - from experience from being in the England squad myself - England need to build, they can't just switch it on.\n\"But Australia can turn it on in the blink of an eye, so it's just about whether England can build up in time to face them.\"", "url": "https://www.bbc.com/sport/netball/66365989"}