{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:59:32", "date_modify": "2025-05-21 06:59:32", "date_publish": "2025-03-29 08:52:40", "description": "England's Charley Hull is two shots behind American leader Lilia Vu following the second round of the Ford Championship in Arizona.", "filename": "sport_golf_articles_c8x4x224pljo_1747810772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6251/live/099c86e0-0c77-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c8x4x224pljo_1747810772.html", "title": "LPGA: Charley Hull two shots back in Ford Championship as Lilia Vu leads", "title_page": "LPGA: Charley Hull two shots back in Ford Championship as Lilia Vu leads - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ford Championship second-round leaderboard\n-14 L Vu (US); -12 C Hull (Eng), N Korda (US), NK Madsen (Den), A Thitikul (Tha); -10 S-Y Kim (Kor), I Yoon (Kor), A Furue (Jpn)\nSelected others: -9 L Ko (Aus); -4 L Maguire (Ire), L Thompson (US)\nFull leaderboard\nEngland's Charley Hull is two shots off the lead at the Ford Championship in Arizona after carding a three-under-par 69 in the second round.\nThe overnight leader slipped behind American Lilia Vu, who hit a 64 to move to 14 under for the tournament at the halfway stage.\nTwo-time champion Vu made eight birdies to catapult herself clear of the field, with compatriot Nelly Korda, Denmark's Nanna Koerstz Madsen and Thailand's Atthaya 'Jeeno' Thitikul alongside Hull on 12 under.\nHull followed up her opening 63 with four birdies and a single bogey as she struggled to keep pace with Vu in windy conditions.\n\"I felt like I played pretty solid out there today,\" she said. \"I holed some good putts, and I missed some that I probably should have holed, but it was a bit windy out there today.\n\"It was a little bit trickier on some of the holes, but I'm pretty happy with that and looking forward to the weekend.\"\nDefending champion and world number one Korda is well placed on her return from a six-week break, moving up into contention with a 65, while Thitikul equalled Vu's 64 to keep pace with the leaders.", "url": "https://www.bbc.com/sport/golf/articles/c8x4x224pljo"}