{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:31", "date_modify": "2025-05-21 05:49:31", "date_publish": "2025-04-02 10:53:08", "description": "BBC Radio Newcastle's Nick Barnes on Sunderland's reunion with old boss Tony Mowbray at the weekend.", "filename": "sport_football_articles_c39jn0kkr7wo_1747806571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8fe5/live/a7fa1a30-0fad-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c39jn0kkr7wo_1747806571.html", "title": "Sunderland: A Mowbray play-off victory would be 'poetic justice'", "title_page": "Sunderland: A Mowbray play-off victory would be 'poetic justice' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland met up with an old boss when they hosted Alex Neil's Millwall at the weekend and have now got yet another reunion on the cards - a trip to The Hawthorns to see Tony Mowbray's West Bromwich Albion on Saturday.\nBlack Cats commentator Nick Barnes has been giving his insight on both managers, from his \"spiky start\" with Neil to chats with \"remarkable\" Mowbray.\n\"Tony Mowbray is one of the nicest men in football you will ever meet,\" Barnes told BBC Radio Newcastle.\n\"He was honest, he was thoughtful and I know it got difficult for him towards the end of his time at Sunderland... and the dignity in which he dealt with that shows the mark of the man.\n\"Over the 22 years I've covered Sunderland, he is up there with one of the best to deal with.\"\nThe game on Saturday will be watched with keen eyes, though less for a glimpse of Mowbray but more for what both teams may expect should they face off again in the play-offs in May.\nHowever, Barnes is hoping it's not a match-up we will get to see come the end of the season.\n\"It's a difficult scenario, West Bromwich Albion and Sunderland in the play-offs, because I think there's a part of everybody who would love to see Tony get some poetic justice - but you don't want it at Sunderland's expense,\" he said.\n\"Most Sunderland fans would accept he was harshly dealt with and it wasn't handled particularly well.\n\"So this potential collision in the play-offs, it probably makes people like me more uncomfortable than Tony Mowbray, but it's certainly one that if one can avoid it, I'd like to avoid it.\"", "url": "https://www.bbc.com/sport/football/articles/c39jn0kkr7wo"}