{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:59:28", "date_modify": "2025-05-20 13:59:28", "date_publish": "2023-07-31 08:44:59", "description": "Scotland lose 76-37 against Australia but give the world number one-ranked side their toughest game of the Netball World Cup.", "filename": "sport_netball_66358534_1747749568.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/49DD/production/_130590981_sco.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66358534_1747749568.html", "title": "Netball World Cup 2023: Australia beat Scotland in Group F", "title_page": "Netball World Cup 2023: Australia beat Scotland in Group F - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland lost 76-37 against Australia in the Netball World Cup but gave the world's number one-ranked side their toughest game of the tournament.\nThe youthful Scots had notably inferior possession but made the 2019 World Cup finalists work hard for their points.\nThe Thistles were well organised and aggressive as they held Australia to their lowest score of the tournament.\nScotland face Tonga on Tuesday and Fiji two days later in their remaining Group F games in Cape Town, South Africa.\nClaire Maxwell's young side - including seven players under the age of 24 - were dominated in the opening two quarters, losing them 21-9 and then 22-8 as Australia capitalised on their superiority with 90% shooting accuracy.\nHowever the third quarter was much closer and while the Diamonds still prevailed 15-11 it was their lowest goals total in a quarter in the tournament.\nThe Thistles - who secured 43 turnovers in the game - continued to largely frustrate the Diamonds in the final quarter, which ended 18-9 to Australia, to round off a performance that will give Scotland confidence for their final games.\nAustralia have scored 101, 85 and 86 points in their previous games in the tournament and only Tonga, with 38, have scored more against the Diamonds.", "url": "https://www.bbc.com/sport/netball/66358534"}