{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 05:25:09", "date_modify": "2025-05-21 05:25:09", "date_publish": "2025-04-03 14:02:34", "description": "Ruud van Nistelrooy press conference: Leicester vs Newcastle preview", "filename": "sport_football_articles_c8jeynww3dwo_1747805109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b61/live/eb1c3f30-b0b9-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8jeynww3dwo_1747805109.html", "title": "Ruud van Nistelrooy press conference: Leicester vs Newcastle preview", "title_page": "Ruud van Nistelrooy press conference: Leicester vs Newcastle preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Van Nistelrooy confirmed he has no new injuries to contend with after Wednesday's defeat at Manchester City.\nHe is happy to have Riccardo Pereira back available: \"With the injuries that he's had we are careful with him. He had a hamstring injury after he came back already. Now he's back after only two days training. Monday is soon but he's someone we're very happy is available and can make an impact. But, as a starter, it's quite early.\"\nOn the remainder of the season: \"We have to get up. It's my responsibility to do my job the best I can for the last eight games. I don't look further on. It's hard enough to keep the spirits up and everyone together because it's not going well. We are a team and we stick together. If we do that we have a chance of results.\"\nWhen asked if the Foxes' financial statement on Wednesday could have impacted the team, Van Nistelrooy said: \"I don't see that relation. We are purely focused on the games and it's difficult enough to keep our spirits up in the space we are in. I don't think it was a distraction. Of course, the financial situation of the club is of influence for future strategies.\"\nOn how he is dealing with such a difficult run: \"It's something that I feel I want to go through with the team, the squad and the staff. Stay together and stay connected. Fight through this as people. We need to give everything every day to get out of this. It is not something I want to walk away from. I want to fight every day. We will fight until the end.\"\nOn the challenge posed by Newcastle: \"It's clear the momentum they are in. First trophy for 50 years so you can imagine what a milestone they achieved and how proud they made the fans. They are part of the history of Newcastle - that is a tremendous boost in confidence and belief.\"", "url": "https://www.bbc.com/sport/football/articles/c8jeynww3dwo"}