{"authors": ["Ben Ashton", "www.facebook.com"], "date_download": "2025-05-21 06:46:50", "date_modify": "2025-05-21 06:46:50", "date_publish": "2025-01-31 08:41:07", "description": "From Matt Grimes to Louie Barry, BBC Sport looks at some of the key talking points ahead of this weekend's EFL action.", "filename": "sport_football_articles_c8d9yp26l31o_1747810010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4538/live/3d6d2e20-df5e-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8d9yp26l31o_1747810010.html", "title": "EFL preview: A weekend of returns, wonderkids and derby delights", "title_page": "EFL preview: A weekend of returns, wonderkids and derby delights - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Transfer deadline day might be looming but there are important matters to tend to on the pitch before then.\nThe race for promotion and battle for survival across all three EFL divisions is hotting up and yet more twists and turns are inevitable.\nHere is a look at some of the biggest talking points before this weekend's action.\nCoventry City's Jamie Allen might have celebrated his birthday on Wednesday but it's his new midfield partner who will be in the limelight at the weekend.\nMatt Grimes has joined the Sky Blues from Swansea City after 10 years at the club. Coventry's first game after signing Grimes? Swansea away, of course.\nWhether Grimes features in Frank Lampard's side straight away remains to be seen, but it's bound to be an emotional return for the 29-year-old.\nBristol City boss Liam Manning will also pay a visit to a former club when the Robins travel to Oxford United on Saturday lunchtime - but says he is fully focused on picking up three points to boost his side's play-off bid.\n\"Obviously I spent a period of time there and I had some good memories,\" Manning told BBC Radio Bristol.\n\"I'm all-in here and look forward to taking this group of players there to try and win.\"\nThe U's are unbeaten in their past eight games (W5 D3) since Gary Rowett took over from Des Buckingham as head coach, winning four in a row at home, and will be looking to continue their impressive climb away from the bottom three.\nAnother return, of sorts, sees a rivalry rekindled as Milutin Osmajic comes up against Owen Beck again as Blackburn Rovers welcome Preston North End in a Lancashire derby.\nLilywhites striker Osmajic was banned for eight games for biting defender Beck during the melee that followed the Liverpool loanee's late sending off in the goalless draw at Deepdale in September.\nThe return fixture at Ewood Park on Friday night promises to be an intriguing clash with Rovers' play-off bid stuttering after just one win in their past nine (D2 L6), while 15th-placed Preston have won two in a row, losing just once in their previous seven (W4 D2).\nHull City will feel they have pulled off a major coup by signing Louie Barry on loan from Aston Villa until the end of the season and he could make his Tigers debut on Saturday.\nThe 21-year-old was in blistering form during the first half of the season with League One side Stockport County, scoring 15 goals and providing three assists in 23 appearances.\nHull welcome Stoke City, who have a young starlet of their own in the shape of 19-year-old goal machine Nathan Lowe.\nLowe netted 15 goals and assisted five times in 22 games while on loan at League Two leaders Walsall, as well as scoring nine minutes into his return to the Potters in a 1-1 draw at West Bromwich Albion two weeks ago.\nWill either of these wonderkids steal the show at MKM Stadium?\nSomething strange happened across the EFL last weekend - none of the top four won… in any of the three divisions.\nIn the Championship, Sheffield United were surprisingly beaten 3-0 by relegation battlers Hull City at Bramall Lane before Sunderland were held to a 2-2 draw by bottom side Plymouth. Burnley and Leeds United's meeting at Turf Moor then ended goalless.\nWest Bromwich Albion were the only side in the top seven to capitalise, thrashing Portsmouth 5-1 to move up to fifth, but the Baggies still remain 11 points behind Sunderland in fourth.\nIt means the top four are still scrapping it out for the two automatic promotion spots, but there are at least six teams well in the mix for a top-six finish.\nOnly seven points separate Middlesbrough in sixth from Preston in 15th, so predicting who will make the play-offs is still anyone's guess.\nLeague One's Hollywood derby ended all square between Wrexham and Birmingham City on 23 January, while Wycombe drew 0-0 with Northampton and Huddersfield lost 1-0 at home to Bolton two days later.\nBirmingham and Wycombe did recover to pick up wins in the midweek fixtures that followed, with Blues winning 1-0 at the Terriers and the Chairboys beating Barnsley 2-1, but Wrexham lost 3-2 at home to Stevenage.\nThe standout fixture this weekend is perhaps Stockport's trip to a resurgent Leyton Orient as two of the chasing pack go head to head.\nCounty have won three on the bounce, while the O's are unbeaten in their past 11 (W9 D2) - a run which has seen them climb from 21st in late November to sixth.\nLeague Two leaders Walsall saw their nine-game winning run - and 16-match unbeaten streak - ended by Bradford with a 3-0 defeat at Valley Parade last weekend.\nCrewe, who were second before last Saturday's games, lost 1-0 at home to Accrington, while Port Vale and AFC Wimbledon drew with Chesterfield and MK Dons respectively.\nFollowing the midweek fixtures, only Walsall have retained their place in the top four, but it's still incredibly tight in the race for automatic promotion and the play-off spots.\nEven the Saddlers have had a wobble of late, losing again at Fleetwood on Tuesday, meaning their 12-point gap at the top has been cut to nine by Doncaster Rovers, who have now won three on the bounce.\nIt's still a pretty hefty advantage, although Mat Sadler's side will want to get things back on track when they host Salford City, while in-form Bradford City welcome fellow promotion challengers AFC Wimbledon in the pick of the games on Saturday.\nThe EFL weekend will end in some style on Monday night as Middlesbrough welcome Sunderland to the Riverside for the Tees-Wear derby.\nBoro, who have won just three of their past 11 games (D5 L3), are aiming to strengthen their grip on a play-off spot.\nMeanwhile, the Black Cats have lost only one of their past 11 (W6 D4) and need to keep pace with Leeds, Sheffield United and Burnley at the top.\nChris Rigg scored the only goal of the game against Boro when they met at the Stadium of Light in September.\nIt's always a grand occasion and this derby day could be one of the biggest between the two in recent years, given what's at stake.", "url": "https://www.bbc.com/sport/football/articles/c8d9yp26l31o"}