{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:19:56", "date_modify": "2025-05-21 05:19:56", "date_publish": "2025-04-03 20:50:53", "description": "Cardiff City: Grieving Andy Rinomhota back for QPR trip", "filename": "sport_football_articles_cwy71zz25g4o_1747804796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/85a7/live/69401880-10a2-11f0-9aa4-254a91e4e856.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy71zz25g4o_1747804796.html", "title": "Cardiff City: Grieving Andy Rinomhota back for QPR trip", "title_page": "Cardiff City: Grieving Andy Rinomhota back for QPR trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andy Rinomhota is available for Cardiff City's trip to Queens Park Rangers on Saturday after returning to training following the death of his brother.\nRinomhota paid an emotional tribute earlier this week following reports that 30-year-old Joseph Itai Rinomhota died after receiving a kick to the ribs during a Muay Thai boxing match on the island of Koh Samui, Thailand.\nZimbabwe international Rinomhota, 27, missed Cardiff's draw with Sheffield Wednesday last weekend having only returned from international duty a day earlier.\nBut the midfielder or right-back could feature against QPR having been training this week.\n\"He didn't get back until Friday so he was a bit tired after playing two games. So we spoke with him and decided we'd let him rest [against Sheffield Wednesday],\" said Cardiff manager Omer Riza, whose father Josh died in January.\n\"Obviously since then the devastating news regarding his brother happened after. He's been with his family and back in today [Thursday] training.\n\"He's come in, like myself coming back after something like this not so long ago, and the only thing we can do is comfort him and be there for him for whatever he needs.\n\"At the moment, he's trained and sometimes it's good to be around your team-mates and the people you spend time with, take your mind off things to a certain extent. He'll train and we'll look at what's happening on Saturday.\"\nRiza also gave an update on Cardiff's other team news issues for the weekend.\n\"Perry Ng won't be available. He's picked up a slight problem,\" he said.\n\"Callum Robinson will be back in the squad, Chris Willock will be back in the squad.\n\"Anwar El Ghazi hurt his back and was unavailable today [Thursday, for training]. Joe Ralls and Rambo [Aaron Ramsey] are long-term injuries and still out.\"", "url": "https://www.bbc.com/sport/football/articles/cwy71zz25g4o"}