{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:37", "date_modify": "2025-05-20 12:23:37", "date_publish": "2023-08-04 14:37:50", "description": "Gareth Southgate understands why Jordan Henderson has been criticised by LGBTQ+ campaigners for his move to Saudi Arabia.", "filename": "sport_football_66409012_1747743817.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1617F/production/_130659409_southgatehendon.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66409012_1747743817.html", "title": "Jordan Henderson: Gareth Southgate understands criticism of England player's Saudi move", "title_page": "Jordan Henderson: Gareth Southgate understands criticism of England player's Saudi move - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gareth Southgate says he can understand why Jordan Henderson has been criticised by LGBTQ+ rights campaigners for his move to Saudi Arabia.\nHowever, the England manager feels Henderson, 33, can still be an ally to the community after signing for Al-Ettifaq in July.\nThe former Liverpool captain joined the Saudi Pro League club in a deal worth £12m plus add-ons.\n\"I think it's very complicated,\" Southgate told Talksport.\n\"It's not for me to judge any individual whether they're in football or in any other industry.\n\"I don't think he's changing his view on what he believes in. So now we're in a really complex world where, what are we saying, nobody should go to Newcastle?\n\"Should nobody work for companies that the Saudis own in London or should nobody buy oil from the Saudis?\"\nHenderson has been a long-time supporter of LGBTQ+ rights and wrote about Stonewall's Rainbow Laces campaign in a Liverpool matchday programme two years ago.\nSame-sex sexual activity is illegal in Saudi Arabia, with the death penalty a possible punishment.\nPride in Football, a network of UK LGBT+ fan groups, said the midfielder had \"lost the respect of so many people who valued and trusted\" him.\n\"I completely understand the argument of, you know, you've supported the LGBTQ community and I can understand why they would have a really strong view on it,\" said Southgate.\n\"I think it's so difficult to say, you know, is Henderson saying he doesn't support that community any more? Well no, he isn't, but of course people are going to say his actions are the reverse of that.\"\nHenderson made his England debut in 2010 and has made 77 appearances for his country, scoring three goals.\nQuestions have been asked about whether playing in the Middle East will affect Henderson's place in the international squad and if he could be omitted - something the player asked Southgate about.\n\"We would be stupid to do that,\" said Southgate. \"Why would we rule anyone out based on where they are playing? We have got to see how they are playing.\n\"We have an idea of what that league will look like, but we won't know until we actually start to see the games.\"\nHowever, Southgate said the Premier League and Champions League would still be the \"easiest assessment for the level\" at which Henderson is playing.", "url": "https://www.bbc.com/sport/football/66409012"}