{"authors": ["Will Faulks", "www.facebook.com"], "date_download": "2025-05-21 06:06:15", "date_modify": "2025-05-21 06:06:15", "date_publish": "2024-12-24 15:36:42", "description": "Chelsea news: Opinion - My moment of the year", "filename": "sport_football_articles_cj90ywklvjdo_1747807575.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e6b/live/e7ef49b0-b628-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj90ywklvjdo_1747807575.html", "title": "My moment of the year", "title_page": "Chelsea news: Opinion - My moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been a great year for Chelsea all told - Mauricio Pochettino ended his one season in charge with a strong run, and Enzo Maresca has had a brilliant start to his time since taking over in the summer.\nIt is hard to boil the success down to one moment, but the 6-0 destruction of Everton at Stamford Bridge in April would take some beating in terms of pure enjoyment and catharsis.\nAt the tail end of a largely frustrating campaign, full of games where the team created chances but did not finish them, things clicked into place in a potent display under the lights at home.\nNicolas Jackson had turned the corner at this point, and the improvement which has seen him become one of the best strikers in the league since then was already under way.\nHe and his team-mates in attack took out nine months of frustration in 90 minutes.\nCole Palmer scored four goals in the game - his second such haul of the season. At this point, there were no doubts left that he was something special. But the first goal he scored just crystallised how brilliant and unique a talent the fans were witnessing.\nA slick team move out from the back concluded with Palmer and Jackson exchanging flicks on the edge of the Everton box. After a slick nutmeg got the crowd on its feet, the languid, first-time finish that Palmer curled into the side netting had them jumping for joy.\nA stadium that had been starved of entertainment and optimism for long periods of the preceding couple of years felt like it was finding its love of the game again.\nAnd, despite some big setbacks shortly afterwards, the progress since that day in April has been pretty remarkable.", "url": "https://www.bbc.com/sport/football/articles/cj90ywklvjdo"}