{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:27", "date_modify": "2025-05-21 04:40:27", "date_publish": "2025-04-03 09:31:47", "description": "After posting record financial figures, Luton Town directors admit the club \"might have reinforced more\" last season.", "filename": "sport_football_articles_cjew0px2ey5o_1747802427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ad1/live/1c405dc0-106f-11f0-b72e-6314f702e779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjew0px2ey5o_1747802427.html", "title": "Luton Town 'might have reinforced more in hindsight' last season", "title_page": "Luton Town 'might have reinforced more in hindsight' last season  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town \"might have reinforced more\" last season to try and avoid relegation from the Premier League, the club has admitted.\nThe Hatters published their financial results for the year ending 30 June, 2024, external on Wednesday night, revealing record turnover and profits as a result of being promoted to the Premier League for the first time.\nThe club posted an operating profit of £48.8m, having lost £16m the previous year, though that figure has already been spent on ground improvements at Kenilworth Road, upgrades to the training ground and new club office space.\nThe remainder has been ring-fenced for investment in the club's academy and the development of the proposed new stadium at Power Court.\nThe club also reported spending more than £25m on new signings to compete in the Premier League, however, a strategic report from directors which accompanied the financial results, external suggested they \"might\" have invested more in January to stave off the threat of relegation.\nJapan international Daiki Hashioka was the only January arrival to make a first-team impact, though the defender was limited to just six starts, and amid an injury crisis the Hatters took just six points from their final 16 fixtures to finish 18th.\nThe statement said: \"In hindsight the club might have reinforced more, as from the turn of the year onwards injuries began to blight the season with a number of key players succumbing to long term issues that would seem them miss all or large parts of the remainder of the season.\n\"The club recorded 11 missing players in a single game week, the joint-highest in the 2023-24 season, while 18 of the 26-man squad were ruled out at some point, with many of these injuries concentrated in the second half of the season, severely hampering the team's efforts to avoid the drop.\"\nThe club's turnover increased from £18.4m to £132.3m thanks to their return to the top flight after more than 30 years away, but operating costs also jumped from £39.5m to nearly £85m as a result of winning the Championship play-off final against Coventry City.\nThe Hatters broke their transfer record a number of times, bringing in Tahith Chong from Birmingham, Ryan Giles from Wolves, Blackburn keeper Thomas Kaminski and Jacob Brown from Stoke, in addition to signing free agents Tim Krul, Andros Townsend and Ross Barkley, who went on to become the club's player of the season.\nLuton are facing the prospect of a second-straight relegation as the Hatters are 23rd in the Championship, three points from safety and with the second-worst goal difference in the division.", "url": "https://www.bbc.com/sport/football/articles/cjew0px2ey5o"}