{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:50:19", "date_modify": "2025-05-21 06:50:19", "date_publish": "2025-04-02 00:00:00", "description": "Follow live text commentary, score updates and match stats from Liverpool vs Everton in the Premier League", "filename": "sport_football_live_cedldwwvn49t_1747810219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/42c1/live/f472bd10-1000-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cedldwwvn49t_1747810219.html", "title": "Liverpool 1-0 Everton: Diogo Jota scores winning goal in tight derby victory", "title_page": "Liverpool 1-0 Everton: Diogo Jota scores winning goal in tight derby victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool claimed bragging rights on Merseyside with victory over rivals Everton and edged closer to lifting the Premier League title.\nArne Slot's men require only 13 points from a possible 24 available to guarantee a deserved and record-equalling 20th top-flight triumph.\nThe Red were being frustrated by Everton's backline sitting deep, but claimed the three points courtesy of a moment of magic from Diogo Jota.\nThe Portugal forward was on the periphery of the game but collected Luis Diaz's cute backheel before showcasing dancing feet by jinking past challenges and slotting home.\nReplays showed Diaz had been standing in an offside position earlier in the build-up to the goal, but he was deemed not to be interfering with play and it was allowed to stand\nBefore the deadlock was broken, there was another moment of controversy with Everton defender James Tarkowski incredibly fortunate to stay on the pitch.\nTarkowski received only a yellow card early on when he won the ball with a sliding challenge but caught Alexis Mac Allister on the knee with his studs with the follow-through.\nThe video assistant referee (VAR) decided not to upgrade the tackle to a red card and Dominik Szoboszlai curled the resulting free-kick narrowly wide, while the in-form Mohamed Salah headed straight at Jordan Pickford at the back post.\nBeto had the Liverpool backline rattled and saw a goal ruled out for offside after outmuscling Virgil van Dijk.\nThe striker got the better of the Reds captain again, but this time could only hit the post when one-on-one with Caoimhin Kelleher.\nLiverpool and their supporters looked to up the ante in the second period and Ryan Gravenberch's stinging drive from range was pushed away by Pickford, but Jota's 56th-minute strike made the difference.\nRed smoke billowed from the Kop End and chants of \"we're gonna win the league\" echoed around from the home supporters at full-time knowing a second Premier League title is within grasp after moving 12 points clear at the top with eight games to play.\nSlot has seamlessly taken over the Anfield hotseat from the much-vaunted Jurgen Klopp and the Dutchman's side have lost just once in the league.\nLiverpool have impressed both in attack and defence - not only have they scored more goals than any other team with 70, they have also managed to keep a joint-high 13 clean sheets this term.\nThe Reds were left convalescing during the international break after being knocked out of the Champions League by Paris St-Germain then losing the Carabao Cup final to a hungry Newcastle side.\nThe ball didn't quite seem to fall their way for much of Wednesday night, with Everton defenders diving in to make crucial blocks, but Liverpool showed why they are champions elect following Jota's twinkling of inspiration.\nHis delightful goal came at the right time as it was just his sixth in the league this term and ended a barren run of 10 games without scoring.\nWith Manchester City dropping away this season and Arsenal failing to mount a serious challenge, the title is in sight for Liverpool and the earliest they can put red ribbons on the trophy is 20 April at Leicester, if results were to go their way.\nDefeat for Everton on Wednesday evening ended Everton's nine-game unbeaten run and extended manager David Moyes' misery at the venue.\nThe veteran Scot will be sick at the sight of the stadium having now gone 22 matches, including 20 in the Premier League, without winning here.\nIt could have been a very different story had Beto converted the gilt-edged opportunity that fell to him in the first half, doing well to sneak ahead of Van Dijk but then being unable to finish.\nThe major point of contention came in the 11th minute when centre-back Tarkowski somehow managed to escape a red card for a wild lunge on Mac Allister.\nThe referee gave only a caution and VAR agreed, but ultimately it did not make a difference on the result.", "url": "https://www.bbc.com/sport/football/live/cedldwwvn49t"}