{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:01:16", "date_modify": "2025-05-21 04:01:16", "date_publish": "2025-01-23 22:53:50", "description": "Manchester United v Rangers: Have your say", "filename": "sport_articles_ce3ln13gw7jo_1747800076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d267/live/989266c0-d9c9-11ef-902e-cf9b84dc1357.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce3ln13gw7jo_1747800076.html", "title": "Manchester United v Rangers: Have your say", "title_page": "Manchester United v Rangers: Have your say - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers' fans were still celebrating what they thought was a famous draw after Cyriel Dessers had brilliantly levelled United's opener with an 88th-minute drive into the bottom corner from the edge of the area.\nBut Fernandes cut those celebrations short when he got on the end of Lisandro Martinez's angled cross to the far post and drove a first-time shot through Jack Butland's legs.\nFrom his seat in the directors' box, legendary United boss and former Rangers striker Sir Alex Ferguson could only shake his head in wonderment at the drama of it all.\nAt least the ending meant the game was not known purely for Butland's terrible own goal, when he came to clear Christian Eriksen's 52nd-minute corner and succeeded only in punching the ball into his own net.\nUnited's character shone through just four days after head coach Ruben Amorim had stated his side were \"maybe the worst team in Manchester United history\".\nFor Rangers, it was a cruel way to extend a run in which Philippe Clement's side have not won away from Ibrox since 8 December.\nThey drop into the play-off places in 13th and need to beat Belgian side Union Saint-Gilloise on home soil next week and hope other results go their way to gain automatic passage into the last 16.", "url": "https://www.bbc.com/sport/articles/ce3ln13gw7jo"}