{"authors": ["Andy Campbell", "www.facebook.com"], "date_download": "2025-05-21 03:45:03", "date_modify": "2025-05-21 03:45:03", "date_publish": "2025-04-06 15:16:02", "description": "Brendan Rodgers bemoans how Celtic have started recent games his side's expected title party is delayed after losing to St Johnstone", "filename": "sport_football_articles_czjn3g9mp3vo_1747799103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6eea/live/03f09db0-12fa-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjn3g9mp3vo_1747799103.html", "title": "Celtic: Brendan Rodgers bemoans start as title party is delayed", "title_page": "Celtic: Brendan Rodgers bemoans start as title party is delayed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic's procession to a fourth successive Scottish Premiership title may only have been delayed, but it was clear that Brendan Rodgers' assessment of defeat at St Johnstone as \"bitterly disappointing\" was about more than just the result.\nA win against a team adrift at the bottom of the division would have set up the chance of clinching the trophy at home to Kilmarnock on Saturday lunchtime.\nThat scenario is now null and void, although a Celtic win followed by a Rangers loss at Aberdeen the following day would still add up to a title win.\nDefeat in Perth was Celtic's fourth in an otherwise impressive league campaign, but all four have come since January and featured the concession of an early goal - something highlighted by Rodgers.\n\"It's happened too many times,\" he said. \"I've seen a trend now with us, and it will be interesting between now and the end of the season in terms of mentality.\n\"We didn't start the game how we wanted. The first-half mentality and attitude is disappointing. It's about your mindset, and that is something that concerns me.\"\nFormer Celtic goalkeeper Pat Bonner, on Sportsound punditry duty, suggested it would be a \"real, real disappointment for the fans\" but what went wrong?\nRodgers gradually withdrew his starting front three of Nicolas Kuhn, Daizen Maeda and Jota in Perth and also replaced £11m signing Arne Engels at McDiarmid Park.\nBut their replacements could not make the difference either.\n\"The first half was poor,\" said Bonner. \"There was really no penetration. Did we see Maeda running in behind today? No.\n\"Kuhn was right off it. That's a bit of a worry for me. Jota did a bit but not enough.\n\"They did create enough chances in that second half at least to get a draw but they weren't able to put the ball in the back of the net.\"\nThe relative dip in Celtic's results in the second half of the season, having dropped just four points from August through December, is arguably down to their own consistency.\nWhen they were beaten for the first time domestically this season at Rangers on 2 January, the gap between the sides was reduced to 11 points.\nIt was hardly the re-igniting of a title race because there has never really been a title race this season.", "url": "https://www.bbc.com/sport/football/articles/czjn3g9mp3vo"}