{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:54:04", "date_modify": "2025-04-26 03:54:04", "date_publish": "2025-03-03 07:24:22", "description": "Donegal boss Jim McGuinness praises his team's late fightback as they beat Ulster derby rivals Derry 1-22 to 1-19.", "filename": "sport_articles_c4g0e75r03xo_1745639644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6b96/live/41eaeab0-f79f-11ef-be25-e92e4d3ccfe0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c4g0e75r03xo_1745639644.html", "title": "Donegal 'found a way' to overcome Derry - McGuinness", "title_page": "Football League: Donegal 'found a way' to overcome Derry - McGuinness - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donegal boss Jim McGuinness praised his team's late fightback as they beat Ulster derby rivals Derry 1-22 to 1-19 on Sunday.\nThe Ballyshannon hosts were eight points down with 15 minutes left in the Division One encounter before clinching a comeback victory.\n\"Derry came very hard at us and played very, very well,\" McGuinness told BBC Sport NI after the game.\n\"We were flat for long, long periods of the game but managed to find a way - in a way that's the most pleasing thing.\"\nDerry led 0-11 to 0-7 at the break and a goal from Conor Glass saw them extend their advantage after the restart.\nShane O'Donnell netted as Donegal hit 1-6 without reply and secured a win which leaves them in second place and only behind leaders Galway on scoring difference with two matches remaining.\nA top-two finish would see Donegal earn in a place in the final but that would mean playing seven games in eight weeks ahead of another meeting with Derry in the Ulster Championship on 6 April.\n\"It's clear the boys need a break,\" he added.\n\"It's not ideal for us but you're in Division One and you want to get to this point so we have to celebrate that as well.\"\n\"We're not in a league final - there's a lot of other games to be played and there's a lot of other teams that can be in the final.\"", "url": "https://www.bbc.co.uk/sport/articles/c4g0e75r03xo"}