{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:42", "date_modify": "2025-05-21 04:05:42", "date_publish": "2025-02-01 13:47:45", "description": "Jhon Duran's rapid rise has taken him from Colombia to the MLS to the Premier League and now on to Saudi Arabia.", "filename": "sport_football_articles_c80515rdjvyo_1747800342.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c890/live/789ee780-e09a-11ef-8eda-9dd77dfbb8b8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c80515rdjvyo_1747800342.html", "title": "Jhon Duran joins Al-Nassr: The journey from Colombia to Saudi via the MLS and Premier League", "title_page": "Jhon Duran joins Al-Nassr: The journey from Colombia to Saudi via the MLS and Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jhon Duran's breakout season in the Premier League and Champions League came to an abrupt end on Friday when he sealed a £71m move to Saudi Arabia.\nIt was an unexpected turn on a rapid trajectory that has taken him from Colombia to Major League Soccer (MLS) to the Premier League and now to Saudi in just six years.\nDuran had been one of the young stars of this season, with 12 goals in 29 games for Villa including a stunning 25-yard Champions League winner against Bayern Munich, and a new long-term contract signed in October.\nBut his influence was coming mostly from the bench, leading some to ask if he was 'the ultimate impact sub'.\nHe struggled to dislodge England international Ollie Watkins as Unai Emery's preferred frontman and was in the starting XI just once as Villa navigated their Champions League group to reach the last 16, and four times in the Premier League.\nNow, just over two years since his £18m move from Chicago Fire to Villa Park, the Colombia international will link up with a forward line at Al-Nassr that includes five-time Ballon d'Or winner Cristiano Ronaldo and former Liverpool forward Sadio Mane.\n\"We told him, today he is here in El Dorado fields, tomorrow he could be stepping into the best stadiums in the world and facing the best players in the world,\" youth coach Wilberth Perea Mena, who first met Duran as a 14-year-old at his first club Envigado, told BBC Sport.\n\"He laughed, but I think that dream has come true.\"\nChicago Fire technical director Sebastian Pelzer found Duran, almost by accident, while scouting a team-mate - and said he instantly recognised that he could become a Premier League star.\nEnvigado are a club who pride themselves on their academy and conveyer belt of talent.\nTheir slogan is 'Cantera de Heroes'. Cantera translates as quarry but in a football sense is used to describe academies.\nSince being formed in 1989 they have yet to win a major trophy - but have produced several Colombia internationals and Champions League players such as James Rodriguez, Juan Fernando Quintero, Mateus Uribe, Fredy Guarin and Yaser Asprilla.\nIn 2024 the CIES Football Observatory said Envigado were second only to Athletic Bilbao in the world for giving the most opportunities to youth players.\nSo the ideal club for Jhon Jader Duran - as he is known in his homeland - to join at the age of 11. It was a tough start though as he left his family's home in a barrio in Colombia's second-largest city Medellin to pursue that dream.\nThings improved, however, when the club brought his family to live with him in an apartment.\n\"Fortunately, he managed to have the nucleus of his family close to him,\" said Perea, \"a very humble, hard-working, honest family. Very good people.\n\"He is temperamental in the game, but he is a person who is very close to his family.\n\"Many times it is not what is reflected on the playing field. Jhon is a noble, calm person and you have to get to know him a little more inside.\"\nPerea was the coach who decided to change Duran from a winger to a striker and used to show him videos of top strikers - including Villa and Colombia icon Juan Pablo Angel.\n\"Jhon was sometimes difficult. At times it was somewhat complicated, but I knew how to manage it,\" said Perea.\n\"For me, it was very important to understand the person and then to understand the footballer.\n\"That was an important detail because one understands his childhood has not been easy, it was not easy at all.\"\nPerea tells a story of going to Duran's school to get permission for him to play in a national tournament.\n\"The principal told me 'if you find him in the classroom, I'll give you permission!' So I entered the classroom and Jhon Jader was missing class.\n\"He had stayed at home listening to Reggaeton music.\n\"I left that school furious to look for him at his home. I almost grabbed him by the ears.\"\nDuran broke into the Envigado first team at the age of 15 - and became the second youngest player to score a Colombian top-flight goal not long after.\nPerea said: \"I knew he was going to be a great player because he believed in his convictions, and he knew he could do great things.\n\"He managed to direct his talent because we knew that he could give much more. The truth is that it fills me with a lot of happiness because he has achieved great things.\n\"Thank God, who gave us enough wisdom to direct this great human and this excellent footballer.\"\nMonths later Duran caught the eye of a former Blackburn player and his upwards trajectory was about to continue.\nPelzer was a German defender who played for several teams in his homeland - plus 18 months at Blackburn.\nSadly his time at Ewood Park was blighted by injuries and he managed just one League Cup game against Walsall in 2002.\nIn December 2019, four years after retiring from playing, Pelzer got his first job with a club - technical director of MLS side Chicago Fire.\nA few months into the job he went to Envigado to scout a defender - who they also went on to sign.\n\"I was watching our main target Carlos Teran at the time,\" he told BBC Sport. \"Jhon got subbed in later on and you could already see how good he was.\n\"He was a raw talent but you could see his speed and acceleration. In the air he was a handful for the defenders already.\n\"From my experience in England I knew he had already something for England. That was something where you could have the fantasy he could make it. It was a wow effect.\"\nBut there was a twist - in the form of an article headlined 'Next Generation 2020: 60 of the best young talents in world football' that included Duran.\n\"A few weeks later the Guardian brought a list out, external and after that it was a race,\" said Pelzer.\n\"We wanted to get him somehow but the clock was ticking. There were so many other teams chasing him as well. We were convinced about his qualities.\"\nAgain, Duran's strong family roots were evident during negotiations.\n\"During the pandemic we had to be creative,\" said Pelzer. \"We had to get in touch with the family - that was not that easy. Finally we made it, we got everyone on the same page.\n\"We showed him how he would progress here. We had a lot of conversations with his family and that was also something that helped a lot in the moment.\"\nAnd so in January 2021 a 17-year-old Duran became the youngest international signing in MLS history - for a fee of $2.5m (£1.8m).\nBut he could not move until he turned 18 - so spent the next year on loan with Envigado.\nAs well as playing and training with his Colombian club, he had weekly individual training sessions for the Fire.\n\"It was important for us that he was well prepared,\" said Pelzer. \"In acceleration, technique, finishing, a lot of jumping exercises, we trained him.\n\"You could see the numbers every week were better, better. The trajectory was already going in the direction you could see if he trains well and is focused on his work he can achieve a good level.\"\nAfter a total of nine goals in 47 games for Envigado, Duran left for the States. \"For a young South American boy coming into a country like the US it was different,\" said Pelzer.\n\"The city is huge compared to where he came from. Of course he had to adapt.\"\nPelzer said he \"was very raw but showed a lot of bright things\" on his debut. \"That was very impressive but we had to work with him a lot after to get him in the right frame,\" he said.\n\"He has a lot of talent. When he joined us it was about channeling all his qualities because he has to stay focused on his work,\" continued the German. \"If he is able to focus there and put all his efforts into his work he is able to achieve a very high ceiling.\"\nDuran scored one goal in the first half of the season - but netted seven more in the second half of the campaign and ended as the club's top goalscorer with eight goals in 28 games.\nAnd then Aston Villa came in and signed him despite competition from other clubs.\n\"Villa were the ones who shifted up to sixth gear to make the deal happen,\" said Pelzer. \"They wanted him and were very serious and put all the efforts in to make it happen.\"\nIn January 2023, Villa boss Unai Emery made Duran his second signing, bringing the then teenager to the club for an initial £14.75m, plus a potential £3.3m in add-ons.\nPelzer said: \"[We weren't] naive to think he will stay here [Chicago] forever. It's the ambition the player has to have when we try to bring him on, it's important he wants to move on at a certain point because it shows his character and competitiveness. That's what he showed.\"\nJust 38 minutes into his Villa career he crashed a volley off the crossbar against Manchester City.\nHe was eased into the picture that season though, making 12 appearances - all from the bench - at an average of just 10 minutes per game, without scoring.\nLast season though he started making waves - even though he could not, and still cannot, get into the team on a regular basis because of the form and ability of Watkins.\nHe netted three Europa Conference League goals including qualifiers, and five times in the Premier League - including two in the last five minutes of a 3-3 draw against Liverpool in May.\nIn the summer though he courted controversy. He had reportedly agreed personal terms with West Ham and in a live social media video he crossed his arms to imitate West Ham's Irons logo.\nHad he made the move it would have been a third transfer before turning 21. But Villa did not sell him.\nFormer Aston Villa midfielder Thomas Hitzlsperger, speaking on the BBC MOTD: Champions League show, said: \"Credit to Emery. When you have a player who wants to leave, usually a manager says let him go.\n\"He put his arm around him and said, 'you'll get your chances, we need you' and now that's the best proof. The difference he's made is massive. Both parties - player and management - will say they've done a good job.\"\nDuran started this season off in spectacular form, scoring four goals in six substitute appearances in the Premier League.\nMost notably he netted against West Ham and indicated in his goal celebration that he was staying at Villa.\nHe also struck a brilliant long-range winner against Everton.\nBut all that has gone before was eclipsed as he lobbed Bayern goalkeeper Manuel Neuer to send the home fans wild and seal a famous win.\n\"When he came to the club I didn't have a clue he was 20,\" said Villa team-mate Morgan Rogers on TNT after the Bayern game.\n\"The way he plays, he's such a handful for defenders. When he comes on with all that energy, he knows he'll get that chance and backs himself 100%. He's a great lad.\n\"Every game is exactly the same. He's the most chilled, relaxed person I've ever met. He's a different animal when he's playing.\"\nThe goals kept coming from the bench and Duran has only played 1,043 minutes of football this season.\nAl-Nassr stepped up their pursuit this week and he was an unused substitute in Wednesday's 4-2 win over Celtic, after which he said his goodbyes to staff and colleagues at Villa Park.\nNow millions of pounds and possibly more playing time await in Riyadh as his globe-trotting career makes another stop.\nA version of this article was first published on 30 September 2024.", "url": "https://www.bbc.com/sport/football/articles/c80515rdjvyo"}