{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:52", "date_modify": "2025-05-21 06:38:52", "date_publish": "2025-01-31 00:00:00", "description": "Follow radio and live text commentary from the opening game of the Six Nations as France host Wales.", "filename": "sport_rugby-union_live_cz6l4jx9d2qt_1747809532.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_cz6l4jx9d2qt_1747809532.html", "title": "France 43-0 Wales LIVE: Result & reaction as Wales suffer Six Nations defeat in Paris", "title_page": "France 43-0 Wales LIVE: Result & reaction as Wales suffer Six Nations defeat in Paris - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Au revoir from Paris\nFT: France 43-0 Wales\nThat's it from Paris, unfortunately for Wales it went pretty much to script.\nFrance ran in a magnificent seven tries, with Antoine Dupont starring.\nBut he'll likely be without his half-back partner for next weekend's game against England after Romaine Ntamack's needless red card.\nIt's back to the drawing board for Wales, they've now lost a record 13 Tests in a row, and seven on the bounce to the French.\nThey head down to Nice this week now before facing Italy, and the significance of that game cannot be overestimated.\nIt's absolutely huge for Wales and for Warren Gatland.\nUntil tomorrow!\nItaly game is 'huge' - Biggar\nFT: France 43-0 Wales\nFormer Wales fly-half Dan Biggar told ITV: \"For me, this game next week is the biggest match in Welsh rugby for the last 15-20 years.\n\"It's a huge match. I'm not saying that light-heartedly.\n\"Everyone is talking about an agenda in terms of the negativity, but it's very difficult to be overly positive because of the defeats and the way Wales are playing at the minute.\"\n'No excuses about result' - Gatland\nFT: France 43-0 Wales\nWales head coach Warren Gatland speaking to S4C: \"I think we started off alright, we tried to play some rugby, probably on a couple of plays overplayed a little bit.\n\"They're a good side and it's just making sure we get that balance.\n\"I thought we scrummaged well and the forwards worked really hard, in terms of trying to get front foot ball.\n\"But there's no excuses about the result. I thought we created a couple of opportunities and we didn't finish them.\n\"Probably the penalty call wasn't in our favour, I thought there were a couple of tough calls. That's what happens sometimes in those scenarios.\n\"We've just got to make sure we get back on the horse and look forward to preparing for next week.\"\nPost\nFT: France 43-0 Wales\nEmyr Lewis\nFormer Wales flanker on BBC Radio Cymru\nIf I was one of the coaches picking the team to face Italy, I'd say, 'Go out there and play how you like!'\nTheir tactics aren't working.\nLet them make the decisions on the field and play what's in front of them because I don't think they've got a right to go outside of the plan.\n'We need to stay tight as a group'\nFT: France 43-0 Wales\nWales captain Jac Morgan told ITV: \"Yeah it was a tough night, we're disappointed with the result.\n\"We knew how dangerous France could be, they capitalise on your mistakes.\n\"In attack we weren't quite clinical enough. There was a lot of good there, a lot of promise, we need to stay tight as a group now.\n\"We'll take it week on week, we want to keep on getting better and improving. We've got a lot of talent and a lot of passion.\"\nCoaches will be 'fuming' at Ntamack red\nFT: France 43-0 Wales\nFormer Wales fly-half Dan Biggar told ITV: \"I think Fabien Galthie, Shaun Edwards and the French coaching staff will be furious with that.\nYou see the score line, it was 38-0, 70 minutes on the clock and your main player, who hasn't played for 18 months, is probably going to miss certainly one game, maybe two.\n\"You can see how disappointed he is. He's really annoyed with himself.\"\nPost\nFT: France 43-0 Wales\nKen Owens\nFormer Wales hooker on Clwb Rygbi\nIt's sad for Owen [Watkin] to get an injury like that, it doesn't look good.\nTo lose a player at the start of the Championship, you talk about needing experience, Owen's been around the squad for about six or seven years now.\nHe's an experienced player and he's played a lot of games for the Ospreys.\nHopefully it's not as bad as it looks.\nMan of the Match\nFT: France 43-0 Wales\nFrance number eight Gregory Alldritt told ITV: \"Big team performance today, incredible to play in this stadium, our fans are outstanding.\n\"The key was to play as a team, we've got a lot of individual really good players, and we wanted to play as a team.\n\"I think we did well, we got forwards and backs tries.\n\"We are happy with the win tonight, but we only did 20% of the job, we've got four more games to go.\"\nPost\nFT: France 43-0 Wales\nEmyr Lewis\nFormer Wales flanker on BBC Radio Cymru\nIt's been disappointing. They've thrown everything at it but unfortunately we aren't up to the standard.\nI think in this tournament, there are two, maybe even three groups.\nFrance and Ireland are in that top tier, then perhaps Scotland and England in the second tier, and unfortunately Wales and Italy are in the bottom tier.\nWales are possibly the worst team in the tournament at this moment.", "url": "https://www.bbc.com/sport/rugby-union/live/cz6l4jx9d2qt"}