{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:39:06", "date_modify": "2025-04-26 03:39:06", "date_publish": "2025-03-04 21:40:45", "description": "Joe Crowe scored an injury-time winner as Carrick Rangers defeat Larne 1-0 in the Irish Premiership, while Glentoran and Glenavon also win.", "filename": "sport_football_articles_cn0jqxeznq7o_1745638746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fb8/live/23df4540-f941-11ef-95fb-d138264a2044.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn0jqxeznq7o_1745638746.html", "title": "Irish Premiership: Carrick Rangers stun Larne as Glentoran and Glenavon win", "title_page": "Irish Premiership: Carrick Rangers stun Larne as Glentoran and Glenavon win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Joe Crowe scored an injury-time winner as Carrick Rangers defeated Larne 1-0 in the Irish Premiership.\nCrowe flicked home Kyle Cherry's free-kick as Carrick Rangers moved 12 points clear of bottom side Loughgall.\nElsewhere, Chris Atherton and Jack Malone were on target as Glenavon defeated Loughgall 2-0 at Lakeview Park.\nGlentoran have consolidated second place in the Irish Premiership with a 1-0 victory over Ballymena United.\nNathaniel Ferris as the Glens moved 16 points behind runaway leaders Linfield.\nMore to follow.\nIn a feisty east Antrim derby, Carrick midfielder Kyle Cherry spotted Rohan Ferguson slightly off his line and bent an effort from 25 yards but the Larne goalkeeper managed to tip the ball over the bar to safety.\nJust after the half-hour mark, it was the home side who once more almost had the breakthrough.\nA free-kick was delivered from the right-hand side and Carrick's Danny Gibson charged towards the ball but was clearly pulled back by Shaun Want.\nGibson went to ground and referee Mark Dillon had an excellent view of the incident, but the man with the whistle waved play on, with the visitors feeling they may have gotten away with one.\nAs half-time approached Larne again failed to deal with a corner, which allowed Seanan Clucas to hook in an effort from 18 yards. The ball took a wicked deflection of Tomas Cosgrove but keeper Ferguson reacted superbly to make the save.\nThe second-half was a period of few chances with not a single shot on target until three minutes into stoppage time.\nAfter sustained pressure in and around the Larne box, Cherry fired in a low free-kick from the right that was back-heeled into the Larne goal by Crowe to give Rangers their first league win since November.\nGlenavon's revival under Paddy McLaughlin continues as they leapfrog Ballymena United into ninth place thanks to a comfortable 2-0 win over Loughgall at Lakeview Park.\nThe visitors started brightly and opened the scoring after 18 minutes through Atherton.\nThe teenager, injured just moments earlier, recovered sufficiently to waltz through a static Loughgall defence to plant a low shot under the body of advancing keeper Nathan Gartside for his first league goal of the season.\nGlenavon doubled their lead just after the half hour when midfielder Jack Malone found himself unmarked inside the Loughgall penalty area and directed a powerful header past a helpless Gartside from Peter Campbell's pin-point delivery.\nThere were other chances, too, as Malone forced a fine save from Gartside and Len O'Sullivan volleyed over the crossbar following a quickly taken throw-in.\nAnd Michael O'Connor was denied a third for his side just before the break when his close range volley after James Carroll had failed to clear crashed off a post before being cleared by a relieved home defence.\nNiall Quinn forced a smart stop from Gartside on the restart from a long range free-kick as the visitors looked to kill the game but Loughgall were much improved in the second period, though they failed to unduly trouble Tadhg Ryan in the visitors' goal.\nThe Villagers remain rooted to the foot of the table while Glenavon continue to target the teams above them, starting with Coleraine, who are three points ahead of the Lurgan Blues, on Saturday.\nThere were plenty of early chances at the Oval as Daniel Gyollai produced a great reaction save to keep out a header from Ballymena defender Stephen O'Donnell, before Cammy Palmer's effort from 25 yards was just wide at the other end.\nBallymena keeper Sean O'Neill was then called into action to divert defender Daithi McCallion's attempted clearance after he had tried to clear Finley Thorndike's deep cross away but nearly found the back of his own net.\nFrom the resulting corner, Frankie Hvid's first time effort deflected off Calvin McCurry and crashed off the right-hand post.\nJust after the restart, Ferris had a great opportunity after a poor defending left him through on goal, but he failed to get a strike away before O'Donnell rushed back to dispossess the midfielder.\nHowever, Ferris would find the back of the net in the 55th minute after the Sky Blues failed to clear their lines and Danny Amos' low cross was converted by the January signing from close range.\nGlentoran pushed for a quick second as Palmer's effort from range was palmed away by O'Neill.\nJim Ervin's side then started to enjoy more possession and pushed for an equaliser with Gyollai rushing off his line and making himself big to thwart Success Edogun's strike in the 70th minute before he made a superb save to stop O'Donnell's free header from levelling the match through the last kick of the game.", "url": "https://www.bbc.co.uk/sport/football/articles/cn0jqxeznq7o"}