{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:33", "date_modify": "2025-05-21 05:00:33", "date_publish": "2025-04-04 11:05:46", "description": "What can happen & when in final weeks of SPFL season?", "filename": "sport_football_articles_c70z869xr06o_1747803633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/981c/live/2ac3bcb0-1142-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70z869xr06o_1747803633.html", "title": "What can happen & when in final weeks of SPFL season?", "title_page": "What can happen & when in final weeks of SPFL season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic sealed a 13th Scottish top-flight title in 14 seasons with four games to spare, while Rangers are secure in second place.\nHibernian lead the race for third, with Aberdeen three points behind and Dundee United a further three back.\nIn the bottom half, St Johnstone remain six adrift of Ross County and eight back from Dundee.\nMotherwell are now safe from the drop, while Heart of Midlothian and Kilmarnock can no longer finish bottom and automatic relegation but could still finish 11th and face a play-off to avoid relegation.\nThe title fight went down to the final round of games, with Falkirk and Livingston locked together on 70 points, but it was the Bairns who secured back-to-back titles and promotions with a win over Hamilton Academical as Livi lost to Partick Thistle.\nThistle's win retained a two-point cushion over Raith Rovers, whose win way to Queen's Park proved to no avail as the Firhill side secured the final promotion play-off spot.\nIt means Thistle host Ayr United on Tuesday in the first leg of their quarter-final, with the second leg a week later at Somerset Park and the winner taking on Livingston.\nHamilton's automatic relegation was sealed after an appeal against a 15-point deduction was dismissed, while second-bottom Airdrieonians will be in the relegation play-offs against Stenhousemuir, who finished fourth in League 1.\nArbroath confirmed promotion straight back to the Championship by sealing the third-tier title with three games to spare.\nCove Rangers, Queen of the South and Stenhousemuir, who leapfrogged Alloa Athletic on the final day, finished in the promotion play-off spots.\nDumbarton had long been relegated - a 15-point deduction for entering administration scuppering their season.\nMeanwhile, second-bottom Annan Athletic face play-offs to avoid relegation and face Elgin City, who finished fourth in League 2, in their semi-final.", "url": "https://www.bbc.com/sport/football/articles/c70z869xr06o"}