{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-19 14:40:14", "date_modify": "2025-05-19 14:40:14", "date_publish": "2017-07-17 14:10:32", "description": "England slump to a 340-run defeat by South Africa on day four of the second Test at Trent Bridge.", "filename": "sport_cricket_40633404_1747665614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6D3F/production/_96976972_rootgety.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40633404_1747665614.html", "title": "England v South Africa: Joe Root suffers first defeat as Test captain", "title_page": "England v South Africa: Joe Root suffers first defeat as Test captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's batting crumbled for a second time to give South Africa a 340-run win on day four of the second Test.\nChasing an improbable 474, the home side were bowled out for 133, as only Alastair Cook (42) offered any prolonged resistance.\nVernon Philander and Keshav Maharaj took three wickets, while Chris Morris and Duanne Olivier claimed two apiece.\nThe four-match series is level at 1-1, with the third Test at The Oval beginning on 27 July.\nEngland and new captain Joe Root have much to ponder for that game, specifically the make-up of their top order and whether or not to retain left-arm spinner Liam Dawson.\nFor South Africa, who have not lost a series in this country since 1998, this is a first win at Trent Bridge for 52 years, in the process becoming the first touring side to win a Test on this ground for a decade.\nA seventh defeat in 10 Tests is a horrible statistic for England, although the mitigating circumstance is that seven of those matches were played in unfamiliar subcontinental surroundings.\nHowever, a problem going further back is a weakness when batting second. In the past 10 matches when England have fielded first, they have won only once, a run going back to 2015.\nIn that time, they have been unable to settle on a top-order line-up and batting was once again their undoing in this match.\nRealistically, the game was lost when they were bowled out for 205 in the first innings, but the second-innings capitulation, in less than two sessions under warm sunshine, was feeble.\nThough the Trent Bridge surface was showing signs of wear, perhaps only Gary Ballance can say the conditions contributed to his demise.\nKeaton Jennings was bowled by Philander, leaving a huge gap between bat and pad, while Ballance's stride back towards the stumps left him exposed when the same bowler got one to keep low.\nThe ugliest dismissal belonged to Jonny Bairstow, who tried to hit left-arm spinner Maharaj over the top and was held at mid-on.\nThe strokes of Moeen Ali and Stuart Broad were nearly as poor, with both men caught playing sweep shots.\nThe last five wickets went down for 11 runs, the last three without an addition to the score.\nPaceman Olivier got numbers 10 and 11 - Mark Wood and James Anderson - in successive balls. England lost all 10 wickets in the space of 38.4 overs.\nSouth Africa were humbled by 211 runs in the first Test, but looked galvanised by the return of captain Faf du Plessis, who was absent at Lord's following the birth of his child.\nTheir batting showed greater discipline than the home side, while their bowling was relentless and penetrative.\nPhilander was a menace with the new ball, relying on accuracy and movement rather than pace, but the most impressive moments of the day were conjured by Morris.\nBowling with extreme pace, he first uprooted Root's off stump with a searing away-swinging yorker, then produced a vicious bouncer to remove the usually unflappable Cook.\nAll of this was achieved without suspended paceman Kagiso Rabada, who will return at The Oval to strengthen a Proteas side that has been vastly superior in Nottingham.\nEngland captain Joe Root: \"It is disappointing. The most important thing is we learn from it. The other day in the first innings the conditions suited bowling. We didn't act quickly enough and were always behind in the game.\n\"The plan was to go and make big runs and to be in a position where we were still in with a chance of winning at the end of the day. It is very disappointing that we lost the wickets as we did. We have to move on and learn quickly.\"\nSouth Africa captain Faf du Plessis: \"We did our basics a lot better and put England under pressure for longer periods in the game.\n\"We played well in periods of the first Test but let England dominate us.\n\"This Test, we haven't lost that momentum, which is exactly what we wanted to do in this game.\"", "url": "https://www.bbc.com/sport/cricket/40633404"}