{"authors": ["Andy Cryer", "Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 06:24:40", "date_modify": "2025-05-21 06:24:40", "date_publish": "2025-01-04 16:56:55", "description": "Tottenham are enduring a results crisis and an injury crisis - and manager Ange Postecoglou finds himself at the centre of attention.", "filename": "sport_football_articles_cn85mrvd838o_1747808680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ff0/live/2e72d370-caa0-11ef-a078-37769e6d4b12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn85mrvd838o_1747808680.html", "title": "Tottenham 1-2 Newcastle: Can Ange Postecoglou deliver success at Spurs?", "title_page": "Tottenham 1-2 Newcastle: Can Ange Postecoglou deliver success at Spurs? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What are Ange Postecoglou's Tottenham Hotspur?\nThe Premier League's entertainers? A gung-ho side too leaky at the back to achieve success? Both of the above?\nSaturday's 2-1 home defeat by Newcastle leaves Spurs 12th in the Premier League, some 21 points off leaders Liverpool and 12 behind the top four.\nThe Australian had fuelled fans' expectations of winning a first trophy in 17 years by saying in September he \"always\" wins a trophy in his second season in charge.\nBut the question is now this: having managed 58 games in the Premier League for Tottenham - the same number as Jose Mourinho when he was dismissed in 2021 - has Postecoglou actually improved Spurs?\nTottenham currently have 24 points, which is 15 fewer than they had at the same stage of last season.\nThey are also the first Premier League team to sit in the bottom half after 20 games despite having a positive double-digit goal difference since Claudio Ranieri's Chelsea in 2000-01.\nAn agitated Postecoglou was furious Gordon's equaliser had been allowed to stand after a handball in the build-up, as his injury-hit side pushed Newcastle all the way.\nHe used a version of the phrase \"if all things were equal\" nine times in an interview to the BBC.\n\"I think it's clear,\" Postecoglou said, irate at what he considered a handball by Joelinton in the build-up to Newcastle's early equaliser.\n\"I'm just really, really angry. Angriest I think I have ever been in my career.\"\nHe added: \"On the balance of play, any balance you want with all things being equal, we would have won today.\n\"Outstanding. I couldn't be prouder of the players. I couldn't ask any more. It's a game we would have won if all things were equal.\n\"If all things were equal and balanced we would have won today. Things weren't equal and balanced.\"\nAfter more conservative approaches under Mourinho, Antonio Conte and, briefly, Nuno Espirito Santo, Postecoglou's emphasis on attacking, high intensity football has led to Spurs being one of the league's most entertaining sides.\nThey have scored 116 goals since he arrived and are the league's fourth highest scorers since summer 2023.\nThis season, only Liverpool have scored more goals than Tottenham's 42 goals, while they are also second in terms of the number of big chances created.\nAfter qualifying for the Europa League with a fifth-placed finish last season - compared to the eighth place they finished the season before Postecoglou's arrival - they have a League Cup semi-final against Liverpool to look forward to on Wednesday and remain in Europe.\nBut defensively, the stats aren't so great.\nTottenham recorded 51 points in the Premier League in 2024. That's their worst return in a calendar year since 2008 when they recorded 42 points.\nSince Postecoglou was appointed, Spurs have conceded 91 goals - the seventh most from teams in the top flight since he joined.\nThis season, their 30 goals against is worse than 12 other Premier League teams.\nThey have registered just one victory from their last eight top-flight games.\nSpurs are winless in six successive Premier League home games - their worst run since October 2008.\nThe Australian continues to insist his defenders remain as high up the pitch as possible, a tactic that leaves plenty of space in behind. It is a problem that has been exacerbated by the absence of defensive speed merchants - and first-choice centre-backs - Cristian Romero and Micky van de Ven through injury.\nFormer Arsenal defender Martin Keown told Football Focus: \"The stubbornness from Ange Postecoglou may ultimately cost him his job at Tottenham.\n\"When they went down to nine men against Chelsea, of 100 top coaches 99 would have dropped to the edge of the box, but he wanted to sit on the halfway line. They lost that game comfortably as Chelsea ran all over them.\n\"I don't quite understand why he does not want to adapt. There are issues with his system and his failure to adapt will go against him in the long run.\"\nFormer Tottenham striker Gary Lineker said on his Rest is Football podcast: \"I do think if they can get Romero and Van de Ven together they are a different side. They need that pace.\n\"It is a brave form of football but I like it. Spurs tried to play a more cagey game of football and the fans didn't enjoy it – although results were maybe slightly better. I hope they stick with him and I hope they turn it around.\"\nTottenham's dramatic slide down the league has coincided with a defensive injury crisis - worsened by Destiny Odogie's absence.\nGoing into Saturday's match, they had the most players unavailable in the Premier League with 11 players out and a sickness bug in the squad.\nThe Spurs boss has insisted his side's poor form is a result of the club's injury crisis and has previously said a concerning rate of recurring injuries is under review, following the appointment of a new head of medical and new head of sports science in the summer.\nBut is the team's non-stop approach one of the reasons for the amount of injuries? It might be, along with other factors, including having played 33% more games than at this stage last season.\nBefore the defeat by Newcastle, only Bournemouth and Ipswich had run more than the 2,129.2km covered by Spurs players in their first 19 games.\nDejan Kulusevski had run more distance (205.4km) than any other player in the Premier League this season.\nDominic Solanke, Kulusevski, Udogie and Son Heung-min all ranked in the top 20 for sprints in the league. No other club had more than two players in the top 20.\nProfessor of Sports Medicine at the University of Northampton, Bill Ribbans, said: \"In order to play Postecoglou's style of play, you have to be both incredibly fit and have pace.\n\"With it, that risks injury. Postecoglou has obviously had a very impressive managerial career but managing in the Premier League is pretty intense and unrelenting. There are a high number of games at [Postecoglou's previous club] Celtic and in the Scottish division but he won 72 per cent of them and may have felt able to rotate and still win.\n\"It's very different in the Premier League to rotate and still have the same standard of performance to win.\"\nRob: I think most people have recognised since halfway through last season that 'Angeball' isn't some revolutionary new approach to the game, but a tongue-in-cheek euphemism for playing badly, without structure, and losing a lot of games.\nToby: No, he hasn't improved us. Jose Mourinho had slightly better points per game. And while we might be the league's entertainers, it's not entertaining being a Spurs fan. But that won't change until Daniel Levy and co are out.\nLaurie: As a fan of 61 years, I love the Ange approach and style of play, after the dire offerings under Jose Mourinho, Nuno Espirito Santo and Antonio Conte. The squad has been decimated by injuries yet the style of play has not changed and the players are still playing for the manager and the club.\nIt would be futile to change the manager so let him stay until the end of the season and see what we have to show for his efforts.\nBen: Spurs would be foolish to sack Ange mid-season. They've been decimated by injuries, but they're in really good shape in all the cups. It would be cool to see them prioritise the cups in the second half of the season.\nTom: Spurs would be absolutely mad to sack Postecoglou under these circumstances - starting the game with the third choice keeper and a decimated back four. Yes, I accept there are systemic issues with the vulnerable play style but Ange hasn't even been there for two full seasons. Who does the Spurs fans think they are, demanding more?", "url": "https://www.bbc.com/sport/football/articles/cn85mrvd838o"}