{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:43", "date_modify": "2025-05-21 07:29:43", "date_publish": "2025-01-14 00:00:00", "description": "The NFL's wildcard weekend concludes in the NFC - follow live text as the Minnesota Vikings face the Los Angeles Rams.", "filename": "sport_american-football_live_cqld30y0ee7t_1747812583.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_live_cqld30y0ee7t_1747812583.html", "title": "NFL playoffs LIVE: Minnesota Vikings at Los Angeles Rams", "title_page": "NFL playoffs LIVE: Minnesota Vikings at Los Angeles Rams - live text and score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you on Saturday!\nRight folks, that's your lot from Wildcard Weekend with the Rams booking the final spot in next week's Divisional Round.\nAnd looking at some of the fixtures coming up next week should be an absolute belter - so rest up gridiron gang as we've got live text commentary on all four games next week, starting on Saturday at 21:00 GMT.\nSo make sure you join us then!\nPlay-off picture\nMinnesota Vikings 9-27 Los Angeles Rams\nThe cream usually rises to the top and that's true in the NFL play-off picture as seven of the eight teams remaining are the division winners and top seeds, with Washington the only wildcard side to make it through this weekend.\nPost\nMinnesota Vikings 9-27 Los Angeles Rams\nRams quarterback Matthew Stafford: \"We knew what we were playing for. That was for the people of Los Angeles who are struggling right now.\n\"We're living it every day. It was a tough week for us, a bunch of moving parts. It's been a whirlwind, but to come out here and play like we did, in all phases, I'm really proud of this group.\"\nDivisional round fixtures\nMinnesota Vikings 9-27 Los Angeles Rams\nAnd here is the schedule for next week's Divisional round, with the Rams winning tonight to book a trip to face the Eagles in Philly on Sunday at 20:00 GMT.\nWe'll have live text coverage of each game.\nSaturday, 18 January\nAFC - Houston Texans (4) at Kansas City Chiefs (1), 21:30 GMT\nNFC - Washington Commanders (6) at Detroit Lions (1), 01:15 GMT (Sunday morning)\nSunday, 19 January\nNFL, Los Angeles Rams (4) at Philadelphia Eagles (2) 20:00 GMT\nAFC - Baltimore Ravens (3) at Buffalo Bills (2), 23:30 GMT\nFT: Rams heading to Philly!\nMinnesota Vikings 9-27 Los Angeles Rams\nAnd that's the ball game!\nThe Minnesota Vikings had a stinker in just about every facet of the game, but the Los Angeles Rams came ready to play and they dominated in every phase - especiaally on defence with those record nine sacks.\nStill no play-off win for Minnesota since 2019, and after a great season Sam Darnold's time there might be done after two hugely disappointing showings in their biggest two games of the season the last two weeks.\nBut for the Rams, they looked great and on this performance will given number two seeds Philadelphia all they can handle next week.\nOne last sack!\nMinnesota Vikings 9-27 Los Angeles Rams\nSam Darnold actually goes to throw it then but pulls it back in, and that allows Desjuan Johnson to get him down for the ninth sack of the game for the Rams - that's an NFL record for a play-off game.\nTurnover\nMinnesota Vikings 9-27 Los Angeles Rams\nFourth down so Sam Darnold might as well go for it, which he does and at least this time they target their best play Justin Jefferson in the end zone, but he can't make the catch so the Rams get it back.\nJust over three minutes left on the clock now and it looks like the Rams will be heading east to the Eagles in Philadelphia..\nVikings in no-rush offence\nMinnesota Vikings 9-27 Los Angeles Rams\nLook, it's not easy to get the plays called and get the right players on the field when the stakes are so high, but the Vikings are 18 points down with under seven minutes left in the game and not only are they running the ball a lot, they're taking their sweet time getting up to the line and actually running these plays.\nHurry up lads!\nRams punt\nMinnesota Vikings 9-27 Los Angeles Rams\nWe've heard afr too much from the refs recently, and the stuttering Rams drive finally ends with a punt, giving Sam Darnold another chance to prove he can be the long-term QB in Minnesota.\nDarnold's one-year deal with the Vikings is up after the season and they drafted JJ McCarthy to be their starter, so there's a big doubt over their current triggerman, which won't have been eased by tonight's display.\nFlags everywhere!\nMinnesota Vikings 9-27 Los Angeles Rams\nFour flags in five plays as penalties start to add up here - the Rams actually came into the game as the team with the fewest penalties out of all the play-off teams, but they've had eight flags tonight for a total of 85 penalty yards.\nA seventh sack!\nMinnesota Vikings 9-27 Los Angeles Rams\nOh Sam! Darnold has been doing so well getting himself out of trouble recently, but he's just transfixed on Jalen Nailor and takes an age waiting for him to get open, and soon the Rams pass rush gets to him and drags him down for another sack.\nThat seventh sack could be the most damaging as the Vikings could have gone for it on fourth down, maybe even tried a long field goal, but instead have to punt when facing a fourth-and-21!\nDarnold dithering again in the pocket has cost Minnesota.\nVikings pushing\nMinnesota Vikings 9-27 Los Angeles Rams\nThere's a lot more freedom about this Vikings offence now, whether that's just because they have to go for everything or whether the Rams have just taken their foot off the gas ever so slightly we're not too sure.\nSam Darnold hits TJ Hockenson for a first down, and then goes for broke with a long throw towards Jalen Nailor near the end zone, but his throw has a bit too much juice on it.\nDarnold takes off\nMinnesota Vikings 9-27 Los Angeles Rams\nSam Darnold has finally started to get out of town when the pocket collapses and he's under pressure - this time he goes for a run forward for 17 yards, and gets an extra 15 as he takes a hit to the head as he's sliding.\nMinnesota get almost to midfield with that play.", "url": "https://www.bbc.com/sport/american-football/live/cqld30y0ee7t"}