{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:40:32", "date_modify": "2025-05-21 03:40:32", "date_publish": "2025-02-01 17:57:28", "description": "Hibernian 2-0 Aberdeen: What the manager said", "filename": "sport_articles_cpqly9rpex2o_1747798832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f53/live/c2720980-e0c4-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpqly9rpex2o_1747798832.html", "title": "Hibernian 2-0 Aberdeen: What the manager said", "title_page": "Hibernian 2-0 Aberdeen: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian head coach David Gray: \"I'm delighted for the players, today was a real challenge, it's always going to be a challenge because of everything that goes around the fixture.\n\"I think we've played a lot better this season, but full credit to the players, to win 2-0, clean sheet is fantastic.\n\"I thought defensively we were excellent and we still had a lot of probably the best chances in the game. So all in all delighted with the three points, and delighted with the form and the players deserve all the credit for that.\n\"The biggest thing I've always been very consistent with the way I think the group is always stuck together. I've always seen that every single day and that gave me the belief and the staff the belief that we would turn it around given the time.\n\"I'm delighted for the support that we've had from everyone involved and the effort for the players as I've always touched on has always been there and they fully deserve what they're producing at the moment.\n\"Our full target at the moment was always to catch the team in front of us.\n\"Now I know that's one game at a time, it's that mindset but I think with how tight the league is that's the way we need to be.\n\"Firstly, it's always going to be that the teams above us are always going to be catchable in the short term so we need to make sure we do that.\n\"We need to make sure we cement that top six place as quickly as we can because there's going to be a lot of challenging games between now and the split end and to make sure we do do that.\n\"We need to keep moving forward and if we can keep catching that team in front we're in a position, a fantastic position where European then becomes a possibility.\n\"So we need to not get carried away at all, we need to make sure we keep working hard, keep improving because we've still got a lot of that to do.\"", "url": "https://www.bbc.com/sport/articles/cpqly9rpex2o"}