{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-04-26 03:48:51", "date_modify": "2025-04-26 03:48:51", "date_publish": "2025-03-05 14:10:29", "description": "Chelsea news: Who is Blues academy youngster Ibrahim Rabbaj?", "filename": "sport_football_articles_cdjyx02lp9mo_1745639331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5afd/live/21f0d260-f9a7-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdjyx02lp9mo_1745639331.html", "title": "Chelsea news: Who is Blues academy youngster Ibrahim Rabbaj?", "title_page": "Chelsea news: Who is Blues academy youngster Ibrahim Rabbaj? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Let's talk about Ibrahim Rabbaj and his performances in Chelsea's academy.\nThere have been multiple reports about the 16-year-old forward's goals record, which, along with his playing style, is leading to comparisons with superstar Lionel Messi.\nA statistic of 50 goals and 60 assists in 42 games across various academy levels -circulating on social media - is difficult to verify.\nThat stat may even be unhelpful, given it does not clarify whether it includes small-sided games or shorter matches, which are common at that level, and official data is not available until under-18 level.\nWhat is undeniable is Rabbaj, now playing above his age group and a youth international, passes the eye test.\nWithin 23 minutes of his first start in the U18s Premier League, Rabbaj scored twice at Leicester last month.\nAnother undeniable truth about Rabbaj is that England and Morocco have been battling for his international future.\nAnd Chelsea still have to wait nearly a year to sign Rabbaj, who turns 17 in January 2026, to his first professional deal.\nRabbaj's father, Mohammed, grew up playing football and was in the academy of Moroccan powerhouse Raja Casablanca, before moving to Spain and starting his family.\nThey spent a brief period living in Leicester before returning to Morocco, where they remained with their six children until Ibrahim's gifts sparked a final family move.\nSuch was the young Rabbaj's talent - at the age of two, playing with a small, size-two football - the family decided to move back to England, to Ashford in Kent, almost entirely to give their son access to the Premier League academy system.\nThere are videos on social media of Rabbaj, external training in a local park with his father and football-obsessed brother. Eventually, Rabbaj had trials at Arsenal before joining Charlton Athletic's pre-academy.\nRabbaj then played at Crystal Palace until the age of 11, when Chelsea signed him.\nOne challenge in Rabbaj's journey was a year of not playing football because of an issue with his registration. Another was his small stature.\nBut his obvious technical gifts shone through as England and Morocco both called him up to their various age groups, up to under-17 level.\nRabbaj has recently chosen Morocco after a series of trips to the country's state-of-the-art training base in Casablanca.\nA pathway has been presented to highlight how Rabbaj could be a key player by the 2030 World Cup, which will partly take place in Morocco. Meanwhile, comparisons have been made with Hakim Ziyech's and Brahim Diaz's choices to reject the Netherlands and Spain respectively.\nRabbaj speaks with a Moroccan Arabic dialect. In Arabic, there is the word \"maktub\", which means \"it is written\". Given the sense of anticipation around him, many feel Rabbaj destiny is to reach the top.", "url": "https://www.bbc.co.uk/sport/football/articles/cdjyx02lp9mo"}