{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:47", "date_modify": "2025-05-21 07:52:47", "date_publish": "2025-02-11 00:00:00", "description": "Nottingham Forest edge past 10-man Exeter City in a penalty shootout to reach FA Cup fifth round.", "filename": "sport_football_live_c93lx99pn1qt_1747813967.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c93lx99pn1qt_1747813967.html", "title": "FA Cup LIVE: Exeter vs Nottingham Forest score, commentary, stats & updates", "title_page": "FA Cup LIVE: Exeter vs Nottingham Forest score, commentary, stats & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A much-changed Nottingham Forest needed penalties to beat 10-man Exeter City in the fourth round of the FA Cup.\nThe two sides finished locked at 2-2 after extra time, but Forest ran out 4-2 winners on spot-kicks against the League One side.\nReece Cole had his effort saved, while Angus MacDonald hit the bar for the hosts before Neco Williams scored the decisive penalty for the visitors.\nIt means Forest, who made 10 changes to their team, avoided becoming the second Premier League side to be knocked out by a Devon club in the fourth round after Plymouth Argyle stunned Liverpool on Sunday.\nIt meant the end of an FA Cup dream for a gutsy Exeter outfit that had defended superbly, especially after debutant Ed Turns was sent off for an 87th-minute foul on substitute Morgan Gibbs-White.\nForest will host fellow Premier League side Ipswich Town in the fifth round at the start of next month.\nOnly Danilo survived from the Forest team that thrashed Brighton and Hove Albion 7-0 last week, while Exeter made five changes as defenders MacDonald and Turns made their debuts after last week's 4-1 loss at Stevenage.\nExeter caught Forest cold when goalkeeper Carlos Miguel fumbled Demetri Mitchell's curling effort into the path of Josh Magennis to score the opener from close range after just five minutes.\nBut Forest soon found their stride as Taiwo Awoniyi went close twice – the second needing a fine goalline clearance from Vincent Harper – before Ramon Sosa levelled as he coolly finished from Ibrahim Sangare's weighted pass.\nAwoniyi had 32nd-minute shot well saved by Exeter keeper Joe Whitworth before he deservedly put Forest ahead soon after as he fired into the bottom corner after turning well on the edge of the box as Turns and MacDonald struggled to contain the Nigerian striker.\nHowever, Magennis drew Exeter level shortly after the restart, this time on hand to score a deflected effort after a scramble from a deep corner.\nMiguel was forced off with an injury soon after, with keeper Mats Sels replacing him.\nSels had to be alert to palm away an Ilmari Niskanen strike five minutes later as a rejuvenated Grecians – backed by a vociferous home end of packed fans – had their best spell of the game.\nForest brought on Elliot Anderson and Gibbs-White with 20 minutes left and the pair both went close as the top flight side shifted up a gear.\nExeter gave Forest another scare as they pressured late on with a series of corners – one effort needing a desperate block from defender Willy-Arnaud Boly to clear the danger.\nCity had Turns sent off before 20 minutes of stoppage time, caused in part by a head injury to Awoniyi. Jota Silva hit the post and Pat Jones brought a good save from Sels as both sides went close to snatching victory.\nForest brought on Chris Wood for the stricken Awoniyi, with Williams brought on at the start of extra time.\nWhitworth twice saved well from Wood early in the second period as Forest began to dominate with Exeter's depleted and tiring team dropping deeper and deeper.\nBut the Grecians defended superbly with crucial interceptions and frustrated their top flight opponents as they held out for a shoot out after two wasted chances from Nicholas Dominguez.\nMagennis and Wood scored their side's first penalties but Sels saved from Cole and MacDonald hit the bar either side of a successful Gibbs-White penalty.\nTony Yogane converted Exeter's fourth spot kick to give the home side hope, but Wales international Williams calmly converted Forest's fourth to send them through.\nExeter City manager Gary Caldwell told BBC Sport:\n\"It was a heroic effort - it feels like we've been playing for about three days.\n\"With 11 men I thought the game plan worked, we bought into it, we gave up possession to a team that wants to play counter-attack and we frustrated them.\n\"The disappointing thing was the two goals, they were soft goals from our point of view.\n\"The sending off obviously has a huge impact on the game, but against 11 we dig in, the finishers come on, we really gambled in the last 10 minutes, I didn't want extra time.\n\"The players were outstanding. The mentality, the teamwork, the looking after each other and protecting each other in difficult moments was incredible. It's something we have to take forward.\n\"We have to use this performance, we have to use this feeling and take this into the next 17 games.\"\nNottingham Forest head coach Nuno Espirito Santo told BBC Radio Nottingham:\n\"It was a tough one. This is the FA Cup, we knew how hard it was going to be.\n\"Credit to Exeter, but probably we didn't do one of the best games.\n\"At the end we are happy, this is more important.\n\"Penalties is not a lottery. We have to prepare them and the boys were really focused on doing things properly.\n\"We take our penalty shots in training sessions and did really well here.\"", "url": "https://www.bbc.com/sport/football/live/c93lx99pn1qt"}