{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:32:30", "date_modify": "2025-05-21 04:32:30", "date_publish": "2025-04-05 06:33:16", "description": "Swansea City: Jerry Yates' future 'a conversation in the summer'", "filename": "sport_football_articles_c9djlw82yj5o_1747801950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/49a6/live/1f2a8f20-10a0-11f0-85a6-779568683363.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9djlw82yj5o_1747801950.html", "title": "Yates' future 'a conversation in the summer'", "title_page": "Swansea City: Jerry Yates' future 'a conversation in the summer' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan says Jerry Yates' long-term future will be discussed at the end of the season as Swansea City prepare to face the striker's loan club this Saturday (15:00 BST).\nYates has enjoyed a positive spell at Derby County this season, and scored his eighth goal of the campaign – in his 36th appearance – as the Rams beat Preston North End on Wednesday.\nBut the 28-year-old will be ineligible to feature when Derby take on his parent club at the Swansea.com Stadium.\nYates, who joined Swansea from Blackpool in a deal worth about £3m in 2023, is under contract at the Welsh club until at least 2026.\n\"Jerry came in last year and it was an up and down year for him, but he's gone to Derby and played regular games which was the plan,\" said Swansea caretaker boss Sheehan.\n\"He's doing really well there and [his future] will be a conversation in the summer I'm sure.\"\nAs for this weekend, Sheehan says Derby \"have replacements who can come in and do a similar job\" to Yates as they target a fifth straight league victory.\nJohn Eustace's rejuvenated team climbed out of the relegation places thanks to the Preston win and would close to within a point of Swansea with an away triumph.\n\"It's going to be a dogfight because of how they play,\" Sheehan said.\n\"They are winning games, they have found a formula to do so. They've got momentum and momentum is powerful.\n\"But that's them, we have to focus on ourselves. We believe that if we give the best version of ourselves, we are a test for even the top teams now.\"", "url": "https://www.bbc.com/sport/football/articles/c9djlw82yj5o"}