{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:16", "date_modify": "2025-05-20 12:32:16", "date_publish": "2023-08-04 10:39:24", "description": "Everton: Toffees kit manager Jimmy Martin retires after 30 years", "filename": "sport_articles_c84q5zxlnk1o_1747744336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6dbd/live/5abca750-32b0-11ee-ae3c-c3dd6487b7e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c84q5zxlnk1o_1747744336.html", "title": "Everton: Toffees kit manager Jimmy Martin retires after 30 years", "title_page": "Everton: Toffees kit manager Jimmy Martin retires after 30 years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton kit manager Jimmy Martin has announced his retirement, after becoming the club's first-ever kit man in 1990.\nInitially, Jimmy joined the club as the men’s senior team coach driver, driving the players and staff to matches, until ex-manager Howard Kendall offered him his new role.\nThe club said he \"became a hugely-popular member of the backroom staff\", working with the likes of Roberto Martinez, Carlo Ancelotti and, most recently, Sean Dyche.\nFormer Everton attacking midfielder Graham Stuart said: \"Jimmy is an Everton legend, no question about it. Finch Farm won’t be the same without him – it will certainly be quieter, that’s for sure!\n\"Nothing is ever too much trouble for Jimmy and he’s been a great friend of mine since the first day I walked through the door at Bellefield. I love the man.\"\nFormer midfielder Ian Snodin, who was on the bus when Jimmy drove the newly-crowned League champions back from Norwich City in May 1987, said: \"There’s no quick way back from Norwich and the lads never wanted the journey to end. Jimmy was doing the minimum speed on the motorway but, even then, Howard [Kendall] kept telling him to slow down!\n\"Jimmy has been a magnificent servant to Everton and I wish him all the very best for the future.\"", "url": "https://www.bbc.com/sport/articles/c84q5zxlnk1o"}