{"authors": ["Matt Warwick", "www.facebook.com"], "date_download": "2025-05-21 05:30:58", "date_modify": "2025-05-21 05:30:58", "date_publish": "2025-01-14 13:29:09", "description": "Britain's Simon Yates will try to win the Giro d'Italia for Visma-Lease a Bike before supporting Jonas Vingegaard at the Tour de France.", "filename": "sport_cycling_articles_cq5g275x6ljo_1747805458.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e48e/live/f7af0850-d273-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cq5g275x6ljo_1747805458.html", "title": "Simon Yates ready for Giro d'Italia bid and Tour de France fight", "title_page": "Simon Yates ready for Giro d'Italia bid and Tour de France fight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Simon Yates will try to win the Giro d'Italia for his new Visma-Lease a Bike team before supporting Jonas Vingegaard at the Tour de France.\nThe 32-year-old joined the Dutch team after spending his whole World Tour career with Australia's Jayco-AlUla, with whom he won the Vuelta a Espana in 2018.\n\"These are very exciting times. I want to be back on the top step. It's always scary to make a change but it was one I needed to make.\n\"This is a very professional team - I'm really looking for all the smallest details possible. Fine details is where I can make some gains.\"\nYates came agonisingly close to winning Italy's Grand Tour in 2018 before losing ground in the latter stages to eventual winner Chris Froome.\nBut he has won six single stages of the three-week event across 2018, 2021 and 2022.\n\"I will go back to the Giro [in May] - I feel really inspired to go there again. It's a race I have a lot of history with, bad and good.\"\nYates will be expected to be one of the favourites in what is a gruelling race.\nIt does not always feature the greatest talents in the sport but the icy snow banks of the mountains and often torrential rain make it one of the most unpredictable races on the calendar.\nYates' main rivals are expected to be Slovenia's Primoz Roglic of Red Bull-Bora Hansgrohe and Ecuador's Richard Carapaz of EF Education-EasyPost.\nThat list of rivals could also potentially include his twin brother Adam.\nAdam will ride at the Giro for his UAE Team Emirates team-mate Juan Ayuso of Spain, but he could also be a contender for the pink jersey.\nThe competition between the two twins from Greater Manchester could then continue on into the summer.\nSimon's new team is home to two-time Tour de France winner and de facto second best rider in the world Jonas Vingegaard, who he will support this year as the Dane tries to regain the yellow jersey.\nVingegaard lost out to Tadej Pogacar last year following a harrowing crash early in the season which compromised his Tour.\n\"There's a lot of people underestimating his injuries,\" said Simon. \"Tadej was very strong, but if you look where Jonas came from - there's a lot of improvement to come.\n\"It's exciting to play a similar role to what my brother would do.\"\nPogacar - who was peerless in 2024 after winning the Giro, Tour and Road World Championships 'triple crown', external - will try to defend his title with Adam by his side as a super-domestique.\nThe pair have spent a lot of their careers in the same team but clashed in the first stage of the 2023 Tour de France, with Adam winning a sprint for victory and the honour of wearing the yellow jersey.\nNevertheless Simon has been the more decorated of the two, winning 10 Grand Tour stages to Adam's two, and the overall red jersey at the Vuelta six years ago.\n\"Me and my brother are always very competitive in races,\" says Simon. \"But we've not raced against each other as much as you would think.\n\"Next year that's going to change. We'll have to see who comes out on top.\"\nVisma-Lease a Bike, based in Den Bosch, are one of the biggest-budget teams in the World Tour and this year have the largest number of British riders in their squad in their history.\nThere are five, a list that also includes Ben Tulett, Thomas Gloag, Matthew Brennan and sprinter Dan McLay.\nYates is expected to begin his season at March's Tirreno-Adriatico stage race across Italy.", "url": "https://www.bbc.com/sport/cycling/articles/cq5g275x6ljo"}