{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:51:25", "date_modify": "2025-04-26 03:51:25", "date_publish": "2025-03-05 11:57:13", "description": "Leicester City podcast: Reporter on boardroom giving answers", "filename": "sport_football_articles_cg4kr1qqzv9o_1745639485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34a0/live/e03cea30-f8f1-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cg4kr1qqzv9o_1745639485.html", "title": "Leicester City podcast: Reporter on boardroom giving answers", "title_page": "Leicester City podcast: Reporter on boardroom giving answers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Daily Mail reporter James Sharpe believes those at the top of Leicester City deserve praise for the success they have brought the club, but need to answer the \"legitimate questions and concerns\" fans have about how the Foxes are being run.\nSpeaking on the latest episode of BBC Radio Leicester's When You're Smiling podcast, Sharpe said: \"It's wrong not to give them the credit they deserve for the fantastic times Leicester have had and the amazing things the club have achieved.\n\"Promotion, staying up, winning the title, Champions League football, FA Cup wins - they deserve credit for that and we should always be thankful.\n\"What that doesn't do is absolve them of responsibility and give them a free pass for what has happened since. There's a number of things that have been huge issues.\n\"Getting rid of Brendan Rodgers far too late had a massive impact on the club's future. Fumbling on the replacement and having caretakers in for two crucial games that went badly stunk of a club that lacked direction, planning and a clear vision of what they needed.\n\"They are responsible for a big part of the financial situation Leicester find themselves in. They have to take responsibility for the contracts that have been handed out.\n\"The complete scattergun transfer policy over recent seasons and repeated decisions that have left Leicester in such a tricky financial situation, where they're juggling PSR charges and narrowly escaping points deductions because of loopholes. You wouldn't expect these decisions to be made by a club like Leicester who have done such great things.\"\nHowever, Sharpe's biggest concern is the lack of answers given from the club as to how things have gone so badly wrong.\n\"Leicester's owners were seen as the pinnacle of how to run a football club - we've gone from that to where we are now,\" Sharpe said. \"A lot of the frustration from fans and journalists is their refusal to speak openly about their decision-making.\n\"Give supporters answers to these legitimate concerns. Questions need answering.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cg4kr1qqzv9o"}