{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:49", "date_modify": "2025-05-21 07:49:49", "date_publish": "2025-05-18 17:27:21", "description": "Coleraine will sign Kodi Lyons-Foster from Irish Premiership rivals Glentoran at the conclusion of his contract at the Oval.", "filename": "sport_articles_clyg82mxjgmo_1747813789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d00/live/f02378b0-3406-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clyg82mxjgmo_1747813789.html", "title": "Lyons-Foster swaps Glentoran for Coleraine", "title_page": "Irish Premiership: Tottenham and Aston Villa youth product Kodi Lyons-Foster swaps Glentoran for Coleraine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coleraine will sign Kodi Lyons-Foster from Irish Premiership rivals Glentoran at the conclusion of his contract at the Oval next month.\nLyons-Foster impressed during his one season with Glentoran having previously spent time in the academy structures at Tottenham Hotspur and Aston Villa.\nThe 28-year-old defender has signed a \"multi-year\" deal with the Bannsiders who finished fifth in the league this season before replacing manager Dean Shiels with Ruaidhri Higgins and losing the European play-off final to Cliftonville.\n\"After speaking to Ruaidhri, I was excited by the plans for the future and the ambition around the club,\" Lyons-Foster told Coleraine's club website.\n\"I've really enjoyed my time in the league and I'm grateful to Glentoran, but this felt like the right move for me.\n\"I've heard brilliant things about the fans and the atmosphere at The Showgrounds, and when I played there this season it really stood out. I'm excited about what's ahead and buzzing to get started.\"\nColeraine have already signed Irish Premiership player of the season Joel Cooper from Linfield for next season after \"significant investment\" from new majority owner Henry Ross.\nFor Glentoran, it is the second prominent departure in three days after it was confirmed on Friday that Fuad Sule will also sign elsewhere upon the conclusion of his contract.", "url": "https://www.bbc.com/sport/articles/clyg82mxjgmo"}