{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:04", "date_modify": "2025-05-19 15:24:04", "date_publish": "2015-02-13 10:32:53", "description": "Glenn Ferguson warns his Ballymena players they could be facing relegation if they do not halt their poor league run.", "filename": "sport_football_31453078_1747668244.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80983000/jpg/_80983669_pe_00460219.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31453078_1747668244.html", "title": "Irish Premiership: Ballymena boss fears survival fight", "title_page": "Irish Premiership: Ballymena boss fears survival fight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ballymena United manager Glenn Ferguson has warned his players they could be facing relegation if they don't halt their poor run in the Premiership.\nThe Sky Blues had a brilliant Irish Cup win at Cliftonville last weekend but lost to Glentoran on Tuesday and have managed just one point from 15.\n\"There were a few stern words after the Glens game,\" said Ferguson.\n\"We have to start picking up points before the split or we are going to be in a relegation battle.\"\nBallymena, without a league victory since Boxing Day, host bottom-placed Institute on Saturday with Ferguson wanting more from his players.\n\"They all have to do better, right throughout the team,\" he added.\n\"Institute are in a real dogfight and will be fired up. They are a good footballing side and will stick to the game plan.\n\"I want us to get ourselves into a position where we don't have to worry about relegation.\"\nMeanwhile at Seaview, Premiership leaders Crusaders will be missing key men Colin Coates and Declan Caddell for the home clash with Warrenpoint Town.\nCaptain Coates is out following his red card in last week's Irish Cup win over Bangor while midfielder Caddell is in the middle of a three-game ban.\nThe Crues will still be expected to maintain their three-point advantage at the top of the table.\nBut they are expecting a tough battle against a revitalised Warrenpoint.\nBarry Gray's men were six points adrift at the foot of the table in early December but have lost just once in nine league matches and are four points ahead of bottom-placed Institute.\n\"It has been a good run but it is all about what we can produce over the next five or so,\" said Gray.\n\"We were disappointing in last week's cup match against Linfield and it would be nice to see a positive response.\"\nLinfield's challenge for the league crown has faltered in recent weeks with just one win from their last five.\nOn Tuesday, Warren Feeney's Blues drew 2-2 at home to Cliftonville after leading 2-0 at the break.\nThey travel to Dungannon whom they have already beaten twice in the league this season.\n\"We are still in a great position and have 10 big games to go,\" said Feeney.\n\"I thought the boys were superb in the first half against Cliftonville but it was disappointing we did not close the game out.\"", "url": "https://www.bbc.com/sport/football/31453078"}