{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:52", "date_modify": "2025-05-21 06:37:52", "date_publish": "2025-04-01 00:00:00", "description": "In-form Charlton edge a hard-fought 2-1 win at Mansfield to make it seven wins and a draw in eight games.", "filename": "sport_football_live_cg4k4yz0lglt_1747809472.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/476e/live/70ff6540-0ee9-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cg4k4yz0lglt_1747809472.html", "title": "Mansfield Town 1-2 Charlton Athletic", "title_page": "Mansfield Town 1-2 Charlton Athletic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In-form Charlton edged a hard-fought 2-1 win at Mansfield to make it seven wins and a draw in eight games.\nCharlton were impressive for the first half-hour and almost went ahead after two minutes, Thierry Small heading a good chance wide from Tyreece Campbell's cross.\nChristy Pym was down well to save from Charlton's Macaulay Gillesphey after 13 minutes.\nBut in the 22nd minute Louis Reed's loose pass at the back intended for his keeper rolled straight to Matty Godden who made no mistake in tucking away his gift.\nStags went up a gear and after Reed had drilled inches wide in the 29th minute they were level after 40 minutes.\nBaily Cargill's cross was headed out to Matty Craig who smashed an unstoppable rising finish home from 16 yards off the underside of the bar.\nSoon after, Will Mannion had to get down to deny Caylan Vickers as Stags ended the half on a high.\nJosh Edwards saw his shot blocked on the line on the hour after a scramble from a corner.\nBut Charlton noses were in front again with 16 minutes to go as Tennai Watson found Campbell to his right and he beat Stephen McLaughlin before tucking a low 15-yard finish inside the near post.\nCharlton defended well under late pressure before Pym saved superbly from a powerful Chuks Aneke shot in added time.", "url": "https://www.bbc.com/sport/football/live/cg4k4yz0lglt"}