{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:46", "date_modify": "2025-05-21 04:09:46", "date_publish": "2024-12-29 00:00:00", "description": "Nectar Triantis' glancing first-half header earns revitalised Hibernian a fourth consecutive Scottish Premiership victory as they beat Kilmarnock.", "filename": "sport_football_live_c0mvk2y1l9dt_1747800586.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c0mvk2y1l9dt_1747800586.html", "title": "Hibernian vs Kilmarnock: Scottish Premiership report, reaction & head-to-head", "title_page": "Hibernian vs Kilmarnock: Scottish Premiership report, reaction & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheerio\nDundee United v Aberdeen has just got started, so we'll wrap this up.\nLook out for reaction from the three o'clock starts on our club pages.\nThe Scottish Premiership is almost done with 2024 but we don't have to wait long for our next fix.\nAll 12 clubs are back on 2 January, with Rangers v Celtic and a Dundee derby topping the bill.\nSee you in 2025!\nMassive win for Dundee\nFT: St Mirren 1-2 Dundee\nKheredine Idessane\nBBC Scotland at the SMISA\nYou have to give Dundee huge credit. Manager Tony Docherty will be without key centre-half Antonio Portales until mid-February. He then watched two other defenders, Jordan McGhee and Billy Koumetio, come off injured within 25 minutes.\nStill his men had enough to get the job done, thanks to the calm head of Simon Murray. Two goals, two headers, three massive points. A sizeable and noisy travelling support is now looking forward to a sold-out Dundee derby at Dens on Thursday with a little extra relish.\nFor St Mirren, it seemed a game too far. Following the energy-sapping win over Rangers last time out, they just didn't have enough quality to break down a makeshift but sturdy Dundee defence but such has been their recent form, the Buddies can still reflect on a fine 2024 and a recent record that reads played ten, won six, lost only three.\nBoth these sides have eyes on another top six finish and you wouldn't bet against it, especially when Dundee get some key players fit again.\nFULL-TIME Motherwell 2-2 Rangers\nA wild game is, finally, brought to a close.\nMotherwell were dreaming of a first league win against Rangers at Fir Park since Boxing Day 2002 when Apostolos Stamatelopoulous and Tawanda Maswanhise had them ahead at half-time.\nHowever, substitute Hamza Igamane hauled Rangers back with a second-half brace.\nSubstitute Tony Watt had the ball in the net twice when it was 2-1 to the hosts, but referee Kevin Clancy ruled both efforts out.\nA frantic afternoon at Fir Park ends with Rangers 14 points behind league leaders Celtic.\nFULL-TIME Celtic 4-0 St Johnstone\nCeltic continue to cruise at the top of the Premiership table with a comfortable victory over struggling St Johnstone.\nDespite a solid first half display, Brendan Rodgers' side punished the visitors in the second and no wonder when you can bring the likes of Daizen Maeda and Callum McGregor off the bench.\nMore misery for St Johnstone as they end the year three points adrift at the bottom of the Premiership table.", "url": "https://www.bbc.com/sport/football/live/c0mvk2y1l9dt"}