{"authors": ["Mike Taylor", "www.facebook.com"], "date_download": "2025-05-21 06:59:04", "date_modify": "2025-05-21 06:59:04", "date_publish": "2025-01-22 15:53:10", "description": "Aston Villa news: Opinion - Is Lamare Bogarde set for proper breakthrough?", "filename": "sport_football_articles_c0m1r89zmrgo_1747810744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7569/live/57a66290-4781-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0m1r89zmrgo_1747810744.html", "title": "Aston Villa news: Opinion", "title_page": "Aston Villa news: Opinion - Is Lamare Bogarde set for proper breakthrough? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Players identified in their mid-teens as an emerging force can spend years orbiting the squads of major clubs, waiting for the opportunity to bloom. That has been the route for Lamare Bogarde.\nA quick internet search reminds us his name was in headlines when he was just 16, in Feyenoord's youth system, apparently with a host of Premier League clubs taking note. Five years on, if he is to make a major step forward into regular first-team football, perhaps it will finally come soon.\nAston Villa took him on in 2020, when Dean Smith was in charge, so Bogarde's nine first-team appearances technically span across three Villa bosses. This is slightly skewed by his first, in the callow youth squad Villa were forced to field in an FA Cup tie against Liverpool at the height of the pandemic, when the seniors were in quarantine.\nAlthough Bogarde then disappeared from the public spotlight for a while, we now see evidence Unai Emery has been paying close attention to his development.\nFor most of 2023 he was loaned to Bristol Rovers, and as his initial Villa contract wound down he approached the moment of decision, for player and club. Instead of moving him on, Villa signed him to a new contract last August, since when he has made a breakthrough of sorts.\nThe manner of that breakthrough, though limited, suggests Emery has confidence in him.\nWith Villa short of cover after an early-season injury to Matty Cash, Emery moved Bogarde away from his favoured position to fill the right-back space against Leicester and Everton, rather than use the more experienced Ezri Konsa there. Although the experiment ended at half-time in the first Champions League game in Bern, it still showed faith in Bogarde's ability.\nEvidently, he also has the qualities to play in midfield, too, having been called on to replace the injured Amadou Onana in the first half at Arsenal last weekend, and therefore present in Villa's recovery from two down.\nThat may be his most significant performance so far. Being seen as a dependable, versatile, fill-in player is not a bad role for a youngster at a club with a workload like Villa's, without the squad depth of some of its rivals.\nBogarde turned 21 earlier this month, and perhaps his football coming-of-age is close at hand.\nListen to full commentary of Aston Villa v West Ham at 16:30 GMT on Sunday on BBC Radio WM", "url": "https://www.bbc.com/sport/football/articles/c0m1r89zmrgo"}