{"authors": ["Anna Thompson", "www.facebook.com"], "date_download": "2025-05-21 04:21:38", "date_modify": "2025-05-21 04:21:38", "date_publish": "2025-04-06 06:21:55", "description": "Riley Sharpe, 10, is being tipped as Britain's next snowboard superstar after winning slopestyle and big air titles at the Brits.", "filename": "sport_articles_cedy9j118v1o_1747801298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78e6/live/97046520-12df-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cedy9j118v1o_1747801298.html", "title": "Riley Sharpe: Britain's next snowboard superstar?", "title_page": "Riley Sharpe: Britain's next snowboard superstar? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British freestyle skiing and snowboarding is already blessed with world beaters in Mia Brookes, Charlotte Bankes and Zoe Atkin.\nBut who could be the next generation superstar for Great Britain?\nRiley Sharpe was the name on everyone's lips at the British Freeski and Snowboarding Championships, aka the Brits.\nAnd for good reason.\nThe 10-year-old snowboarder swept the board, winning the overall slopestyle and big air titles - beating some athletes more than twice his age. He also took home the under-16 rail jam trophy and the under-12 snowboard cross title.\nThe last person under 12 to win a main title? That was Brookes, back in 2018, when she was 11. Still a teenager, she has gone on to become world champion, an X Games gold medallist and a World Cup overall crystal globe winner.\nThe Brits were being held in Mayrhofen, Austria, after a six-year hiatus for the full event because of the coronavirus pandemic.\nHis father James told BBC Sport: \"Riley amazes us every day with his hard work and dedication and it's great to see all that hard work pay off for him.\n\"Thank you to the Brits for putting on the competition to enable the best talent in the UK to showcase themselves. We can't wait to see how Riley progresses in the sport.\"\nSharpe has been snowboarding since the age of two - his ability soon became so evident that the family were advised to allow him to snowboard for a full season, rather than a week's holiday a year.\n\"We were told he had a gift and to give him a chance,\" James said, so they made the decision to support him and moved the family to France for the winter.\n\"He excelled faster than anyone expected. He is obsessed with it,\" James added.\nHe competed on the Swiss tour aged eight and won every competition in the under-11s category against other international snowboarders. This season, Sharpe claimed the under-12 title at the World Rookie Tour finals in Kaprun and is leading the Ziller Valley Rally - also in Austria - with one event to go.\nJohn Weatherley, who coaches him alongside Barry Parker, said: \"You can tell he's special. He's got a lot of style and is like a sponge when he's learning anything new.\"\nTo aid his training, the family are building a rail park at their property in the French ski resort of Avoriaz and split the winter season between France and the United States, where mum Jennifer was born.\n\"We were just casual snowboarders,\" Jennifer said. \"Now we chase the snow across the world!\"\nIn the summer months, the family are back in Nantwich in Cheshire and Sharpe trains at the Chill Factore in Manchester and Tamworth Snowdome.\nBrookes and her family live 10 miles away and Mia's mum Vicky has been advising the Sharpes on the number of competitions he should enter at his age - as well as keeping snowboarding fun.\nSharpe and Brookes, 18, have ridden together a number of times. Jennifer said: \"She's really good with him and understands because she's been on the same journey.\"\nAlthough Sharpe is eager to progress to major competitions as soon as possible, he will have to wait until he is 15 for World Cup events, and 16 for the Winter Olympics, which would mean being eligible for the 2034 Games.\nThere is no minimum age for the X Games, however, which is by invitation.\n\"Nothing scares me,\" Sharpe said. \"I can't wait for next season already. I want to keep pushing and showing what I can do.\"", "url": "https://www.bbc.com/sport/articles/cedy9j118v1o"}