{"authors": ["Gareth Griffiths", "Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-21 08:03:01", "date_modify": "2025-05-21 08:03:01", "date_publish": "2025-02-11 10:46:43", "description": "Warren Gatland leaves his role as Wales head coach by mutual consent after 14 successive Test match defeats.", "filename": "sport_rugby-union_articles_cpwrj451k95o_1747814581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b4b/live/ad111940-a678-11ef-9594-01270c2bfaac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpwrj451k95o_1747814581.html", "title": "Warren Gatland: Wales rugby union head coach leaves role during Six Nations", "title_page": "Warren Gatland: Wales rugby union head coach leaves role during Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warren Gatland has left his role as Wales head coach during the Six Nations after a record 14 successive Test match defeats.\nGatland, 61, was contracted until the 2027 World Cup but has departed by mutual consent, the Welsh Rugby Union (WRU) confirmed.\nCardiff head coach Matt Sherratt will take over as interim head coach for the remaining three games of the Six Nations.\nWRU chief executive Abi Tierney said Gatland initiated talks over his future after the loss in Italy on Saturday in which both parties agreed an immediate change was \"in the best interests\" of the Wales squad.\nIn a statement, Gatland said: \"I would like to thank the WRU board for the faith shown in me after a tough campaign throughout 2024 and affording me the time and resource to try to turn things around for this 2025 tournament.\n\"We have worked hard, we have a talented young squad that is developing and have been desperate to turn potential into results but now is the right time for a change.\n\"I've reached the end of this particular chapter, but remain grateful to all those in Wales who have supported me, the players who have played for me and all those around me, especially my management team, who have contributed to what we have achieved over the years.\"\nNo announcement has been made on the rest of the current coaching team.\nWales face Ireland on 22 February in Cardiff, then travel to Scotland on 8 March before finishing the tournament at home against England on 15 March.\nTierney said the WRU wants to appoint a permanent successor before the summer tour to Japan with \"all options open\".\nFormer Australia coach Michael Cheika, Glasgow coach Franco Smith and Ireland interim boss Simon Easterby are potential long-term successors.\n\"We are grateful to Warren for all he has done for the game in Wales. He remains our longest-serving and most decorated head coach in terms of the silverware he has won,\" said Tierney.\n\"It is a credit to [Sherratt] that he has not hesitated to answer Wales' call.\"\nGatland presided over statistically the worst Wales side in their 144-year international rugby history, slumping to their 14th successive defeat as they lost 22-15 to Italy in Rome last weekend.\nThe New Zealander previously enjoyed a successful 12-year spell as Wales coach which included three Grand Slams, two World Cup semi-finals and a record run of 14 victories that led to Wales briefly topping the world rankings.\nHe left after the 2019 Rugby World Cup before returning for a second stint when he replaced Wayne Pivac in December 2022.\nSince then Gatland has overseen just six victories in 26 Tests - a win ratio of just 23%. Wales have also slumped to a lowest position of 12th in the world rankings.\nOver both spells Gatland has been in charge for 151 games with his overall record standing at 76 wins, 73 defeats and two draws.\nGatland offered to resign after the loss to Italy in 2024 but vowed to fight on immediately after the latest defeat by the Azzurri.\nFollowing the winless autumn 2024 series - which included defeats against Fiji, Australia and South Africa - the WRU held a review.\nGatland was given the green light to continue for the 2025 Six Nations but his second stint sunk to a new low with a record 43-0 defeat in the opening game against France in Paris, before the loss in Rome.\nIt is the third time a Wales head coach has left in the middle of the Six Nations following Graham Henry (2002) and Mike Ruddock (2006).", "url": "https://www.bbc.com/sport/rugby-union/articles/cpwrj451k95o"}