{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:19:05", "date_modify": "2025-05-21 04:19:05", "date_publish": "2025-02-09 13:04:06", "description": "Rookie fly-half Fin Smith showed England there is another way to play after stepping in for maverick Marcus Smith says Matt Dawson.", "filename": "sport_rugby-union_articles_cg7z4k49lxko_1747801145.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3f9/live/fc177300-e6e1-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cg7z4k49lxko_1747801145.html", "title": "Six Nations: Fin Smith gives England new dimension", "title_page": "Six Nations: Fin Smith gives England new dimension - Matt Dawson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In his BBC Sport column, World Cup winner Matt Dawson examines the different outlook that rookie fly-half Fin Smith gave England in their surprise win over France.\nThis was such a gritty performance by England, but by no means perfect.\nIt couldn't have been. France could, perhaps should, have been out of sight.\nFrance's performance in the first 60-odd minutes was good enough to put themselves in an unassailable position, but they coughed up two or three tries.\nSport is like that though.\nIt is not about how many opportunities you create, it is about how many you take. You have to execute and seize those moments.\nAnd Fin Smith did exactly that.\nOver the past year, England have suffered a series of narrow defeats that have left us crying out for nouse, character and game management.\nWhen it mattered on Saturday, they had that in spades.\nOnce England got themselves through an opening passage in which France were getting round the defence, offloading and finding space, they stood up, stayed in the fight, and worked out where to apply the pressure in the right areas.\nFin Smith had a couple of moments, particularly in the first half, in which the reality of being at the centre of a monster Test match hit him hard.\nThere were a few wayward kicks where he looked rushed into decisions by the faster pace of the game.\nBut in the second half, he understood the situation.\nHe saw that England needed to play, needed to be more ambitious.\nBut in that decision you saw the difference between him and Marcus Smith.\nMarcus Smith is a brilliant runner, who breaks lines and beats defenders. No-one in the England team can do that like him.\nBut it means that when the pressure comes on and the team needs to chase, he naturally takes that responsibility on himself and relies on his own individual ability. It will be a goosestep or a dummy. An attempt to conjure something magical out of nothing.\nFin Smith's mindset is a little different. His first thought will be how to create a situation for the team to exploit.\nHis breadth of vision and understanding meant that he could spot those possibilities.\nFor England's second try he saw Northampton team-mate Tommy Freeman isolated against the smaller Louis Bielle-Biarrey and put the cross-field kick on a sixpence.\nIn that helter-skelter finale to the game, his execution was so accurate; doing the right thing at the right time and understanding the physics of the situation and how to exploit it.\nNowhere was that clearer than on the final, decisive try.\nOutside centre Pierre-Louis Barassi, with four previous caps, was the least experienced of the France starting XV, but England hadn't been able to test him.\nBut after a spotless line-out drill from replacements Jamie George and Ollie Chessum had provided front-foot ball, England worked it perfectly.\nAll the different moving parts came together to unlock the France defence.\nFreeman's dummy run fixed Barassi, Fin Smith floated out the back beautifully and delayed his pass to bring Elliot Daly into the hole on a clever arcing line for the try.\nEngland made it look easy, but to get all those things right when you are deep in the game, with fatigue affecting your skills and the pressure bearing down, is so hard.\nI don't think it gets any better than to finish a game like that.\nIt showed that England have the ability to dominate teams in those \"championship minutes\" – the times that really matter, the ones that France fluffed in the first half.\nMarcus Smith is a game-breaker. He score tries, he is on all the posters and is so exciting to watch - his is probably the one name that kids growing up who want to get into rugby know about.\nBut at that level yesterday, it is very difficult to integrate those type of players into key decision-making roles.\nWhile George Furbank recovers from his injury, I think Marcus Smith will play at full-back, but I don't necessarily think he is the long-term solution there.\nFin Smith showed there is a difference in the way you can compete. There has to be an element of calmness and control. For all his individual gifts – perhaps because of them - that isn't Marcus Smith's forte.\nI don't think it will be a difficult decision for Steve Borthwick.\nIn opting for Marcus Smith over Freddie Steward at full-back, you sacrifice aerial security for more of an attacking threat, but I think that is a price worth paying for this England team.\nLong-term though, particularly with the Northampton connection, I foresee George Furbank coming back into the team at 15.\nTest match rugby is tough.\nIt is uncompromising high-performance environment. We are now more mindful of looking after each other in the work place and that is vital and important. But this is sport and it is a strict meritocracy. If there is someone who will serve the team better, you are out. And that is OK.\nIt is up to every player to prove they either deserve to stay in the team or should oust the person in possession of the shirt.\nEngland for too long have handed out caps based on the fact that you were in the week before.\nIt has started to frustrate me. I understand consistency is important, but the number of caps you have doesn't give you some special quality. It means so very little. When talent is coming through, you can't deny it.\nTom Willis is a good example. I thought he had really steady game at number eight and the balance of the back row looked good, with Ben Earl playing at open-side flanker where he is best.\nYou can't be scared to put these players in. We have to see what they are like in the heat of battle. There will be wobbly moments, but you will also see what they are capable of.\nThat was certainly the case with Fin Smith.", "url": "https://www.bbc.com/sport/rugby-union/articles/cg7z4k49lxko"}