{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:25", "date_modify": "2025-05-21 04:09:25", "date_publish": "2024-12-29 00:00:00", "description": "Tom Cannon scores a stoppage-time winner as managerless Stoke check Sunderland's promotion momentum.", "filename": "sport_football_live_c5yd29zvj2vt_1747800565.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5yd29zvj2vt_1747800565.html", "title": "Stoke City 1-0 Sunderland: Cannon goal gives managerless Potters victory", "title_page": "Stoke City 1-0 Sunderland: Cannon goal gives managerless Potters victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Cannon fired managerless Stoke City to a dramatic stoppage-time victory against promotion-chasing Sunderland at the bet365 Stadium.\nThe Potters striker's 10th goal of the season, two minutes into added time, gave caretaker manager Ryan Shawcross victory at the first attempt following the sacking of Narcis Pelach.\nPelach was dismissed following their Boxing Day defeat by Leeds after winning just three of his 19 matches in charge.\nIt was a first win in 10 for Stoke and checked Sunderland's promotion momentum, having started the day in fourth and unbeaten in their previous five games.\nWhile the Black Cats created more than enough chances to win comfortably, Cannon's unstoppable shot, rifled in from 25 yards, sent them home empty-handed.\nShawcross, though, once again owed a huge debt of gratitude to goalkeeper Viktor Johansson, who kept the Black Cats at bay with another towering performance between the sticks.\nSunderland had to call on their own keeper Anthony Patterson several times in an entertaining encounter.\nBut it was the home side's MVP who was the busier of the two with Sunderland having 22 shots and seven on target but unable to find a way past the Swede.\nJohansson denied Milan Aleksic and Trai Hume in a lively first half but it was his save from Adil Aouchiche, low to his left at the near post after the forward charged into the area from the right flank, which stood out.\nIt was not all one-way traffic with both Cannon and Lewis Koumas testing at the other end.\nKoumas was again unable to beat Patterson 20 minutes into the second half, with Chris Mepham clearing the ball off the line in the aftermath.\nAouchiche hit the woodwork for Sunderland and then two minutes later delivered a cross to Eliezer Mayenda, only to see him put his header from six yards out wide of the post.\nIt was an awful miss and one punished by Cannon, who was cautioned for excessive celebration following his goal.\nSunderland had one last chance to level deep into injury time but Mepham's effort from the edge of the box was saved to his right by Johansson.\nRegis Le Bris' side remain fourth but still four points adrift of Leeds in the second automatic promotion spot, with the West Yorkshire side in a later kick-off against Derby County.\nFor Stoke, a sixth win of their campaign, saw them move up to 18th place, four points away from the danger zone at the foot of the table.\nStoke caretaker manager Ryan Shawcross told BBC Radio Stoke:\n\"The game plan was a risky one as I wanted the lads to go for it and get after Sunderland. I knew at times they would cut through us at times if we did, but second half I felt we had a right good 20 minutes where we probably didn't get enough finishes or end product.\n\"Then to win it in the last minute, the feeling in the stadium was amazing and the sort of thing you dream of.\n\"With a few slight changes, I think there is a group in there who can move forward and be successful. The season has not been great but we spoke about a moment in the season where you have an upturn and hopefully that was it.\n\"[On whether he wants the job full time] I've had one game. I will concentrate on Burnley, if they need me to take it. I would love to know what is going to happen but you never know in football. We will see how it goes.\"\nSunderland manager Regis le Bris told BBC Radio Newcastle:\n\"[I am] Disappointed, but it is a long league and a tough league with many, many games in a short period.\n\"The most difficult part of the pitch is always the final third. We created many chances I think we had 22 shots and two on the post, three big saves from the goalkeeper. Sometimes football is like that.\n\"Sometimes you score with one chance and other times you can't score with six, seven, eight or nine big chances.\n\"But the spirit was good and we have to keep the way we want to play. Sometimes we deserve to win and sometimes we don't, so no drama.\"", "url": "https://www.bbc.com/sport/football/live/c5yd29zvj2vt"}