{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 07:30:12", "date_modify": "2025-05-21 07:30:12", "date_publish": "2025-03-28 17:52:23", "description": "Rocky Bushiri hasn't received 'official offer' to stay at Hibs", "filename": "sport_articles_c4g9gz90e2eo_1747812612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2cb2/live/2cec6450-0bf8-11f0-8dd7-cb9a32074811.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4g9gz90e2eo_1747812612.html", "title": "Rocky Bushiri hasn't received 'official offer' to stay at Hibs", "title_page": "Rocky Bushiri hasn't received 'official offer' to stay at Hibs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibs head coach David Gray says \"communication\" with Rocky Bushiri about a new deal is ongoing, with the defender's contract expiring this summer.\nBushiri, 25, made his first competitive appearance for DR Congo in their 1-0 victory over South Sudan in a World Cup qualifier last week.\nWhen asked if he expected Bushiri's future to be at Easter Road, Gray said: \"It could well be.\n\"I think there is communication going on, as there is with all the players that are out of contract. And right now, there's no distractions for what we're trying to do.\n\"He's fully focused on what he wants to try and do. And now that he's back, he's trying to make sure he stays in the team and plays at a certain level. Because I've said it all the time, you're constantly being judged when you pull on the jersey.\n\"Whether that's to earn a contract here or elsewhere, it's in your best interest to do the best you can. And if a team's successful and individually we're successful, then everybody benefits.\"\nBushiri remains in the dark about whether his future lies away from Easter Road and says he has not received an \"official offer\" to stay.\n\"I don't know if I'm honest,\" the former Norwich City defender said. \"I don't know what the future looks like but I hope it's a positive future.\n\"Why not [stay at Hibs]? I have been exchanging thoughts with the manager and the club over the last few months. But an official offer hasn't been there yet.\"", "url": "https://www.bbc.com/sport/articles/c4g9gz90e2eo"}