{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 04:44:40", "date_modify": "2025-05-21 04:44:40", "date_publish": "2025-04-03 06:13:45", "description": "Olympic 1500m medallist Yared Nuguse's ambition has always been to become an orthodontist, but a career as a professional athlete has put those plans on hold - for now.", "filename": "sport_athletics_articles_c05ngvep18yo_1747802680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ffb/live/3217f9c0-0f14-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c05ngvep18yo_1747802680.html", "title": "Yared Nuguse: Olympic 1500m medallist chasing golds before return to dental school", "title_page": "Yared Nuguse: Olympic 1500m medallist chasing golds before return to dental school - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yared Nuguse's childhood ambition has never changed.\nWhile the 25-year-old made the podium in the fastest Olympic men's 1500m final in history, his dream since 13 has been to qualify as an orthodontist.\nBut world gold is the American's target in 2025 as he builds towards a shot at Olympic glory in Los Angeles in 2028 - an achievement the self-confessed 'Swiftie' hopes will grant him the opportunity to at last meet singer Taylor Swift.\nThe deadline for this chapter of his life has been set, however - Nuguse has no intention of delaying his career in dentistry beyond the end of his 20s.\n\"I always said I will get back to dentistry. The goal is 2029 right now, so I'm going to enjoy these years of running while I have it,\" Nuguse tells BBC Sport.\n\"When I had braces I was such a huge fan of my orthodontist. I now have a smile that I'm really proud of and that is something I would love to provide to a lot of other kids. You can give them this permanent confidence boost.\n\"I'd always been the nerdy, smart type and I'd just pointed everything towards getting into dentist school. Running was just this fun little side thing.\"\nNuguse never saw himself as the sporty type.\nAt high school, he joined the bowling team to satisfy his extracurricular requirements, as it seemed \"a great way to be in sport without being in a sport\".\nThe admissions tests were completed, the offers from dental schools were in.\nBut everything changed on the day his PE teacher informed the school's track coach of his talent - an intervention which led Nuguse to rethink his plans and, ultimately, claim Olympic bronze in one of the most eagerly anticipated events of Paris 2024.\nNuguse, who also won world indoor silver last year, has asserted himself as a key player in a men's 1500m event that has captured widespread attention amid the rivalry between Josh Kerr and Jakob Ingebrigtsen.\nBut as Kerr and Ingebrigtsen engaged in a public war of words last year, Nuguse was happy to leave the spotlight to his competitors and enjoy the fallout from afar.\n\"There's already a lot of pressure on all of us but at the Olympics there was a little more on them, and a little less on me,\" says Nuguse.\n\"I did love going to practice earlier in the year and it was like 'oh my God, did you hear what they said?' It's the juiciest running drama we've had in a long time.\n\"It is a little funny how serious it felt in the moment. You can't focus on it too much because it's their business, but it made good running conversation, that's for sure.\"\nNuguse beat defending champion Ingebrigtsen and finished within 0.15 seconds of gold in a dramatic Paris final, in which Cole Hocker squeezed past Britain's world champion Kerr to win in an Olympic record time.\nThe event's current heavyweights represent four of the nine fastest men in history over the distance, but Nuguse is the only one yet to get his hands on gold.\nHe believes this year's World Championships in Tokyo will provide his crowning moment.\n\"You're really happy and proud of yourself but, at the same time, you're still yearning for more,\" says Nuguse, who broke the indoor mile world record in February only to see Ingebrigtsen beat it five days later.\n\"I know I can win these races, I was right there with them. It's just a matter of doing literally that last 1%, or 0.1%.\n\"It just feels like it's my time. I can taste it, I'm so close.\"\nBefore aiming for his first global title in September, Nuguse will compete in the inaugural season of Michael Johnson's Grand Slam Track, which begins in Kingston, Jamaica on Friday.\nAs a contracted racer, he will line up against fellow Olympic medallists Hocker and Kerr over 800m and 1500m at four 'slams', with a total prize pot of $12.6m (£10m) on offer to athletes, in addition to a base salary.\nHowever, Johnson's controversial decision to exclude field events from the competition has been criticised.\n\"I'm very excited. It's shaping up to be something really cool and really fun,\" says Nuguse.\n\"Track doesn't really have this pinnacle league like a lot of other sports do and it's largely because our sport is so different to a lot of traditional sports.\n\"It would be nice for track athletes to be treated like athletes in other professional sports, especially at the top level.\n\"I think it's definitely a good shot at making something that could last and promote more of a professional league. I'm very interested to see how it's received but [Johnson] seems to be doing everything right.\"\nNuguse's pet tortoise Tyro has only been out of hibernation for a few days when we speak, but the laid-back athlete is grateful to have his companion back.\n\"The irony was a big part of it. I often joke that he absorbs all my slow energy for me, so that I can be as fast as I want,\" says Nuguse.\nIt will likely not be long before he once again becomes the star of the American's social media accounts, providing an outlet for Nuguse's silliness without having to be the main focus himself.\nLast week, after waiting one year, Nuguse introduced his boyfriend, Julian, to his 85,000 followers.\nOn the door behind him, a sign reads 'Beware of Goose', after a high school news article coined the phrase 'the Goose is loose' as his running talent became increasingly apparent - and his team-mates ensured the nickname stuck.\nThis journey was not one Nuguse ever expected, the attention it has brought unnatural. He always had another plan beyond the track.\nBut his self-imposed deadline in the sport - before embarking on four years of dental school and a further two years of specialisation - is only serving to enhance his enjoyment of this current assignment.\n\"Hopefully, if I win Olympic gold, I'd probably like to do a bit of 2029 as a little victory lap, or a year where I just do fun races,\" says Nuguse.\n\"Running is something that I love so much and has brought me so much joy, but it's not something you can do forever.\n\"Having a deadline, you know you have to enjoy these years because you're going to blink and, the next thing you know, it's all over.\"", "url": "https://www.bbc.com/sport/athletics/articles/c05ngvep18yo"}