{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:51:47", "date_modify": "2025-05-20 12:51:47", "date_publish": "2023-08-03 11:00:06", "description": "Marcus Smith will start at fly-half for England against Wales in Cardiff on Saturday, with Ellis Genge captaining the side.", "filename": "sport_rugby-union_66394269_1747745507.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/42F6/production/_130624171_smithil.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66394269_1747745507.html", "title": "Wales v England: Marcus Smith starts at fly-half with Ellis Genge captain", "title_page": "Wales v England: Marcus Smith starts at fly-half with Ellis Genge captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marcus Smith will start at fly-half for England against Wales in Cardiff on Saturday, with Ellis Genge captaining the side.\nSmith, 24, last started for England in the 53-10 defeat by France in the Six Nations, and is joined by Harlequins team-mate Danny Care at scrum-half.\nFlanker Tom Pearson makes his debut, while potential debutants Theo Dan and Tom Willis are on the bench.\nMax Malins is the only player from the Premiership final in the starting XV.\nThis is the team's final match before head coach Steve Borthwick confirms his 33-man squad for the World Cup in France on Monday morning.\nRegular captain Owen Farrell, plus fellow stalwarts Jamie George and Maro Itoje, who helped Saracens win the Premiership final against Sale, are absent from the squad.\nSmith gets another opportunity to showcase his talent after a mixed Six Nations that ended with Farrell re-establishing himself as the starting number 10.\nSale's George Ford, who played under Borthwick during Leicester's Premiership title-winning season in 2022, is the back-up fly-half on Saturday.\nThere are only five starters from the team that played Ireland in the Six Nations finale in March. Prop Genge, who captained England against France, is joined in a new front row by Newcastle hooker Jamie Blamire and Bath's Will Stuart, with David Ribbans and George Martin in the second row.\nBoth Lewis Ludlam and Alex Dombrandt started the game against Ireland and are joined by debutant Pearson in the back row.\nIn the backline, Leicester centre Guy Porter partners Stade Francais' Joe Marchant in a new-look midfield, with Bath winger Joe Cokanasiga returning to the side.\nFull-back Freddie Steward, who was sent off in the defeat by Ireland, also remains in the starting XV.\nPearson, who was formerly of London Irish before signing for Northampton for next season, won the Premiership's breakthrough player of the year award in 2023. An all-action flanker, the 23-year-old trained with England during the 2022 Six Nations and with the back row being one of the most competitive selection areas, knows he has to take his opportunity.\nHooker Dan, 22, could also make his debut. He began his youth career on the wing and at centre before transitioning into the front row during his time in the Saracens academy.\nLearning his new trade on loan at Old Alleynians in level nine of the Rugby Union League, Dan has climbed through the pyramid of English rugby at a rapid rate. He then featured in National League 1 for Bishop's Stortford, before starting last season at Ampthill.\nHis breakthrough season with Saracens ended with a Premiership winners medal, playing 70 minutes of the final after an early injury to George.\nWillis, 24, is the oldest of the potential debutants and will be keen to secure his place in the World Cup squad alongside brother Jack. Similar to his brother, he spent the year in France playing in the Top 14 with Bordeaux Begles following the financial collapse of his boyhood club Wasps, and will play his rugby at Saracens next season.", "url": "https://www.bbc.com/sport/rugby-union/66394269"}