{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 03:43:21", "date_modify": "2025-05-21 03:43:21", "date_publish": "2025-01-26 06:55:56", "description": "Kyran Bracken and Mike Friday represented England. Now their sons, like other rugby offspring, are following in their footsteps", "filename": "sport_rugby-union_articles_cm216804l3jo_1747799001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/798b/live/6e18e140-da5e-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cm216804l3jo_1747799001.html", "title": "England under-20 Six Nations: Father-son dynasties powering the future", "title_page": "England under-20 Six Nations: Father-son dynasties powering the future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lucas Friday and Jack Bracken need only look sideways for inspiration.\nIn July, they lined up to play France in the Under-20 World Cup final in Cape Town.\nAlongside them then, singing the anthem, were England team-mates Asher Opoku-Fordjour, Henry Pollock and Afolabi Fasogbon.\nA little more than six months on and Opoku-Fordjour has already won his first senior cap, Pollock has been called up for the Six Nations and Fasogbon surely would have been, but for an untimely injury.\n\"They have done incredibly really - the way they have adapted to the Premiership and showed themselves on big stages,\" Friday tells BBC Sport.\n\"It is testament to the team and to age-group rugby in England right now,\" adds Bracken.\nAs they pursue the same pathway, Friday and Bracken can also look back for guidance.\nElite rugby is in their family trees, just a generation behind.\nFriday's father Mike played for Wasps and Harlequins and captained England's Sevens team.\nBracken's father Kyran was a scrum-half who won the last of his 51 caps for England in the 2003 World Cup semi-final win over France.\nLucas and Jack are far from the only sons getting into a family business either.\nOllie Sleightholme (son of former England wing Jon), Greg Fisilau (son of Tonga international Kenni), Josh Beaumont (son of former England captain Bill), Reuben Logan (son of Scotland wing Kenny), Sonny Tonga'uiha (son of Tonga prop Soane) and Tyler Offiah (son of league legend Martin) are all playing for Premiership clubs.\nIn the Bath backline alone, Cameron Redpath (son of former Scotland scrum-half Bryan), Max Ojomoh (son of former England flanker Steve) and Tom de Glanville (son of former England captain Phil) are competing for spots.\nOverseas, Damian Penaud (son of former France fly-half Alain) and Max Jorgensen (son of ex-Wallaby Peter) have followed their fathers into Test rugby.\n\"It is definitely a massive advantage,\" says 19-year-old Bracken.\nFor him though, neither genetics or tactics are the most valuable inheritance from his father.\nInstead it is the closeness to someone who has also experienced the emotional bumps and knocks that come with being a promising sporting prospect and can offer support.\n\"More than anything it has been the off-pitch stuff that has been really beneficial, just developing as a person, as well as a rugby player, and dealing with setbacks,\" he adds.\n\"Having a parent who knows the ins and outs of all those processes makes the transition from amateur rugby to professional a lot easier.\n\"It is really reassuring to have my dad in that picture to guide me through.\"\nThere are challenges that come with a famous family name though. These are young men carrying the preconceptions and expectations of others.\n\"I always get called Mike Friday's son, every time,\" says 18-year-old Friday with a smile.\n\"I want to make a name for myself as well. My dad has done everything - he was really good - but obviously I want to try and push on for myself.\n\"It is not about escaping his shadow. I just want to be seen as my own person as well, not just a son.\"\nFor Bracken it is about being more than a brother as well. Charlie, two years older, is also on Saracens' books and has represented England Under-20s in the past.\nBracken says being a wing rather than a scrum-half like Charlie and Kyran limits comparisons, though even if they do come he has the belief that he could hold his own against his father's heyday.\n\"I have been shown a few highlight reels and been told my dad used to be quicker than me - I'm not sure that works any more!\" he says.\n\"I have also watched a few England games from the 2003 World Cup run. It is funny seeing how the game has changed so much in a short space of time, with the speed and the structure there is now.\n\"I wonder how good he would be today. I'm sure he would do all right.\"\nThe more pressing question for many England fans is how good this generation of youngsters can become after winning the junior versions of both the Six Nations and World Cup in 2024.\nBracken, who is studying at Loughborough University, made his Saracens debut earlier this season in the Premiership Cup, while Friday appeared in the Premiership for the first time in December, coming off the bench in a victory over Newcastle.\nAmong the under-20s preparing for their Six Nations opener against Ireland on Thursday, they are now the wise, old heads.\n\"There are different faces from last time, but I am really enjoying the vibe and brotherhood we have got going,\" says Bracken.\n\"It has almost continued from last season and built again this season.\"\nFrom babes-in-arms to brothers-in-arms, they won't be the last to follow their parents' stud marks towards the top.", "url": "https://www.bbc.com/sport/rugby-union/articles/cm216804l3jo"}