{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:02:44", "date_modify": "2025-05-20 13:02:44", "date_publish": "2023-08-01 10:35:19", "description": "Marc Leonard says he was given \"a lot of say\" by Brighton about a loan move and is delighted to return to Northampton.", "filename": "sport_football_66371771_1747746164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6482/production/_130603752_gettyimages-1578840669.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66371771_1747746164.html", "title": "Marc Leonard: Northampton return had 'right feel', says loanee midfielder", "title_page": "Marc Leonard: Northampton return had 'right feel', says loanee midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Marc Leonard says returning to Northampton for a second loan spell is \"a step in the right direction\".\nThe 21-year-old made 48 appearances last term as the Cobblers won automatic promotion from League Two.\nIt was not enough to persuade boss Roberto De Zerbi to include Leonard in his 2023-24 plans for parent club Brighton & Hove Albion.\n\"I talked to other clubs and other managers, but I got the right feel about coming back,\" he said.\n\"It was key that it wasn't (going to be) on a par with last season, it's a step in the right direction which for me is perfect.\n\"A few of the lads have been badgering me all summer about coming back so it's nice to see everyone again,\" the Scotland Under-21 international told BBC Radio Northampton.\nLeonard played an hour of Northampton's weekend pre-season friendly against MK Dons after completing his loan return last week.\nAnd he is happy that he was given a \"lot of say\" by Brighton as to where he would spend the upcoming season.\n\"I can't speak for other clubs but at Brighton it was a lot based on what I thought,\" he said.\n\"Brighton guide you in the right direction and both clubs thought it would be beneficial (for me to come back).\"\nThe Cobblers sealed third place in League Two with a 1-0 win at Tranmere on the final day of last season and start the new campaign with a home game against Stevenage, who were promoted alongside them.\n\"Those moments will live me forever,\" added Leonard. \"The fact that I can come back and experience being here again is something I wanted to do.\"", "url": "https://www.bbc.com/sport/football/66371771"}