{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:33:48", "date_modify": "2025-04-26 04:33:48", "date_publish": "2025-03-06 00:00:00", "description": "Follow live text commentary, score updates and match stats from FCSB vs Olympique Lyonnais in the UEFA Europa League", "filename": "sport_football_live_clyn2mvn9gjt_1745642028.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_clyn2mvn9gjt_1745642028.html", "title": "FCSB vs Olympique Lyonnais: UEFA Europa League stats & head-to-head", "title_page": "FCSB vs Olympique Lyonnais: UEFA Europa League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This will be the fifth European meeting between FCSB and Lyon having met in the UEFA Champions League group stages in 2006-07 and 2008-09 (three Lyon wins and one draw).\nLyon have only faced Sparta Prague (6) and Fenerbahçe (5) more often in major European competition without ever suffering a defeat than they have FCSB (P4 W3 D1).\nFCSB have won the first leg of each of their last three knockout ties in major European competition (all in the UEFA Europa League), although they have only gone on to progress from one of those ties (eliminated by Chelsea at this stage in 2012-13, Lazio at the last 32 stage in 2017-18, progressing past PAOK Salonika in this season’s play-off).\nLyon are unbeaten in their last 11 away games in the UEFA Europa League (W8 D3 – a run stretching across three different seasons), since a 1-0 loss at Atalanta in their final group game of the 2017-18 campaign.\nNo side has scored more set piece goals (excluding penalties) than FCSB in this season’s UEFA Europa League (6), with five of their last seven goals in the competition coming from corners (also a competition high this term, alongside Bodø/Glimt.", "url": "https://www.bbc.co.uk/sport/football/live/clyn2mvn9gjt"}