{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:22:45", "date_modify": "2025-05-20 13:22:45", "date_publish": "2023-08-02 10:18:50", "description": "Massive investment leads to sense of expectation at Hibs", "filename": "sport_articles_cyjgw1grp3no_1747747365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f3d1/live/7c0743c0-3111-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cyjgw1grp3no_1747747365.html", "title": "Massive investment leads to sense of expectation at Hibs", "title_page": "Massive investment leads to sense of expectation at Hibs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brian McLauchlin, BBC Sport Scotland\nThe defeat last week in Andorra rocked everyone associated with Hibernian. Indeed, some of the hardy band who travelled to the Pyrenees last week vented their frustrations towards the team and the management on the full-time whistle.\nIn fairness, it is only half-time in the tie and there were mitigating circumstances, but there can be no excuses on Thursday, when the players and management have an opportunity to regain some of the trust lost last week.\nThe Easter Road board have backed the manager financially with massive investment in new players coming in.\nSerious transfer fees have been paid to secure the services of Dylan Vente from Roda JC, Dylan Levitt from Dundee United, and Ellie Youan who made his loan move from Swiss side St Gallen permanent towards the end of last season.\nIn addition, two goalkeepers Max Boruc and Joe Wollacott have been signed, defenders Jordan Obita and Ricky Harbottle have come in, along with Will Fish who is returning for his second loan spell at the club.\nThe experience of striker Adam Le Fondre should also prove to be crucial throughout the campaign.\nBut similar to Edinburgh rivals Hearts, judgement will be made on Hibs' league position next May. The fans and the board now expect to challenge for third place given the level of investment.", "url": "https://www.bbc.com/sport/articles/cyjgw1grp3no"}