{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:07", "date_modify": "2025-04-26 04:26:07", "date_publish": "2025-03-03 11:37:34", "description": "Brighton news: Seagulls fan on Fabian Hurzeler's age being an advantage", "filename": "sport_football_articles_ce8m1xymln0o_1745641567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f519/live/0441fe90-f80a-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8m1xymln0o_1745641567.html", "title": "Brighton news: Seagulls fan on Fabian Hurzeler's age being an advantage", "title_page": "Brighton news: Seagulls fan on Fabian Hurzeler's age being an advantage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton fan Scott Daly says Fabian Hurzeler has started his reign at Amex Stadium \"incredibly\" since taking charge in the summer, adding that the Seagulls are \"one point better off\" in the Premier League this season than at the same point under Roberto de Zerbi in 2023-24.\nSpeaking to BBC Radio Sussex about Brighton's season so far, Daly said: \"In the Premier League, Brighton have only lost six games this season. If you think back to five or six years ago, it is incredible to have only lost six games over halfway through the season.\n\"There have been quite a few draws where we could have stolen points and we should be in the top four, but Brighton are a very well-managed team at the moment. The club is very well run from the top to the bottom.\n\"Hurzeler has started incredibly. He has had an impact straightaway. Yes there was a little blip halfway through this season, but we are obviously on the rise again.\n\"If you are going to compare him with other managers, then I think that's silly. If you did want to compare him then I'm pretty sure that at this point in Roberto de Zerbi's last full season, we are one point better off than De Zerbi was.\n\"Being a young manager, some of your players are going to be a little bit older than you, but you are a manager who can gel with the team a little bit more.\n\"He can sympathise with them and he knows what's going on at that age. He can be more down to earth with them. Rather than being that father figure, he can be that brother figure that has a bit of banter with them and encourages them to do better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8m1xymln0o"}