{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:41:02", "date_modify": "2025-05-20 12:41:02", "date_publish": "2023-08-03 16:16:08", "description": "Balogun, Nketiah, and Biereth - Motherwell striker's impressive pedigree", "filename": "sport_articles_cgr8dn3e0k3o_1747744862.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7942/live/2dbe5290-320f-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cgr8dn3e0k3o_1747744862.html", "title": "Balogun, Nketiah, and Biereth - Motherwell striker's impressive pedigree", "title_page": "Balogun, Nketiah, and Biereth - Motherwell striker's impressive pedigree - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George O'Neill, BBC Sport Scotland\nMotherwell manager Stuart Kettlewell spoke about how excited he is to land Mika Biereth on loan from Arsenal, and a quick look at the 20-year-old's background explains why.\nArsenal's Hale End academy has churned out high-quality footballers consistently over the last decade or so - Bukayo Saka and Emile Smith-Rowe in Mikel Arteta's side are the obvious evidence of that.\nBiereth signed for Arsenal after banging in the goals for Fulham's youth sides - including 21 in 21 games during season 2020-21 - and joined a crop of young strikers that included Eddie Nketiah and Folarin Balogun, yet still managed to make an impact.\nHe continued to be a reliable source of goals at youth level, featured in first-team squads for Arsenal, and then last season earned a loan move to the Eredivisie with RKC Waalwijk.\nThere's more to Biereth's skill-set than just finishing. His intelligent movement, link-up play and creative flair has helped make him a regular provider of assists.\nHis time in the Netherlands was plagued by injuries, and while he fought back to full fitness, he saw contemporaries Nketiah and Balogun shine.\nNketiah was a feature in the Arsenal side that challenged Manchester City for the Premiership title, while Balogun scored 21 goals in Ligue 1 on loan at Reims and also made his international debut for the United States.\nIf Biereth can go some way to replicating those feats, Motherwell's Kevin van Veen-shaped hole may not be quite so big...", "url": "https://www.bbc.com/sport/articles/cgr8dn3e0k3o"}