{"authors": ["Dafydd Pritchard", "www.facebook.com"], "date_download": "2025-05-21 04:47:28", "date_modify": "2025-05-21 04:47:28", "date_publish": "2025-01-14 23:26:00", "description": "Cardiff City are targeting a move for Danish striker Yousef Salech but are cooling their interest in Peterborough's Ricky-Jade Jones.", "filename": "sport_football_articles_c5ye5j95y2jo_1747802848.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f020/live/0badd7a0-d2c4-11ef-af5d-07f6a75d4237.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ye5j95y2jo_1747802848.html", "title": "Yousef Salech: Cardiff City target move for Sirius striker", "title_page": "Yousef Salech: Cardiff City target move for Sirius striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City are targeting a move for Danish striker Yousef Salech.\nThe 22-year-old, who plays for Swedish side Sirius, is reportedly valued between £3m and £4m.\nChampionship strugglers Cardiff hope to make their first signing of the January transfer window before Saturday's south Wales derby against Swansea City.\nIt looks unlikely they will be signing Peterborough United striker Ricky-Jade Jones, who had been a target.\nLeague One Peterborough rejected an offer from the Bluebirds for 22-year-old Jones, who is out of contract at the end of this campaign.\nCardiff manager Omer Riza confirmed earlier this month that the Welsh club had held talks about signing the pacey forward, but may now have to look elsewhere.\nRiza would not be drawn on links to Salech, who has scored 13 goals in 29 appearances for Sirius.\n\"Striker position, wingers potentially, hopefully within the next few days we will get a few players through the door. Might be one, doubt it will be two, \" said Riza.\n\"I speak with the board every day regarding transfers, I speak to Mr [Vincent] Tan [Cardiff's owner], Ken [Choo, chief executive], Mehmet [Dalman, chairman], Paddy [Deboys, head of recruitment]… we are all talking, the list I've given out with regards to players, they've worked really hard to get them in.\n\"It will become clear over the next few days regarding players. Potentially we could have one coming in before the derby game and he may get some minutes potentially.\"", "url": "https://www.bbc.com/sport/football/articles/c5ye5j95y2jo"}