{"authors": ["Stuart Brennan", "www.facebook.com"], "date_download": "2025-04-26 06:44:50", "date_modify": "2025-04-26 06:44:50", "date_publish": "2025-03-01 16:30:09", "description": "St Helens make it three wins from three with a victory at Wakefield Trinity which takes them back to the top of Super League.", "filename": "sport_rugby-league_articles_cvg187exjdzo_1745649890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de52/live/75be0de0-f6c3-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cvg187exjdzo_1745649890.html", "title": "Super League: Wakefield Trinity 6-26 St Helens", "title_page": "Super League: Wakefield Trinity 6-26 St Helens - Saints go top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "St Helens maintained their 100% record to return to the top of Super League with a hard-fought win at Wakefield.\nSaints had been at their free-scoring best in the first two rounds, piling up 128 points, but promoted Trinity proved stiffer opponents than Salford and Castleford to remain in the contest well into the second half.\nTries from Jack Welsby and Harry Robertson - his fifth in three games - and a couple of Mark Percival penalties gave the visitors breathing space at half-time, although Isaiah Vagana struck to keep Trinity within sight.\nSaints weathered some Wakefield pressure early in the second half before easing away through tries from Daryl Clark and Kyle Feldt.\nTrinity have shown they can compete in Super League after romping through the Championship last season, by winning at Leeds on the opening day and then running title hopefuls Hull KR close last week.\nThey matched Saints for possession, territory and work-rate here as well, but in the end the class of the away side's back line made the difference.\nSaints showed Trinity plenty of respect, opting to take the two points through Percival when presented with an early penalty in front of the posts.\nAnd they forged further ahead when Jon Bennison did well to keep the ball alive out wide, Curtis Sironen fortuitously toed it forward as he tried to pick it up and Welsby was quickest to the loose ball to touch down.\nWakefield struck back as Robertson spilled the ball deep in his own half and from the resulting attack Vagana used his bulk to good effect to crash into a tackle and spin over the line.\nRobertson made amends shortly afterwards, picking up the loose ball after Tom Johnstone had juggled and dropped a pass, the 19-year-old Saints back keeping up his scintillating start to the season by running 70 metres to score.\nPercival struck another penalty late in the half, and that again looked a sound decision as Trinity mounted their best spell of the game after the break.\nRobertson showed his defensive prowess with a vital tackle that forced a knock-on from Corey Hall in a dangerous attacking position, and Saints broke the hosts' stern resistance after that point.\nClark bagged his 100th career try after a sharp break by Tristan Sailor gave him a clear run at the posts, and Feldt brilliantly finished in the corner from Welsby's pass to make sure of the win.\nWakefield coach Daryl Powell told BBC Radio Leeds:\n\"I just don't think we played well enough. We started poorly, made way too many errors in good attacking positions, and were way too lateral at the start of the first half, and you can't do that against St Helens because they're too good defensively.\n\"We didn't get to the speed of the game and had too many players making too many errors, and against teams like Saints that's never going to be good enough.\n\"Some key lessons for us to learn in a few areas. We are going to lose games, we have to make sure we learn from it.\n\"In the second half I felt they just ground us out of the game.\"\nSt Helens coach Paul Wellens told BBC Radio Merseyside:\n\"It was a great test. That's not a team that will struggle this year, they're a really good side, they've built something strong here on the field and off it as well.\n\"We had some defensive resilience, apart from the one try we conceded, and towards the back end of the game we nailed a couple of opportunities.\n\"Once we had a bit of daylight we felt more comfortable, because for long periods that game was in the balance.\n\"Their first try was not a try - it's criminal to give that to be honest, but you come to expect it and just crack on. It's a forward pass so just give it as a three-metre knock-on.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cvg187exjdzo"}