{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:02", "date_modify": "2025-05-21 07:29:02", "date_publish": "2025-03-28 19:04:30", "description": "Headline here...", "filename": "sport_rugby-union_articles_cp8l8z7y12ro_1747812542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aab9/live/bd11e8d0-0c06-11f0-a070-51c1461c0297.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cp8l8z7y12ro_1747812542.html", "title": "Headline here...", "title_page": "Headline here... - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ospreys and Scarlets have both recorded financial losses of more than £2m for the second year in a row.\nAhead of the United Rugby Championship derby between the sides, the Welsh rugby regional rivals have each published their latest accounts, taking in the 2023-24 season.\nThe results for the year end June 2024 saw the Scarlets post a loss of £2.59m, down from £2.91m the previous year.\nOspreys recorded a £2.18m loss, slightly up on the previous year's figures of £2.15m.\nBoth described the year as challenging.\nOspreys used the accounts to underline the need to move to a redeveloped St Helens as a means of achieving financial stability.\nThe Swansea-based side – who reached the play-offs of the United Rugby Championship and the quarter-finals of the European Challenge Cup in a successful 23-24 campaign on the field – saw turnover dropping 15% from £11.59m to £9.78m.\nThere was also a 20% drop in direct funding from the Welsh Rugby Union from £6.99m to £5.54m, as well as a reduction in competition income to £1.93m compared to the £2.3m earned in the 22/23 season where they competed in the Champions Cup.\nThe loss came despite the wage bill for coaching staff and playing squad being reduced by £2m to £6.75m\nChief Executive Lance Bradley revealed in the year plans to leave the Swansea.Com Stadium, with St Helen's later chosen as the preferred site with pledges of investment from the local council.\n\"The move to our own stadium will significantly increase our revenue opportunities, especially in the areas of sponsorship, ticketing hospitality and non-match day activities. This will drive us closer to our aim of financial stability,\" Ospreys stated in the accounts.\nAt the time of the accounts, Ospreys had £3.3m owed in loans – although the majority of that is a long-term financing from the WRU repayable over 19 years.\nThe repayment and structure of loans to all four regions have been included in discussions of a new five-year Professional Rugby Agreement that has been agreed in principle.\nIn the Scarlets' accounts, chairman Simon Muderack said: \"We have worked the with the WRU on a new funding agreement that will relieve the regional clubs of a substantial portion of the Covid-related debt that has previously burdened us, alongside a more sustainable funding model that provides greater long-term financial certainty.\"\nThe Scarlets' borrowings stood at more than £10m in their accounts for year ending June 2024, including £7.955m owed to the WRU and £2.6m to Carmarthenshire County Council – the latter having been granted a 15-year extension last year.\nThe region described the season – where they finished 13th in the URC and did not reach the knock-out stages of Europe – as one that \"fell short of our objectives and ambitions\".\nTurnover dropped from £12.79m to £11.34m while competition income and ticketing also fell.\nThe Parc y Scarlets wage bill was cut 15% from £9.69m to £8.24m with the WRU funding also cut – a figure that was reduced again for the current season to £4.5m.\nOfficials did manage to cut the size of the losses by 11%, but Muderack added the continued support of benefactors and directors \"have provided stability without which the club simply could not continue to operate\".\nScarlets host the Ospreys in the URC on Saturday with five points separating the sides with five rounds remaining.\nThey meet again next weekend on Sunday 6 April in Swansea in the last-16 of the Challenge Cup.", "url": "https://www.bbc.com/sport/rugby-union/articles/cp8l8z7y12ro"}