{"authors": ["Seb Brown", "www.facebook.com"], "date_download": "2025-04-26 04:12:22", "date_modify": "2025-04-26 04:12:22", "date_publish": "2025-03-04 12:24:39", "description": "Ipswich news: Opinion - 'The ever-growing injury list'", "filename": "sport_football_articles_cdx25gn4xeko_1745640742.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed4c/live/b5390d40-54ba-11ef-b2d2-cdb23d5d7c5b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdx25gn4xeko_1745640742.html", "title": "'The ever-growing injury list'", "title_page": "Ipswich news: Opinion - 'The ever-growing injury list' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ipswich Town's unwanted membership in a select group of four sides who have never played at the 'new' Wembley Stadium will continue for at least another 12 months.\nAlong with Accrington Stanley, Blackburn Rovers and Colchester United, Ipswich are the only Premier League and Football League clubs to never feature at the new stadium since it opened in 2007.\nMonday's defeat on penalties at Nottingham Forest was the story of the season so far - spirited at times, rarely being outplayed by stronger opponents but lacking quality at key moments. The performance will give Town fans both concerns and optimism.\nThe concerns will be the ever-growing injury list the squad now faces. A double enforced substitution at half-time now takes the injured player list to 10. Very few Premier League squads could cope with this level of player absence, let alone one which was in League One two years ago and has had to spend over £120m to try to catch up.\nSeason-ending injuries to Wes Burns and Chieo Ogbene, along with several months out for George Hirst and Axel Tuanzebe, have severely disrupted Kieran McKenna's ability to field a familiar starting XI each week in the hope of building some on-pitch relationships.\nThe overriding positive element from Monday was the defensive display. Restricting Forest to four shots on target across 120 minutes is a testament to their defensive solidity, with academy graduate Luke Woolfenden in particular a real standout.\nThe attributes on show were a stark contrast to recent defeats by Tottenham and Manchester United.\nWith only two games now left in March, Ipswich will hope to get some players back, especially in the attacking third to provide some creativity, goals and offensive threat.\nIf they can combine this with the defensive display at the City Ground, then they will have half a chance in their Premier League run-in.", "url": "https://www.bbc.co.uk/sport/football/articles/cdx25gn4xeko"}