{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:24", "date_modify": "2025-04-26 08:04:24", "date_publish": "2025-02-26 15:48:47", "description": "Cardiff City forward Isaak Davies says \"there are memories to be made\" for the players and fans as they prepare to take on Aston Villa in the FA Cup fifth round.", "filename": "sport_football_articles_c3374kjkg61o_1745654664.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3779/live/413e2340-f45a-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3374kjkg61o_1745654664.html", "title": "'Memories to be made' for Cardiff against Aston Villa", "title_page": "'Memories to be made' for Cardiff against Aston Villa in FA Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City forward Isaak Davies says \"there are memories to be made\" for the players and fans as they prepare to take on Aston Villa in the FA Cup fifth round.\nThe Bluebirds travel to Villa Park on Friday evening looking to reach the quarter-finals for the first time since 2008.\nCardiff have beaten Championship sides Sheffield United and Stoke to reach the fifth round, but now face the challenge of playing a Villa side who are into the last 16 of the Champions League.\n\"It's going to be a big test,\" said Davies.\n\"There'll be loads of eyes on the game, so it's a good opportunity for everyone to put their name out there and make a statement.\n\"We're going there trying to win, like any other game, but we'll need to be at our best.\n\"We've got a really good squad, a lot of experience, and whoever plays in the game will give it their best.\n\"Playing the big teams, there are memories to be made. We have to take it in our stride and enjoy it.\"\nDavies made his first home appearance for Cardiff in almost two years when he came on as a second-half substitute in Tuesday's crucial win over Hull City.\nThe 23-year-old made his first appearance of the season on 22 February against Plymouth having suffered a serious hamstring injury last summer.\n\"It's been a long time, a tough seven months but I'm so glad to be back playing in blue,\" said Davies.\n\"Of course last year I was out on loan, so it feels like ages since I've played for Cardiff.\n\"It was a massive win on Tuesday [against Hull], we knew going into the game that we had to get three points, no matter how it came.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c3374kjkg61o"}