{"authors": ["Emma Sanders", "Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 08:01:59", "date_modify": "2025-05-21 08:01:59", "date_publish": "2025-01-30 20:27:03", "description": "Arsenal defender Laura Wienroither completes loan move to Manchester City on the Women's Super League transfer window deadline day.", "filename": "sport_football_articles_c04nvnkvqklo_1747814519.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5eab/live/b03b62a0-df59-11ef-88f5-9fd60bc5cfdc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c04nvnkvqklo_1747814519.html", "title": "Arsenal's Laura Wienroither completes loan move to Man City", "title_page": "Arsenal's Laura Wienroither completes loan move to Man City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal defender Laura Wienroither has completed a loan move to Manchester City until the end of the 2024-25 campaign.\nThe 26-year-old, who has only featured three times in all competitions this season, is seeking regular minutes and has faced stiff competition for a place in the Arsenal side.\nThe Austria defender sustained an anterior cruciate ligament (ACL) injury in May 2023.\nWienroither said she is \"grateful for the opportunity\" to join City.\n\"I'm really happy to be here,\" she said. \"I'm relieved everything's done now and I'm grateful for the opportunity to work with people who trust and believe in me. I just hope I can give the trust back.\n\"I'm really excited to get started and can't wait to meet the team. When you have the chance to sign for a big club like City, I don't think you have to think a lot about it – at least I didn't.\"\nAfter Wienroither's ACL injury in 2023 Arsenal signed USA full-back Emily Fox, while academy graduate Katie Reid emerged as a first-team player, both providing competition for the Austrian.", "url": "https://www.bbc.com/sport/football/articles/c04nvnkvqklo"}