{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 11:35:08", "date_modify": "2025-05-20 11:35:08", "date_publish": "2023-08-07 05:56:22", "description": "Colombia set up a Women's World Cup quarter-final against England with a hard-fought 1-0 victory over Jamaica thanks to Catalina Usme's goal.", "filename": "sport_football_66424838_1747740908.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/08DC/production/_130686220_gettyimages-1600533474.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66424838_1747740908.html", "title": "Colombia 1-0 Jamaica: South Americans set up England quarter-final at Women's World Cup", "title_page": "Colombia 1-0 Jamaica: South Americans set up England quarter-final at Women's World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colombia set up a Women's World Cup quarter-final against England with a hard-fought 1-0 victory over Jamaica.\nCatalina Usme, who captained Colombia in Melbourne, curled home the decisive strike in the 51st minute.\nIt was the first goal Jamaica had conceded at the tournament after 321 minutes of play, but they could not find a response.\nThis is the first time Colombia have reached the last eight of the Women's World Cup.\nThey will face European champions England at Stadium Australia in Sydney on Saturday, kick-off at 11.30 BST.\nThis was the final match in Melbourne at this World Cup, and the Rectangular Stadium has claimed many traditional names of women's football as victims.\nOlympic champions Canada were eliminated by hosts Australia, Brazil icon Marta saw her World Cup dreams dashed, and the once unbeatable four-time world champions the United States were humbled.\nThis game was about the new generation, two sides re-writing their football history.\nBoth seemed weighed down by the opportunity early on, with a first half more about fouls than shots.\nThe clearest first-half chance came on 38 minutes, as Linda Caicedo shot over on the turn from six yards.\nBut this young, vibrant Colombia side is near impossible to contain. And, while Caicedo has made the headlines this tournament, it was another 18-year-old who set the winner in motion.\nAna Maria Guzman was making her first World Cup start in place of suspended full-back Manuela Vanegas.\nThe absence of Vanegas, who scored the winner in the victory over Germany, was the cause of much pre-match worry among Colombian media.\nBut they need not have worried as Guzman produced a moment of magic, a brilliant deep cross from the left which Usme brought down and buried in the far corner.\nColombia should have made the game safe but Caicedo was denied by Jamaica keeper Becky Spencer following a counter-attack before Leicy Santos hit the post late on.\nBut they saw the job through - and face the Lionesses next.\nWhile much attention has been placed on Colombia and Caicedo and co, Jamaica's impressive World Cup has been built on their watertight defence.\nOn debut in 2019, they let in 12 goals in three matches. In 2023, they went into this match as the only side yet to concede.\nThe first Caribbean nation to play in the knock-outs of any Fifa World Cup since Cuba in 1938 and the sole remaining Concacaf representative after the eliminations of Canada and USA, they did not allow Colombia to easily build any attacking tempo.\nDrew Spence drew the ire of the partisan Colombia fans, who made up the vast majority of the crowd in Melbourne, when she threw Caicedo to the ground late in the first half, the former England international getting a yellow card.\nBut Jamaica struggled to create, with striker Khadija Shaw - scorer of 31 goals in 30 games for Manchester City last season - feeding off scraps.\nTheir best chance came almost immediately after Usme's goal, Jody Brown striking the post with a close-range header. They also came close with eight minutes remaining as Spence headed narrowly wide.", "url": "https://www.bbc.com/sport/football/66424838"}