{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:25:40", "date_modify": "2025-05-20 14:25:40", "date_publish": "2023-07-29 14:03:08", "description": "Wigan move up to second in Super League and bring Challenge Cup finalists Leigh down to earth with a thumping win.", "filename": "sport_rugby-league_66301881_1747751140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D37A/production/_130583145__es23665.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301881_1747751140.html", "title": "Super League: Wigan Warriors 44-18 Leigh Leopards - Miski treble sees Challenge Cup finalists beaten", "title_page": "Super League: Wigan Warriors 44-18 Leigh Leopards - Miski treble sees Challenge Cup finalists beaten - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wigan Warriors moved up to second in Super League and brought Challenge Cup finalists Leigh Leopards back down to earth with a thumping home win.\nLate first-half tries from Bevan French and Toby King gave the scoreline a flattering look for Wigan at the break, after Tom Amone's try put Leigh ahead.\nThe second 40 saw Wigan dominate as French, debutant Tyler Dupree, Abbas Miski thrice and Liam Marshall crossed.\nTom Briscoe and Rob Mulhern replied for Leopards but they were well beaten.\nLast weekend's Challenge Cup semi-finals had differing fortunes for these two clubs, as Wigan bowed out to Hull KR in golden point and Leigh vanquished reigning Super League champions St Helens, making for a very different week of preparation for each club.\nWhile Wigan dusted themselves down with this return to form, it seemed as though the Leopards' exploits caught up with them mentally and physically after a set-for-set beginning.\nAmone's stomp over after Liam Farrell gave away a costly penalty was reward for Leigh's composure, as Wigan lacked rhythm and control by contrast.\nFor spells they struggled to break out of their own end but a wonderful move finished by French which involved Jai Field, Farrell and a smart pass by Smith gave them a foothold in the game.\nThe next two tries came from an unlikely source, as winger Miski's kicking provided two assists to swing the momentum just before half-time, first when King clutched his grubber in and pirouetted through, before French dotted down another poke ahead.\nWith an advantage to lift their spirits during half-time, Wigan cut loose with sharp attack as Leopards wilted, summed up when front-rower Dupree punched through a gap to mark his first outing with a try.\nLebanon international Miski showed he is just as adept at finishing as creating when he intercepted a Gareth O'Brien pass to race in - as he would later repeat for his treble - and also defied physics with a spectacular dive over in the corner.\nLiam Marshall capitalised on defensive chaos for his score, and although Leigh's attack clicked on a rare raid for Briscoe's impressive finish, Wigan were never in danger of disappointing their 15,000-strong crowd for a vital win.\nWigan head coach Matt Peet:\n\"Really happy with that after what has been a really difficult week. It was important we responded the right way and I think the lads managed to channel their frustration in the right way and turned it into energy.\n\"I thought we played full of energy. Even in the first half when we had to defend the goal-line for extended periods I thought we were excellent.\n\"I am disappointed we conceded 18 points, because I think the way we defended we should not be letting those points in.\n\"There were a couple of sloppy tries in there that we have to amend, but, on the whole, I am very pleased with our commitment and some of our execution. You can see what we are trying to build.\"\nLeigh head coach Adrian Lam:\n\"I knew it was going to be a tough week for us, obviously coming off the emotional rollercoaster that we have had. I have been around as a player long enough to know it is difficult to back up from that.\n\"I thought Wigan were outstanding in everything that they did. I thought we were the complete opposite of what we have been in the last 20 rounds. That happens and I'll draw a line in the sand quickly and move on.\n\"It was very similar to the last time we played. We should have led at half-time and (there were) a couple of calls before half-time and late tries in the last seven minutes of the game.\n\"We talked about that and Wigan being dangerous close to half-time and just after, and it was game over by then.\n\"I thought we were at the races early on, but the longer the game went the more disinterested we were.\"\nWigan: Field; Miski, King, Wardle, Marshall; French, Smith; Ellis, O'Neill, Byrne, Pearce-Paul, Farrell, Smithies.\nInterchanges: Cust, Mago, Nsemba, Dupree [Hill]\nLeigh: O'Brien; Briscoe, Hardaker, Chamberlain, Charnley; Reynolds, Lam; Amone, Mellor, Mulhern, Holmes, Hughes, Asiata.\nInterchanges: Nakumbuwai, Wardle, Wilde, Davis [Smith]\nReferee: Jack Smith.", "url": "https://www.bbc.com/sport/rugby-league/66301881"}