{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:20", "date_modify": "2025-05-21 06:38:20", "date_publish": "2025-04-01 00:00:00", "description": "Striker Sam Smith rescues a point for promotion-chasers Wrexham at relegation-threatened Cambridge United.", "filename": "sport_football_live_c4g7gexl2zyt_1747809500.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g7gexl2zyt_1747809500.html", "title": "Cambridge United 2-2 Wrexham: Sam Smith rescues visitors", "title_page": "Cambridge United 2-2 Wrexham: Sam Smith rescues visitors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Striker Sam Smith rescued a point for promotion-chasers Wrexham at relegation-threatened Cambridge United.\nThe visitors were 2-1 down after their early lead was overhauled by their tenacious hosts before January signing Smith equalised.\nGeorge Dobson's superbly-struck, long-range shot in the fourth minute seemed to fit the pre-match script in which the second-placed visitors were supposed to brush aside the lowly hosts.\nBut Cambridge had other ideas as Liam Bennett levelled as half time beckoned with a close-range effort.\nTwo minutes after the restart Neil Harris' side were in the lead as Lewis Brunt's foul on Ryan Loft allowed Josh Stokes to put Cambridge ahead from the penalty spot.\nHowever, that lead was short-lived as Smith headed in from Ryan Longman's cross, a rare moment of quality in the second half up to that point from the visitors.\nIt was Cambridge's fourth successive draw amid their battle to avoid relegation and they also survived Elliot Lee finding the target late on, only for it to be ruled out.\nBut it ended as a setback for Wrexham, albeit tinged with the knowledge Wycombe Wanderers remain three points and a place behind them following a goalless home draw against bottom side Shrewsbury Town.\nWycombe have a game in hand on Phil Parkinson's Wrexham as the promotion race continues.\nWrexham boss Phil Parkinson told BBC Sport Wales: \"The referee's (Thomas Parsons) performance tonight, to say I'm raging is one of the biggest understatements in my 1,000 games.\n\"That penalty decision is one of the worst penalty decisions I've seen, similar to the Reading one, and to disallow the goal (by Elliott Lee) at the end is completely bizarre.\"\nAssessing his side's efforts, Parkinson said: \"We came here looking for three points. I thought the performance level was very good. Obviously, a couple of big decisions have gone against us.\n\"But I asked the lads for performances and for 80% of the game I thought we played well, controlled even at 2-1 down, got back in the game and we've had a couple of great chances to win it.\n\"I was pleased with the composure we showed after the penalty decision to get back in the game, and a brilliant cross by Longy (Longman) and a fantastic finish (by Smith).\n\"And we had other chances, bits of good defending from them, but there were chances we probably should have taken. But all in all, the performance was good.\"", "url": "https://www.bbc.com/sport/football/live/c4g7gexl2zyt"}