{"authors": ["Paul McNicoll", "www.facebook.com"], "date_download": "2025-05-21 06:35:29", "date_modify": "2025-05-21 06:35:29", "date_publish": "2024-12-24 10:26:03", "description": "'Anti-football? United were tactically astute in deserved draw'", "filename": "sport_articles_c3e3dj9308po_1747809329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eda1/live/497e7ef0-c161-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3e3dj9308po_1747809329.html", "title": "'Anti-football? United were tactically astute in deserved draw'", "title_page": "'Anti-football? United were tactically astute in deserved draw' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As I walked along to Tannadice on Sunday I knew that from then until 5pm on 11 January, United will have had to play seven games.\nThat's a lot to ask, so you'd hope for a nice easy start to that hectic period. Not to be, it was only the past, current and more than likely future champions of Scotland that paid a visit to Tannadice Street.\nNow forgive me for not particularly looking forward to this fixture. I am a fan nearer to the age of 50 than I am to 40 and for what seems like forever this has been a game that I'm almost certain Celtic look to as a guaranteed three points.\nIn the last 80 matches between the sides United have won just three, Celtic have won 61. You can see where I'm coming from.\nSo as I took to my seat on Sunday I was hoping for a good performance and a 'let's just keep the score down' kinda day.\nBear in mind, this is a very good Celtic side this season and United, as well as they have done up to now, were only promoted in the summer and last time out had shipped four goals to Motherwell. It felt like the Terrors were on a hiding to nothing. At least to me.\nWe all know, however, that is not the way it turned out. Every man in Tangerine gave their all and I would argue they deservedly earned a point.\nJim Goodwin once again proved just how astute he is with another formation and tactical change to suit the occasion. Horses for courses if you will. He has every player singing from the same hymn sheet and appears to have everyone willing to give everything for the cause.\nSince full-time on Sunday I have heard and read accusations of negative, boring and anti-football levelled at United's approach to the match. That is not the way I see it.\nUnited set out to play to their own strengths, as well as to try to negate Celtic's strengths. And guess what? It worked.\nCeltic may have been less than full strength, the wind may also have been a factor, but make no mistake about it, United deserved everything they got on Sunday.\nIt is the season of goodwill. The time of year when gifts are handed out, but as I headed home after the match I was absolutely delighted that United showed absolutely no respect to that tradition. Merry Christmas one and all.", "url": "https://www.bbc.com/sport/articles/c3e3dj9308po"}