{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 04:41:15", "date_modify": "2025-05-21 04:41:15", "date_publish": "2025-04-03 08:55:15", "description": "Lewis Hamilton says he has \"absolute 100% faith\" in Ferrari despite their difficult start to the season.", "filename": "sport_formula1_articles_cdrgdm4ye53o_1747802475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff96/live/99e95640-1066-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cdrgdm4ye53o_1747802475.html", "title": "Japanese Grand Prix: Lewis Hamilton says he has 'absolute 100% faith' in Ferrari", "title_page": "Japanese Grand Prix: Lewis Hamilton says he has 'absolute 100% faith' in Ferrari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Hamilton says he has \"absolute 100% faith\" in Ferrari despite their difficult start to the season.\nThe seven-time champion won the sprint race in China last time out but struggled in the grand prix in Shanghai and the season-opener in Australia.\nFerrari are only fifth in the constructors' championship after Hamilton and team-mate Charles Leclerc were disqualified from fifth and sixth places in China for technical infringements.\nBriton Hamilton said: \"I saw someone said something about whether I'm losing faith in the team, which is complete rubbish.\n\"I have absolute 100% faith in this team.\n\"There was obviously a huge amount of hype at the beginning of the year. I don't know if everyone was expecting us to be winning from race one and winning the championship in our first year.\n\"That wasn't my expectation. I know that I'm coming into a new culture, a new team and it's going to take time.\"\nHamilton emphasised the difficulties in adapting to a new team, especially around the specifics of the technicalities of a new car.\n\"On reflection, I was actually quite happy with how I've adapted in just those two races,\" he said.\n\"I've definitely got a lot of work to do to make sure that it's better moving forward.\n\"It's just understanding the technical side of this thing, understanding all the tools that I have. It likes to be driven differently.\n\"After analysing the last two races, you've got the first race (in Australia)… I generally didn't feel great in the car at the beginning, but my pace wasn't too bad in the first two days.\n\"And Sunday was the first time I'd ever driven the car in the rain, and I was learning a lot throughout the race.\"\nHamilton said that he had also been affected by lost running time in pre-season testing in Bahrain and being forced to miss a test in Abu Dhabi at the end of last year when other drivers tried out the new 2025 tyre designs.\nBecause of that, he said China \"was the first time I'd actually done a long run\" in the dry.\nHe added: \"Every other driver here got to do Abu Dhabi tests and try the 2025 tyre. I didn't. When we went into the race run in Bahrain, the car broke down, so I didn't actually get to do a long run on any of the tyres.\n\"So, the sprint race was the first time I'd actually done a 20-lap stint on the tyre.\n\"And then, in the race, it was the first time I'd ever tried the C2 (compound). So, I was just learning that through the race.\n\"You don't just put the tyre on and know what it's going to do. I definitely feel like I was starting to feel the onward effect of not being able to do the test at the end of the year.\"\nDespite the problems they have had so far, which leaves Ferrari 61 points behind McLaren in the constructors' championship, Leclerc said the Italian team can \"still have an amazing season\".\nThe Monegasque - who finished ahead of Hamilton in China, despite a front wing damaged on the first lap in a collision between the two Ferrari drivers - pointed to the team's progress in 2024, which started slowly but ended with them narrowly missing out on winning the constructors' championship for the first time since 2008.\nLeclerc said: \"If we go back to last year, looking at the first few races, the situation in terms of performance was quite a bit worse than where we are now.\n\"We kind of expected Red Bull to dominate the whole season, and by taking the points that were available at the beginning of the season with the performance we had, we ended up actually fighting for the championship – which was way above our expectations.\n\"There's definitely not that feeling within the team at the moment.\n\"However, we do feel we haven't maximised what we could have in the first two races, and that's frustrating.\n\"But it doesn't mean we cannot recover. The season is still very long. Small steps after small steps – we can still have an amazing season.\"", "url": "https://www.bbc.com/sport/formula1/articles/cdrgdm4ye53o"}