{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 04:55:23", "date_modify": "2025-05-21 04:55:23", "date_publish": "2025-01-15 00:04:42", "description": "Nottingham Forest are not going away.", "filename": "sport_football_articles_c0jn8x68z52o_1747803323.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5305/live/059bcd00-d2cd-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0jn8x68z52o_1747803323.html", "title": "Forest show no signs of stopping after Liverpool draw", "title_page": "Nottingham Forest 1-1 Liverpool: Forest show no signs of stopping after Liverpool draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest are not going away. A night under the lights at the City Ground should disprove any remaining doubters.\nNuno Espirito Santo's side went toe-to-toe with leaders Liverpool to justify their second place in the Premier League.\nThey are Liverpool's nearest challengers - before Arsenal's north London derby with Tottenham on Wednesday - and while Nuno will always look to keep a lid on expectations his side show no signs of stopping.\nThe City Ground erupted after Chris Wood's opener - which came against the run of play - but still encapsulated the clinical nature of Forest this season.\nThey then dug in and relentlessly fought for every inch. The hosts may have needed three superb Matz Sels saves to keep their point but they were brave, with defender Murillo also excellent, and underlined why they have one of the best defences in the division.\nThere was a tinge of disappointment from the hosts at the point, which shows the standards set this season and the potential trajectory of the squad.\nForest remain the only team to beat Liverpool this season in the Premier League and Arne Slot's side will be glad to see the back of them.\nWhile Liverpool will take some stopping, Forest are in title contention because they are just six points behind with over half the season done.\nEven if the trophy is out of reach, a place in the Champions League remains well within their grasp.", "url": "https://www.bbc.com/sport/football/articles/c0jn8x68z52o"}