{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:23:08", "date_modify": "2025-04-26 06:23:08", "date_publish": "2025-03-04 00:00:00", "description": "Preston North End's slim Championship play-off chances suffer a blow as they are held to a goalless draw by Swansea City.", "filename": "sport_football_live_cj67708plr0t_1745648588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc38/live/54c4f880-f941-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cj67708plr0t_1745648588.html", "title": "Preston North End 0-0 Swansea City: Lilywhites frustrated by battling Swans", "title_page": "Preston North End 0-0 Swansea City: Lilywhites frustrated by battling Swans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Preston North End's slim Championship play-off chances suffered a blow as they were held to a goalless draw by Swansea City.\nMilutin Osmajic wasted the best chance of the night, scuffing wide of the target when he seemed certain to score early in the second half.\nEom Ji-Sung went closest for Swansea with a free-kick, but it was Preston who were left frustrated by the stalemate having looked the more likely winners for long periods.\nPreston's 16th league draw of the season means they are without a win in four second-tier games.\nThey remain 15th in the table, nine points adrift of the top six with 11 league matches remaining.\nSwansea are two points worse off in 16th, with the gap to the bottom three now standing at 10 points.\nWhile the Welsh side's performance was unconvincing at times, the result made this a decent night for caretaker boss Alan Sheehan, who has four points from two games since the departure of Luke Williams last month.\nPreston have an FA Cup quarter-final against Aston Villa to look forward to at the end of March courtesy of their rousing weekend win over Burnley.\nYet Paul Heckingbottom had claimed Swansea's visit was more significant than the Villa tie because it offered his team the chance to close the gap on West Bromwich Albion, the side currently occupying the Championship's final play-off place.\nIt was Swansea who were sharper in the early stages, however, with Preston defender Lewis Gibson surviving a penalty claim when he slid in clumsily on Liam Cullen having given the ball away.\nThe visitors controlled the opening quarter, with Zan Vipotnik failing to connect properly with Josh Tymon's cross before Lewis O'Brien's drive was gathered at the second attempt by Freddie Woodman.\nPreston eventually came into the contest, with Osmajic denied by Josh Key's block before Will Keane latched on to a long ball and unselfishly squared for Sam Greenwood.\nPreston manager Paul Heckingbottom:\n\"We have had too many games where we've been the best team this season and not got the three points, but my message to the players after the game was how proud I was of them.\n\"What we limited them to was excellent, but we just couldn't take our chances.\n\"They defended well, but looking back there were four, five golden opportunities. We should have taken at least two or three of them.\n\"It's unfortunate because the players deserved a lot more.\n\"I've said it many times. I'd take that performance again because you know you are going to win more than you lose and you are going to be high up the league, but we have to be clinical.\"\nSwansea caretaker boss Alan Sheehan:\n\"I thought in the first 25 minutes we were excellent. We came out on the front foot and we tried to hurt them. We had a few opportunities.\n\"Then their keeper went down injured – I hope he's OK – and that kind of changed the momentum of the game.\n\"It became more their game, landing on second balls. The second half was a bit more their game. Then we had some momentum, half-chances, but ultimately I am happy with the point.\n\"I think the lads should be really proud of themselves tonight. Back-to-back clean sheets, four points from six. When you come away from home, you have got to be tough, you have to show grit, and I think overall it's a good point.\"", "url": "https://www.bbc.co.uk/sport/football/live/cj67708plr0t"}