{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:09:48", "date_modify": "2025-04-26 08:09:48", "date_publish": "2025-02-26 12:50:29", "description": "Middlesbrough striker Tommy Conway says the 3-1 win at Stoke City \"means everything\" after ending a run of five straight defeats.", "filename": "sport_football_articles_clyde9xlq0lo_1745654988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4603/live/7130c2c0-f440-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyde9xlq0lo_1745654988.html", "title": "Conway steps up as Boro rediscover winning touch", "title_page": "Middlesbrough: Tommy Conway steps up as Boro rediscover winning touch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Middlesbrough striker Tommy Conway says the 3-1 win at Stoke City on Tuesday night \"means everything\" to the team after ending a run of five straight defeats.\nBoro eased the pressure around Michael Carrick with victory in the Potteries that moved them back within four points of the play-off spots.\n\"Everyone knows the run we've been on hasn't been a good one over the past couple of weeks and we've been trying to put it right but for some reason it hasn't been falling for us,\" Conway told BBC Radio Tees.\n\"But I thought everyone put in a fantastic performance. Credit to everyone, I'm just buzzing for everyone that we've managed to come away with three points.\"\nConway was on the scoresheet at the bet365 Stadium for the second game in a row and took his Championship goal tally for the season into double figures.\nThe 22-year-old scored 12 in all competitions, in each of his two previous campaigns with Bristol City, but is now on-pace to eclipse that personal best.\nThe Scotland international is helping fill the void left by Emmanuel Latte Lath's departure and says he is \"100%\" hitting form now after a five-week absence because of a hamstring injury.\n\"Getting back into the rhythm of playing games week in, week out - we know the relentlessness of the Championship,\" Conway added.\n\"I'm just trying to do my job and score goals. I feel like I'm getting better and better every game and hopefully that continues.\"\nConway also believes Middlesbrough can get their play-off bid back on track and continue to close the four-point gap to the top six with struggling Derby County the visitors to the Riverside on Saturday.\n\"When we're not winning football matches, we're not doing our jobs and it affects us,\" Conway added.\n\"When you win games, it ultimately goes the other way and you start getting your confidence back and everyone starts believing again.\n\"If we take that into the next couple of games leading up to the international break, I think we'll be right up there.\"", "url": "https://www.bbc.co.uk/sport/football/articles/clyde9xlq0lo"}