{"authors": ["Kenny Crawford", "www.facebook.com"], "date_download": "2025-05-19 15:19:01", "date_modify": "2025-05-19 15:19:01", "date_publish": "2015-03-02 14:13:58", "description": "Doddie Weir feels a lack of \"clinical precision\" has Scotland facing the bleak prospect of last place in the Six Nations.", "filename": "sport_rugby-union_31692023_1747667941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81333000/jpg/_81333664_10691006.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31692023_1747667941.html", "title": "Six Nations 2015: Doddie Weir fears Wooden Spoon for Scotland", "title_page": "Six Nations 2015: Doddie Weir fears Wooden Spoon for Scotland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Lions lock Doddie Weir feels a lack of \"clinical precision\" means Scotland are facing the bleak prospect of last place in the Six Nations.\nItaly's last-minute penalty try secured a 22-19 win against Vern Cotter's side.\n\"They've got a hard task ahead of them to not get the Wooden Spoon this year,\" Weir told BBC Radio Scotland.\n\"Missing touch five minutes from the end of the match - that's the kind of clinical thing that needs to be done in top-level rugby in order to win games.\"\nWeir, capped 61 times between 1990 and 2000, was referring to Peter Horne's failed kick to touch which helped give the Italians the momentum in the closing stages.\nBut the former Newcastle Falcons player also identified Italy's opportunity to score their first try as a crucial point in the match.\n\"When the ball hit the post Scotland, should have been able to react,\" said Weir, who won the Five Nations Championship with Scotland in 1999.\n\"What I think is lacking is this clinical precision and reaction.\n\"I don't think we've got a major problem. It's more frustration rather than a major issue, because they've been very competitive in all their matches.\n\"They're playing attractive rugby and they've got a bit of discipline there so Vern Cotter's doing a good job. It's basically on results and that's what's been lacking - actually finishing and winning the game.", "url": "https://www.bbc.com/sport/rugby-union/31692023"}