{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:54:48", "date_modify": "2025-05-21 05:54:48", "date_publish": "2025-04-02 07:11:07", "description": "Nottingham Forest 1-0 Man Utd: Forest fans give verdict on the game", "filename": "sport_football_articles_c3d8y9yj1nko_1747806888.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3d8y9yj1nko_1747806888.html", "title": "Nottingham Forest 1-0 Man Utd: Forest fans give verdict on the game", "title_page": "Nottingham Forest 1-0 Man Utd: Forest fans give verdict on the game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Nottingham Forest's 1-0 victory against Manchester United on Tuesday evening.\nHere are some of your comments:\nTom: Wow, it's never over until the final whistle with Forest! But a great backs-to-the-wall effort and Murillo did what he does, in the right place at right time!\nKen: The teams we beat don't like our style, mainly because it's mightily successful. We don't try to be something we are not. We have a squad where even the fringe players want their squad mates to succeed - there's no bitterness there at all. Next season will be the test. We will need 10 more quality players to cope with the extra games we will have if we qualify for Europe, but as Cloughie said: \"I hope anybody isn't stupid enough to write us off!\"\nKris: It was another solid defensive display with devastating counter attacking and a brilliant goal to take the three points. Elanga got the plaudits, but Yates, Williams and Murillo really shone. With Wood and Hudson-Odoi, we would have made even lighter work of a team that lacked any cutting edge. The Champions League dream gets closer!\nDavid: Very proud of our guys. I was worried with only getting three days rest between games. Anthony Elanga definitely had a score to settle with Man Utd. One more game down. Only a handful left to play. I actually think we can take some silverware this season as well.\nJames: What a win for Forest! Even when we were under the cosh, and just days after 120 mins and penalties at Brighton, we were so well organised and kept believing. The fans were incredible. Forest would be an asset to the Champions League!\nJohn: No doubt much of the media will focus on United but hey, who cares. A masterclass goal from Elanga; a masterclass on how to defend a lead and concentrate until the final whistle and a masterclass from Yates on controlling the midfield. A superb performance especially after extra time and penalties on Saturday. Total commitment again. As a fan, you can't ask for better than this.", "url": "https://www.bbc.com/sport/football/articles/c3d8y9yj1nko"}