{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 13:51:30", "date_modify": "2025-05-20 13:51:30", "date_publish": "2023-07-31 17:58:21", "description": "Stuart Broad says he will leave cricket with \"pure joy and happiness\" after taking the final two wickets as England drew the Ashes with a 49-run victory.", "filename": "sport_cricket_66366996_1747749090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15503/production/_130599278_gettyimages-1583286067.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66366996_1747749090.html", "title": "The Ashes 2023: Stuart Broad says he will retire with 'pure joy and happiness' after fairytale finish", "title_page": "The Ashes 2023: Stuart Broad says he will retire with 'pure joy and happiness' after fairytale finish - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart Broad says he will leave cricket with \"pure joy and happiness\" after taking the final two wickets as England drew the Ashes with a 49-run victory.\nIn a thrilling finale, Broad removed the final two Australia batters as England levelled the series at 2-2.\nIt was a fitting end for an Ashes legend, who announced on Saturday that he would retire after this Test.\n\"It is special,\" said 37-year-old Broad, who ends with 604 Test wickets after a 15-year Test career.\n\"It is a difficult decision to walk away from the game I love but I wanted my last ball to be in an environment that is so special and playing sport I still love - for my lasting memory to be pure joy and happiness.\n\"That is how I feel now.\"\nThe finish means Broad, the second most successful fast bowler in Test history, ends his career having hit his final ball faced for six and taken a wicket with his last delivery.\nHe retires with a record 153 Test wickets against Australia, having completed the win by nicking off Todd Murphy and then Alex Carey.\n\"I've played with him for a long time,\" said England captain Ben Stokes.\n\"He has been an unbelievable performer for England over a long, long time. It was written in the stars he'd take the last wicket with two left-handers.\"\nAustralia were 264-3 chasing 384 before a stunning surge from England with Chris Woakes taking 4-50 and off-spinner Moeen Ali a crucial 3-76.\nMoeen came out of retirement to play in the series and was struggling with a groin injury. He confirmed afterwards the Test will be his last.\n\"To finish with Broady taking last wicket was amazing, it is a great win,\" he said.\n\"It was a little daunting [coming out of retirement]. I have never played that well against Australia but Stokesy asked and I thought 'why not?'.\n\"I am so glad I came back and said yes. It has been amazing. I am chuffed I can finish with a win against Australia and play a little bit of a helping hand.\"\nThe result means England fought back from 2-0 down after two Tests to draw the Ashes, while they have also denied Australia a first series win in the UK since 2001.\nFour of the Tests went down to the wire, with the fourth Test in Manchester, which England dominated but had to settle for a draw because of rain, the only one-sided affair.\nStokes, who was captaining in his first Ashes series and continued to employ England's aggressive style, said 2-2 was a \"fair reflection\".\n\"Being in a do-or-die situation, most teams can shy away from it and hope that the results are going to go their way whereas we knew we had to try and force it from the second game onwards,\" he said.\"You can look back and say a few things went our way and a few things went Australia's way.\n\"Hand on heart, I think 2-2 is a fair reflection of where the two teams are at in this moment.\n\"We didn't shy away from the momentous event the Ashes is and we talked the talk and we've also walked the walk out there, I'm very proud of this whole team and what they have accomplished over these weeks.\"", "url": "https://www.bbc.com/sport/cricket/66366996"}