{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:39", "date_modify": "2025-05-21 06:37:39", "date_publish": "2025-04-01 00:00:00", "description": "Crewe return to winning ways against play-off rivals Grimsby", "filename": "sport_football_live_c7575nwkl24t_1747809459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba64/live/ac587080-0ed7-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c7575nwkl24t_1747809459.html", "title": "Crewe Alexandra 2-0 Grimsby Town", "title_page": "Crewe Alexandra 2-0 Grimsby Town: League Two - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Long's first-half finish and a late header from Mickey Demetriou earned Crewe an important win over play-off rivals Grimsby.\nLong made the most of some poor set-piece defending to hand the Railwaymen an early lead and skipper Demetriou sealed the Railwaymen's first success in six games.\nHome goalkeeper Filip Marschall got behind Jason Svanthorsson's drive from distance in the opening minutes.\nBut Crewe went ahead in the 14th minute after Ryan Cooney's long throw into the box was helped on by Demetriou to leave Long unmarked with a simple finish from close range.\nJack Lankester was making his first start for Crewe in more than two months and the attacker forced a save from Jordan Wright with a low drive from the edge of the box.\nWithout leading scorer Danny Rose, Grimsby lacked guile in the final third but they pieced together a neat move which ended with Svanthorsson coming close to an equaliser as the Icelander's volley crashed into the side-netting.\nLankester drove an effort across the face of the goal as Crewe looked more likely to add to their lead, although Luca Barrington flashed a drive wide on a rare Grimsby counter-attack.\nBut Crewe put the game beyond former boss Dave Artell's side in the third minute of stoppage time when Demetriou headed in Tommy Lowery's lofted corner at the far post.", "url": "https://www.bbc.com/sport/football/live/c7575nwkl24t"}