{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 04:14:58", "date_modify": "2025-05-21 04:14:58", "date_publish": "2025-04-05 20:28:40", "description": "Raymond van Barneveld books his place in the last 16 of the International Open with a 6-2 victory against Jonny Clayton.", "filename": "sport_darts_articles_c9w85llg7j5o_1747800898.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba7b/live/c02af510-125b-11f0-9b05-6b3bc7230ff7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_c9w85llg7j5o_1747800898.html", "title": "International Open: Raymond van Barneveld beats Jonny Clayton to join Luke Humphries and Stephen Bunting in last 16", "title_page": "International Open: Raymond van Barneveld beats Jonny Clayton to join Luke Humphries and Stephen Bunting in last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Raymond van Barneveld booked his place in the last 16 of the International Open with a 6-2 victory against Jonny Clayton.\nVan Barneveld made a confident start to the second-round match at Sachsen Arena in Riesa, Germany, to take a 3-0 advantage over Wales' Clayton - and never looked back.\nThe 57-year-old Dutchman, ranked 35th in the PDC order of merit, averaged 97.2 while a below-par Clayton managed just 81.4.\nVan Barneveld's compatriot Wessel Nijman also pulled off a minor upset when he knocked out Chris Dobey 6-3.\nElsewhere, world number one Luke Humphries reeled off six consecutive legs as he cruised into the third round with a 6-1 win over Dirk van Duijvenbode.\nEnglishman Stephen Bunting found it slightly tougher during a gritty 6-4 win over Darius Labanauskas of Lithuania.\nWelshman Gerwyn Price clinched a 6-4 victory against Mike de Decker, Cameron Menzies edged out James Wade 6-5, and Peter Wright won by the same margin against Ritchie Edhouse.\nRob Cross has pulled out of the tournament because of illness so Germany's Martin Schindler was given a bye to the next round.\nThe third round, quarter-finals, semi-finals and final will be played on Sunday.", "url": "https://www.bbc.com/sport/darts/articles/c9w85llg7j5o"}