{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-20 12:55:03", "date_modify": "2025-05-20 12:55:03", "date_publish": "2023-07-25 14:48:50", "description": "India captain Harmanpreet Kaur has been suspended for two matches for two breaches of the ICC code of conduct.", "filename": "sport_cricket_66300520_1747745703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1507D/production/_130514168_gettyimages-1469054827.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300520_1747745703.html", "title": "Harmanpreet Kaur: India captain banned for two matches after Bangladesh outburst", "title_page": "Harmanpreet Kaur: India captain banned for two matches after Bangladesh outburst - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "India captain Harmanpreet Kaur has been suspended for two matches for two breaches of the ICC code of conduct.\nHarmanpreet hit her own stumps with her bat after being dismissed and criticised the umpires after the tied third one-day international against Bangladesh.\nHaving pleaded guilty, Harmanpreet is the first women's player to be handed a Level 2 sanction since the ICC started listing code of conduct breaches publicly in 2016.\nShe was fined 75% of her match fee.\n\"We controlled the game very well but some pathetic umpiring was done and we are really disappointed about some decisions given by the umpires,\" Harmanpreet said after Saturday's ODI.\nThose comments cost the India skipper 25% of her match fee and a demerit point.\nThe 34-year-old received a further three demerit points and lost 50% of her fee for smashing her stumps - a breach of article 2.8 of the ICC Code of Conduct for Players and Player Support Personnel, relating to \"showing dissent at an umpire's decision\".\nHarmanpreet is now set to miss the start of India's Asian Games campaign, which takes place between September 23 and October 8 in Hanghzou in China.", "url": "https://www.bbc.com/sport/cricket/66300520"}