{"authors": ["Harry De Cosemo", "www.facebook.com"], "date_download": "2025-05-21 05:07:49", "date_modify": "2025-05-21 05:07:49", "date_publish": "2025-04-04 07:01:48", "description": "French Ligue 1 side Strasbourg endures fan tension over the perceived 'betrayal' of the club's sale to Chelsea owners BlueCo.", "filename": "sport_football_articles_c8dgjl8ygr3o_1747804069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0461/live/b8e0e6e0-0f07-11f0-8db0-89a142ea748b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8dgjl8ygr3o_1747804069.html", "title": "'BlueCo out' - Strasbourg fans protest against Chelsea's parent club", "title_page": "'BlueCo out' - Strasbourg fans protest against Chelsea's parent club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For the people of Alsace, a French region close to the German border, local pride is a huge part of life.\nIts biggest football team, Racing Club Strasbourg, has galvanised the France-Germany identity even further over the last 16 years. But now the club is engulfed in bitter civil war.\nSince going bankrupt in 2011, Strasbourg, who climbed back to the top flight from the amateur fifth tier, built a strong fan-centric culture with former France international Marc Keller as president.\nIn June 2023, the one-time French champions were bought by BlueCo, a consortium headed by American businessman Todd Boehly and Behdad Eghbali, and became part of a multi-club ownership portfolio alongside Chelsea.\nIt was seen as betrayal by Keller in the eyes of many.\nSince then, the fanbase has been torn apart, with ultras and supporters' groups organising protests at every game.\nBlueCo's influence has been huge. Strasbourg have the youngest average age in Ligue 1 this season at 21.3 years.\nAfter bottom-half finishes in three of their past four seasons since promotion from Ligue 2, they are dreaming of Europe under former Hull City boss Liam Rosenior.\nBut despite this being their strongest era in a generation, it hasn't been worth what some supporters believe is a loss of identity.\n\"Strasbourg doesn't exist from the sporting point of view. We are just Chelsea B team,\" Strasbourg Supporters' Club member Alexandre Hummel tells BBC Sport. \"I don't get why they would buy Strasbourg.\n\"Strasbourg is the only professional club in Alsace. There is a strong connection to the local identity, a mix of French and Germanic culture.\n\"In 2011, we went back to basics, we fought for our club and the Alsatian roots. It didn't matter what league it was, there was a local, grassroots link with the club.\n\"It worked very well, we have beaten every attendance record in the fifth, fourth and third tiers. You would regularly see crowds of 10,000 or 20,000.\"\nAn £11.9m deal to take defender Mamadou Sarr to Stamford Bridge has been agreed for July and Hummel says he expects such transfers to become a regular occurrence.\n\"It has been slow to emerge but for me it was clear from the beginning,\" he adds. \"They use Strasbourg so they can buy a player earlier than they would have otherwise and they pay a lower transfer fee.\n\"When BlueCo arrived, Keller was saying we'd be two different entities, with our own sporting policies. It has been clear for 18 months that this is not the case.\"\nMeanwhile, goalkeeper Djorde Petrovic and winger Andrey Santos - on loan from Chelsea - have become crucial members of Rosenior's squad this season, with 20-year-old Brazilian Santos reaching nine goal involvements in 24 Ligue 1 games.\nFrench football expert Jonathan Johnson believes the stature of Strasbourg always gave BlueCo an uphill battle for acceptance.\n\"Strasbourg fans are hurt as BlueCo identified them as a solid club with potential to nurture quality players and occasionally compete in Europe without being frontrunners for in Ligue 1 or Champions League regulars,\" he said.\n\"I can see why BlueCo acquired Strasbourg. However, looking at some of the other clubs that were available then, it was always going to be tricky for a foreign investment group to succeed with the club clearly not the multi-club operation's focal point.\n\"I believe that an absence of strong and clear communication created enough doubt to foster this hostility from Strasbourg's fans towards BlueCo.\"\nA lot of frustration and anger is directed at Keller, who is accused of selling out by sections of the fanbase, but the split among the fans has created a toxic - even violent - atmosphere on matchdays.\n\"At the beginning of every game, for 15 minutes, the ultras and supporters' groups don't sing in protest against BlueCo,\" says Hummel.\n\"Keller said clearly he wasn't going to interfere with the protests. It was our right, he respected it. Now he is putting pressure on us, publicly. For us, it is the icing on the cake of all the lies.\n\"There is a big row between the ultras and the rest of the stadium. Protesters have been harassed online and the leader of the ultras had to avoid a glass bottle that was thrown at him.\n\"It is difficult to know if we should be happy when the team wins. It is difficult for us to work with someone who we trusted to build the club back from the fifth tier and for him now to be working with the shareholders.\"\nJohnson says although Strasbourg fans may not like it, they have to accept the positive impact BlueCo has had on the club financially during difficult times for Ligue 1. The league's TV rights have shrunk twice in the past five years.\n\"Objectivity is needed,\" he asserts. \"This current team is younger, more vibrant and plays attractive football - the club is moving in a positive direction.\n\"The stadium is also being renovated. Strasbourg could have been in major financial trouble last summer without BlueCo during France's latest TV rights debacle.\"\nBut Hummel disagrees, saying: \"The economic problem in French football is very real - BlueCo is just a bad solution.\n\"We are not in debt to a bank but we are in debt to BlueCo. I would rather be in the fifth tier with our destiny in our hands, not spending someone else's money. When you do that, you belong to them.\"\nIn a recent interview with BBC Sport, manager Rosenior said his footballing philosophy aligns with what BlueCo want to achieve.\n\"Strasbourg is a club that has had a takeover from BlueCo and I know the technical directors Paul [Winstanley] and Laurence [Stewart] there,\" he said.\n\"They're great guys and aligned with what I believe in, which is a style of football and the development of players and winning games in a style that I believe in.\n\"I think that's why they spoke to me. I spoke to Marc Keller who's the president here and Marc has a great knowledge of the English game, a fantastic footballer himself, and he understands football.\n\"He played for some top clubs including West Ham, which again I have a link with through my dad, so everything felt right with the people I spoke to and I took the plunge. I'm enjoying every minute.\"\nMulti-club ownership is becoming more common in modern football. Johnson believes has its place but understands fan frustrations.\n\"I do think that it can work with select clubs,\" he says. \"There are financial benefits but the project's narrative not being tightly controlled from day one creates a crisis of identity.\n\"No fan views their club as secondary in any project and a stand-alone approach is more palatable.\n\"Some French clubs have historically relied on wealthy, stable benefactors and being in a modern multi-club operation could keep them relatively competitive and secure.\"\nBut in Alsace, the war between sporting success and local pride and community shows no sign of ending.\nStrasbourg were invited to comment on this story but did not respond.", "url": "https://www.bbc.com/sport/football/articles/c8dgjl8ygr3o"}