{"authors": ["Martin Keown", "www.facebook.com"], "date_download": "2025-05-21 07:47:07", "date_modify": "2025-05-21 07:47:07", "date_publish": "2025-05-18 22:40:42", "description": "Match of the Day pundit Martin Keown explains how Mikel Arteta's side can emulate his Arsenal team and take the next step to winning trophies.", "filename": "sport_football_articles_c5ye4jdl2z2o_1747813627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9cdb/live/35ff5690-3436-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ye4jdl2z2o_1747813627.html", "title": "'It can't all come from the manager'", "title_page": "'It can't all come from the manager' - Martin Keown on how Mikel Arteta's Arsenal can become winners - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunday's win over Newcastle means Arsenal will almost certainly finish second in the Premier League for the third year running, and of course people are asking how they might take the next step and land a major trophy.\nI've been there myself and, while it can sometimes feel very easy when you are always winning things, I know how difficult it is as a player when you keep getting so close without getting any reward.\nAs well as your own disappointment, you have to deal with all the noise around what has gone wrong - all the doom and gloom about how you have either bottled it or your team is missing an ingredient to make you into winners.\nThat's what Mikel Arteta and his players are hearing now, and my Arsenal team had exactly the same issue when we finished second to Manchester United three seasons running without winning a trophy between 1998-99 and 2000-01.\nLooking back now I don't feel any shame in that but, at the time, it was the toughest thing to take.\nBeing the bridesmaid so often is the worst feeling in football and it takes a special group to come back from having that happen repeatedly, and win.\nI was lucky because I was part of a special group of players at Arsenal, but we still had to work on it.\nIn the summer of 2001, Arsene Wenger brought in a psychologist who said to us that we were second best because the statistics proved we were.\nWe weren't very happy about that, but then he told us that he did not believe that the statistics were telling the truth.\nHe looked around the dressing room and said we have got World Cup winners in here, and you have all won trophies in the past. His message was that there was more under the bonnet, we just needed to find it.\nIt was a clever move by Wenger and the parallels in Arsenal's current position means it is something Arteta could try too, but it can't all come from the manager - it is down to the players to respond in the right way\nI remember being on the Millennium Stadium pitch after we had just lost the 2001 FA Cup final to Liverpool and thinking 'well this can't happen again', and it didn't.\nWe came back to Cardiff the following year and beat Chelsea to win the FA Cup then, a few days later, we went to Old Trafford and beat Manchester United to win the Premier League too.\nWe did not make big changes to our squad that won nothing in 2001 to do the Double the following season.\nSol Campbell arrived and Wenger told myself and Tony Adams that Sol would always play and one of us would be alongside him, but our only other major signing was Everton striker Francis Jeffers.\nI don't think this Arsenal squad needs an overhaul either, but the question always seems to come back to what they need to do to win trophies after finishing empty-handed again.\nThe answer is usually a new player in a certain position, like a centre-forward this summer for example.\nI do think Arteta needs to strengthen in a few areas but I think what they really need to be successful is the mindset I mentioned above - so, a really strong group that has got such a burning desire to win that it hurts them to the core when they don't.\nWhat you want is to be able to look around the dressing room and know everyone is feeling the same way, and that they will use this disappointment as fuel too.\nI had that feeling with Wenger's Arsenal, because I knew I was surrounded by people who, like me, were not going to rest until we got that glory.\nThat is how it has to be for this Arsenal team too. Like I say, it can't just come from the manager but that is a good starting place, and Arteta definitely provides it.\nI wish I was a fly on the wall in the Arsenal dressing room at half-time on Sunday because I think a lot of the difference between their first and second-half performance was down to the kind of motivation from the manager that I am talking about.\nIt was the same at Anfield last week, when they were 2-0 down to Liverpool at the break and Arteta told them he was not accepting that level of performance. They were not behind against Newcastle this time but they could have been, and he deserves some credit for how they turned things around again.\nLike Wenger, Arteta has got his lieutenants - the players he can rely on - and Declan Rice stepped up again on Sunday. You could tell he was short of full fitness because he was blowing a bit but Arsenal needed him, and he delivered.\nThere was a bit of a cup final feel about the game because Champions League qualification was riding on it for both teams and of course there was an edge to it, with Newcastle beating Arsenal three times this season already.\nThey needed to be put to bed, really, and Arsenal did that in the second half - even if the game still had quite a tense ending.\nI don't think Arsenal fans were exactly celebrating second place at the final whistle but it is still quite an achievement for them to get back into the Champions League for a third straight season, after they were away for six years.\nWhen you consider where Arsenal were when Arteta took over in 2019, I think he has done an amazing job.\nInjuries have massively impacted them this season, but it still feels like we have got our Arsenal back - they are on the right path, and the trophies he craves will follow.\nMartin Keown was speaking to BBC Sport's Chris Bevan.", "url": "https://www.bbc.com/sport/football/articles/c5ye4jdl2z2o"}