{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:22:38", "date_modify": "2025-05-20 12:22:38", "date_publish": "2023-08-04 14:43:41", "description": "Boss Mark Kennedy says Lincoln City are in a better position than they were when he took over last year.", "filename": "sport_football_66409568_1747743758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D15B/production/_130659535_gettyimages-1555010299.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66409568_1747743758.html", "title": "Mark Kennedy: Lincoln City boss can see progress since taking over in May 2022", "title_page": "Mark Kennedy: Lincoln City boss can see progress since taking over in May 2022 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Mark Kennedy says Lincoln City's stock continues to rise and the club is in a much better position than it was when he took over just over a year ago.\nThe Imps, who face Bolton Wanderers in Saturday's opening fixture, finished 11th in League One last season.\nKennedy believes that was a clear sign of progress during his brief time in charge, having inherited a side that finished 17th in 2021-22.\n\"The trajectory is going up,\" Kennedy told BBC Radio Lincolnshire.\n\"I think we finished a few places higher than we should have last season so we probably over-achieved.\n\"It's not so much a league position. It's building on last year.\n\"I want to improve on what we did. It's making sure the club is in a better place at the start of next season than it is now. Some of that is off the field and this pre-season we are in a very good position.\n\"The strength of the squad is a lot stronger, when everyone is fit and available, we should have a very powerful squad.\n\"The team I have now I am really proud of the players, individually and collectively. It is probably a million miles away from what I started out with last year but I am really pleased, privileged and proud of what I have now.\"", "url": "https://www.bbc.com/sport/football/66409568"}