{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-21 06:16:50", "date_modify": "2025-05-21 06:16:50", "date_publish": "2025-02-08 16:16:23", "description": "Italy punish Welsh indiscipline to inflict a 14th successive Test defeat on Warren Gatland's side.", "filename": "sport_rugby-union_articles_cge7vgdznr9o_1747808210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/86a9/live/07c0a5a0-e651-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cge7vgdznr9o_1747808210.html", "title": "Italy 22-15 Wales: Warren Gatland's side suffer 14th straight Test defeat", "title_page": "Italy 22-15 Wales: Warren Gatland's side suffer 14th straight Test defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Italy piled more misery on Wales by dominating a cagey Six Nations basement battle in Rome.\nAnge Capuozzo's acrobatic finish gave the hosts a lead they never looked like relinquishing at Stadio Olimpico.\nThe Welsh driving line-out brought an Aaron Wainwright score, a penalty try and two yellow cards in the closing stages of the contest as Italy finished with 13 players.\nBut it was too late for Wales to undo the damage caused by their own indiscipline as their record losing run went on.\nA 14th successive defeat saw Wales drop to their lowest ever position in the world rankings - 12th - and will only heighten the pressure on head coach Warren Gatland.\nItaly had to handle a new level of expectancy given they were such favourites for this game but comfortably coped with the pressure and took their one clear chance.\nWales had to deal with the loss of two key players on the morning of the match after Dafydd Jenkins (sickness) and Liam Williams (knee) withdrew.\nBoth teams had to overcome the downpour that was more Rhondda than Rome on a day when it almost easier not to have the ball.\nThe conditions only heightened the need to be accurate, disciplined and clinical and Wales were none of those things.\nTheir 15 handling errors that compared to just four by Italy told half the story, while 17 points from the boot of Tommaso Allan told the other half.\nWales had more of the ball but, just as in Paris a week earlier, did precious little with it as they looked predictable.\nItaly, in contrast, were assured, smarter and won key battlegrounds in the kicking and, with number eight Lorenzo Cannone prominent, the breakdown.", "url": "https://www.bbc.com/sport/rugby-union/articles/cge7vgdznr9o"}