{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 05:04:11", "date_modify": "2025-05-21 05:04:11", "date_publish": "2025-01-14 21:17:27", "description": "Forward Chris Wreh refuses to play for Tamworth after being racially abused, claiming the club have not supported him enough.", "filename": "sport_football_articles_clyzv46rgl8o_1747803851.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4835/live/75fda420-d2c2-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyzv46rgl8o_1747803851.html", "title": "Chris Wreh: Tamworth forward refuses to play over reaction to racism after Tottenham FA Cup tie", "title_page": "Chris Wreh: Tamworth forward refuses to play over reaction to racism after Tottenham FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tamworth forward Chris Wreh says he made himself unavailable for their midweek game as he felt the club had not supported him enough after he was racially abused online following their FA Cup third-round defeat.\nWreh was a second-half substitute as the part-time National League side took Premier League Tottenham to extra time on Sunday, eventually losing 3-0.\nAfterwards the 28-year-old posted an image to his social media of an Instagram message from a person using racist language and blaming Wreh for him losing a bet on the game.\nWreh said he had received support from Tamworth manager Andy Peaks and fans, and been contacted by police.\nHowever he said he was \"disappointed\" by a lack of a public statement from the club, claiming only one club official had been in contact since he posted the screenshot - to say the club wanted to \"keep the matter internal\".\nAs a result, Wreh said he declined to play in Tamworth's Birmingham Senior Cup third-round match against Boldmere St Michaels on Tuesday.\n\"Incidents like this highlight the ongoing issue of racism,\" Wreh wrote in a message posted to his X and Instagram accounts, external before Tuesday's match. \"It is shameful to be racially abused by someone simply because they lost a bet, but sadly this happens all too often.\n\"While I have the utmost respect for my manager, who has supported me throughout this issue, I am disappointed that the club has not publicly supported me yet, which has left me feeling confused and disappointed.\n\"At no point was I asked if I was OK, instead I was informed that the silence was due to a desire to keep the matter internal. I cannot agree with or condone this approach.\n\"If these incidents are kept 'in-house', they will never be addressed. I hope everyone understands my reasons for speaking out.\"\nOn Wednesday, Tamworth said club officials were assisting police on the matter.\n\"We will continue to support Chris with the extensive work that's going on behind the scenes to bring the person responsible to justice,\" a club statement added.\n\"Tamworth Football Club and its management have and will always support its players against any sign of racism or discrimination so all players have trust within the club, for which they have all played a major role in the club's rapid growth, and recent FA Cup run.\n\"Racist abuse will never be tolerated and will be thoroughly investigated.\"\nAnti-discrimination charity Kick It Out said: \"It's concerning that Chris does not feel he has had the right level of support when faced with discrimination.\n\"When this happens, it's vital that it's taken seriously and players have the backing of their club, and from authorities so that the case can be investigated.\"\nThey added Wreh's decision was \"selfless\" and that he should be \"commended\".\nWreh joined Tamworth, who are 16th in the fifth tier of English football, in 2023. The striker has also played for Hartlepool United, Southend United and Banbury United.\nSince Sunday's tie, Spurs manager Ange Postecoglou has criticised a section of the Tamworth support for abuse aimed at him during the match.", "url": "https://www.bbc.com/sport/football/articles/clyzv46rgl8o"}