{"authors": ["Ged Scott and Nick Southall", "www.facebook.com"], "date_download": "2025-05-21 06:15:40", "date_modify": "2025-05-21 06:15:40", "date_publish": "2025-03-31 09:56:50", "description": "Relegation-haunted Shrewsbury Town must look elsewhere for investors following the collapse of their proposed takeover.", "filename": "sport_football_articles_c4g2d7pkpk4o_1747808140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c63/live/70e0eea0-0d66-11f0-8cb6-ef080be5aa48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g2d7pkpk4o_1747808140.html", "title": "Shrewsbury Town: Relegation-haunted club look elsewhere for investors", "title_page": "Shrewsbury Town: Relegation-haunted club look elsewhere for investors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shrewsbury Town have been forced to look elsewhere for new investment following the collapse of a takeover deal from a potential American owner.\nThe existing deal on the table, to end long-serving chairman Roland Wycherley's 29-year ownership of the struggling League One club, had been under discussion since first being publicly announced in September.\nAlthough the prospective new owner's application had not yet been submitted to the English Football League Owners and Directors 'fit and proper person' test, it had nearly reached completion following a six-month exclusivity period.\nThat period ends on Monday, 31 March, after which time Shrewsbury would be free to talk to any potential bidders.\nOne media report says it looks like the takeover has already collapsed as the interested party had decided the timing was not right due to a liquidity issue from another business. But, in reality, the proposed first-choice bidder wanted to spend the weekend ahead of Monday's deadline thinking it through.\nThis latest twist on Shrewsbury's uncertain future caps a bad week in a bad season for the Shropshire club.\nPrevious Town head coach Gareth Ainsworth, who knew that the proposed Town takeover was not guaranteed when he first took the job in November, left last Tuesday.\nHe was on contract until 2026 but a settlement fee was agreed between the two clubs for both him and his number two Richard Dobson to join Gillingham.\nLittle more than 24 hours later Michael Appleton was appointed as head coach until the end of the season but his first game ended in a 4-1 defeat by leaders Birmingham City on Saturday.\nAnd Shrewsbury, 14 points adrift of safety with just eight games left, now face a further daunting test against another of Ainsworth's former clubs, third-placed Wycombe Wanderers, at Adams Park on Tuesday night.\nIf they lose that and again at home to Cambridge United next Saturday, that could conceivably be enough to relegate them with a month of the season left.", "url": "https://www.bbc.com/sport/football/articles/c4g2d7pkpk4o"}