{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:06:09", "date_modify": "2025-05-21 05:06:09", "date_publish": "2025-01-23 12:41:10", "description": "Hull City sign winger Lincoln on loan from Turkish side Fenerbahce until the end of the season.", "filename": "sport_football_articles_c391xg72gkko_1747803969.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8577/live/4700e220-d986-11ef-9467-577a0b7c8ee7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c391xg72gkko_1747803969.html", "title": "Lincoln: Hull City sign Brazilian winger on loan from Fenerbahce", "title_page": "Lincoln: Hull City sign Brazilian winger on loan from Fenerbahce - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City have signed Brazilian forward Lincoln on loan from Turkish side Fenerbahce until the end of the season.\nThe 26-year-old has made 29 Fenerbahce appearances and is the Tigers' fifth signing of the winter transfer window.\nLincoln spent most of last year on loan with Brazilian side Red Bull Bragantino and featured in 49 matches during the 2024 Serie A season.\n\"It was about two weeks ago I met the chairman in Istanbul. He approached me with the interest; I was very glad, very happy. I am 100% ready to try to help the club,\" he said., external\n\"I am a very versatile player. I can understand the situations of the game; that's why I play three or four different positions, even during the same match.\n\"My best position is number 10, but I have played many times as a box-to-box number eight, left winger, right winger.\n\"The fans can expect a lot of hard work, a lot of intensity. I'll run a lot and give everything for the club.\"\nLincoln joins striker Kyle Joseph, midfielders Matt Crooks and Nordin Amrabat and forward Joe Gelhardt in linking up with Ruben Selles' side during January.", "url": "https://www.bbc.com/sport/football/articles/c391xg72gkko"}