{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:59", "date_modify": "2025-05-21 07:48:59", "date_publish": "2025-05-18 17:59:48", "description": "Lewis Gregory hit a brilliant 89 not out as Somerset beat Sussex by five wickets in their County Championship match at Taunton.", "filename": "sport_cricket_articles_cy4evw73r1yo_1747813739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d7db/live/135d37d0-3411-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy4evw73r1yo_1747813739.html", "title": "County Championship: Somerset v Sussex", "title_page": "County Championship: Somerset v Sussex - Lewis Gregory leads from front in home win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Gregory led from the front with a brilliant 89 not out as Somerset completed a five-wicket win over Sussex in their County Championship match at the Cooper Associates Ground in Taunton.\nSet just 150 to win on a benign pitch, the hosts reached their target in an additional half hour to the scheduled day's play, skipper Gregory taking advantage of his new position as opener to hit 12 fours in a sparkling 118-ball innings.\nEarlier, an unbeaten 82 off 164 balls from John Simpson had helped Sussex extend their second innings total from an overnight 127-4 to 335 all out. Fynn Hudson-Prentice contributed 41 and James Coles 39, while Jack Leach finished with 4-51.\nIt did not prove enough and Somerset took 21 points from a second successive Championship victory, while their opponents had to be content with three.\nSussex hopes of a fightback were dealt an early blow when Craig Overton struck with his first delivery of the day at the start of the second over. Tom Alsop, playing defensively, edged a low catch to Gregory at first slip.\nAlmost immediately it was 129-6 as James Coles called for a single to mid-wicket to get off the mark and James Hayes was run out by Tom Banton's direct hit at the wicketkeeper's end.\nColes soon began to time the ball sweetly. He and Simpson held up the home side's victory bid with a stand of 66, both looking to play positively on a now flat wicket.\nColes had struck six fours when attempting another attacking shot off Jack Leach and driving in the air to Tom Lammonby at mid-off. At 195-7, his side led by just nine runs.\nSimpson looked untroubled and found another partner in good touch as Hudson-Prentice helped take the total to 224-7 at lunch. More Sussex resistance followed the interval, aided by the rare sight of Overton dropping Hudson-Prentice at second slip off Leach. With 27 runs added, the second new ball was taken.\nA pulled four off Henry took Simpson to a half-century off 126 balls. It was the sixth boundary of an innings that was starting to frustrate the Somerset bowlers. When Hudson-Prentice smacked Henry for six over the short boundary on the town side of the ground, the lead had grown to 87.\nThe shot provoked quick revenge from the New Zealand seamer who with the next delivery sent Hudson-Prentice's off stump flying to end a partnership of 78, which had occupied 28 overs.\nHenry soon followed up by having Nathan McAndrew caught behind after moving briskly to 16. Still Simpson refused to buckle and with last man Ollie Robinson at the other end, he went on the attack.\nRobinson also played aggressively in a last-wicket stand of 44 before being caught at slip for 18 pushing forward to Leach. Tea was taken with 35 overs left in the day's play.\nThere were early scares for the hosts when Gregory edged the second delivery of their second innings from Robinson to first slip, only to be reprieved by a no-ball call, and Josh Davey was dropped by in the slips off McAndrew.\nDavey soon fell to Robinson, bowled by a full delivery, and it was 11-2 when Lammonby fell lbw to the same bowler falling across his stumps. That became 30-3 as James Rew uncharacteristically chased a wide ball from McAndrew and edged through to Simpson.\nThere was tension aplenty as Tom Abell took 25 balls to get off the mark before a square cut for four off Hudson-Prentice. But Gregory was proving a calming influence and when he moved to a confident half-century off 73 balls, with six fours, Somerset were more than halfway to their target.\nLeft-arm spinner James Coles removed Abell for 27 and Tom Banton for 15, but Gregory saw his side home, striking three boundaries in an over from Jack Carson before deservedly hitting the winning run.", "url": "https://www.bbc.com/sport/cricket/articles/cy4evw73r1yo"}