{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:30", "date_modify": "2025-05-21 07:56:30", "date_publish": "2025-03-27 21:15:43", "description": "Cliftonville manager Jim Magilton says his side will rise to the challenge of facing Ards in their Irish Cup semi-final at Windsor Park on Friday night.", "filename": "sport_articles_ce3096ww0yzo_1747814190.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/802c/live/4b921740-0b50-11f0-852c-e5502ca11fa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce3096ww0yzo_1747814190.html", "title": "'We can rise to the challenge' - Reds boss Magilton", "title_page": "Irish Cup: 'We can rise to the challenge' - Reds boss Magilton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cliftonville manager Jim Magilton says he expects his side to \"rise to the challenge\" when they face Ards in the first of the weekend's Irish Cup semi-finals at Windsor Park on Friday night.\nThe Reds are defending the trophy they won for the first time since 1979 by beating Linfield in last year's decider and last month the north Belfast club added the BetMcLean Cup to their silverware cabinet.\nArds have defeated Premiership opponents in the form of Ballymena United and Loughgall on their way to reaching the last four of the competition and are on a run of four consecutive wins in the Championship.\n\"They're winning games, they're very confident. We face a huge challenge, one that we're going to rise to,\" Magilton told BBC Sport NI.\n\"We know how confident a group they are. Winning games of football just breeds confidence.\n\"We recognise their strengths and we need to exploit whatever weaknesses are in their team. We're very determined to defend the Irish Cup.\"\nThe teams met earlier in the season in the first round of the County Antrim Shield in September, the Reds only advancing courtesy of a 9-8 penalty shootout success after the game ended 0-0.\n\"You look at Ards' record in the cup competitions this year, we played them here and they were so unlucky not to go through,\" reflected the Reds boss.\n\"They've had two major scalps in the Irish Cup and we're expecting a really tough game. They're very well organised, well coached, they've got players who can hurt you.\n\"They have certainly earned the right to play in an Irish Cup semi-final with a goal of reaching an Irish Cup final very much in their sights and we have to stand up and be counted.\"\nMagilton believes his squad includes the kind of players who relish the opportunity of performing on the big occasions.\n\"The best players take the pressure on board. They love it, they love that stage, they want it, they crave it.\n\"They now have an opportunity to present themselves again and we'll see what happens,\" he added.", "url": "https://www.bbc.com/sport/articles/ce3096ww0yzo"}