{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-04-26 03:55:30", "date_modify": "2025-04-26 03:55:30", "date_publish": "2025-03-04 16:04:20", "description": "Arne Slot told referee Michael Oliver he would blame him if Liverpool fail to win the Premier League.", "filename": "sport_football_articles_cx2gve0z8vgo_1745639730.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3cf8/live/cbb9df00-f90a-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2gve0z8vgo_1745639730.html", "title": "Arne Slot: Liverpool boss told referee Michael Oliver he would 'blame him' if Reds don't win title", "title_page": "Arne Slot: Liverpool boss told referee Michael Oliver he would 'blame him' if Reds don't win title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool manager Arne Slot told referee Michael Oliver he would blame him if the club failed to win this season's Premier League.\nThe Dutchman was shown a straight red card after he confronted Oliver and one of his assistant referees on the pitch following his side's 2-2 Merseyside derby draw with Everton last month.\nSlot was given a two-match ban and fined £70,000 by an independent Football Association commission after accepting a charge of acting in an improper manner and using insulting and/or abusive words and/or behaviour towards both the match referee and an assistant referee.\nOliver alleged Slot, while shaking the official's hand, said: \"If we don't win the league, I'll [expletive] blame you.\"\nSlot disputed the alleged language used, claiming he instead said \"if we don't win the league, I will have you to thank for that\".\nBut the commission decided it was \"more likely than not that Arne Slot used the language alleged by the referee and the FA\".\nThe FA argued the discrepancy didn't make a material difference to the sanction because the words used still constituted Slot acting in an improper manner.\nSlot accepted that, and did not dispute stating \"[expletive] disgrace\" to the assistant referee as part of his angry outburst.\nThe FA also alleged the Reds boss said Oliver \"[expletive] give them everything\", and hoped the referee \"was proud of that performance\".\nSlot acknowledged his actions were unacceptable and he let his frustrations get the better of him, because he felt certain decisions during the game went against his side.\nThe commission acknowledged he had since made a sincere apology both privately and in public.\nSlot's fine was reduced from £100,000 due to mitigating factors, including his apology, admitting the charge at the earliest opportunity and because he had no previous record of misconduct.\nSpeaking before Liverpool's Champions League last-16 first-leg match against Paris St-Germain on Wednesday, Slot said: \"The moment it happened, I was quite emotional [about] everything that happened in the game.\n\"I chose to go on the pitch instead of staying calm and staying inside to talk to Michael [Oliver]. I don't have these emotions now so I should set a better example.\"\nSlot's assistant coach Sipke Hulshoff was also given a two-match touchline ban and fined £7,000 after the FA alleged he approached Oliver in an \"extremely aggressive manner\", and said he was a \"[expletive] disgrace\".\nLiverpool and Everton were both charged with failing to ensure their players did not behave in a way which was improper or provocative.\nThe late chaos at Goodison Park began after James Tarkowski scored a dramatic 98th-minute equaliser for Everton, which was awarded after a video assistant referee (VAR) check.\nLiverpool were adamant the goal should have been disallowed because of a shove by Toffees striker Beto on Reds defender Ibrahima Konate in the build-up.\nEverton midfielder Abdoulaye Doucoure then celebrated in front of the Liverpool fans at the final whistle, before being confronted by visiting midfielder Curtis Jones, with both players sent off for second yellow-card offences.\nSlot and Hulshoff were both shown the red card after approaching Oliver on the pitch.\nAfter serving the touchline ban, Slot's first domestic game back in the dugout will come after the international break when his side face Newcastle in the Carabao Cup final on 16 March.\nLiverpool, who are 13 points clear at the top of the Premier League, host Everton at Anfield on 2 April.", "url": "https://www.bbc.co.uk/sport/football/articles/cx2gve0z8vgo"}