{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:18:52", "date_modify": "2025-05-20 14:18:52", "date_publish": "2023-07-29 13:36:48", "description": "Liverpool: Jurgen Klopp says Trent Alexander-Arnold can play as number six", "filename": "sport_articles_cx7ye3ex80do_1747750732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e66b/live/bf407440-2e14-11ee-aad2-dfe6ec183c8f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cx7ye3ex80do_1747750732.html", "title": "Liverpool: Jurgen Klopp says Trent Alexander-Arnold can play as number six", "title_page": "Liverpool: Jurgen Klopp says Trent Alexander-Arnold can play as number six - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool manager Jurgen Klopp has said Trent Alexander-Arnold is an option for the number six role in midfield, but stopped short of confirming whether he will start the new season in that position.\nAlexander-Arnold excelled in a hybrid role in the latter part of 2022-23 as Liverpool finished the campaign strongly, and he has been deployed in a deep midfield during pre-season.\nBut Klopp said on Saturday: \"After we put him in this flexible role, everyone told us he should play completely in midfield without saying why.\n\"It's a completely different position to the one he played last season, or he played for England, because it’s a holding position. You have to organise much more.\n\"Trent can play the position - it depends on who is on the left and right of him.\n\"We really thought it was a very good and important thing to do this pre-season.\n\"We still want to try it with Trent as a right-back again. Then we'll see how we'll start the season.\"\nLiverpool continue preparations for the new season when they take on Leicester City at Singapore National Stadium on Sunday (10:00 BST kick-off).\nThey then complete their tour of the Far East with a friendly against Bayern Munich at the same venue on Wednesday (12:30).", "url": "https://www.bbc.com/sport/articles/cx7ye3ex80do"}