{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:56:10", "date_modify": "2025-05-20 13:56:10", "date_publish": "2023-07-31 10:24:19", "description": "Essex sign Australian all-rounder Beau Webster for the One-Day Cup, ahead of Tuesday's game against Lancashire", "filename": "sport_cricket_66359548_1747749370.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15A2B/production/_130591688_shutterstock_editorial_11717802dj.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66359548_1747749370.html", "title": "Beau Webster: Essex sign Australian for One-Day Cup", "title_page": "Beau Webster: Essex sign Australian for One-Day Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Essex have signed Australian all-rounder Beau Webster for the One-Day Cup, which starts on Tuesday.\nWebster, from Tasmania, has scored 728 runs in 36 List A games, including one century, and taken 12 wickets.\nThe 29-year-old has been playing club cricket in the county for Upminster this summer, where former Essex keeper Adam Wheater is captain.\n\"It's fantastic to sign for Essex and to get a chance in county cricket,\" Webster told the club website.\n\"I've really enjoyed being here this year, so to stay in the area and test myself at the next level will be brilliant.\"\nEssex, who are away to Lancashire on Tuesday, failed to progress beyond the group stage of last year's One-Day Cup and have not won a 50-over trophy since 2008.\n\"When we became aware that a player of Beau's calibre might be available for the One-Day Cup this year, we wanted to move to bring him on board,\" said Essex head coach Anthony McGrath.\n\"He is a tall, powerful player who can impact a match with bat and ball, and having spoken to him already, I know just how keen he is to get going and help win games of cricket for Essex.\"", "url": "https://www.bbc.com/sport/cricket/66359548"}