{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:15:08", "date_modify": "2025-04-26 08:15:08", "date_publish": "2025-02-26 10:59:44", "description": "'Really special' - Johnston proud to reach Celtic milestone", "filename": "sport_articles_cx29p12wr5no_1745655308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c26/live/8611b650-f430-11ef-90ba-27e0e506a6c8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx29p12wr5no_1745655308.html", "title": "'Really special' - Johnston proud to reach Celtic milestone", "title_page": "'Really special' - Johnston proud to reach Celtic milestone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A trio of milestones were reached on a night Celtic put five goals past Aberdeen.\nCaptain Callum McGregor's strike was his 50th league goal for the club, 19-year-old midfielder Jude Bonnar came off the bench for a debut, and Alistair Johnston made his 100th Celtic appearance.\nNot that the Canada right-back knew much about it until a team-mate filled him in.\n\"Tony Ralston congratulated me before the game on my 100th appearance but I didn't realise it was,\" Johnston told Celtic TV.\n\"To have 100 appearances at a club like this is really special. Around the changing room, there are guys who have so many more than that and it feels like a small number.\n\"But to me, it's an impressive thing and to me and my family, it's really important and special.\n\"To have thought a couple years ago that I'd have 100 appearances for a club like Celtic, it's not something that was even in the realm of possibility.\n\"So to say that I've done that, I'm pretty proud of myself and hopefully I'll kick on and get some more under my belt.\"\nJohnston, 26, marked the occasion by providing the 18th assist of his Celtic career, sending in a fine cross for Daizen Maeda to complete the 5-1 victory.\n\"He's always pushing in every game, and for him to get an assist in the last minute is crazy,\" said midfielder Arne Engels.\n\"He's doing really well and I'm really impressed with him, so I hope he just keeps on going.\"", "url": "https://www.bbc.co.uk/sport/articles/cx29p12wr5no"}