{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:55:35", "date_modify": "2025-05-20 11:55:35", "date_publish": "2023-08-05 16:12:39", "description": "A 98th-minute Jay Donnelly goal gives Glentoran manager Warren Feeney a winning league start while newly-promoted Loughgall beat Newry City.", "filename": "sport_football_66417951_1747742135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53E4/production/_130667412_glenavonvglentoran_0066.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66417951_1747742135.html", "title": "Irish Premiership: Glentoran grab last-gasp victory as promoted Loughgall open with win", "title_page": "Irish Premiership: Glentoran grab last-gasp victory as promoted Loughgall open with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A 98th-minute Jay Donnelly goal gave Glentoran manager Warren Feeney a dramatic winning start in the Irish Premiership as they beat Glenavon 1-0.\nSeven minutes of injury-time had been added on at Mourneview Park before Donnelly's last-gasp winner.\nNewly-promoted Loughgall got their top-flight campaign off to a stunning start with a 3-0 away win over Newry City.\nTwo Caolan Loughran goals either side of a Nathaniel Ferris penalty won it for The Villagers.\nNewry had Thomas Lockhart sent off in the closing stages for a stamp on Ally Teggart, who had slid in on Lockhart with a heavy tackle.\nThe new Irish Premiership campaign kicked off on Friday night as Coleraine came from behind to beat derby rivals Ballymena United 2-1 thanks to two goals from Matthew Shevlin.\nWith his side having suffered a disappointing shootout defeat by Gzira United of Malta in the first qualifying round of the Europa Conference League, Feeney made his Premiership debut in the Glens dugout in front of a large travelling support at Mourneview Park.\nThe east Belfast outfit enjoyed the majority of possession throughout most of the match but Glenavon looked solid and appeared to be on the verge of earning a point until Donnelly scored with almost the last kick of the game.\nGlens sub Shay McCartan reacted quickest to a drop ball on the edge of the box and got to the byline before flashing the ball across the face of goal, with Donnelly on hand to finish from close range.\nThey came close to opening the scoring on 65 minutes when substitute Junior was released down the left by Niall McGinn, but his low right-footed shot struck the post with goalkeeper Ryan Brown beaten.\nThey created their best chance on 14 minutes when Rhys Marshall was played in down the right wing, but his effort was straight at keeper Brown who came off his line well to push the ball away to Cameron Palmer, who had his rebound blocked.\nMcGinn then had an effort cleared off the line by Glenavon captain Daniel Wallace before the hosts began to edge themselves into the game, with Aaron Prendergast's powerful strike from the edge of the box in the 52nd minute testing Aaron McCarey.\nThere were fewer chances in the second half, apart from that Junior effort, before the late, late drama of Donnelly's goal.", "url": "https://www.bbc.com/sport/football/66417951"}