{"authors": ["Kate Holloway", "www.facebook.com"], "date_download": "2025-05-21 05:52:36", "date_modify": "2025-05-21 05:52:36", "date_publish": "2025-01-31 14:28:33", "description": "BBC Sport assesses 10 EFL players who could be worthy of an England call-up under new Three Lions boss Thomas Tuchel.", "filename": "sport_football_articles_c4g34l37l8xo_1747806756.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b71/live/5ceadc00-df2e-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g34l37l8xo_1747806756.html", "title": "Thomas Tuchel: 10 EFL players new England boss should consider", "title_page": "Thomas Tuchel: 10 EFL players new England boss should consider - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England boss Thomas Tuchel is reportedly open to calling up Championship players for international duty as he takes charge for the first time during their World Cup qualifying matches.\nEngland face Albania on 21 March at Wembley, before welcoming Latvia three days later.\nIt is understood the German has already been keeping an eye on a couple of second-tier stars - but are there more in the ranks who deserve a shot at representing their country?\nHere is a look at some of the players who might make the cut...\nThe Burnley goalkeeper has been exceptional this season so it would be no surprise if he is called up by Tuchel.\nThe 19-times capped England Under-21 international already received a promotion to the senior squad in 2024 after Southampton's Aaron Ramsdale withdrew.\nThis season the 22-year-old has kept an incredible 19 clean sheets for the Clarets in 28 Championship games, with Burnley only conceding nine goals in total.\nAs for 2025... Trafford is yet to pick the ball out of his net.\nSunderland's teenage sensation Jobe Bellingham is the other name on Tuchel's list.\nThe 19-year-old has been undroppable this season, having played every minute in 25 of his 26 appearances for the side - only a red card against QPR ruining his unblemished pitch time.\nThe younger Bellingham brings a physical presence onto the pitch and adds versatility to the squad, having being rotated in each of the midfield positions as well as covering as a centre forward for Sunderland last season.\nIt is no secret that England do not have a set left-back - but Luton Town's Alfie Doughty could be one to fill that hole.\nManchester United's Luke Shaw is likely to be Tuchel's first choice for the position but the 29-year-old has been plagued with injuries.\nIt leaves Newcastle's Lewis Hall as the only other player from England's past squads playing regular football, with Chelsea's Ben Chilwell out of favour with boss Enzo Maresca.\n\"If Tuchel does insist on playing as a back three, Alfie is one of the quickest I've seen and is a natural left-sided left-back,\" Colchester forward Lyle Taylor told the 72+ podcast.\nIt will be a tough task for Sunderland's Chris Rigg to break into the squad this time around, but he is definitely one to keep an eye on for the future.\nLike Jobe Bellingham, Rigg is a regular feature for the Black Cats and has drawn praise for his dynamic and aggressive play.\nAt just 17, he is not quite the fully developed package, but he has already shown what a leader he can be, captaining England Under-16s as well as wearing the armband for the Under-17s' Euros quarter-final against Italy.\nSheffield United's Harrison Burrows has a wicked left foot and the magic he creates with it has helped the Blades in their hunt for promotion this season.\nThe left-back is a strong passer, which may work well with Tuchel's desire to maintain high volumes of possession, and leans more towards attack than defence which would allow England's new boss to use him in a more creative role.\nIn the absence of James Trafford, James Beadle became the number one pick for England's under-21s and has been impressing while on loan at Sheffield Wednesday from Brighton.\nIt is likely that only injuries would create a chance for 20-year-old Beadle to receive a call-up in March, but Trafford's ascension last year shows age is no barrier.\nDefender CJ Egan-Riley is a regular starter for Burnley - a side that has conceded just nine goals in their 29 Championship games.\nThe 22-year-old is clearly doing something right and, given that part of what makes England centre-backs Harry Maguire and John Stones tick is their synergy with one another, any inclusion now may be beneficial for the future.\nThe Championship is not the only place to seek out young talent - especially if you are looking for first pick goalkeepers.\nWigan's Sam Tickle has played every League One match for the Latics this season, keeping 11 clean sheets out of his 27 games.\n\"Tickle has been absolutely magnificent at Wigan. I loved his decision to stay there and play games,\" McAnuff said of the 22-year-old.\n\"Playing football regularly at a young age is so important for development.\"\nDublin-born Dennis Cirkin is another left-back who could benefit from a lack of options in that position for Tuchel.\nHe is the favoured choice for Sunderland boss Regis Le Bris, who uses width to get past opponents - a similar tactic to the one Tuchel employed while at Chelsea with Reece James and Ben Chilwell.\nCirkin would also provide plenty of pace for the German's high-pressing style of play.\nHave we missed anyone?\nLet us know in the comments section.", "url": "https://www.bbc.com/sport/football/articles/c4g34l37l8xo"}