{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 04:57:45", "date_modify": "2025-05-21 04:57:45", "date_publish": "2025-04-04 13:05:51", "description": "Four-time champions Leinster overpower Harlequins in a one-sided contest at Croke Park to cruise into the Investec Champions Cup quarter-finals.", "filename": "sport_rugby-union_articles_c05np6vvnndo_1747803465.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/596b/live/54c82400-1233-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c05np6vvnndo_1747803465.html", "title": "Leinster 62-0 Harlequins: Four-time champions thrash Quins to reach last eight", "title_page": "Leinster 62-0 Harlequins: Four-time champions thrash Quins to reach last eight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four-time champions Leinster overpowered Harlequins in a one-sided contest at Croke Park to cruise into the Investec Champions Cup quarter-finals.\nThe Irish province, beaten finalists in each of the past three seasons, built a commanding advantage before the break thanks to first-half tries from returning Ireland internationals Sam Prendergast, Joe McCarthy and Jamie Osborne.\nJosh van der Flier and Garry Ringrose, both outstanding, extended the lead after the break before Dan Sheehan touched down.\nHarlequins' misery deepened when Leinster were awarded a penalty try for a deliberate knock-on by Luke Northmore, who was yellow carded, before Ross Byrne and two James Lowe scores capped a thoroughly satisfying afternoon for Leinster.\nLeinster will host Glasgow at Aviva Stadium on Friday after the Warriors outclassed Leicester Tigers 43-19.\nBritish and Irish Lions head coach Andy Farrell's attendance at Croke Park in Dublin gave extra incentive to several players in both line-ups just a month out from the Englishman's squad announcement.\nAnd while Leinster, who won all four pool games, were firm favourites, it was Harlequins who started brightly and could have been 10-0 ahead inside the opening 15 minutes.\nHowever, Leigh Halfpenny's long-range penalty dropped short before a maul from the visitors was held up on Leinster's tryline.\nFrom there, the home side surged out of sight as Harlequins struggled to cope with the speed and ferocity of those in blue.\nIreland fly-half Prendergast, undoubtedly keen to impress Farrell after dropping to the bench for the last Six Nations game against Italy, got the United Rugby Championship leaders up and running when he finished in the corner after a powerful drive from Dan Sheehan.\nWhile Prendergast sliced his conversion attempt wide, he turned provider for McCarthy three minutes later, looping a pass into the second row's path after the impressive Josh van der Flier opened up the Harlequins defence.\nFew teams can cope with Leinster when their attack clicks into gear and that was the case for the third try as Ringrose surged into Harlequins territory. After a neat exchange between Van der Flier and Osborne, the latter crossed to make it 19-0, further denting the Premiership side's hopes.\nLeinster put their foot down after the break, and while an RG Snyman try was ruled out following a television match official (TMO) check, Van der Flier and Ringrose deservingly got in on the act to extend the advantage to 31-0.\nJust before the hour mark, Sheehan continued his impressive scoring form when he finished off another driving Leinster maul to dot down for his eighth try in as many games for club and country this season after returning from a serious knee injury.\nWith 15 minutes left, Northmore was sent to the bin for a deliberate knock-on at the end of a wonderful Leinster move that was started by Prendergast and Jordie Barrett combining beautifully down the left wing.\nBarrett, who has 68 New Zealand caps, was an example of the strength of Leinster's bench and he was involved in the build-up again before Ross Byrne - another replacement - crossed in the corner.\nTwo late Lowe tries - and a Jamie Benson yellow card - rubbed salt in Harlequins' wounds and left the majority of the 55,627-strong crowd at Croke Park smiling once more before another knockout game in Aviva Stadium next week.\nHarlequins, meanwhile, will hope to park their European disappointment when they face Sale on 19 April.", "url": "https://www.bbc.com/sport/rugby-union/articles/c05np6vvnndo"}