{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:10", "date_modify": "2025-05-19 15:13:10", "date_publish": "2017-07-04 15:38:15", "description": "Bernard Tomic says he felt \"bored\" and could not find motivation during his straight-set defeat by Mischa Zverev at Wimbledon.", "filename": "sport_tennis_40498212_1747667590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/176A6/production/_96801959_tomic.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40498212_1747667590.html", "title": "Wimbledon 2017: Bernard Tomic 'bored' during defeat by Mischa Zverev", "title_page": "Wimbledon 2017: Bernard Tomic 'bored' during defeat by Mischa Zverev - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bernard Tomic says he felt \"bored\" and could not find motivation during his straight-set defeat by Mischa Zverev at Wimbledon.\nThe 24-year-old Australian lost 6-4 6-3 6-4 to Germany's world number 30 in one hour and 19 minutes.\nTomic was ranked 17 in January 2016 but has fallen to 59 in the world.\nHe said: \"I think I don't respect the sport enough. You know, I'm going to play another 10 years, and I know after my career I won't have to work again.\"\nTomic, who has won three ATP Tour titles, has earned almost £4m in career prize money, including £35,000 for his defeat by Zverev.\nWhen asked in his post-match news conference if he should repay the money from his limp defeat, he replied: \"We all work for money. At 34, maybe I can donate to charity. If you ask Roger Federer if he'll do it, I'll do it.\"\nTomic, who has not won a tour title since 2015, has struggled for form this year, winning just nine matches overall and losing in the first round at the French Open and now Wimbledon.\n\"I felt a little bit bored out there,\" he said.\n\"The last sort of year or two, nothing motivates. It's not I don't give my best. I still try to go for it in a way.\"\nNine-time Wimbledon singles champion Martina Navratilova\n\"It's disrespectful to the sport and disrespectful to the history of the sport. If you can't get motivated at Wimbledon it's time to find another job. The spectators paid good money to come here and watch Wimbledon and the guy shows up and doesn't try, he can't be bothered. Just stay at home.\nAustralian two-time Wimbledon doubles champion Rennae Stubbs\nTo say the things that he said in the press conference today is a disgrace.\nYou're an embarrassment to yourself, and not only to the sport but to Australian tennis.", "url": "https://www.bbc.com/sport/tennis/40498212"}