{"authors": ["Piers Newbery", "www.facebook.com"], "date_download": "2025-05-19 15:10:40", "date_modify": "2025-05-19 15:10:40", "date_publish": "2017-07-04 19:11:22", "description": "British number ones Andy Murray and Johanna Konta continue their Wimbledon campaigns on Wednesday.", "filename": "sport_tennis_40495443_1747667440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17EC5/production/_96798979_040390169.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40495443_1747667440.html", "title": "Wimbledon 2017: Andy Murray & Johanna Konta face tough tests in round two", "title_page": "Wimbledon 2017: Andy Murray & Johanna Konta face tough tests in round two - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andy Murray is ready to face a barrage of serve-volleying when he takes on Germany's Dustin Brown in the second round of Wimbledon on Wednesday.\nThe defending champion plays world number 97 Brown in the second match on Centre Court at about 15:00 BST.\nFellow British number one Johanna Konta faces Donna Vekic of Croatia in the opening match on Centre Court at 13:00.\nRafael Nadal, Venus Williams, Heather Watson and Aljaz Bedene are also in action on day three.\nBritain's Watson faces Anastasija Sevastova of Latvia on court two at 11:30, while compatriot Bedene takes on Damir Dzumhur of Bosnia-Herzegovina on court three at about 13:00.\nTwo-time champion Nadal plays American Donald Young in the third and final match on Centre Court.\nJapan's ninth seed Kei Nishikori opens play on Court One against Ukraine's Sergiy Stakhovsky, before 10th seed and five-time winner Williams plays China's Qiang Wang, and second seed Simona Halep plays Brazil's Beatriz Haddad Maia.\nFrench Open champion Jelena Ostapenko, Petra Kvitova and Victoria Azarenka are also in action in a packed bottom half of the women's draw.\nMurray came through his opening match against the unorthodox Alexander Bublik in straight sets, and the Scot expects another unusual test from Brown.\nThe dreadlocked German upset Nadal at Wimbledon two years ago, thrilling the Centre Court crowd with his diving volleys and attacking style.\n\"I know Dustin pretty well,\" said Murray. \"We get on well with each other. We message each other from time to time. I like him. He's really, really a nice guy.\n\"But in terms of the match, I expect him to be very aggressive. I think he'll go for his shots. I think he'll come forward a lot. You know, he's unpredictable.\n\"You know he's going to go for it. Also you know he hits a lot of drop shots. He can play slice. Sometimes he hits two first serves, goes for a huge second serve.\n\"It's not easy to play players like that.\"\nMurray won their only previous meeting at the US Open seven years ago in straight sets.\nSixth seed Konta, 26, arrived at the All England Club as a serious title contender for the first time and impressed in her first-round win over the tricky Hsieh Su-Wei.\nThe Taiwanese player had beaten Konta at the French Open five weeks ago, and the Briton has another chance to make amends against Vekic, the world number 58 who beat her in the recent Nottingham final.\n\"That's another great opportunity for me to play against someone who the last time I played, played a very good match,\" said Konta.\n\"It's another opportunity for me to try and find a way to come out on top this time.\"\nIt is also a chance for Konta to reach the third round of Wimbledon for the first time, at the sixth time of asking.\n\"I play my career in a tennis season context, so I don't live my career for this week particular, this fortnight particular,\" she said.\n\"I live it for the whole season and try to really perform the best that I can in every event that I enter.\n\"That said, I definitely would like to be involved here for the full fortnight to help, I guess, put tennis on the map that much more.\"", "url": "https://www.bbc.com/sport/tennis/40495443"}