{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:31", "date_modify": "2025-04-26 06:47:31", "date_publish": "2025-03-01 00:00:00", "description": "Watch live coverage from the Kingspan Stadium as Ulster host Scarlets in the United Rugby Championship", "filename": "sport_rugby-union_live_cd92q3288k7t_1745650051.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_live_cd92q3288k7t_1745650051.html", "title": "'Very important result' - reaction as Ulster beat Scarlets in URC thriller", "title_page": "'Very important result' - reaction as Ulster beat Scarlets in URC thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodnight!\nFT: Ulster 30-28 Scarlets\nThanks for joining us for what turned out to be a thoroughly enjoyable and dramatic evening of United Rugby Championship action.\nUlster needed a result after a poor run and they got it. They made it hard for themselves and were made to work by the Scarlets, but Alan O'Connor's late try sealed a vital victory for the Irish province.\nWith the Six Nations once again taking centre stage over the next couple of weeks, Ulster are next in action on 22 March when they travel to strugglers Dragons, while Scarlets host Stormers.\n'Very important result'\nFT: Ulster 30-28 Scarlets\nUlster back row Nick Timoney speaking to BBC Two NI:\n\"They came out red-hot and caught us with a few things. We were happy with how we battled back but they got another breakaway try which stunted our momentum.\n\"We were pleased with the resilience we showed to come back at the end. It's a very important result.\n\"It's massive. It keeps our season alive. We've given the fans very little to cheer about recently so we're unbelievably thankful for the support. We need to get a bit of momentum going but we think we can build from here.\"\n'It took a lot of heart and effort'\nFT: Ulster 30-28 Scarlets\nUlster captain Alan O'Connor, speaking to BBC Two NI:\n\"It'll hopefully kick-start us. We've been doing a lot of good stuff but too much bad stuff. Tonight we showed that, a lot of good stuff but maybe conceded an easy try.\n\"It took a lot of heart and effort to get back into the game, especially being 12 points down. There's definitely a lot of good qualities in this team, we just need to see it more often.\"\n'We needed that to salvage our season'\nFT: Ulster 30-28 Scarlets\nPlayer of the match James McNabney, speaking on BBC Two NI:\n\"It was very tough out there, they pushed us until the end. We needed that win to salvage our season and we got it. It wasn't pretty but we got it. We dug deep, I'm proud of the lads, we really ground it out.\n\"We're taking it one game at a time. We're not in a good place at the moment so we just need to build week on week, take it as it comes and see how we get on. We're not finished yet.\"\nUlster score late try to defeat Scarlets in Belfast\nFT: Ulster 30-28 Scarlets\nUlster with a dramatic late victory in Belfast.\nA late try from Alan O'Connor allows Ulster to edge out the Scarlets in the last few minutes.\nA back-and-forth first half saw the visitors go in with a narrow first half lead.\nHowever, second-half tries from Callum Reid and Alan O'Connor helped seal an important win for Ulster in Belfast.\nWhat a game of rugby!\n'Big win for Ulster'\nFT: Ulster 30-28 Scarlets\nTommy Bowe\nFormer Ireland & Ulster wing on BBC Two NI\nUlster got the job done, you can see how much it means to the player and to the fans. It's a big win for Ulster. Scarlets put it up to them but getting the job done was all that was needed.\nConverted try: Ulster 30-28 Scarlets\nAlan O'Connor (try); Nathan Doak (conv)\nUlster score!\nIt's Alan O'Connor who made the breakthrough after repeated attempts to batter their way over the line.\nWhat a time to score!\nDoak adds the conversion to put his side ahead.\nJust time for a restart!\nPost\nUlster 23-28 Scarlets\nUlster have another chance now as they surge forward and into the Scarlets' 22.\nIt looks promising for Ulster.\nThey are keeping it tight and applying a lot of pressure to the visitors.\nUlster battering the line but can they make it over the try-line?\nTry: Ulster 23-25 Scarlets\nVaea Fifita (try); Ioan Lloyd (conv)\nScarlets take the lead with a breakaway try against the run of play!\nUlster's attack is intercepted and the ball is supplied to Vaea Fifita who sprints over from distance to give the visitors the lead.\nFrustrating for Ulster, but a well-taken opportunistic try from the Welsh side.\nIoan Lloyd adds the extras.", "url": "https://www.bbc.co.uk/sport/rugby-union/live/cd92q3288k7t"}