{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:17", "date_modify": "2025-04-26 06:47:17", "date_publish": "2025-03-01 12:21:57", "description": "Crystal Palace Women appoint Leif Smerud - the former caretaker head coach of the Norway men's and women's teams - as their new manager.", "filename": "sport_football_articles_cjevwkqj34go_1745650037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bbf/live/54cfb340-f696-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cjevwkqj34go_1745650037.html", "title": "Crystal Palace Women: Norwegian Leif Smerud appointed as manager", "title_page": "Crystal Palace Women: Norwegian Leif Smerud appointed as manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace have appointed experienced Norwegian coach Leif Smerud as their new manager, a day after sacking Laura Kaminski.\nSmerud, 48, takes over an Eagles side that is bottom of the Women's Super League, four points from safety with eight games of the season remaining.\nHe guided the Norway men's Under-21s team to the 2023 European Championship finals in his last role and has also worked as caretaker head coach of both the Norway men's and women's teams.\n\"I'm really honoured, I'm proud and I'm very happy to join Crystal Palace, a club with a long history in football,\" said Smerud, whose first match in charge will be at home to Liverpool on Sunday.\n\"I've been lucky enough for 10 years to talk to players about the privilege of representing their country. I believe football is about more than tactics - it's about a connection with some values, and I really think that Crystal Palace has values that I connect with.\"\nKaminski guided Palace to the Women's Championship title last season, securing their promotion to the WSL, but she was sacked from the role on Friday after leading them to just one win in 14 games.\nSmerud faces a huge task to keep the Eagles in the top flight, but believes the club has a track record of proving their doubters wrong.\n\"It's a club that's no stranger to hard work and punching above its weight,\" he added.\n\"It's an honour to connect with a club like that, and the people I've met in the process are also brilliant people. I really look forward to representing the club and all that it stands for.\"\nGrace Williams, head of women's football at Crystal Palace, believes Smerud's \"experience and credentials speak for themselves\".\n\"As we head into a crucial stretch of games at the end of our Women's Super League season, we feel he will be an outstanding fit for maximising the undoubted potential of this group of players,\" she said.\nSunday's opponents Liverpool also sacked their manager this week, with Matt Beard leaving the club in seventh place in the WSL following just four wins from their 14 matches this season.", "url": "https://www.bbc.co.uk/sport/football/articles/cjevwkqj34go"}