{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:16:21", "date_modify": "2025-05-21 05:16:21", "date_publish": "2025-04-04 00:00:00", "description": "Listen to live BBC Radio commentaries as Northampton Saints face ASM Clermont Auvergne in the European Champions Cup and Pau take on Bath Rugby in the Challenge Cup.", "filename": "sport_rugby-union_live_ce8mlz38yp2t_1747804581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df32/live/b13c8500-1198-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_ce8mlz38yp2t_1747804581.html", "title": "European Champions Cup LIVE: Northampton 46-24 Clermont", "title_page": "European Champions Cup LIVE: Northampton 46-24 Clermont - scorers and reaction as Saints reach quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saints march on into Champions Cup quarter-finals\nNorthampton and Clermont have set a very high bar with the Saints' England stars to the fore in a pulsating last-16 encounter.\nHere's Mantej Mann's match report from Franklin's Gardens and you can scroll through this live page to relive the home side's seven tries as they fought back from 10-0 down early on.\nThere's lots more European rugby for you this weekend, here on the live text and on radio, so please join us again on Saturday.\n'You can see the next iteration of Courtney Lawes and Lewis Ludlam coming through'\nNorthampton 46-24 Clermont\nPaul Grayson\nFormer Northampton and England fly-half on BBC Radio 5 Sports Extra\nNorthampton's guile, skill and attacking craft kept Clermont at arm's length in the second half.\nSome superb performances - obviously Freeman, but Odendall is back, Fin Smith was influential, Coles and Augustus in the pack stood out and Pollock showed flashes of what he can do.\nShout-out to Tom Lockett too for a cracker of a hit on Fritz Lee when he came off the bench.\nYou can see the next iteration of Courtney Lawes and Lewis Ludlam coming through and experiences like this against one of France's giants will serve them well.\nConverted try - Northampton 46-24 Clermont\nHenry Pollock (con: Fin Smith)\nThe man of the moment has his moment - latching on to a deft little kick from Fin Smith to dive over just ahead of Tommy Freeman. Then there's the trademark booting the ball into the stands celebration - lovely stuff.\nSmith bags the kick to put Saints a try from reaching a half-century.\nPost\nNorthampton 39-24 Clermont\nOh dear - Fritz Lee looks to be seriously injured.\nThere was a horrible noise as he went to the floor, and a stretcher is on very quickly. This could be a serious leg injury, and this could be the final act for the veteran in a Clermont shirt.\nPost\nNorthampton 34-24 Clermont\nMantej Mann\nBBC Sport at Franklin's Gardens\nSaints started the second half as they end the first as Juarno Augustus doubled his tally after George Hendy's fine solo break.\nIt looked as if that might be that but Clermont have salvaged some pride with their last two tries and now only trail by 10 with over 20 minutes still to play.\nI wouldn't say the home fans are panicking just yet but they might just be shuffling around on their seats a bit more.", "url": "https://www.bbc.com/sport/rugby-union/live/ce8mlz38yp2t"}