{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 04:46:23", "date_modify": "2025-05-21 04:46:23", "date_publish": "2025-04-05 06:01:24", "description": "\"I see the highlight videos, but I'm never satisfied\", says Crystal Palace midfielder Adam Wharton about his recent good form.", "filename": "sport_football_articles_c77njvzynx1o_1747802783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3f5/live/638dc850-11e3-11f0-9dca-cd8d25d07abd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c77njvzynx1o_1747802783.html", "title": "Adam Wharton: Crystal Palace midfielder on social media highlight videos", "title_page": "Adam Wharton: Crystal Palace midfielder on social media highlight videos - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace's current run of form was a distant dream at the beginning of the season.\nThe Eagles have lost just two of their past 16 games and had a five-game winning run end with a 1-1 Premier League draw at Southampton on Wednesday, while they are also in the FA Cup semi-finals.\nBefore that match at St Mary's Stadium, 12th-placed Palace had won six consecutive away games without conceding a goal.\nHead coach Oliver Glasner put the poor run of form at the start of the season down to several reasons, including key players being involved in major tournaments, late signings and the loss of Michael Olise to Bayern Munich in the summer.\nAnother factor in that slow start may have been the fitness of midfielder Adam Wharton.\nThe 21-year-old signed for the Eagles in February 2024 and hit the ground running, playing a crucial part as Palace won six of their final seven games in the Premier League and securing a place in the England squad for Euro 2024.\nHowever, Wharton was managing a groin issue at the beginning of this season which then required surgery, keeping him out for two months and missing 14 Premier League games.\n\"I'm still not where I want to be fitness-wise. I haven't played a full 90 minutes since I have been back,\" Wharton told BBC Sport.\n\"I'm getting there each game but feeling better within myself and feeling like I can move more freely.\"\nWharton says that although results at the beginning of the season did not go Palace's way, he always believed the Eagles would improve.\n\"We knew that if we kept at it the results would start turning,\" he says. \"We thought the confidence would then get better and better.\n\"We have the togetherness as a group. We know that if we play how we can play then we can beat any team.\"\nSince his return Wharton has produced a number of eye-catching performances and it is common to see edits of his best moments - such as a pirouette against Fulham - on social media. His friends enjoy sending him highlight reels, too.\n\"You can't get too ahead of yourself with them,\" he adds. \"It's easy to take from a 90-minute game two minutes of good things or two minutes of bad things.\n\"You just have to keep level-headed and go into every game as though nothing has happened and it's a fresh start.\n\"I've never really come out of a game thinking '[I'm] satisfied with my performance'. I've not had a perfect performance, I probably never will.\n\"Sometimes you might think 'I've done pretty well', but then I always think 'I could have done this better, I could have done that'.\n\"I will watch them and it's usually just the good clips so it's pretty good to watch. I always know that there's somewhere I have not done the right thing.\"\nWhen Wharton was selected for England's Euro 2024 squad, manager Gareth Southgate said the midfielder was the type of player the Three Lions had missed \"for seven or eight years\", and praised his forward-thinking game.\n\"[It's] just the way I play football,\" says Wharton. \"When I was younger I used to play as more of a 10 - more of an attacking midfielder - so I probably know how you play that position.\n\"But if I have got the ball and the striker is an option then I'm going to pass to him as he's the one that scores the goals.\n\"If I can pass it forward to a player that can be effective, score goals, create chances, get assists then I don't see why I shouldn't pass it to them.\n\"I'm not going to dribble through five people and put it in the top corner, that's just not my game.\"\nThe former Blackburn Rovers player was in the England Under-21s squad for the recent international break, but trained with the senior squad under new England manager Thomas Tuchel, who has been a frequent visitor at Selhurst Park to watch Palace.\n\"It is obviously good to be involved with the senior team. It's good to try and leave an impression and train with the best players in the world,\" says Wharton.\n\"He [Tuchel] was speaking to me more in general, just about how it has been coming back from injury and things like this. It was good to be there but now I'm just focusing on playing more games and helping the team.\"", "url": "https://www.bbc.com/sport/football/articles/c77njvzynx1o"}