{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 07:50:09", "date_modify": "2025-05-21 07:50:09", "date_publish": "2025-03-28 06:22:43", "description": "The sad story of much-loved Wigan fan Darren Orme shows the concept of clubs as an extended family still exists, says chief football writer Phil McNulty.", "filename": "sport_football_articles_c241e8gvz9eo_1747813809.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bf7d/live/bd7bf0c0-0aff-11f0-93c7-431cc016c489.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c241e8gvz9eo_1747813809.html", "title": "Darren Orme: Tragic story of Wigan fan shows concept of football family still exists", "title_page": "Darren Orme: Tragic story of Wigan fan shows concept of football family still exists - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Darren Orme was a familiar figure cycling through the streets to work, the supporter known as 'Mr Wigan Athletic' because of a devotion to his beloved Latics stretching back more than 40 years.\nHe was nearly always first on the supporters' coach travelling to away games, happy to wait in the early hours for the ticket office to open for big occasions such as the club's greatest day - the 2013 FA Cup final win over Manchester City at Wembley.\nWhen he was reported missing on 5 March, supporters, the town and its respective football and rugby league clubs rallied in the search for the 54-year-old amid a huge public response.\nSadly, his body was discovered a fortnight later in the shadow of the Brick Community Stadium where he always took his seat in the East Stand.\nIt is a story both heartbreaking and heartwarming, as it enabled the people of Wigan to prove that the powerful concept of football as an extension of family still exists.\nThe life of this much-loved supporter will be commemorated and celebrated at Wigan Athletic's home game against Barnsley on Saturday (15:00 GMT), when a minute's applause will be held, while a shirt emblazoned with 'Darren 1 Of Our Own' and a scarf will be placed on his seat.\nSince the news of Darren's death a carpet of flowers has grown around the stadium's statue of former Wigan chairman and owner Dave Whelan, while a book of condolence has been opened.\nAmid the sadness, the response from Wigan supporters, and the town as a whole, has shone a light on the pivotal role a football club can play in its community - and how regarding your club as an extension of family is not an emotional exaggeration.\nMick Wimsey, chairman of the club's Travel and Supporters Club, organised a search for Darren in the days following his disappearance, also driving around in the early hours while taking time off work in an attempt to find the friend who had followed Wigan Athletic with him for more than four decades.\n\"We live in a bad world,\" he told BBC Sport. \"But the amount of goodness that's come out of this is amazing. When there was no word on Darren after a few days, we organised a search on the Sunday after he went missing.\n\"I was only expecting a few people to turn up but we had more than 100. All those people searched for Darren from 10am to 4.30pm - then some went back out afterwards after they had a break.\n\"On that Sunday morning, there were people who don't even watch football, but had seen him going to work on his bike and felt compelled to come and look for him. It was heartbreaking, but there was good in it as well.\"\nHe added: \"Football clubs are like your family. He was part of our family at Latics. Once you saw him you'd never forget him. His smile was infectious. If you could bottle what Darren had, Armani would make millions out of it.\n\"Sometimes you saw more of him than you did members of your own family. He was one of my best friends. I've been watching Wigan for 46 seasons and running the supporters' club for 44. I've known Darren for so long. I met him at a game against Walsall when we were both kids about 14 years of age.\n\"I was asked to write a tribute to him in the local paper. It just poured out of me and I found myself with tears streaming down my face. Everyone loved Darren - although he was definitely the worst raffle-ticket seller I ever knew.\"\nThe official Wigan Athletic Supporters Club paid an emotional tribute to \"a recognisable and loved character\" who \"lived and breathed blue and white\". It will pay posthumous tribute with a fan of the month award - a framed certificate passed to Darren's family before Saturday's game.\nIt added: \"He had numerous nominations for our fan of the month, including 'for being the loudest singer in any stadium' and for bringing back programmes from away matches for fans who couldn't attend themselves. Darren was kind-hearted and caring.\"\nWhen he was reported missing, posters were placed in shop windows around Wigan, while new manager Ryan Lowe made a public appeal. There was also a banner on display at Wigan's training headquarters.\nJamie Allen, head of media marketing and communications at Wigan, said: \"Latics has had its issues on and off the pitch over the last few years. It's been a rollercoaster ride at Wigan Athletic, but this showed what this club and town has at its heart.\n\"This was not the outcome anyone wanted and is devastating, but it united a town and a sporting family across two clubs - Wigan Athletic and Wigan Warriors. The community and clubs come together in times of need and, like families, this is what happened here.\n\"This is a very sad outcome but there is a heartwarming side to this in what it says about our town and the people in it, and how much a football club and its supporters - and of course the rugby league club - can mean.\"\nSaturday will be an emotional day in Wigan when they face Barnsley, but Wimsey says: \"Football supporters are a community regardless of who you support. Bolton Wanderers fans, our big rivals, were sending love and their thoughts.\n\"It will change next Tuesday when we play each other, but for this period of time we were all like one big family. This is what football is - it is grassroots, working class and the word 'family' is right.\"\nWigan, of course, are not the first club or community to have proved amid tragedy that football has a life and impact stretching beyond 90 minutes.\nWhen six-year-old Bradley Lowery died after a long illness - he was only 18 months when diagnosed with neuroblastoma, a rare type of cancer - he had become known to the whole football community.\nThe Sunderland fan became \"best mates\" with his hero, striker Jermain Defoe, as well as gaining worldwide recognition following an appeal in which he received 250,000 Christmas cards from around the globe.\nHe met then England manager Gareth Southgate and former striker Gary Lineker at BBC Sports Personality of the Year, and won Match of the Day's goal of the month award after he took a penalty before a Sunderland game against Chelsea.\nMeanwhile, earlier this month, Rangers captain James Tavernier, goalkeeper Jack Butland and former Scotland international Robert Snodgrass all contributed to a fundraiser for a fan killed in Turkey after being hit by two cars while crossing a road in Istanbul before the Glasgow side's Europa League match with Fenerbahce.\nOxford United are another club touched by tragedy, when former winger Joey Beauchamp, regarded by many as their greatest player, took his own life aged 50 in February 2022.\nHis younger brother Luke has set up a foundation in his name to help those battling mental health and depression to support their families.\nPaul Peros, chairman of OXVOX, the Independent Supporters Trust for Oxford United, said: \"Fundamentally, as much as everyone wants wins and promotions, we want to feel connected to the club we love, along with the fans who share the experience.\n\"In a slightly different way, when Joey passed away it did feel almost like a member of a family, because in a broader sense football is absolutely a family, especially at your own club.\n\"You spend as much time with those you regularly go to the match with as you do a lot of your family. You build those bonds. The story of the Wigan supporter is so sad but has also shown how football does go beyond the pitch and into the community.\n\"There are people that you may not know, but have just seen around at away games or whatever. You have shared experiences, like members of a family. The minute you sit down, they will bring up things like the non-league days, the experiences, good and bad.\n\"There have been a couple of instances where we have spoken directly to people we are aware of that may be struggling in some way, but it is more a case of us helping to facilitate things like the Joey Beauchamp Foundation, who are doing great work, and the club taking it on.\"", "url": "https://www.bbc.com/sport/football/articles/c241e8gvz9eo"}