{"authors": ["www.facebook.com"], "date_download": "2025-05-21 07:59:03", "date_modify": "2025-05-21 07:59:03", "date_publish": "2025-05-21 00:00:00", "description": "Follow live text updates and listen to BBC Radio 5 Live commentary as Tottenham Hotspur take on Manchester United in the UEFA Europa League Final.", "filename": "sport_football_live_cz9yney9391t_1747814343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a96/live/1b09e6b0-3568-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cz9yney9391t_1747814343.html", "title": "Europa League Final LIVE: Tottenham Hotspur vs Manchester United", "title_page": "Europa League Final LIVE: Tottenham Hotspur vs Manchester United - live text, score updates & radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 2024-25 UEFA Europa League final will be the sixth all-English major European competition final, and the third of those to involve Tottenham Hotspur, after the 1971-72 UEFA Cup final (won 3-2 on aggregate v Wolves) and the 2018-19 UEFA Champions League final (lost 0-2 to Liverpool).\nThis will be the fourth UEFA Europa League final to be contested between two sides from the same nation, after 2011 (Porto 1-0 Sporting Braga), 2012 (Atlético Madrid 3-0 Athletic Club), and 2019 (Chelsea 4-1 Arsenal).\nTottenham Hotspur and Manchester United’s only previous meeting in major European competition came in the 1963-64 Cup Winners’ Cup last 16, with the Red Devils progressing 4-3 on aggregate over two legs under Matt Busby.\nTottenham Hotspur have won all three of their meetings with Manchester United in all competitions so far this season, twice in the Premier League (3-0 away, 1-0 home) and once in the League Cup (4-3 at home). The only opponent Spurs have ever won four games against in a single campaign were Manchester City in 1992-93, while the only side to beat the Red Devils four times in a single season were Everton in 1985-86.\nManchester United are winless in their last six meetings with Tottenham Hotspur in all competitions (D2 L4), losing their last three in a row. The Red Devils have never gone seven without a win against Spurs before, and have also never lost four successive matches against them.\nManchester United remain the only unbeaten side in major European competition this season, winning nine and drawing five of their 14 UEFA Europa League games. They are looking to become only the fourth side to win the Europa League without losing a single match that campaign, after Chelsea in 2018-19, Villarreal in 2020-21, and Eintracht Frankfurt in 2021-22.\nTottenham Hotspur are looking to win their first major trophy since the 2007-08 League Cup under Juande Ramos, 17 years and 86 days prior to this UEFA Europa League final. Spurs’ last major European title was the 1983-84 UEFA Cup under Keith Burkinshaw, 40 years and 363 days ago.\nThis will be Manchester United’s ninth major European final, with only Liverpool (15) reaching more among English clubs. The Red Devils have failed to win three of their last four such finals – Barcelona in the 2008-09 and 2010-11 UEFA Champions Leagues, and Villarreal in the 2020-21 UEFA Europa League – winning the other 2-0 against Ajax in the 2016-17 Europa League.\nTottenham Hotspur have won the UEFA Cup/Europa League twice previously (1972, 1984), while victory here would see them become the second English club to win it three times, along with Liverpool. The only side to win the competition on more than three occasions are Sevilla (7).\nTottenham Hotspur have won nine of their 14 matches in this season’s UEFA Europa League (D3 L2), their most ever wins in a single campaign in major European competition, overtaking their eight in 1971-72, 1973-74, and 2006-07 (all UEFA Cup).\nManchester United have scored 35 goals in this season’s UEFA Europa League; the only sides ever to score more in a single UEFA Cup/Europa League campaign are Borussia Mönchengladbach in 1972-73 (36), Porto in 2010-11 (37), and Chelsea in 2018-19 (36).\nOnly Athletic Club (30) have had more shots following high turnovers than both Manchester United (23) and Tottenham Hotspur (22) in this season’s UEFA Europa League. Meanwhile, the Red Devils are also joint-top of the 2024-25 competition for direct attacks (32, level with Lyon).\nRuben Amorim is looking to become only the third manager to win a major trophy in his first season in charge of Manchester United, after José Mourinho in 2016-17 (League Cup & UEFA Europa League) and Erik ten Hag in 2022-23 (League Cup). Amorim also could become only the third manager to win a major European title with an English club while aged 40 or younger, after Howard Kendall (1984-85 Cup Winners’ Cup with Everton, 38) and Gianluca Vialli (1997-98 Cup Winners’ Cup with Chelsea, 33).\nTottenham’s Ange Postecoglou is the first Australian manager ever to lead a side to a major European final. It’s the first time a manager from a particular nation has taken charge of a major European final for the first time since Norwegian Ole Gunnar Solskjær lost the 2021 UEFA Europa League final on penalties to Villarreal with Manchester United.\nOnly Rayan Cherki (12) has been directly involved in more UEFA Europa League goals this season than Manchester United’s Bruno Fernandes (11 – 7 goals, 4 assists). Indeed, the only player to be involved in more for an English club in a single campaign in the competition was Olivier Giroud for Chelsea in 2018-19 (15 – 11 goals, 4 assists).\nTottenham Hotspur forward Dominic Solanke has scored in each of his last four appearances against Manchester United in all competitions (5 goals). Since Alex Ferguson left the Red Devils in 2013, only one player has scored in 5+ consecutive appearances against them, with Mo Salah doing so in six in a row from January 2021 to March 2023.\nManchester United’s Bruno Fernandes (7 goals, 4 assists), and Tottenham Hotspur’s Dominic Solanke (5 goals, 4 assists) each require one assist to record both 5+ goals and 5+ assists in this season’s UEFA Europa League, a feat only two players have achieved previously: Kevin De Bruyne in 2014-15 (5 goals, 5 assists), and Giuliano in 2016-17 (8 goals, 6 assists).", "url": "https://www.bbc.com/sport/football/live/cz9yney9391t"}