{"authors": ["Sam Davis", "www.facebook.com"], "date_download": "2025-05-21 05:45:43", "date_modify": "2025-05-21 05:45:43", "date_publish": "2025-01-14 12:31:41", "description": "Bournemouth news: Opinion - Time to shoot for FA Cup glory?", "filename": "sport_football_articles_cx24n41zgw0o_1747806343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc65/live/63c552c0-b627-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx24n41zgw0o_1747806343.html", "title": "Opinion - Time to shoot for FA Cup glory? - BBC Sport", "title_page": "Bournemouth news: Opinion - Time to shoot for FA Cup glory? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The furthest Bournemouth have reached in the FA Cup has been the quarter-finals in the 2020-2021 season. However it was a run that Cherries fans never got to experience given it was during the Covid campaign.\nOther than that, there have been numerous times that we have graced the last 16, so after the weekend win, fans are now pondering whether Andoni Iraola's charges might look to go further than ever before.\nA comprehensive 5-1 win over West Brom set Bournemouth up for a fourth-round trip to Everton, a side they have already done the double over this season. Easily dispatching Championship opponents in the third round may not seem that significant to most, but in the past three seasons the Cherries have gone out to lower league sides, so a swing in fortunes is certainly a good place to start this time around.\nDespite something of an injury crisis, the club are sat comfortably in the top half of the Premier League table and, although Europe may be a dream for many fans, it still feels incredibly unlikely. So that being said, could a cup run be on the agenda?\nThe club are in a rare place of being all but mathematically safe in terms of relegation, so therefore it may be the first time in a while that Bournemouth can have a proper crack at some cup glory.\nIt will be a big ask, but with Premier League rivals Arsenal, Brentford and West Ham already exiting the competition, it may genuinely be an aim for which the club could strive.\nWe know the draw has to be kind, but ultimately, defying the odds is what Bournemouth do - so could we?", "url": "https://www.bbc.com/sport/football/articles/cx24n41zgw0o"}