{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:23:22", "date_modify": "2025-05-20 13:23:22", "date_publish": "2023-08-02 10:38:00", "description": "Carlisle United are fined £7,500 for racist chants at the game against Bradford on 26 December.", "filename": "sport_football_66382909_1747747402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13C23/production/_130613908_gettyimages-1384542924.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66382909_1747747402.html", "title": "Carlisle United fined £7,500 after racist chanting against Bradford City", "title_page": "Carlisle United fined £7,500 after racist chanting against Bradford City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlisle United have been fined £7,500 after they were charged with racist chanting by supporters during the League Two match against Bradford at Brunton Park on 26 December.\nThe Cumbrians admitted to the breach of Football Association rule E21, around discriminatory behaviour.\nIn response, the club has warned fans that further incidents will lead to further punishments.\n\"It brings shame on the club,\" chief executive Nigel Clibbens said.\n\"There must be no repeat. We have worked to improve spectator behaviour, including with supporter groups, but this has proved to fall short of what is required.\n\"We will introduce an action plan in accordance with the FA Regulatory Commission sanction.\n\"The club will develop initiatives to make it a more inclusive environment and will be more proactive in the prevention and detection of any potential discriminatory or disorderly behaviour going forward.\"\nThis was Carlisle's first breach of the rule, and therefore no action plan had previously been imposed.\nIn the written reasons, the independent regulatory commission found it took three separate incidences of chanting for security and safety staff supported by the police to act, and that \"significant defects in the approach\" - particularly around the use of CCTV facilities - meant no culprits were identified.\nIt also highlighted \"substantial deficiencies\" within the pre-match planning for the fixture in terms of \"properly and reliably\" identifying risk factors and briefings to security and safety staff.\nThey also note that while Carlisle did deploy security and safety staff and police spotters with covert cameras which brought the chanting to an end, and the club did have a text message service in place for supporters to report incidents, that the latter could have been better \"widely promoted\".\nCarlisle, it is stated, had made proactive steps in relation to discriminatory conduct and that codes of conduct were available on social media and the club website.\nAs part of the action plan, Carlisle must work with the FA around anti-discriminatory projects such as Kick It Out and Her Game Too, as well as developing proactive \"prevention, deterrent and detection initiatives\" around anti-discrimination.\nThey must also appoint a Supporter Liaison Officer to attend every away fixture and liaise with home stewarding, and Carlisle supporters.", "url": "https://www.bbc.com/sport/football/66382909"}