{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:44:08", "date_modify": "2025-05-21 04:44:08", "date_publish": "2025-04-03 06:42:36", "description": "Scottish gossip: Kochorashvili, Hatate, Taylor, Miller, Doak, Lawrence", "filename": "sport_football_articles_c807ld0zy49o_1747802648.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c751/live/722f5ed0-105f-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c807ld0zy49o_1747802648.html", "title": "Scottish gossip: Kochorashvili, Hatate, Taylor, Miller, Doak, Lawrence", "title_page": "Scottish gossip: Kochorashvili, Hatate, Taylor, Miller, Doak, Lawrence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic were thwarted after making a last-gasp bid at the weekend to sign Georgia midfielder Giorgi Kochorashvili for next season, according to reports in Spain, but the 25-year-old, currently in La Liga's second tier with Levante, completed a £5m transfer to Sporting Lisbon. (The National), external\nCeltic are likely to sell Japan midfielder Reo Hatate this summer while making another attempt to sign £4m-rated Motherwell 18-year-old Lennon Miller. (Daily Record), external\nCeltic have renewed their interest in £5m winger Michel-Ange Balikwisha, whose chance of a move to the Scottish champions in January was ended by injury, with scouts watching Royal Antwerp's 5-1 defeat by Union Saint-Gilloise on Saturday. (Scottish Sun), external\nDinamo Zagreb remain confident of landing Greg Taylor at the end of his Celtic contract this summer after offering the 27-year-old a significant increase on his current deal, but the Scotland left-back also has options in Major League Soccer and they have not been dismissed yet for family reasons. (Daily Record), external\nEverton could land 19-year-old Scotland winger Ben Doak if they offer a fee of £30m this summer to city rivals Liverpool. (Football Insider), external\nNumerous clubs in the UK, including Wrexham, and abroad are keeping a check on Tom Lawrence's situation as the 31-year-old Wales midfielder approaches the end of his Rangers contract but with the Ibrox club having the option to extend his stay by a year. (Daily Mail), external\nMillwall had a representative watching Kevin Nisbet continue his impressive goalscoring heroics on loan to Aberdeen last weekend amid speculation around the in-form striker's future with the London club. (The Herald), external\nNorth Texas SC, MLS club FC Dallas' development team, have an option to make St Johnstone midfielder Aaron Essel's loan permanent at the end of their season in December, but the Scottish Premiership club have the right to recall the 19-year-old. (The Courier), external\nHeart of Midlothian are looking at options to sign a new right-back when the summer transfer window opens and will work with sports recruitment firm Jamestown Analytics to identify possible targets. (Edinburgh Evening News), external\nHearts chief executive Andrew McKinlay says the Scottish Premiership club are well down the line with summer transfer targets despite Brighton & Hove Albion majority owner and chairman Tony Bloom's proposed £10m investment yet to be finalised. (Hearts Standard), external\nHibernian head coach David Gray would be open to Bournemouth goalkeeper Alex Paulsen, the 22-year-old currently on loan to Auckland, joining on loan next season as part of the Black Knight FC network. (Scottish Sun), external\nHibs head coach David Gray has targeted a new goalkeeper as a position he would like to strengthen this summer. (Edinburgh Evening News), external\nAberdeen's proven track record of propelling players into the top leagues in Europe can be a valuable bargaining tool in securing summer signing targets for manager Jimmy Thelin and head of recruitment Nuno de Almeida. (Press & Journal), external\nDespite making a good start to his second spell as Everton manager, David Moyes has refused to visit the new Bramley-Moore Dock stadium until his side have mathematically avoided relegation as the Scot does not expect to stay in charge if they drop to the Championship. (Football Insider), external\nQueen's Park fear major financial backer Lord Willie Haughey is set to walk away from the Scottish Championship club as he has grown increasingly frustrated by the bureaucracy at the top at Lesser Hampden preventing them moving forward in the way he wants. (Daily Record), external\nPlans to push for a return to a 10-team Scottish Premiership might already be dead in the water after it emerged the clubs behind new reconstruction proposals - all from the Championship - want the top flight to be made bigger. (Daily Record), external\nNo plans have been put in place ahead of expected celebrations at the end of this year's football season despite a \"productive discussion\" last week after MSP Kaukab Stewart brought together community councils for Merchant City, Trongate and Calton and representatives for Celtic, Rangers, the Scottish Professional Football League, Police Scotland and Glasgow City Council in a bid to avoid the 'disruption' seen in previous years. (The Herald), external", "url": "https://www.bbc.com/sport/football/articles/c807ld0zy49o"}