{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:42", "date_modify": "2025-05-21 05:52:42", "date_publish": "2025-04-02 08:56:03", "description": "Hearts: Neil Critchley says Yan Dhanda and Alan Forrest still have role - gossip", "filename": "sport_articles_cp91zzp4x05o_1747806762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6c0/live/417b0290-0fa0-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp91zzp4x05o_1747806762.html", "title": "Hearts: Neil Critchley says Yan Dhanda and Alan Forrest still have role", "title_page": "Hearts: Neil Critchley says Yan Dhanda and Alan Forrest still have role - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Convinced he was Spurs-bound' - How Fernandes became Man Utd's heart\nWhat is still to be decided as season reaches climax?\nLeague reconstruction - why, when & what might it look like?\nCommonwealth Games: Why is it so special to be part of Team Scotland?\nFrom titles to tinpottery - rank Scotland's top 10 clubs\nF1 Q&A: Did McLaren miss a trick in Norris v Piastri battle?\nWait goes on as Salah bids to break Premier League records\nWhy Swiatek's reign as 'Queen of Clay' is under threat\n'They now sing England's number one' - Henderson's rise against the odds\nBaltimore scores twice as Chelsea beat Man Utd to secure treble. VideoBaltimore scores twice as Chelsea beat Man Utd to secure treble\n'The old place will live on - but this was end of an era for Goodison Park'\n'It can't all come from the manager' - Keown on how Arsenal can become winners\nA tale of nine points & the 99th minute - how Ajax blew title\n'This is the year of the underdog - and I love it!'\nPalace shock Man City to win first major trophy in their history. VideoPalace shock Man City to win first major trophy in their history\n'Just get rid of VAR!' - Rooney baffled by Henderson decision. Video'Just get rid of VAR!' - Rooney baffled by Henderson decision", "url": "https://www.bbc.com/sport/articles/cp91zzp4x05o"}