{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 05:19:53", "date_modify": "2025-05-21 05:19:53", "date_publish": "2025-04-03 21:05:55", "description": "Michael Vaughan believes it would be \"nonsense\" and \"selfish\" for England to make Ben Stokes a white-ball captain.", "filename": "sport_cricket_articles_c985d82nnejo_1747804793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/649c/live/78ca56d0-10ca-11f0-83b1-1fd3218c6da4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c985d82nnejo_1747804793.html", "title": "Ben Stokes would be taking on too much as England white-ball captain, says Michael Vaughan", "title_page": "Ben Stokes would be taking on too much as England white-ball captain, says Michael Vaughan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Vaughan believes it would be \"nonsense\" and \"selfish\" for England to make Ben Stokes a white-ball captain.\nTest skipper Stokes is under consideration for at least one of the limited-overs roles after Jos Buttler stepped down in February.\nThe Telegraph has reported that Harry Brook is set to become T20 captain, leaving a choice between Brook and Stokes for the 50-over job. BBC Sport understands no final decisions have been made.\nStokes has a chequered injury history - he is currently recovering from hamstring surgery - and has not played white-ball cricket for England since 2023.\nAny return to the limited-overs format would be an increase in workload in a defining year for the 33-year-old's Test captaincy, with a home series against India followed by the Ashes in Australia.\nVaughan, himself a former England captain, said: \"It's absolute nonsense to think that Ben Stokes is going to play white-ball cricket.\n\"He gives absolutely everything, not just when he's playing for England but when he's training. He is all or nothing.\n\"In a way, I think it's quite selfish to even consider him, because he will say yes, because he is Ben Stokes. He will do whatever England ask him to do. Just don't ask him, just let him be.\"\nStokes has energised England's Test team since taking charge in 2022. In the aftermath of Buttler's resignation, England director of cricket Rob Key said it would be \"stupid\" not to consider Stokes for a white-ball job.\nShould Stokes take on one or both white-ball roles, it would also further align him with head coach Brendon McCullum, who added the limited-overs sides to his Test responsibilities at the beginning of this year.\nStokes is the best leader England have and his white-ball pedigree includes match-winning performances in the finals of the 2019 50-over World Cup and 2022 T20 World Cup.\nBut the coming months will shape his legacy as Test captain, and England's hopes of regaining the Ashes in Australia would be almost destroyed if they were to lose Stokes. Any further burden on his body would be a huge gamble.\n\"Let him get the Ashes urn in his hands,\" said Vaughan, who was speaking as part of Test Match Special's delivery of the Cowdrey Lecture at Lord's.\n\"It's not just about this India series or the Ashes series, I want to see him leading the home Ashes in 2027, I want him to get England to a World Test Championship final.\n\"Why put the burden on him to play white-ball cricket? It's not about putting pressure on him because he deals with pressure better than anybody, but just let him look after his body and get him playing Test cricket for as long as possible.\"\nThough Key has said England will consider all options, it is thought that Stokes and current white-ball vice-captain Brook remain the only two candidates.\nAlthough batter Brook captained England in five one-day internationals against Australia last year, giving further responsibility to the 26-year-old would also come with risk.\nHe is still establishing himself in England's white-ball sides and is also a key member of the Test team, so his workload would be a concern.\nFurthermore, he would have to demonstrate the maturity to be England captain. Occasionally prone to a clumsy comment in the media, Brook last year was criticised for saying \"who cares?\" when asked about some of England's dismissals in an ODI defeat by Australia.\nThe England captain is often required to discuss complex situations, just as Buttler did when addressing the controversy surrounding the fixture against Afghanistan at the Champions Trophy. England could face Afghanistan again at the T20 World Cup early next year.\nBut Vaughan said if England consider Brook to be ready to be T20 captain, then he is also ready for the 50-over job.\n\"Harry Brook will be the T20 captain, I think that's being announced soon and that's what we're expecting,\" said Vaughan.\n\"So the next T20 World Cup is in a year - if you're saying that Harry Brook is good enough to be the captain in that format with that tournament coming so soon, surely he's good enough to be 50-over captain for that World Cup in 2027?\"\nVaughan, England captain for the epic 2005 Ashes victory, was joined by fellow TMS regulars Jonathan Agnew, Phil Tufnell and Ebony Rainford-Brent for the Cowdrey Lecture.\nThe lecture, named after former England captain Colin Cowdrey, is delivered at Lord's each year.", "url": "https://www.bbc.com/sport/cricket/articles/c985d82nnejo"}