{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:55:33", "date_modify": "2025-05-20 13:55:33", "date_publish": "2023-07-31 11:20:37", "description": "Your Brighton views on Premier League Summer Series", "filename": "sport_articles_c0j44p9g3p8o_1747749333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd1a/live/de93a6e0-2f7d-11ee-999b-b74dedc428d3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c0j44p9g3p8o_1747749333.html", "title": "Your Brighton views on Premier League Summer Series", "title_page": "Your Brighton views on Premier League Summer Series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a victory and two defeats for Brighton in the Premier League Summer Series.\nWe asked what you made of their last performance against Newcastle and of the tour as a whole.\nHere are some of your thoughts:\nAnthony: We have seen a large, young squad tested in competitive matches. The results are important for confidence, however the overall performance was more important. The level of performance was amazing given the rotation by De Zerbi.\nMark: There's been some great experimenting with young players. We showed great belief in everything we did and it was good to put pressure on our defence. We were never full strength, but were always creative and a great watch. New signings look good but a little extra discipline needed by Van Hecke and Dahoud.\nRobin: The USA trip gave the whole squad game time and the Newcastle game ended basically with the under-21 side, so we cannot read into results too much. The key thing is what we don’t see, the fitness and team building for the upcoming season, which is potentially the most exciting in the club’s history\nJenny: The regulars played well for the most part but obviously De Zerbi wanted to try out new ones. Adingra is a find and played well. Joao Pedro showed promise but I think Mo Dahoud has to learn a bit more. Van Hecke was good, despite cards! Billy Gilmour played well in last game and Peupion looks promising, too. Delighted to see Tariq Lamptey back.\nSean: Excellent run out to have a look at everyone, some exciting looking players. It would be a real shame if Undav goes, he is starting to look really threatening and is finding the net regularly.\nHal: The bottom line is these games were an introduction for the multitude of new and young players. We could’ve won all three as we were the better team for vast quantities of the matches. I think we lost out through lapses in concentration from the new younger players, but that will teach them invaluable lessons and that’s what pre-season is for - learning.", "url": "https://www.bbc.com/sport/articles/c0j44p9g3p8o"}