{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:41:59", "date_modify": "2025-05-20 14:41:59", "date_publish": "2023-07-28 08:19:17", "description": "League Two Stockport County agree a season-long loan with Premier League side Aston Villa for England Under-19 striker Louie Barry.", "filename": "sport_football_66335142_1747752119.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51EF/production/_130557902_gettyimages-1296589265.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66335142_1747752119.html", "title": "Louie Barry: Stockport sign Aston Villa forward on season-long loan", "title_page": "Louie Barry: Stockport sign Aston Villa forward on season-long loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stockport County have signed England youth international Louie Barry from Aston Villa on a season-long loan.\nThe 20-year-old spent a decade in the academy at West Bromwich Albion before joining the Barcelona youth set-up in July 2019.\nSix months later he moved to Villa, where he scored on his senior debut in the 4-1 defeat by Liverpool in a FA Cup third-round tie in January 2021.\nBarry has also been on loan at Ipswich, Swindon, MK Dons and Salford.\nHe spent the second half of last term with the Ammies, scoring twice in 21 appearances, as the club reached the semi-finals of the League Two play-offs where they lost to Stockport on penalties.\nThe Hatters say they beat \"numerous\" other clubs to sign Barry, who signed a new contract at Villa Park before securing his loan move.\n\"We've had to be really patient, but that's been rewarded by Louie now being at the club,\" Stockport first team manager Dave Challinor said. , external\n\"He was our top target in his position, and for him and Aston Villa to choose us as his next destination is really pleasing.\"\nBarry is Stockport's second signing in the last 24 hours following the arrival of Aberdeen loanee Jayden Richardson.", "url": "https://www.bbc.com/sport/football/66335142"}