{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:29", "date_modify": "2025-04-26 06:47:29", "date_publish": "2025-03-01 00:00:00", "description": "Live audio, text and in-play clip coverage of Saturday's four games including the north Belfast derby between Crusaders and holders Cliftonville in the Irish Cup quarter-final.", "filename": "sport_football_live_c4gm9yy3733t_1745650049.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c4gm9yy3733t_1745650049.html", "title": "Ards, Reds and Swifts progress to Irish Cup semi-finals - as it happened", "title_page": "Ards, Reds and Swifts progress to Irish Cup semi-finals - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Final whistle\nThat is all from us after a drama-filled Irish Cup weekend.\nHolders Cliftonville's hopes of retaining the trophy continued as they beat rivals Crusaders.\nThey will now face Championship Ards in the semi-finals after they shocked Premiership outfit Loughgall.\nDungannon Swifts came from behind to beat Carrick Rangers and they will take on Championship Bangor in the other semi-final after they saw off Glentoran in impressive fashion on Friday night.\nIn the Irish Premiership, Coleraine eased to a routine win over Portadown.\nYou can read the report, watch highlights and find further reaction on the BBC Sport website.\nThanks for joining us - goodnight.\nReds face Ards and Bangor take on Swifts in Irish Cup semi-finals\nIn case you missed it, the Irish Cup semi-final draw was made earlier.\nHolders Cliftonville have been drawn to face Championship side Ards.\nChampionship side Bangor, who knocked out Glentoran on Friday night, will take on Dungannon Swifts in the other semi-final.\nThe games will be played on the weekend of the 27/28 March with venues and kick-off times still to be confirmed.\nCliftonville overcame north Belfast rivals Crusaders at Seaview to book their place in the last four of the competition for a second successive year.\nArds meanwhile saw off Premiership side Loughgall at Clandeboyne and are aiming to win the trophy for the first time since 1974.\nDungannon Swifts, who have never won the Irish Cup, came from behind to beat Carrick Rangers to book their place in the semi-finals.\nArds aim to 'give good account' in semi-final\nArds 2-0 Loughgall\nArds boss John Bailie has been speaking about his side's win over Loughgall:\n\"It's a great day for the club and to get through to the semi-final is a very proud moment for me personally and for the players who put in a tremendous shift today.\"\nOn the forthcoming semi-final against Cliftonville:\n\"We played Cliftonville earlier on in the season and gave a good account of ourselves. Hopefully we we'll do the same in the semi-finals and see where that takes us.\"\nSwifts aim to 'carry out dream'\nCarrick Rangers 1-3 Dungannon Swifts\nDungannon Swifts manager manager Rodney McAree on his side's win at Carrick Rangers:\n\"We had to come to a very difficult venue and ask players to do something that they are less comfortable with. It's hard to get players to adapt to playing in the right areas of the pitch, asking questions of Carrick and trying to capitalise on that.\"\nOn his side's forthcoming semi-final appearance:\n\"We talk about carrying out the dream but to do that you have to win every individual test. Today was a stern test and for us to progress another round we will have to fight like we did in the second 45 minutes today and hope that will see us through to the big day.\"\nMagilton hails Reds' 'incredible character'\nFT: Crusaders 1-2 Cliftonville\nCliftonville boss Jim Magilton has been speaking on BBC Sportsound following his side's 2-1 win at Crusaders:\n\"There was so much at stake - you have to do whatever it takes to win the game and to a man, we showed incredible character and resilience. Crusaders threw the kitchen sink at it, but we managed to get it over the line.\"\nOn his side's chances of retaining the trophy:\n\"We are so focused on trying to retain the trophy. We don't want to let go of it - we've grown quite fond of it, having not had it for 45 years!\"\nReds have 'done the job'\nCrusaders 1-2 Cliftonville\nStuart King\nFormer Carrick Rangers manager on BBC Sportsound\nYou can see from the reaction of Jim Magilton how important that was to him.\nCrusaders will be really disappointed - in the second half they gave it a real good go.\nBut Cliftonville have come to their biggest rivals, done the job and qualified for the semi-finals and the goal that won it was absolute quality.\nFULL-TIME\nColeraine 2-0 Portadown\nAll over at the Showgrounds where Coleraine make it back to back wins for the first time in four months with a comfortable 2-0 win over Portadown.\nRonan Doherty fired the home side in from after 11 minutes with his first goal since joining from Cliftonville in January before Jamie Glackin made the game safe with Coleraine's second just before the hour.\nPortadown created very little over the 90 minutes, free-kicks from Shay McCartan and Steven McCullough the nearest they came to scoring.\nSo, a second win in successive weeks for the Bannsiders who are making a late move on a top six finish.", "url": "https://www.bbc.co.uk/sport/football/live/c4gm9yy3733t"}