{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:31", "date_modify": "2025-05-21 03:55:31", "date_publish": "2025-02-09 16:52:57", "description": "Portadown come from behind twice to draw 2-2 with Cliftonville in an entertaining encounter at Solitude.", "filename": "sport_articles_cjr8gw7q3rpo_1747799731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c156/live/0f682c00-e706-11ef-9b11-a943219c72d4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cjr8gw7q3rpo_1747799731.html", "title": "Portadown hit back twice to draw with Cliftonville", "title_page": "Irish Premiership: Portadown hit back twice to draw with Cliftonville - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portadown came from behind twice to draw 2-2 with Cliftonville in an entertaining encounter at Solitude.\nRyan Curran opened the scoring on 31 minutes for the Reds before Ahu Obhakhan equalised three minutes later with a fantastic flick.\nRory Hale finished off a well-worked move to restore the home side's advantage, but Josh Ukek levelled again 10 minutes from time to secure a share of the spoils.\nThe result sees Portadown move up to fifth in the table, whilst the Reds remain in seventh with one league win in their last seven games.\nNiall Currie's men went close to taking the lead on 21 minutes when Steven McCullough's wicked corner fell kindly for Baris Altintop at the back post, but with the goal gaping, the defender somehow contrived to nod wide.\nThey continued to knock on the door with Odumosu palming away a fierce drive from Shay McCartan.\nCurran then opened the scoring for the Reds just after the half-hour mark.\nShea Kearney's teasing cross from the right sparked chaos in the Ports' defence, with Eric McWoods unwittingly playing the perfect dummy into the path of Curran, who pounced to prod home from close range.\nThe jubilation was short-lived however, as Obhakhan silenced the Solitude crowd with a moment of magic just minutes later.\nLatching onto McCullough's inviting cross, he delicately lifted the ball over Odumosu with the outside of his boot for his seventh league goal of the season.\nJim Magilton's charges then reclaimed the lead early in the second half as Curran turned provider, threading a needle-perfect pass to captain Hale, who rifled past Aaron McCarey at his near post.\nJust as it seemed the home side would secure all three points, the Ports struck in the 79th minute.\nLee Chapman's cross caused havoc in the six-yard box, and under pressure from Josh Ukek, Odumosu missed his punch, allowing Ukek to roll the ball into the empty net.", "url": "https://www.bbc.com/sport/articles/cjr8gw7q3rpo"}