{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:35", "date_modify": "2025-04-26 06:25:35", "date_publish": "2025-02-28 21:59:35", "description": "Newcastle will host Bath in the semi-finals of the Premiership Cup after both sides come through their last-eight ties.", "filename": "sport_rugby-union_articles_cg4k1l9gpk1o_1745648735.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d59f/live/4a7e52b0-f61a-11ef-bc15-b928e72b39da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cg4k1l9gpk1o_1745648735.html", "title": "Premiership Cup: Newcastle and Bath through to semi-finals", "title_page": "Premiership Cup: Newcastle and Bath through to semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle will host Bath in the Premiership Cup semi-finals after both sides came through their quarter-final ties.\nBath were 21-0 down against Harlequins at the Recreation Ground but rallied with the help of a very experienced bench to score six tries and win 39-28.\nNewcastle selected a first-choice XV and a hat-trick from hooker Jamie Blamire helped see off a largely second-string Gloucester 22-17.\nExeter entertain Sale and Ealing travel to Northampton in the other quarter-finals.\nBath had a far less experienced starting XV than Harlequins and quickly found themselves three tries down.\nFull-back Tyrone Green scored in the first minute before centres Will Joseph and then Ben Waghorn saw Quins three tries up after only 14 minutes.\nBath's 15, Tom de Glanville, got them on the board with their first try and although Argentina winger Rodrigo Iscro went over to extend Quins' lead, scrum-half Tom Carr-Smith scored for the hosts to make it 28-14 at the break.\nBath then unleashed a platter of experienced replacements to take control of the game and tries from hooker Tom Dunn, number eight Arthur Green, flanker Jaco Coetzee and centre Louie Hennessey's superb diving finish in the right corner saw them comfortably through.\nNewcastle dominated the first half at Kingston Park and Blamire's first try, from a rolling maul, and a Brett Connon penalty saw them lead 8-0 at the break.\nWinger Louis Hillman-Cooper scored for Gloucester six minutes into the second half but another maul soon after led to Blamire's second try.\nCharlie Atkinson landed a 48-metre penalty to bring Gloucester back to 15-10 down but again the Falcons extended their lead as another driving maul brought Blamire's hat-trick.\nKieran Wilkinson was sin-binned for the hosts for a deliberate knock-on and winger Matty Ward took advantage to go under the posts to keep Gloucester in touch but it was as close as they got.\nNewcastle consultant director of rugby Steve Diamond told BBC Radio Newcastle:\n\"They've clearly got a very good group of young players coming through. We could have been better but it's what cup rugby is about.\n\"They got into the game and we couldn't shake them off. We had to go back to basics and the driving maul to win the game.\n\"We never got more than a score in front and it kept them in the game but a win's a win.\"\nBath assistant coach Andy Robinson told BBC Radio Bristol:\n\"It was a really pleasing second half and we knew with the players coming on we could dominate and that's what we did.\n\"We played a good power game, found the field position through penalties and put the power on in their 22.\n\"We wanted to give some of the senior guys game time because they haven't played for four weeks and we're delighted how they played with the younger players.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cg4k1l9gpk1o"}