{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:12:17", "date_modify": "2025-05-21 05:12:17", "date_publish": "2025-04-05 00:00:00", "description": "Goals from Steven Fletcher, Sam Smith and Jack Marriott send Wrexham six points clear of Wycombe Wanderers in the League One promotion race.", "filename": "sport_football_live_ce84127n75yt_1747804337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/be57/live/0787ac60-1224-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce84127n75yt_1747804337.html", "title": "Wrexham beat 10-man Burton Albion 3-0 to boost promotion bid", "title_page": "Wrexham beat 10-man Burton Albion 3-0 to boost promotion bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham struck a significant blow in the League One promotion battle as they eventually broke down 10-man Burton Albion to move six-points clear of rivals Wycombe Wanderers.\nSecond-half goals from Steven Fletcher, Sam Smith and Jack Marriott secured the victory on an afternoon that could yet prove a turning point in the race for the Championship.\nWith Wycombe losing at Reading, Phil Parkinson's side placed their destiny in their own hands with the result, while also narrowing the goal difference gap between the sides.\nBut they were made to wait – and work – for the victory by Gary Bowyer's relegation-threatened side who had Charlie Webster sent off after just 10 minutes.\nIt was not until 19 minutes to go that former Scotland international Fletcher slammed the hosts in front from the penalty spot after Smith had been felled by Brewers goalkeeper Max Crocombe.\nBut a cool-finish from Smith three minutes later removed any lingering worries, with Marriott adding to the jubilant atmosphere when he provided a third on 87 minutes.\nBurton, though, had asked serious questions of Wrexham as they defended superbly despite their early setback.\nThe Brewers will take heart in their fight at the other end of the table as they remain in the bottom three with six games remaining.\nWrexham have five games to go in their attempt to make history with a third successive promotion. They head to Wigan next weekend while Wycombe play their game in hand at Huddersfield on Tuesday.\nWrexham supporters, who seemed to acknowledge the potential importance of the afternoon's events with the way they celebrated at the final whistle, will hope not all games are as tense.\nIndeed, they had to show similar patience to their side after Webster's early sending off gave Burton enough reason to put up a yellow wall of resistance.\nWebster walked off shaking his head after seeing the red card, although replays suggested referee Seb Stockbridge made the right call after the midfielder caught Dobson with studs showing.\nBowyer displayed his frustration, his team responded with determination.\nSat deep, they kept Wrexham at bay and waited for their own moments. Had Wrexham goalkeeper Arthur Okonkwo not been alert, Julian Larsson may well have broken the deadlock as he raced behind after a set-piece was played back in on 35 minutes.\nThe introduction of Elliott Lee and Ryan Barnett boosted the hosts' the urgency after the interval, but it was not until Smith raced onto a hopeful through ball that the game swung, Crocombe racing off his line and the striker welcoming the contact after getting the crucial first touch.\nFletcher, on for Jay Rodriguez who suffered a first-half injury, made no mistake from the spot with his eighth of the season before Smith doubled the advantage when he slotted home expertly from Ryan Longman's through pass.\nAnd Marriott, another off the bench, wrapped up things when he finished after breaking through late on.\nPhil Parkinson said: \"I'm delighted with the win. I thought started well first ten mins, the sending us gave us an advantage, but we were a bit laboured from and needed to step in quicker with the ball and improve the quality of our passes.\n\"We made changes and we did well when it's not easy against ten men; Burton are good at siting off and restricting space to make it difficult as they've been down the bottom and played like that with success.\n\"It was never going to be straight forward but we got the important breakthrough and after that you felt we would go and add to it.\"\nGary Bowyer told BBC Radio Derby: \"When your down to ten men, you will get dominated with possession but we've not had many saves to make. The manner of all three goals is really disappointing, probably the worst we've conceded since I've been here and is really galling.\n\"I haven't seen the sending off, but it's changed the game. It altered the approach. It's now down to us to recover and react.\"", "url": "https://www.bbc.com/sport/football/live/ce84127n75yt"}