{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-05-21 06:06:53", "date_modify": "2025-05-21 06:06:53", "date_publish": "2025-01-31 15:07:13", "description": "Celtic defender Alistair Johnston excited for 'amazing opportunity' against Bayern Munich", "filename": "sport_articles_cgkje0yg2lzo_1747807613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a241/live/ce2dfa10-dfe1-11ef-9e55-bfd035967447.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgkje0yg2lzo_1747807613.html", "title": "Johnston excited for 'amazing opportunity' against Bayern Munich", "title_page": "Celtic defender Alistair Johnston excited for 'amazing opportunity' against Bayern Munich  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alistair Johnston is relishing the chance to play in \"an amazing fixture\" when Celtic take on Bayern Munich in the Champions League play-off round.\nThe Scottish champions could have been drawn against either Bayern or Real Madrid in Friday's draw having finished 21st in the league phase.\nBrendan Rodgers' side host the German giants on 12 February - and Johnston says it is imperative they \"come out firing\" to take a positive result to Munich six days later.\nThe winners of the tie will face either German champions Bayer Leverkusen or Spanish club Atletico Madrid in the last 16.\n\"When you looked at the two options between Bayern and Real Madrid, they are both European powerhouses, so we were just looking forward to whoever we got,\" the Canada international said.\n\"It'll be an amazing experience and a great opportunity for us to show Europe what we're all about. It'll be a really fun first leg at Celtic Park. An amazing fixture.\n\"It's a difficult draw but it's one we're all really looking forward to. Having the first leg at home can be something to build on, and I can imagine it will be a loud one.\n\"Anything is possible. We need to come out firing from the get-go and give ourselves a chance in the second leg. It won't be an easy task but one we're all excited for.\"\nCeltic could have no supporters at the second leg after again being sanctioned by Uefa, but Johnston is hopeful of a solution being found.\n\"It would be disappointing for our fans and for the Champions League in general,\" he added. \"Our fans are known around Europe for being so loud. You want that atmosphere, that give and take in the stadium.\n\"Hopefully something can be decided upon that works out where we can have our fans there, because it adds to the whole experience.\"", "url": "https://www.bbc.com/sport/articles/cgkje0yg2lzo"}