{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:33", "date_modify": "2025-04-26 03:53:33", "date_publish": "2025-03-03 08:15:34", "description": "Crystal Palace 3-1 Millwall: Fan views on FA Cup win", "filename": "sport_football_articles_c1jpxk874ndo_1745639613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b1c/live/a088bcb0-f807-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1jpxk874ndo_1745639613.html", "title": "Crystal Palace 3-1 Millwall: Fan views on FA Cup win", "title_page": "Crystal Palace 3-1 Millwall: Fan views on FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Crystal Palace's performance in the FA Cup win over Millwall.\nHere are some of your comments:\nKevin: I thought we made hard work of beating Millwall after they went down to 10 men, but we rarely looked like losing it. I hope JP isn't too seriously injured and he will be back after the international break. I doubt he will be risked for the Ipswich game, even if he has a speedy recovery. Managing the squad for the coming games will be a key consideration.\nTrevor: In the next round, but only after a pretty inept display. We were two goals up against 10 men and there seemed to be a complete lack of urgency. Against better opposition the result could easily have been different.\nSteve: We did amazingly well given the incident that took JP out and the impact on the squad of seeing a player being stretchered straight into an ambulance from the pitch. We were cruising at 2-0 and took our eye off the game - that gave Millwall some hope for a period in the middle of the game. It is good we have a long break in March for JP to recover without it affecting us too much.\nTheo: Great play! I hope Mateta is OK because it was a reckless challenge from Liam Roberts. However, it was a great opportunity for Eddie Nketiah and he certainly took it! A great game all round.", "url": "https://www.bbc.co.uk/sport/football/articles/c1jpxk874ndo"}