{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:38", "date_modify": "2025-05-21 05:53:38", "date_publish": "2025-01-08 00:00:00", "description": "Kilmarnock miss the chance to move into the Scottish Premiership top six as they are held to a goalless draw by Motherwell at Rugby Park.", "filename": "sport_football_live_c623kn2lxk9t_1747806818.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c623kn2lxk9t_1747806818.html", "title": "Wasteful Kilmarnock held by Motherwell", "title_page": "Wasteful Kilmarnock held by Motherwell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock's draw at home to Motherwell in the Scottish Premiership \"feels like a defeat\" after a host of missed chances, says manager Derek McInnes.\nThe home side dominated for most of the match but could not find a goal to put away a side whose best openings came against the run of play.\n\"In terms of how we set about the task, it was one-way traffic,\" McInnes told BBC Scotland.\n\"Draws should feel like defeats at home. I've always felt that since we came to Rugby Park and it's not a bad thing draws feel that way.\n\"It does feel like there was so much more to get from that game.\"\nKilmarnock bossed the early exchanges and only a combination of poor finishing, great goalkeeping and a little misfortune prevented them taking the lead.\nFraser Murray teed up Marley Watkins inside two minutes only for the striker to make a mess of his finish from 10 yards and pass up a big chance.\nMotherwell goalkeeper Aston Oxborough produced a stunning save to keep out a Joe Wright volley, while at the other end Robby McCrorie made a smart stop from Tony Watt on a rare Motherwell attack.\nThe home side thought they had taken the lead when Murray's clever reverse pass found Brad Lyons, who curled home a lovely finish with the outside of the boot. The video assistant referee (VAR) intervened to rule the final pass was offside and the goal was chalked off.\nLyons was left cursing his luck again when his header came crashing off the bar just before the break.\nWatt had another sight of the Killie goal and saw his strike stopped by the legs of McCrorie.\nOxborough produced another big save from Watkins to keep the scores level while substitute Stephen O'Donnell passed up a terrific chance to snatch an unlikely victory for the visitors late on.\nSubstitute Jack Burroughs nearly won it deep into stoppage time, only for his strike to deflect agonisingly wide as Killie had to settle for a point.\nMcInnes bemoaned the lack of attacking thrust from his side in the defeat to Ross County, and while they looked far more dangerous and created numerous chances against Motherwell, there is still a lingering sense they are lacking an out-and-out goalscorer.\nMurray was once again a threat throughout, getting in behind the defence, creating openings for himself and his team-mates.\nThose chances all went unconverted and this felt like a big opportunity missed for Killie to advance their top-six challenge.\nProven top-flight goalscorers certainly don't come cheap, but with Kyle Vassell and Innes Cameron out injured for two months, McInnes may well be trying to unearth a gem in the transfer market between now and the end of the month.\nAfter ending a four-game winless run against Aberdeen, boss Stuart Kettlewell had hoped that would be the spark his side needed to put a run of form together.\nThat failed to materialise as his team put in a largely passive performance at Rugby Park.\nThe absence of a player of the quality of Lennon Miller – he fractured an ankle against Rangers on December 29 - would hurt any side in the league, and 'Well missed his influence and composure on the ball as they failed to exert authority in midfield.\nWhat they did show was resilience to stay in the fight and the ability to eke out a point when playing below par is not to be underestimated.\nOxborough was the standout with some superb saves to keep Killie at bay and ensure his side left with a share of the spoils.\nKilmarnock manager Derek McInnes: \"We've played worse and won games. I thought we were terrific, it's hard to be critical. But it's our job to win games and find a way to score a goal.\n\"But we have a combination of the offside goal, the crossbar, good blocks and us being a bit rushed at times.\nMotherwell manager Stuart Kettlewell: \"Kilmarnock were the better side, they created the better chances and ours were few and far between. Although we did have a couple.\n\"They had control of the vast majority of the game. So you have to ask your team to stand strong. It's a second clean sheet on the bounce for us in a really difficult spell, with one more game to come before we get any kind of break.\"", "url": "https://www.bbc.com/sport/football/live/c623kn2lxk9t"}