{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:04", "date_modify": "2025-05-21 05:23:04", "date_publish": "2025-04-03 15:31:34", "description": "Connacht defeat Cardiff 35-20 in Galway to set up a home European Challenge Cup quarter-final against Racing 92 next weekend.", "filename": "sport_rugby-union_articles_cd6jvl7pe19o_1747804984.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d791/live/2b970a30-125e-11f0-b4a4-c723e78819a3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cd6jvl7pe19o_1747804984.html", "title": "Connacht 35-20 Cardiff: Irish side reach European Challenge Cup quarter-finals", "title_page": "Connacht 35-20 Cardiff: Irish side reach European Challenge Cup quarter-finals  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Connacht defeated Cardiff in Galway to set up a home European Challenge Cup quarter-final against Racing 92 next weekend.\nTries from scrum-half Matthew Devine, number eight Sean Jansen, wings Finn Treacy and Shayne Bolton and replacement Paul Boyle set up the victory.\nCardiff responded with tries from centres Rey Lee-Lo and Ben Thomas and wing Josh Adams.\nThe visitors' second-half revival was weathered by Connacht who celebrated a third win against Cardiff this season.\nThe Irish province, who finished the pool stages as top seeds and have now won five European games in this campaign, will have home advantage against their French opponents in the last eight at the Dexcom Stadium on Saturday evening.\nBritish and Irish Lions duo Adams and Taulupe Faletau returned alongside Wales prop Keiron Assiratti and captain Liam Belcher in eight changes from the Cardiff side that lost to Benetton.\nConnacht recalled half-backs JJ Hanrahan and Devine, who popped up with the opening try in the third minute before Sheedy responded with a penalty.\nThe Irish were denied a second try because of a Darragh Murray forward pass to Treacy.\nThe classy number eight Faletau was heavily involved in the attacking move that led to Connacht full-back Mack Hansen being shown a yellow card for a professional foul.\nThe visitors took advantage with a free-flowing move that was finished off by Lee-Lo in the right corner.\nThe numbers were evened up when Cardiff lock Josh McNally was sent to the sin-bin for a cynical offence.\nConnacht capitalised when Jansen dived from short range to give the hosts a 14-8 half-time lead.", "url": "https://www.bbc.com/sport/rugby-union/articles/cd6jvl7pe19o"}