{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:50", "date_modify": "2025-05-19 14:41:50", "date_publish": "2017-08-12 13:12:27", "description": "DIGIONLY", "filename": "sport_football_40903342_1747665710.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40903342_1747665710.html", "title": "Saturday's National League reports", "title_page": "Saturday's National League reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aldershot Town 6-0 Guiseley\nAldershot continued their 100% start to the National League season with a thumping of Guiseley.\nThe hosts dominated the early exchanges and thought they had taken the lead in the 14th minute as Bobby-Joe Taylor headed in a James Rowe cross, but the goal was ruled out by an offside flag.\nJust six minutes later the the home side took a deserved lead thanks to Matt McClure's curled effort which went in off the inside of the far post.\nGuiseley then had a goal disallowed, but shortly afterwards Aldershot added to their lead with goals from Callum Reynolds and Jim Kellerman and there was even time for the Shots to make it 4-0 before the break as Shamir Fenelon grabbed his side's fourth.\nRowe added his name to the scoresheet with a low 20-yard drive into the bottom corner, before McClure rounded off the scoring with his second of the afternoon to make it 6-0, Aldershot's biggest league win since December 2013.\nReport supplied by the Press Association.\nBarrow 3-0 Woking\nBarrow moved above opponents Woking in the National League table following a victory at Holker Street.\nBoth sides went close in a frantic start as Barrow's Adi Yussuf missed a gilt-edged chance in the area, while Woking's Joe Ward was denied by a good save from Stuart Moore.\nIt was the hosts who took the lead as Yussuf bent an effort over Woking goalkeeper Nathan Baxter and into the net from 25 yards.\nThe lead was doubled shortly after the break when Jordan White latched on to a long throw from Dan Jones to tap into the Woking net and he should have added a third minutes later but nodded just wide of the target.\nThe striker made amends for his miss seven minutes from time as he found the net with a header from a corner to wrap up a comfortable victory for the Bluebirds.\nReport supplied by the Press Association.\nBoreham Wood 4-1 Solihull Moors\nBoreham Wood grabbed their first win of the National League season with a victory over bottom side Solihull Moors at Meadow Park.\nWood's Dave Stephens saw his ninth-minute header rattle the crossbar, but it was the visitors who struck first as Fiacre Kelleher reacted quickest to a long throw into the penalty area to bundle the ball into the net.\nIt took just over a minute for the equaliser to arrive as on-loan Wood defender Jamie Turley drew his side level with a close range finish following a goal-mouth scramble inside the Solihull box.\nThe home side then took the lead in the 38th minute as Bruno Adrade fired in, before veteran striker Paul Benson doubled the host's half-time lead with a stunning overhead kick.\nAngelo Balanta added his side's fourth in the second half as he curled an effort beyond Connal Trueman from the edge of the area.\nReport supplied by the Press Association.\nChester FC 0-0 FC Halifax Town\nHalifax's wait for their first National League goal this season continues as they were held to a goalless draw by Chester.\nFormer Shayman Ross Hannah stabbed wide from eight yards out with the first real chance of the game after four minutes.\nHalifax striker Tom Denton saw a 36th-minute a header cleared off the line in what was a rare chance during a quiet opening 45 minutes at the Swansway Chester Stadium.\nThe visitors came close to opening the scoring in the 56th minute but a cross from substitute Josh MacDonald came back off the bar.\nChester almost stole the points in the final minute of the match but Halifax goalkeeper Sam Johnson made a stunning stop to deny James Akintunde and earn his side a share of the spoils.\nReport supplied by the Press Association.\nDover Athletic 1-0 Wrexham\nRyan Bird's first-half goal gave Dover Athletic a second win in five days as they beat Wrexham at the Crabble Athletic Ground.\nWrexham's supporters, making a round trip of nearly 600 miles, had little to cheer as their side rarely threatened.\nThe Whites dominated after ex-Newport striker Bird turned-in from close range in the 18th minute after Kane Richards' set-up.\nChris Kinnear's side are sixth in the National League after three games.\nEastleigh 2-2 Dagenham and Redbridge\nBen Williamson and Corey Whitely both scored braces and Eastleigh and Dagenham drew at Ten Acres.\nWhitely scored his third goal in only his third game of the season, slotting past Graham Stack from a one-on-one opportunity.\nWilliamson levelled, however, for the Spitfires after taking Danny Hollands' curled through ball in his stride.\nAyo Obileye was then brought down in the box by substitute Kevin Lokko, and Williamson netted from the penalty spot.\nWhitely also registered from 12 yards 16 minutes from time to save a point and enhance even further his prolific start to the campaign.\nReport supplied by the Press Association.\nEbbsfleet United 3-3 AFC Fylde\nAndy Drury salvaged a late point for Ebbsfleet against fellow promoted outfit Fylde at Stonebridge Road.\nThe first five goals came in the first half after The Coasters led when Henry Jones received Danny Rowe's through ball and slotted past Nathan Ashmore.\nRowe finished off a pass from Jack Muldoon minutes later to double the lead, but Ebbsfleet responded when a deep Myles Weston cross found Kenny Clark free at the back post to loop in a header.\nDanny Kedwell then levelled, before Sam Finley fired the away side back in front after taking a corner ball on the edge of the box.\nDrury's late drilled shot below Rhys Taylor came a minute from time.\nReport supplied by the Press Association.\nGateshead 3-0 Torquay United\nGateshead registered their second home win in a week with a resounding success against Torquay at the International Stadium.\nThe Tynesiders led inside 20 minutes when a dangerous ball across goal by Callum Williams ricocheted off Ryan Higgins for an own goal.\nDanny Johnson then set up Williams to threaten a second, but Ryan Clarke denied him from close range.\nAfter the break, substitute Richard Peniket extended the home side's lead when he redirected Jordan Preston's effort past the goalkeeper.\nMyles Anderson then turned into his own goal from Jordan Burrow's ball as Gateshead secured an unassailable cushion.\nReport supplied by the Press Association.\nLeyton Orient 2-0 Maidstone United\nLeyton Orient made it two home wins in a week as they overcame Maidstone at Brisbane Road.\nThe visitors could easily have led early on when Delano Sam-Yorke stabbed the ball home from close range, but he was adjudged to have fouled keeper Charlie Grainger.\nJoe Pigott was then denied by the home goalie before Tom Wraight smashed over, as Maidstone continued to threaten.\nThe O's, coming off a 3-1 win over Solihull in midweek, perked up and David Mooney opened the scoring for the hosts in the second half with a fine header from James Dayton's cross.\nOrient doubled their lead in added time when substitute Romuald Boco took on Charlie Lee's pass to finish under Lee Worgan.\nReport supplied by the Press Association.\nMacclesfield Town 0-0 Bromley\nMacclesfield and Bromley both remained unbeaten three games into the season after a fairly mundane stalemate at Moss Rose.\nThe home side were disappointed not to go in front in the first 15 minutes when Koby Arthur's shot was saved by David Gregory.\nAt the other end, Brett Williams nearly broke the deadlock with a deflected shot that was tipped over by Shwan Jalal.\nIn the second half, affairs remained tight and the visitors' Iffy Allen fired just over from the edge of the box.\nNoe Baba produced a late, spectacular drive that went just over, but both sides ended up with a point.\nReport supplied by the Press Association.\nMaidenhead United 2-1 Hartlepool United\nDave Tarpey scored twice to help Maidenhead to their first ever National League win as they beat Hartlepool at York Road.\nTarpey opened the scoring in the 34th minute when a long ball down the middle was flicked on by Sean Marks and he tucked it past goalkeeper Scott Loach and into the bottom right-hand corner.\nIt was almost two just five minutes later when Ryan Upward's deflected shot from Harry Pritchard's cross was hacked off the line by a combination of Blair Adams and Loach.\nIt took until the 43rd minute for Hartlepool to trouble Carl Pentney but he easily gathered Jake Cassidy's weak effort after Adams played him in.\nTarpey doubled the lead in the 58th minute, collecting a poor back-pass from Louis Laing and rifling home a shot off the underside of the crossbar.\nPools finished strongly and pulled one back when James Comley was penalised and booked for a late challenge in the box and Padraig Amond stroked home from the spot, but they left it too late to salvage a point.\nReport supplied by the Press Association.\nTranmere Rovers 0-1 Sutton United\nCraig Dundas scored the only goal as Sutton climbed to fourth in the fledgling National League standings with victory over Tranmere.\nDundas found the net for visitors Sutton in the 32nd minute after racing clear from a throw-in to slide the ball past Scott Davies from 20 yards.\nTranmere, who recorded their first league win of the season with a 3-1 victory over Woking on Tuesday, came close early in the second half when Andy Cook hit the underside of the bar from Liam Ridehalgh's cross.\nSutton almost added a second in the 67th minute when Kenny Davis' shot was blocked and Craig Eastmond was also denied with the follow-up.\nReport supplied by the Press Association.", "url": "https://www.bbc.com/sport/football/40903342"}