{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 05:46:53", "date_modify": "2025-05-21 05:46:53", "date_publish": "2025-01-31 18:21:44", "description": "The owners of Major League Cricket franchise Washington Freedom agree a deal to buy a stake in Welsh Fire in the second round of sales in The Hundred.", "filename": "sport_cricket_articles_ckgrl67llkeo_1747806413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/123b/live/04de6400-e000-11ef-b1b3-51355c7a67fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckgrl67llkeo_1747806413.html", "title": "The Hundred: Welsh Fire £40m stake agreed with MLC franchise Washington Freedom", "title_page": "The Hundred: Welsh Fire £40m stake agreed with MLC franchise Washington Freedom - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The owners of Major League Cricket franchise Washington Freedom have agreed a deal to buy a stake in Welsh Fire in the second round of sales of The Hundred.\nFreedom are backed by Indian-American IT entrepreneur Sanjay Govil and tabled the winning bid for a 49% share of Fire.\nA source close to the deal told BBC Sport that the winning bid valued Fire at approximately £80m with Govil's share worth about £40m.\nGovil will now enter into an eight-week exclusivity period with Glamorgan, who were gifted the other 51% share in Fire by the England and Wales Cricket Board (ECB), where the finer details of the agreement will be finalised.\nGlamorgan are set to relinquish another 1% to Govil to ensure a joint 50-50 split of Fire.\nFreedom's owners beat off interest from Capri International, which owns UP Warriorz in India's Women's Premier League and Sharjah Warriors in the UAE's International League T20.\nWrexham Football Club's Hollywood owners Ryan Reynolds and Rob McElhenny were among those who were interested in acquiring a stake in Fire.\nHowever, the pair did not enter the formal bidding process following their initial contact last year.\nMontreal-born Govil is the founder and chairman of Infinite Computer Solutions, who are based in Rockville, Maryland and have an annual revenue of $2bn with 20,000 employees globally.\nThe tech billionaire also owns Infinite and Zyter, one of the leading healthcare technology platforms with 43 million members.\nGovil made his first foray into professional cricket franchise ownership with Freedom during the first season of MLC in 2023 with his son Avikar also actively involved in the day-to-day running of the team.\nFreedom's chief executive is Dhiraj Malhotra, who previously held the same position at Delhi Capitals.\nThe DC-based franchise have a strategic partnership with Cricket New South Wales and have a strong Australian flavour to their set-up.\nCoached by former Australia captain Ricky Ponting, and captained by current Australia batter Steve Smith, Freedom won the 2024 edition of MLC.\nIn addition to Ponting and Smith, Freedom also had fellow Aussies Travis Head and Glenn Maxwell, New Zealand pair Rachin Ravindra and Lockie Ferguson plus South Africa's Marco Jansen on their books.\nMLC and The Hundred are set to held in different windows this summer after the tournaments partially clashed last year.\nThe Hundred sales continue into next week, with the ECB set to confirm the eight preferred bidders at the end of next week.\nThe ECB is retaining control of The Hundred competition, but it is selling stakes in the teams to provide a cash injection into the game.\nFrom the total money raised, an allocation of 10% will go straight to the recreational game. Proceeds from the 49% sales will be divided between the 18 first-class counties and the MCC.\nIf a host decides to sell part or all of its stake, it will hand over 10% of what it receives to be divided between the 18 counties and MCC.", "url": "https://www.bbc.com/sport/cricket/articles/ckgrl67llkeo"}