{"authors": ["Emlyn Begley", "www.facebook.com"], "date_download": "2025-05-21 07:47:11", "date_modify": "2025-05-21 07:47:11", "date_publish": "2025-05-18 21:27:35", "description": "Five teams into three places don't go - so who will qualify for the Champions League as the Premier League's race for Europe heads into the final weekend?", "filename": "sport_football_articles_cg5vqyjqnp2o_1747813631.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b260/live/b27f8ff0-35c1-11f0-92f4-0360ddb40136.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5vqyjqnp2o_1747813631.html", "title": "Premier League: Who will qualify for Champions League, Europa League and Conference League?", "title_page": "Premier League: Who will qualify for Champions League, Europa League and Conference League? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Five Premier League teams will battle it out for three Champions League places on the final day of the season.\nChampions Liverpool and Arsenal have secured their place in European club football's premier competition and a draw against Fulham on the final day should ensure Manchester City join them, after Pep Guardiola's side beat Bournemouth on Tuesday to move on to 68 points.\nNewcastle are one of three teams on 66 points, alongside Chelsea and Aston Villa, with Nottingham Forest on 65 points.\nFive English sides will qualify for the Champions League through the league, up from the usual four, with an extra place secured because of positive results by Premier League clubs in Europe this season.\nNewcastle know a home win against Everton next Sunday (16:00 BST) would successfully finish the job.\nFor Chelsea, a win would also be enough. But... they visit Forest, who beat West Ham 2-1 on Sunday to keep their own hopes alive.\nForest need to beat the Blues and hope at least one team above them slips up.\nVilla will probably need to win at Manchester United and hope for favours elsewhere.\nStill following?\nThe winners of Wednesday's Europa League final between Manchester United and Tottenham will also qualify for next season's Champions League, meaning there will be a sixth English team in the competition, but that has no impact on any league permutations.\nWith Spurs and United in the bottom five of the Premier League, whoever loses in Bilbao will have no European football of any kind next season.\nAnother European finalist, Chelsea, could have a say in what other English teams qualify for various European competitions, but more on that later.\nManchester City will be playing Champions League football next season if they beat Fulham on Sunday. They should be confident of achieving that given they've won their last 14 Premier League games in a row at Craven Cottage.\nA draw will likely be enough, however, because of their superior goal difference.\n\"We still have a lot of job to do,\" Guardiola said after the victory against Bournemouth.\n\"On Sunday we have a tough, tough opponent.\n\"We go there to win and get the result we need to be in next season's Champions League.\"\nTuesday's win for City ended Bournemouth's hopes of securing European football next season.\nThey are 11th and cannot finish in the top eight.\nCrystal Palace, who are 12th in the league, have qualified for the Europa League by winning the FA Cup, beating Manchester City in Saturday's final.\nThe team who finish sixth will also qualify for the Europa League.\nNewcastle United, as Carabao Cup winners, have earned at least a place in next season's Conference League.\nIf Newcastle finish in the top six, then seventh place in the Premier League will qualify for the Conference League instead.\nThe teams who finish sixth and seventh will be the two teams who miss out on the Champions League next weekend, because there is a 10-point drop to eighth.\nNow... there is a chance that the team who finish eighth can qualify for the Conference League.\nThat will happen if Chelsea finish seventh in the league and win the Conference League final against Real Betis on Wednesday, 28 May.\nIn that scenario, Chelsea would qualify for the Europa League because of winning their final in Wroclaw.\nThat is for quite complicated reasons - which you can read here if you like - but you might be better off just trusting us.\nBrighton are eighth after beating Liverpool on Monday to move three points clear of Brentford in seventh.\nFulham - after a win over the Bees - are one point behind them.\nIf Chelsea win the Conference League and finish sixth, England will have three teams in the Europa League (including the team who finish seventh) and none in the Conference League.", "url": "https://www.bbc.com/sport/football/articles/cg5vqyjqnp2o"}