{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:26", "date_modify": "2025-05-19 14:40:26", "date_publish": "2017-07-18 17:14:25", "description": "Liverpool's longest-serving player, midfielder Lucas Leiva, completes his transfer to Serie A side Lazio.", "filename": "sport_football_40628786_1747665626.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13721/production/_96994697_lucas_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40628786_1747665626.html", "title": "Lucas Leiva: Liverpool midfielder joins Lazio after completing medical", "title_page": "Lucas Leiva: Liverpool midfielder joins Lazio after completing medical - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool midfielder Lucas Leiva has completed his £5m transfer to Lazio.\nLucas, 30, was Liverpool's longest-serving player, having joined in 2007 for the same fee from Brazilian side Gremio.\nHe played 345 games for Liverpool, including 247 in the Premier League.\n\"Liverpool is one of the greatest clubs in the world, and my intention had always been to spend the rest of my career here,\" the 24-times capped Brazilian said.\n\"But the less I have been able to play, the more I have realised that I need to go to another club if I want to play as much as I possibly can.\n\"The easiest thing for me to do would be to stay here for as long as I can even if I do not expect to play so often, but that would go against everything that I believe in as a footballer and as a competitor.\n\"My sadness at leaving Liverpool is accompanied by a real excitement that I will be representing one of Italy's great clubs.\"\nLucas will be a direct replacement for Argentine midfielder Lucas Biglia, who has joined AC Milan.\nLazio finished fifth in Serie A last season and will compete in the Europa League under manager Simone Inzaghi.\nLucas played almost 350 games for Liverpool despite never being a regular fixture in the Reds midfield.\nHis versatility meant he was also used as a centre-back - a position he found himself in many times during his 31 appearances last season.\nHe was a popular player at Anfield, being named Young Player of the Year in 2010 and Fans' Player of the Year in 2011.\nThe departures of Xabi Alonso in 2009 and Javier Mascherano in 2011 saw Lucas became an integral part of the team but he suffered a cruciate ligament injury at Stamford Bridge in December 2011, meaning he missed the rest of the season and Liverpool's League Cup final win over Cardiff.\nLucas scored seven goals in his Liverpool career but just one in the Premier League - a header in the 3-0 win over Newcastle in May 2009.\nHe played 45 minutes at centre-back alongside Joel Matip in the friendly against Tranmere Rovers on Wednesday last week but missed Friday's draw with Wigan.", "url": "https://www.bbc.com/sport/football/40628786"}