{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:10", "date_modify": "2025-05-21 07:59:10", "date_publish": "2025-05-19 18:00:01", "description": "Lucknow Super Giants' slim play-off hopes are over after Sunrisers Hyderabad chase 206 for a consolation six-wicket win in the Indian Premier League.", "filename": "sport_cricket_articles_clyvw04d0zlo_1747814350.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80d2/live/9e55c700-34d7-11f0-ac8f-578ab9a74773.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_clyvw04d0zlo_1747814350.html", "title": "IPL 2025: Lucknow Super Giants play-off hopes over after defeat by Sunrisers Hyderabad", "title_page": "IPL 2025: Lucknow Super Giants play-off hopes over after defeat by Sunrisers Hyderabad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lucknow Super Giants' slim play-off hopes are over after Sunrisers Hyderabad chased 206 for a consolation six-wicket win in the Indian Premier League.\nLucknow had to win all three of their remaining matches to have any chance of qualifying but their fate was sealed by a fourth consecutive defeat.\nThey were guilty of not making the most of being 115-0 inside 11 overs in posting 205-7 and then failed to recover from Abhishek Sharma's brutal early assault.\nOpener Abhishek raced to an 18-ball fifty, including four consecutive sixes off Ravi Bishnoi, and when he was caught at deep extra cover for 59 from 20 balls Sunrisers were already 99-2 after 7.3 overs.\nIndia international Ishan Kishan hit 35 and South Africa batter Heinrich Klaasen 47, meaning Sunrisers eased to victory with 10 balls to spare even with Sri Lanka's Kamindu Mendis retiring hurt on 32 with an apparent hamstring injury.\nLucknow had earlier made a perfect start as openers Mitchell Marsh and Aiden Markram made 65 and 61 respectively.\nBut Rishabh Pant made only seven - his fourth single-figure score in five innings - and LSG failed to kick on with Nicholas Pooran the only other batter to make double figures with 45.\nSunrisers were already unable to reach the play-offs but the win means, with one match to go, they will not finish bottom of the standings this year.\nMumbai Indians and Delhi Capitals are now the only sides who can join Gujarat Titans, Punjab Kings and Royal Challengers Bengaluru in the play-offs.", "url": "https://www.bbc.com/sport/cricket/articles/clyvw04d0zlo"}