{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:14", "date_modify": "2025-05-21 05:25:14", "date_publish": "2025-04-03 13:50:14", "description": "Heavyweight Jeamie Tshikeva angrily flips a table and leaves the stage after a heated exchange with fellow Briton David Adeleye in a chaotic news conference.", "filename": "sport_boxing_articles_cy8qneyjg63o_1747805114.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/42fc/live/70f4d7a0-108e-11f0-94b3-d3222284d093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cy8qneyjg63o_1747805114.html", "title": "Jeamie TKV flips table at news conference for heavyweight fight with David Adeleye", "title_page": "Jeamie TKV flips table at news conference for heavyweight fight with David Adeleye - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Heavyweight Jeamie Tshikeva angrily flipped a table and left the stage after a heated exchange with fellow Briton David Adeleye in a chaotic news conference.\nThe pair will fight for the vacant British title at Manchester's Co-op Live Arena on Saturday.\nAdeleye and Tshikeva - known as TKV - were kept apart during a row in a media interview earlier in fight week, but the argument escalated at Thursday's event.\n\"This persona he's putting on, this bad-boy persona... we're both educated men,\" TKV, 31, said.\n\"We're both raised by great parents. Are you an academic gangster? I don't know where this gangster persona comes from, brother.\"\nAdeleye, 28, took offence to suggestions he was scared, and targeted a member of his opponent's team by saying they looked like comedian Harry Hill.\n\"There's only one way to settle this - fight,\" promoter Frank Warren said in reference to Hill's catchphrase.\nThe quip did little to ease the tension as Adeleye and TKV both became visibly irate.\n\"I'm going to hurt you, Jeamie, trust me,\" Adeleye said before banging his fist on the table.\nTKV stood up and overturned the table, before security held both men back and Warren told them to \"calm down\".\nThe event continued without the usual face-off after TKV departed.", "url": "https://www.bbc.com/sport/boxing/articles/cy8qneyjg63o"}