{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:33:41", "date_modify": "2025-05-20 14:33:41", "date_publish": "2023-07-28 17:29:38", "description": "Laura Muir and Eilish McColgan head an eight-strong Scottish contingent at next month's World Athletics Championships in Budapest.", "filename": "sport_athletics_66341129_1747751621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92C9/production/_130577573_18442769-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66341129_1747751621.html", "title": "World Athletics Championships: Laura Muir & Eilish McColgan among eight Scots in GB team", "title_page": "World Athletics Championships: Laura Muir & Eilish McColgan among eight Scots in GB team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Laura Muir and Eilish McColgan head an eight-strong Scottish contingent at next month's World Athletics Championships in Budapest.\nJemma Reekie, Josh Kerr and Neil Gourley are also included in the Great Britain team alongside America-based Nicole Yeargin.\nMegan Keith and Alyson Bell make their senior championships debut.\nJake Wightman is not defending his 1500m title as he recovers from a foot injury.\nOlympic silver medallist Muir will look to improve on the 1500m bronze she claimed in Oregon a year ago, while Commonwealth gold medallist McColgan will compete in the 10,000m should she recover from injury.\nReekie strives for success in the women's 800m, European Under-23 champion Keith goes in the 5000m, and Gourley and Kerr compete in the men's 1500m.\nYeargin bids to bolster her medal tally in the 400m women's relay - where she won bronze last year - and could also feature in the 400m mixed relay. Debutant Bell aims to shine on the big stage in the women's 100m relay.\nWith 50 athletes already named, the full British team will be finalised when UK Athletics (UKA) receive world rankings invitations from World Athletics.", "url": "https://www.bbc.com/sport/athletics/66341129"}