{"authors": ["Graeme McLoughlin", "www.facebook.com"], "date_download": "2025-05-21 07:33:25", "date_modify": "2025-05-21 07:33:25", "date_publish": "2025-03-26 07:57:50", "description": "Ipswich news: Can Town stay in Premier League? Graeme McLoughlin Q&A", "filename": "sport_football_articles_crmjydp4npmo_1747812805.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/03c3/live/c2a45b40-4841-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crmjydp4npmo_1747812805.html", "title": "Ipswich news: Can Town stay in Premier League? Graeme McLoughlin Q&A", "title_page": "Ipswich news: Can Town stay in Premier League? Graeme McLoughlin Q&A - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "More of your questions to BBC Radio Suffolk sports editor Graeme McLoughlin. In this section, he looks at what hope there is left in Ipswich's season.\nGlyn asked: After last weekend, \"they think it's all over, it is now\" sums up our chances. Convince me otherwise, please?\nGraeme: It is going to be very difficult to convince you, Glyn. My last Q&A followed the Southampton defeat in February. At the time, I said I felt Town could still double their points tally for the season and should they do that, they might just have a chance of finishing above Wolves. Town were on 16 points at that stage, but in the five Premier League games since then they have added just one, while Wolves have taken seven. Not good.\nIf the great escape is to be achieved, surely Ipswich have to win at Bournemouth next week before seeing off Wolves a few days later? If they do not, then I am with you and Kenneth Wolstenholme.\nSteve asked: Can we come back up next year?\nGraeme: Should what is looking like the inevitable happen, Ipswich would be well placed to make a speedy return to the top flight.\nWhile there will be a few departures and some new arrivals, the club will also be keeping hold of plenty of talent well proven at Championship level. There are no guarantees, of course, but Town are backed by ambitious owners intent on enjoying more than just a brief fling with the Premier League.", "url": "https://www.bbc.com/sport/football/articles/crmjydp4npmo"}