{"authors": ["Sam Davis", "www.facebook.com"], "date_download": "2025-05-21 07:46:20", "date_modify": "2025-05-21 07:46:20", "date_publish": "2025-05-20 11:36:25", "description": "Bournemouth news: Opinion - Dean Huijsen success testament to all areas of club", "filename": "sport_football_articles_cx2q6x793lwo_1747813580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc65/live/63c552c0-b627-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2q6x793lwo_1747813580.html", "title": "Opinion - Dean Huijsen success testament to all areas of club - BBC Sport", "title_page": "Bournemouth news: Opinion - Dean Huijsen success testament to all areas of club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "They say you should never fall in love with a loan player. This season, the same might be said for our permanent signings too, as Dean Huijsen, after just one campaign at Bournemouth, is moving to Real Madrid for £50m.\nIt feels like yesterday that we watched the Cherries entertain Los Blancos in a pre-season friendly, a fixture boasting the likes of Cristiano Ronaldo, Luka Modric and Mesut Ozil. While the game itself was, perhaps aptly, a \"white-washing\", who knew that just over a decade later we would be supplying their stars of the future.\nAt the time we signed him, he was hotly tipped as a player of the future - tall, combative, comfortable with the ball at his feet, but also, someone who likes to get up the pitch and score goals too.\nWith a solid defensive partnership of Marcos Senesi and Illiya Zabarnyi, it was not really known what impact he would have during his first season, but everything changed when Marcos picked up an injury against Wolves in November.\nHuijsen lived up to the hype.\nWhen he leaves, Huijsen will have clocked up no more than 30 league appearances, meaning that, once Juve's sell-on fee is settled, he will have made Bournemouth £1m for each match he played.\nIn hindsight, it feels like £50m is a steal, but the fact is, how did we know how good he would end up being?\nHis success is testament to all areas of the club. For Bill Foley investing the money in the club, for our recruitment for finding him, and for Andoni Iraola - whose job has been remarkable.\nThere have not been many players who have been so influential in such a short time at AFCB, but Huijsen leaves the club with all Bournemouth fans fully behind him.", "url": "https://www.bbc.com/sport/football/articles/cx2q6x793lwo"}