{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:14", "date_modify": "2025-05-21 07:27:14", "date_publish": "2025-03-28 13:59:20", "description": "'I love the club & city' - Sven Sprangler's St Johnstone passion driving survival mission", "filename": "sport_articles_cpv4vknr7l1o_1747812434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/836c/live/3b897460-0bdc-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpv4vknr7l1o_1747812434.html", "title": "'I love the club & city'", "title_page": "'I love the club & city' - Sven Sprangler's St Johnstone passion driving survival mission - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Skipper Sven Sprangler's \"love\" for St Johnstone is fuelling his drive to keep them in the Premiership.\nThe Austrian midfielder has let Saints get under his skin since joining in September 2023.\n\"Since day one, I love to be part of the club, I love to be part of the city,\" Sprangler, 29, said.\n\"The training, the lads, the people around the club, everyone, I love them. Now it's like a family here, it's my second family.\n\"Everyone I know from the changing room is passionate about it. If we lose, everyone is disappointed, but if we win, it's so much better.\n\"Everyone loves to be here. Everyone gives everything for the gaffer, for the club, for the city.\"\nDespite Saints sitting five points adrift at the bottom with eight games remaining, Sprangler insists the squad are full of belief as they target victory at Hibs on Saturday.\n\"Everyone is positive. Everyone believes, and a lot of that comes from our training staff,\" he said.\n\"The gaffer brings so much energy to us and on every training session we give everything and we put every effort in to improve as players and as a team.\n\"We have the quality in our dressing room, and if we are doing the right things I still believe that everything is possible.\n\"I know what the lads are capable of, and everyone is still positive in the changing room.You see in every game the support from the fans, it's massive. Now we keep fighting until the end.\"", "url": "https://www.bbc.com/sport/articles/cpv4vknr7l1o"}