{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-05-21 07:51:33", "date_modify": "2025-05-21 07:51:33", "date_publish": "2025-02-07 19:24:13", "description": "Scottish FA head of referee operations Willie Collum highlights three mistakes made by officials during Scottish Premiership and Scottish Cup matches across January and the start of February", "filename": "sport_football_articles_c3rw20gz9wzo_1747813893.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b57/live/6a7f6020-e57d-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3rw20gz9wzo_1747813893.html", "title": "Willie Collum admits three VAR mistakes but stands by controversial Kilmarnock goal", "title_page": "Willie Collum admits three VAR mistakes but stands by controversial Kilmarnock goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scottish FA head of referee operations Willie Collum has highlighted three mistakes made by officials during Premiership and Scottish Cup matches across January and the start of February.\nSpeaking on the Scottish FA's VAR Review Show, external, Collum said Hearts should have had a goal disallowed for offside during their 3-2 victory over Kilmarnock last month, and St Mirren should have been awarded a penalty in last week's defeat by St Johnstone.\nHe also said Rangers midfielder Mohamed Diomande should not have been sent off during the Ibrox side's 3-1 win over Dundee United in January.\nRangers successfully appealed against Diomande's dismissal, which came after referee Nick Walsh stuck with his original decision despite a VAR review.\nHowever, Collum believes the decision to award Kilmarnock a controversial winning goal against Dundee United was the correct one.\nMarley Watkins challenged with United goalkeeper Jack Walton in the air to head home and the goal was given following a VAR review.\nThe Tannadice club contacted the SFA after the game to say they feel VAR continues to lead to \"inconsistent interpretations\" of the laws of the game.\n\"We support the decision,\" Collum said. \"There's not enough here for a foul on the goalkeeper.\n\"The Kilmarnock player makes inevitable contact with the Dundee Utd goalkeeper and it's not enough to be illegal contact. We believe the goal was right to stand.\"\nSt Mirren also contacted the SFA at the weekend after a call not to award a penalty for a foul on Elvis Bwomono.\nReferee Dan McFarlane said at the time that there was \"minimal contact if any\", and VAR Alan Muir agreed, opting not to send McFarlane to the pitchside monitor.\nCollum concedes that the match officials arrived at the wrong conclusion.\n\"This is not a normal footballing contact,\" he said. \"The defender goes to play the ball and trips up the attacker. This is a penalty kick.\"\nCollum disagreeing with the Diomande red card was unsurprising given it had already been overturned on appeal, but the VAR Review Show revealed the process by which referee Nick Walsh came to the decision.\nVAR Don Robertson sent Walsh to the monitor saying \"contact is negligible. I don't see excessive force or brutality\", but Walsh stuck by his original call.\nAfter watching replays of several angles, Walsh said: \"I see a slap towards the face so I'm going to put him off.\"\nCollum says his team of officials must now learn from the flawed process.\n\"We don't think it's a red card,\" he said. \"We agree with the VAR's viewpoint. We prefer a yellow card for this action.\n\"This incident doesn't have excessive force. When we call things wrong, we need to learn from them.\"\nMeanwhile, Elton Kabangu's opening goal against Kilmarnock came after the Hearts striker tussled with defender Joe Wright from a Craig Gordon goal-kick.\nNo foul was given, and Kabangu tucked home moments later following scuffed shots from Jorge Grant and James Wilson.\nHowever, officials missed that Kabangu was offside from the original long ball, and Collum says replays watched by VAR Andrew Dallas did not start early enough to spot the infringement.\n\"The foul or no foul is irrelevant,\" Collum said.\n\"The reality is that the attacking player is offside and then interferes and impacts his opponent's potential to play the ball. This should have been given as offside.\"", "url": "https://www.bbc.com/sport/football/articles/c3rw20gz9wzo"}