{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:51:55", "date_modify": "2025-04-26 07:51:55", "date_publish": "2025-02-25 14:47:25", "description": "Newcastle news: Are Magpies' 'hands tied' by PSR rules", "filename": "sport_football_articles_cr523mq7ervo_1745653915.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4a1e/live/7cc78d60-f384-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr523mq7ervo_1745653915.html", "title": "Newcastle news: Are Magpies' 'hands tied' by PSR rules", "title_page": "Newcastle news: Are Magpies' 'hands tied' by PSR rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Monday Night Club panel discussed PSR and the impact it is having on clubs like Newcastle.\n\"It must be so frustrating for Newcastle fans with these PSR rules,\" said former England goalkeeper Paul Robinson.\n\"They're the richest club in the world and the story every transfer window is: 'Oh, they have to sell Alexander Isak or Bruno Guimaraes.'\n\"They should be allowed to spend what other clubs have spent over the years. How are they going to close that gap quickly? They're not - they're going to have to balance the books.\n\"The squad that Eddie Howe wants is probably three or four windows away, but they have the money to do that now.\"\nThe Athletic journalist Rory Smith responded: \"I'd go the other way on the financial rules. I get it's frustrating for Newcastle, but I'm not convinced football should be decided by which team can attract the biggest country to back it.\n\"There is also the benefit that, if you're Arsenal, you probably can't sign Isak any more as it would put you at risk of breaking the rules.\n\"That makes Isak more likely to stay at Newcastle and there is a bigger spread of talent throughout the league.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr523mq7ervo"}