{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-04-26 03:56:23", "date_modify": "2025-04-26 03:56:23", "date_publish": "2025-03-04 15:10:38", "description": "Former captain Will Carling questions the quality and experience of England's current coaching set-up, suggesting it is preventing the team reaching their full potential.", "filename": "sport_rugby-union_articles_cdrx352jzkko_1745639783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/593c/live/fa1cc9e0-f908-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cdrx352jzkko_1745639783.html", "title": "Carling questions quality of England coaches", "title_page": "Six Nations: Will Carling questions quality of England coaches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former captain Will Carling has questioned the quality and experience of England's current coaching set-up, suggesting it is preventing the team reaching their full potential.\nEngland recovered from an opening-round defeat by Ireland with dramatic one-point wins over France and Scotland, but have still been criticised for their style of play so far in the Six Nations.\n\"We do have some talented players there's no doubt and maybe we're seeing a slightly restricted version of them,\" Carling told BBC Radio 4's Today programme., external\n\"You look at the calibre of the England coaching team and you have got to question whether that's the best we can put out there.\n\"Some of them are learning, some of them are very young and maybe lack the experience at Test level. Maybe that's what we're seeing impact on the players.\"\nEngland head coach Steve Borthwick is leading an international team for the first time, having previously worked as an assistant with England and Japan. He also led Leicester to the Premiership title in 2022.\nWhen he took charge of England, Borthwick recruited Richard Wigglesworth and Kevin Sinfield – both of whom are less than a decade into their coaching careers - from his Tigers backroom.\nDefence coach Joe El-Abd is working in international rugby for the first time and splitting his time between England and second-tier French side Oyonnax until the end of the season, while, at 33, scrum coach Tom Harrison is younger than hooker Jamie George.\nFelix Jones, who was part of the coaching team that won back-to-back Rugby World Cups with South Africa, left England's set-up in August after only seven months in his post. Jones has now returned to work with the Springboks once more.\n\"I still think we're way off the potential of this team and let's just hope we start seeing that,\" added Carling, who had a part-time mentoring role with England under Borthwick's predecessor Eddie Jones.\nEngland vice-captain Ellis Genge said last week former players such as Carling were \"out of touch\" in their criticism of the team, failing to give them due credit for turning around a run of six defeats in seven Tests earlier in the year.\n\"I wouldn't necessarily agree with him,\" Carling said. \"A lot of ex-players are hugely experienced and have a lot of knowledge.\n\"But I understand that when you're a current player you're highly sensitive.\n\"You're trying as hard as you can to win games [and] they've had a tough run. Let's be honest, we're talking a tough run for three or four years now. That's where players have to understand people will have opinions.\n\"I remember all these times we had some very ugly wins and you watch the reaction of the media and the fans.\n\"It is a bit frustrating but you have to take a deep breath and accept that's part and parcel of it.\"\nCarling captained England 59 times, leading them to three Grand Slams and a Rugby World Cup final during the 1990s.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cdrx352jzkko"}