{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 04:39:45", "date_modify": "2025-05-21 04:39:45", "date_publish": "2025-04-03 09:35:42", "description": "Chelsea vs Tottenham: Enzo Maresca on playing Reece James in midfield", "filename": "sport_football_articles_cly20pgj2l8o_1747802385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e4a/live/22d457b0-1068-11f0-a00a-3d3b1f8d6cd3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly20pgj2l8o_1747802385.html", "title": "Chelsea vs Tottenham: Enzo Maresca on playing Reece James in midfield", "title_page": "Chelsea vs Tottenham: Enzo Maresca on playing Reece James in midfield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea manager Enzo Maresca says the decision to play Reece James in midfield is part of a plan to protect him from injury.\nThe 25-year-old has been involved in all but two of Chelsea's past 11 games and is increasingly playing in midfield.\nHowever, his former manager Thomas Tuchel said he prefers Chelsea's club captain at right-back with legendary former defender John Terry echoing his words in an interview with BBC Sport.\nHowever, Maresca says that the midfield role is part of a wider strategy to keep James, who has had 15 injuries in five seasons, on the pitch.\n\"In terms of data, you can see that when a full-back plays in the way they used to play, up and down, they (do that) much, much, much more (often) than to go inside, covering a (bigger) distance, for the amount of times they go up and down,\" he said.\n\"So for sure that way that we are using James, in some games, can help him.\n\"Last year at Leicester we had Ricardo Pereira, that he potentially could be a top player for a top team, but because of his injuries... last year with us he played all the games, we changed a little bit and that works quite well.\n\"With James, it's working quite well. But I said already many times, Reece with us is playing right full-back, left full-back, midfielder - different positions.\n\"He's not the only one. We have more players that play in different positions. So we are happy and hopefully the way we are using Reece is helping him to be fit.\"\nMaresca also said that James is still not able to start a match every three days and is being carefully managed, adding: \"We try every day to have the medical staff speak with him to see how he is. If he is able to train, if he is good, if he is not good.\n\"To be honest, in the last weeks, he has been training every day. This is the reason why we are happy with that and we don't want him to force and to have another problem.\n\"When he's fit, he is an international player - without doubt.\"", "url": "https://www.bbc.com/sport/football/articles/cly20pgj2l8o"}