{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 12:52:09", "date_modify": "2025-05-20 12:52:09", "date_publish": "2023-08-03 11:00:13", "description": "After following Chelsea on their pre-season USA tour, BBC Sport's Alex Howell looks at how Mauricio Pochettino's side are shaping up.", "filename": "sport_football_66392081_1747745529.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8AC2/production/_130622553_poch.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66392081_1747745529.html", "title": "Are Mauricio Pochettino's Chelsea heading in the right direction?", "title_page": "Are Mauricio Pochettino's Chelsea heading in the right direction? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's been just over four weeks since Mauricio Pochettino took charge of Chelsea, starting a new era at Stamford Bridge.\nThe Blues won the first Premier League Summer Series - a pre-season tournament featuring Fulham, Aston Villa, Brighton, Brentford and Newcastle in the United States - and also faced Wrexham and Borussia Dortmund as part of their pre-season preparations.\nPochettino's side ended their US tour undefeated and will face Liverpool at home in their opening top-flight game on Sunday, 13 August.\nHere is what BBC Sport learned from following Chelsea, who look to get back to winning ways this season, on the tour.\nChelsea came to the USA with a squad of 29 that was mainly made up of young players. This number went up to 30 after the signing of 19-year-old Lesley Ugochukwu from Rennes.\nSince the club's £4.25bn takeover by American businessman Todd Boehly's consortium and the US private equity firm Clearlake Capital, Chelsea have looked to sign up young talent with huge potential - but this also led to Pochettino calling for \"more experienced\" players to add to the squad.\nEnzo Fernandes and Conor Gallagher are the only two senior players that Pochettino has to call on in midfield. They have been pursuing Brighton midfielder Moises Caicedo but that deal doesn't seem close to being completed.\nHowever, all is not negative. Andrey Santos, the Brazilian midfielder signed from Vasco da Gama in January, has impressed at the heart of midfield and started three of the five matches in the USA and could be an option for the squad.\nPochettino has said that he will cut his squad down from its enlarged size when they return to Cobham. A number of the young players will be sent on loan and there's the possibility of some - like Ugochukwu - being sent to Strasbourg, the Ligue 1 side who were purchased by the Blues' ownership group earlier this summer.\nIt's understood that Pochettino considers the ideal number of players in his squad to be 22 or 23, with young players from the academy stepping in to make up numbers and take their chances if and when needed.\nThat means with the club wanting as many as three new players - a defender, midfielder and attacker - there's going to be a lot of transfer activity at Chelsea before the window closes.\nChelsea did manage two big signings before the USA tour - and they have quite possibly been the players of tour.\nChristopher Nkunku, 25, a £52m signing from RB Leipzig, and 22-year-old Nicolas Jackson from Villarreal have been brought in to try to get the goals flowing again.\nThe side only managed 38 goals during the last Premier League season and Pochettino will be optimistic that things can be better this time out, although there is a concern about Nkunku, who limped off with a knee injury against Borussia Dortmund.\nNkunku has scored three goals in his five pre-season appearances and has also played in a number of different positions. He has scored all of his goals while playing as a number nine and his calm finishing has been noticeable. He has seemed to take every chance that has come his way.\nHis versatility and ability to play in the number 10 role or on either wing means he can be partnered with Jackson, something Pochettino tried again against Dortmund.\nSenegal forward Jackson scored 13 goals in 38 appearances for Villarreal last season, including nine in their final eight league games, and was close to joining Bournemouth in January.\nIn the USA, he took to the Chelsea team seamlessly, scoring two goals and getting three assists.\nHe is excellent at holding the ball up, good at running in behind defences and, as well as his goals, he seems able to pick the right pass in the final third.\nPochettino challenged the younger players to take the opportunity to prove they should be part of his squad for next season and some of them have definitely done that.\nDefender Bashir Humphreys, 20, started three matches and looked very comfortable when called upon. Pochettino and his staff were aware of Humphreys and his potential and have watched clips of his performances while he was on loan at Paderborn in Bundesliga 2.\nDutch under-21 international Ian Maatsen and 19-year-old Brazilian midfielder Andrey Santos have been mentioned already but both of those players look like they could be in serious contention to be part of the first-team plans.\nItalian Cesare Casadei, fresh from the Under-20 World Cup, where he won the Golden Ball and Golden Boot as Italy lost in the final to Brazil, has also played a lot of minutes for the first team.\nThe 20-year-old looks physically ready to deal with Premier League football and has shown plenty of examples of powerful running from deep in midfield.\nHowever, when put under pressure by Fulham in the game in Washington, he was caught in possession in dangerous areas, so maybe he would benefit from a spell on loan away before competing in the Premier League.\nIn North Carolina, during the open training session, Pochettino stood in the middle of the pitch telling his players exactly where and what he wanted from them.\nThat continued throughout this pre-season campaign and Chelsea have played with a defined 4-2-3-1. The players have swapped positions but the high energy and high working play is the same whoever is in the side.\nPochettino said after the match against Dortmund that he played a side he thinks could potentially play the first game of the Premier League season.\nAlthough there is still a lot of work to do, he will be pleased with finishing pre-season undefeated, having won the Premier League Summer Series and he leaves the USA with his squad pushing in the right direction.", "url": "https://www.bbc.com/sport/football/66392081"}