{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-19 15:21:27", "date_modify": "2025-05-19 15:21:27", "date_publish": "2015-03-02 17:37:31", "description": "A bookmaker loses thousands of pounds in a betting scam, where bets are placed on games that never happen.", "filename": "sport_football_31692786_1747668087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81345000/jpg/_81345269_pitch.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31692786_1747668087.html", "title": "'Ghost games' betting scam costs bookie thousands of pounds", "title_page": "'Ghost games' betting scam costs bookie thousands of pounds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A bookmaker has lost thousands of pounds in a betting scam, where bets are placed on games that never happen.\nIsle of Man-based Celton Manx, who operate Sbobet, paid out on FC Slutsk's 2-1 'friendly win' against fellow Belarus side Shakhter Soligorsk, external.\nBut the match did not take place, and both clubs say they were unwitting victims of a \"ghost game\".\n\"We got a statement that the game took place, so we paid out,\" said Celton Manx executive director Bill Mummery.\nThe statement, in Russian, was supposed to have come from FC Slutsk but both Belarusian Premier League clubs have denied any involvement in the fixture to the Belarus FA, who have reported the matter to the police and Uefa.\nBelarus police are also investigating a complaint from Shakhter, claiming that their website and mailbox had been hacked.\n\"There are not a lot of so-called ghost games going on to my knowledge,\" said Kevin Carpenter, a sports lawyer at Hill Dickinson who specialises in regulatory and integrity matters. \"We are only just starting to scrape the surface of the extent of what is going on with the help of betting monitoring organisations and the input of global bodies such as Interpol (International Criminal Police Organisation), but I would say match-fixing is a much bigger issue.\"", "url": "https://www.bbc.com/sport/football/31692786"}