{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:08:25", "date_modify": "2025-05-19 15:08:25", "date_publish": "2015-02-23 10:27:07", "description": "Coventry City sack manager Steven Pressley, placing Neil MacFarlane and Dave Hockaday in temporary charge.", "filename": "sport_football_31587140_1747667305.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81177000/jpg/_81177456_454700200.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31587140_1747667305.html", "title": "Coventry City: Steven Pressley sacked by struggling Sky Blues", "title_page": "Coventry City: Steven Pressley sacked by struggling Sky Blues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City have sacked manager Steven Pressley after almost two years in charge of the Sky Blues.\nPressley's assistant Neil MacFarlane and professional development coach Dave Hockaday, who arrived only three weeks ago, have been put in temporary charge.\nCoventry have slipped into the League One relegation zone, having failed to win any of their last seven matches.\n\"It was very difficult from a personal and professional point of view,\" said chief executive Steve Waggott.\n\"But results over recent weeks and months, and our precarious position in the league table, means that a change of direction at first team level is needed.\"\nThe final game of 41-year-old Pressley's 100 in charge came at Bramall Lane on Saturday when, despite playing against 10 men for most of the game, City allowed Sheffield United to score twice in the final 11 minutes to earn a 2-2 draw.\nThe former Rangers, Dundee United, Hearts, Celtic and Scotland centre-half left Falkirk to take over at City in March 2013 following the resignation of Sky Blues predecessor Mark Robins to join Huddersfield.\nPressley was contractually tied to the Sky Blues until 2018, having signed an initial three-and-a-half-year deal before having that extended to a new four-year agreement in September 2014.\nThe new contract was signed in a mood of euphoria that followed City's return to the Ricoh Arena, but that mood has changed in recent months - and home gates have fallen to below 7,000.\nFor the majority of his time in charge, Pressley was generally viewed by fans as a popular, engagingly frank character, who motivated his team well in adversity, but had to contend with the distracting backdrop of the club's off-field woes.", "url": "https://www.bbc.com/sport/football/31587140"}