{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:17", "date_modify": "2025-05-20 13:28:17", "date_publish": "2023-07-25 00:00:00", "description": "Watch live coverage and follow text updates as Scotland face Austria in the men's T20 World Cup Europe qualifier in Edinburgh.", "filename": "sport_live_cricket_66150335_1747747697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1682A/production/_130420229_capture.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66150335_1747747697.html", "title": "T20 World Cup Europe qualifier: Scotland v Austria", "title_page": "T20 World Cup Europe qualifier: Scotland v Austria - watch & live text - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye for now\nScotland beat Austria by 166 runs\nThat's all from us today, thanks for your company.\nWe'll be back on Thursday for Scotland's clash with Denmark - see you then!\n'Relaxed but professional' environment helping Scotland\nScotland beat Austria by 166 runs\nGeorge Munsey also gave a few words after he blasted 132 from 61 balls - a new Scottish record:\n\"Oli [Hairs] set the standard with the way he batted yesterday, and it was nice to get a few more than him today,\" Munsey said.\n\"It's going to be a tough ask [to beat Oli's 40-ball hundred], but I'll try! It's really chilled, we've had a good environment for a long time now. It's relaxed but professional at the same time, and that's key.\n\"Different players are standing up with match-winning performances. When you've got full belief in the guys that are here, that's what happens. We're in a good place.\"\n'A complete sense of enjoyment'\nScotland win by 166 runs\nTomas Mackintosh made his T20 debut for Scotland today, and spoke to me about the experience post-match:\n\"Very good fun,\" he said. \"Watching the past couple of days and seeing the boys go about it, so to join in today was very special indeed.\n\"It's a complete sense of enjoyment, and that reflects on performance - George [Munsey] today, Oli [Hairs] yesterday.\n\"For me, just keep working hard, and if the opportunity comes around then see what I can do, and hopefully put my name forward for the coming games.\n\"Mum and Dad were here today, and it's always special to have them around.\"\nWICKET Wikesekera c Berrington b Main 6\nAustria 24-3 (target 233)\nNivan Wijesekera never looked comfortable out there, and one ball after being hit, pops a leading edge to Richie Berrington at cover.\nThe field for the new batter isn't one you often see in T20 cricket - a slip and a short-leg to keep the Austrian pair company.\nGeorge Munsey is the man under the lid - clearly a record-breaking century doesn't make you exempt from that job.", "url": "https://www.bbc.com/sport/live/cricket/66150335"}