{"authors": ["Jude McCann", "www.facebook.com"], "date_download": "2025-05-21 07:28:38", "date_modify": "2025-05-21 07:28:38", "date_publish": "2025-01-30 22:32:11", "description": "Holders England survive Junior Kpoku's 20-minute red card to defeat Ireland in the Under-20s Six Nations opener 19-3 in Cork.", "filename": "sport_rugby-union_articles_cr7ele0nldpo_1747812518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a49f/live/db9e7b00-df57-11ef-88f5-9fd60bc5cfdc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cr7ele0nldpo_1747812518.html", "title": "Holders open title defence with win - BBC Sport", "title_page": "Under-20 Six Nations - Ireland 3-19 England: Holders open title defence with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holders England survived Junior Kpoku's 20-minute red card to defeat Ireland in the Under-20s Six Nations opener 19-3 in Cork.\nBack row Kpoku was sent off in the 15th minute for a high tackle on Eoghan Smyth, but England held a 9-3 lead at half-time despite losing captain Tom Burrow to the sin-bin.\nRestored to their full complement, England were awarded a penalty try in the 68th minute and Ben Coen's fourth penalty of the game handed the visitors a comfortable win.\nIt is a strong start to England's bid to win back-to-titles, while it is a first home defeat for Ireland in the U20 Six Nations since 2018.\nIreland had dominated possession but England led through Benjamin Coen's penalty before Kpoku was dismissed for a high tackle on Smyth.\nThe Racing 92 back row became the first player to receive a 20-minute red card in the championship under the new rules that have been implemented by World Rugby.\nBurrow then was shown a yellow card for slapping the ball out of the hands of Clark Logan at the breakdown, but the visitors extended their lead through another penalty by Exeter Chiefs fly-half Coen.\nIreland, who struggled to capitalise on their numerical advantage, got on the board through Sam Wisniewski's penalty, but another effort from Coen gave England a 9-3 lead at the break.\nIn tricky conditions that led to numerous handling errors from both sides, it was a low-scoring second half.\nThe decisive blow came with 12 minutes to play when England's maul roared over the Irish line and French referee awarded a penalty try after consulting with his TMO.\nTo add insult for injury for Ireland, replacement Osin Minogue was sent to the sin-bin.\nThe hosts pressed for a response but were unable to find a clinical touch in England's 22, and Coen's late penalty moved the visitors 16 points clear with two minutes remaining.\nIreland's night was summed up in the final play of the game as Charlie Molony looked to cross for a consolation score in the corner but player of the match James Kane tackled the full-back into touch.\nNeil Doak's Ireland will look to bounce back away to Scotland in their second fixture, while England will take on France at the Rec.\nIreland Under-20s: Charlie Molony; Derry Moloney, Connor Fahy, Eoghan Smyth, Ciaran Mangan; Sam Wisniewski, Clark Logan; Alex Usanov, Henry Walker, Alex Mullan, Mahon Ronan, Billy Corrigan; Michael Foy, Bobby Power, Eanna McCarthy (capt).\nReplacements: Connor Magee, Billy Bohan, Tom McAllister, David Walsh, Oisin Minogue, Andrew Doyle, Gene O'Leary Kareem, Daniel Green.\nEngland Under-20s: Jack Kinder; Jack Bracken; Angus Hall, Nic Allison; Charlie Griffin; Benjamin Coen, Archie McParland; Ralph MacEachran, Kepu Tuipulotu, Vilikesa Sela; Olamide Sodeke, Tom Burrow (capt); Junior Kpoku, Henry Pollock, Kane James.", "url": "https://www.bbc.com/sport/rugby-union/articles/cr7ele0nldpo"}