{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:34:53", "date_modify": "2025-05-20 13:34:53", "date_publish": "2023-08-01 18:01:17", "description": "Sheffield United: Heckingbottom reacts to Ndiaye sale", "filename": "sport_articles_cm5jx3y0852o_1747748093.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7dd6/live/8c3f0f20-3094-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cm5jx3y0852o_1747748093.html", "title": "Sheffield United: Heckingbottom reacts to Ndiaye sale", "title_page": "Sheffield United: Heckingbottom reacts to Ndiaye sale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United manager Paul Heckingbottom says he has been told the proceeds from the sale of Iliman Ndiaye will be fully reinvested into his squad.\nThe Blades accepted a bid from Marseille for the striker on Tuesday and speaking to BBC Radio Sheffield in the aftermath, Heckingbottom said: \"Prince Abdullah has said that to me that we’ll put it all back in the squad so that’s great.\n\"It’s pointless trying to replace Iliman so the thing what we have to do is replace him with players who do other things better than him.\n\"How he played was great, what he gave us was great but we were still working on lots of things in his game. So I think it’s important the money goes straight into the squad and we make sure that we get the most competitive team that we can.\"\nHeckingbottom says he does not feel let down by Ndiaye's decision and understands the 23-year-old's desire to play for his boyhood club.\nNdiaye spent part of his youth career with Marseille before finding consistency with the Blades, scoring 14 league goals on their way to promotion last season.\n\"Iliman turned down vast amounts of money last January to stay with us and help us get promoted so it’s not about the money,\" Heckingbottom added.\n\"It’s about the opportunity he had to play for his boyhood club which is his dream.\n\"The only difference is we could’ve not sold him and run the risk of him leaving on a free transfer next season. We know that the situation we’re in with the finances is a bit sticky. Listen if we were further down the line and, let’s be honest, someone you’ve got in the club for zero money, you work your socks off with him for three years and end up making millions on him, that’s the business.\n\"That’s what we want to do. Unfortunately for us and me, my job is to try and, while developing players, get the most competitive team on the pitch and in this instance it doesn’t go hand in hand.\"", "url": "https://www.bbc.com/sport/articles/cm5jx3y0852o"}