{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:55", "date_modify": "2025-05-21 05:29:55", "date_publish": "2025-01-31 18:01:40", "description": "Coventry City sign Swansea City midfielder Matt Grimes for an undisclosed fee.", "filename": "sport_football_articles_ceve87elpeno_1747805395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/42b5/live/bd250f90-dffc-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ceve87elpeno_1747805395.html", "title": "Matt Grimes: Coventry City complete deal for Swansea City midfielder", "title_page": "Matt Grimes: Coventry City complete deal for Swansea City midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City have completed the signing of Swansea City midfielder Matt Grimes for an undisclosed fee on a three-and-a half-year deal.\nDevon-born Grimes, 29, began his career with Exeter City and joined Swansea when they were a Premier League side in 2015.\nHe had loans with Blackburn Rovers, Leeds United and Northampton Town, but has been a Swansea fixture in recent seasons, taking his tally to 333 appearances for the club.\nIt took three separate bids from Championship play-off hopefuls Coventry to get their first January move done - boss Frank Lampard's first signing.\n\"I've admired him for a long time,\" Lampard told BBC CWR. \"He's one of the best midfield players in the league.\n\"Good experience, technical ability. He understands the league.\n\"He feels like a leader in the dressing room already so we're very pleased to have him with us.\n\"It's always a balance in the team to try and have experience within it. People who know what it takes can help the younger players alongside them to improve and help us improve.\n\"Most strong teams have that nice blend of youth and experience. We have a bit of that already but it's nice to have brought in more experience.\"\nGrimes has started all Swansea's last 88 Championship matches - a record going back to early March 2023.\n\"It's a testament to how he looks after himself and his robust nature to be able to do that,\" said Lampard. \"He's done that for quite a long time. He's a regular player so obviously we hope that continues with us.\"", "url": "https://www.bbc.com/sport/football/articles/ceve87elpeno"}