{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:09", "date_modify": "2025-05-21 04:34:09", "date_publish": "2025-04-04 19:31:32", "description": "Wrexham 'focused on what's at stake'", "filename": "sport_football_articles_c74n5910g7jo_1747802049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e5f/live/75f281a0-116d-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74n5910g7jo_1747802049.html", "title": "Wrexham 'focused on what's at stake'", "title_page": "Wrexham 'focused on what's at stake' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham players do not need reminding of what's at stake during the final month of the League One season, says manager Phil Parkinson.\nThe Dragons are second in the table – an automatic promotion spot – and host Burton Albion at home after winning 2-0 at Exeter City last Saturday and drawing 2-2 at Cambridge United in midweek.\n\"I don't think we need to address what's at stake,\" Parkinson told BBC Sport Wales.\n\"I think everybody knows but it's all about the focus on what's required.\n\"Overall the four points from the two away games is a good return and it readdresses the balance we've had between away games and home games.\n\"Now we've six to go – three at home and three away left.\"\nBurton's squad features three players who joined the club from Wrexham during the season – midfielder James Jones, wing-back Anthony Forde and forward Jón Dadi Bödvarsson.\nFleur Robinson returned to Burton as chief executive in the summer after working in the same role at the Stok Racecourse after being appointed by owners Ryan Reynolds and Rob McElhenney.\n\"We welcome those lads – a couple of them have been injured – back to Wrexham and obviously Fleur as well,\" Parkinson added.\n\"I worked closely with Fleur for three years so it will be nice to see Fleur.\n\"But of course our focus is on our performance level and what we need to do.\"", "url": "https://www.bbc.com/sport/football/articles/c74n5910g7jo"}