{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:37:12", "date_modify": "2025-05-21 03:37:12", "date_publish": "2025-04-08 00:00:00", "description": "England want to \"get revenge on ourselves\" for their last visit to Belgium, as they return to Leuven in the Women's Nations League.", "filename": "sport_football_live_cql65rrn619t_1747798632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec9a/live/fbbccaf0-14b7-11f0-8a1e-3ff815141b98.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cql65rrn619t_1747798632.html", "title": "England suffer humbling defeat by Belgium after poor display", "title_page": "England suffer humbling defeat by Belgium after poor display - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's positive momentum was stopped abruptly with defeat by Belgium following a poor performance in Leuven, despite a stunning debut goal from teenager Michelle Agyemang.\nThey were carved apart defensively, conceding three goals in an opening half to forget, just days after they had beaten the same opponents 5-0 in the first game of this Women's Nations League double-header.\nStriker Tessa Wullaert, returning from injury for Belgium, scored either side of Justine Vanhaevermaet's looping header to give the hosts a 3-0 lead.\nEngland got one back shortly before half-time through Beth Mead's penalty, after she was brought down by Davina Philtjens in the box.\nDebutant Agyemang, brought on as a substitute late on, scored a stunning volley within seconds of coming on in a moment that deserved to have come in better circumstances.\nThe 19-year-old's goal will be spoken about for weeks to come - but England had left themselves too much work to do in the second half and it made little difference.\nForward Agyemang, who has been playing for Brighton this season on loan from Arsenal, had been brought into the squad on Sunday as the Lionesses were without several key players through injury.\nThat showed, as with three months to go until they attempt to defend their European title in Switzerland, this was a humbling result.\n\"As a team, we had to do things better. It's April now, I'm not concerned,\" said manager Sarina Wiegman.\n\"Although this doesn't feel good, this is a huge learning curve for us. They actually played as we expected. We have to step up and do better.\n\"On Friday, even though it was 5-0, we knew it would be totally different. It will help us in the future. Of course it doesn't feel nice now.\"\nEngland will look to bounce back in May when they host Portugal, before travelling to world champions Spain - who overtook them at the top of their Nations League group on Tuesday with a 7-1 thrashing of Portugal.\nIt was a horrible opening 45 minutes from England and when the half-time whistle went, having conceded three goals, captain Leah Williamson was hurrying her team-mates down the tunnel.\nThe centre-back had been in intense conversations with manager Wiegman, and fellow defenders Millie Bright and Niamh Charles, prior to Mead's penalty as they attempted to address their glaring issues.\nBelgium were relentlessly direct, pinging balls over the top and exploiting space left in behind - and England failed to respond.\nGoalkeeper Hannah Hampton - who has nudged ahead in the battle for the number one spot - could do very little about any of the goals her side conceded.\nWullaert was given a free run on goal for the opener and was a few yards out when the cross came in for her second, after Vanhaevermaet's brilliant header had looped over Hampton.\nThe sight of Wullaert on the teamsheet was an unwelcome one for England as she was missed by Belgium in their defeat on Friday, and made an instant impact on her return from injury in Leuven.\nWiegman had to respond and she did not waste time, hooking defenders Charles and Bright off at half-time, and bringing on Agyemang, Fran Kirby and Ella Toone to add more attacking threat later on.\nIt did have an impact as Toone came close when she sent an effort just past the far post, after Williamson's long-range effort had been tipped over the bar.\nAgyemang's introduction was miraculous and she played with confidence for the final 10 minutes, but Belgium did enough to hold on to their lead.\n\"It's disappointing for her. She was great, came in and did really well. I thought she scored an incredible goal,\" added Wiegman.\n\"The composure she had and the calmness... It was really incredible. We do have to celebrate that a little bit for her.\"\nIt became scrappy and tense as England threw everything at the hosts - referee Maria Sole Ferrieri Caputi handing out seven yellow cards in total - and the crowd became more raucous.\nBut while there were significant improvements for England in the last half-hour, this performance fell well below expectations and they cannot afford to be so sloppy in Switzerland this summer.", "url": "https://www.bbc.com/sport/football/live/cql65rrn619t"}