{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:38:10", "date_modify": "2025-05-20 13:38:10", "date_publish": "2023-08-01 15:12:44", "description": "Coach Alex Pinninger hails Norfolk swimmer Jessica-Jane Applegate's S14 200m gold at the Para Swimming World Championships.", "filename": "sport_disability-sport_66374535_1747748290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9E7A/production/_130607504_jja_still.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66374535_1747748290.html", "title": "Jessica-Jane Applegate: Coach hails 'phenomenal' 200m gold 10 years after her first", "title_page": "Jessica-Jane Applegate: Coach hails 'phenomenal' 200m gold 10 years after her first - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coach Alex Pinninger has hailed Jessica-Jane Applegate's \"phenomenal\" second S14 200m freestyle title at the Para Swimming World Championships.\nThe 26-year-old from Norfolk regained the title she first won a decade ago.\nAnd she is now setting her sights on Paris 2024 as she looks to add to her collection of seven Paralympic medals.\n\"I am really proud - she had a difficult winter with injury and things to work through,\" Pinninger told BBC Radio Norfolk.\n\"She looked comfortable but it was a very tough and competitive race and a lot of the swimmers were in the mix in the last 50 - it really was anyone's (race).\n\"She last won that event 10 years ago in Montreal, in Canada, so to reclaim that 200 free title 10 years later is a phenomenal achievement.\"\nApplegate's victory was all the more satisfying after several months of back problems and she clocked 2 mins 9.09 to beat Bethany Firth by almost a second.\n\"They've been racing each other for the past 13 years, it's a fantastic rivalry. They're always having great races and hopefully it'll be (the same for) a good few years to come,\" said Pinninger.\nThey will now take time to review how the season has gone but he said that Paris was \"very much on the agenda\" for Applegate, who won gold in the same event in London 11 years ago and another in the 4x100m relay in Tokyo in 2021.\nPinninger said she was still waiting to find out whether she would take part in the relay in Manchester this week.\n\"It's not something we prepared for, or something that we expected. Because of Jess' injury, the trials didn't quite go as planned,\" he added.\n\"She didn't qualify for the relay by right, but her swim (in the 200m) was so good, maybe she's in contention for one of the relay places, so we'll have to see.\n\"We take a slightly different approach in our programme in Norwich. We're not looking for swimmers to swim as much as possible, we're looking for them to swim the right amount - the right amount of training and the right amount of competition.\n\"But Jessica is used to busier schedule than she's got this week so she'll be able to more than cope with some relay swims.\"", "url": "https://www.bbc.com/sport/disability-sport/66374535"}