{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:37", "date_modify": "2025-05-21 06:08:37", "date_publish": "2025-03-31 11:28:01", "description": "Preston 0-3 Aston Villa: Villa fans' verdict on the FA Cup tie", "filename": "sport_football_articles_cvge4xv9054o_1747807717.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvge4xv9054o_1747807717.html", "title": "Preston 0-3 Aston Villa: Villa fans' verdict on the FA Cup tie", "title_page": "Preston 0-3 Aston Villa: Villa fans' verdict on the FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Aston Villa's victory over Preston in the quarter-finals of the FA Cup.\nHere are some of your comments:\nIan: Very solid performance and got through a tricky tie on paper fairly comfortably and bonus with Rashford scoring his first Villa goals. Could and should have doubled the score in second half - can we dare to dream yet?\nTracey: Absolutely brilliant. Good for Rashford to score two goals and to get man of the match just sums it all up. Keep up the good work and let's hope that we can keep the two loanees permanently. They will be well worth the money.\nMalcolm: A solid performance from Villa. Preston had a good first half, missing the game's best chance but Villa dominated the second half with two goals at last for Marcus and a cracker from Jacob Ramsey.\nTrevor: Villa were lacklustre in the first half. Feel sure they should have started with Ollie Watkins and left Boubacar Kamara out. Enough talent in that starting line-up to cope in midfield against Preston and only one team was ever going to win this game. They will though need four in midfield against a quality Crystal Palace side. Anything less and Palace will win easily. Sorry boss, that's how I see it.\nDave: Thought it was a well measured, patient performance. The first half was holding possession and not doing anything stupid, the second half was turning the screw on a plucky opponent. Job done.", "url": "https://www.bbc.com/sport/football/articles/cvge4xv9054o"}