{"authors": ["Ben Ashton", "www.facebook.com"], "date_download": "2025-05-21 05:05:10", "date_modify": "2025-05-21 05:05:10", "date_publish": "2025-04-04 07:22:32", "description": "BBC Sport takes a look at the key EFL talking points with five of the top six teams in the Championship in action at 12:30 BST on Saturday.", "filename": "sport_football_articles_c99pr8vy0zdo_1747803910.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33cc/live/972b6590-10a4-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99pr8vy0zdo_1747803910.html", "title": "EFL preview: Stakes are high in lunchtime football feast", "title_page": "EFL preview: Stakes are high in lunchtime football feast - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "April is here and many sides across the EFL will be hoping any showers do indeed lead to flowers in May.\nWith just a handful of games remaining, we've reached the crucial stage of the season where all three divisions really spring to life.\nBlackburn and Middlesbrough kick proceedings off with an important clash in the Championship play-off race on Friday night.\nThat contest serves as an appetiser for what's to come on Saturday, which promises to be another pivotal day. Here are the biggest talking points ahead of this weekend's action.\nWhat a set of fixtures the Championship has thrown up at 12:30 BST with a huge amount riding on them for five of the six teams in action.\nAutomatic promotion-chasing Leeds United travel to relegation battlers Luton Town for a contest with permutations at both ends of the table.\nThe Whites will be keen to set aside any Groundhog Day fears with just one win in five (D3 L1) seeing them slip to second, two points behind leaders Sheffield United.\nLeeds fans won't need reminding that Daniel Farke's side dropped 16 points from a possible 24 in the run-in to miss out on the top two last season, but the German manager says he is \"100% convinced\" his side will be in the Premier League next season.\n\"This team, I know how tight they are together and they have the right mentality,\" Farke told BBC Radio Leeds.\n\"Of course at this stage of the season, you can't guarantee you will finish in the top two because the race is so tight.\n\"I still think we have a chance but if not, the play-offs, so I am 100% convinced that we will play in the Premier League. There is not one doubt in my head.\"\nPerhaps one of the most notable talking points ahead of the game is that goalkeeper Illan Meslier, who has made a number of costly errors this season, is set to be dropped for Karl Darlow.\n\"We all know Illan's had a difficult season so far, you have to be honest,\" Farke said. \"Right now, it was a decision I feel I had to make and to protect him a little bit.\"\nThe Hatters are three points adrift of safety in 23rd but are undefeated in their past three (W2 D1) to boost their survival hopes.\nBurnley, who are level on points with Leeds and only behind in third place on goal difference, visit play-off hopefuls Coventry City as Scott Parker and Frank Lampard meet as head coaches 20 years on from when they played at Chelsea together.\nThe Clarets are unbeaten in 26 league matches and have won 16 of those (D10), conceding just five goals in the process.\n\"We are absolutely excited about where we've put ourselves, the race we're in and we've done that through the quality we have and hard work,\" Burnley boss Parker told BBC Radio Lancashire.\n\"We will attack this like we have every part of the season with absolute full commitment. We're going to give absolutely everything to try and be successful this year.\"\nThe Sky Blues have lost two games in three for the first time since December but their fate remains in their own hands as they sit fifth, two points clear in the race for a top six finish.\nSunderland look all but guaranteed to finish fourth and reach the play-offs but for their hosts West Bromwich Albion, it's all still on the line - literally in terms of the top six cut-off.\nThe Baggies have won just two of their previous eight (D4 L2) but remain sixth, though only ahead of both Middlesbrough and Bristol City on goal difference.\nTony Mowbray's side could also be outside the play-off spots by the time they kick-off should Boro avoid defeat at Ewood Park on Friday.\nWith Birmingham seemingly marching towards the League One title, it has been a two-horse race for the remaining automatic promotion spot between Wrexham and Wycombe for some time.\nBut Charlton are making quite the surge to close in and now trail second spot by just six points, while Stockport are only one point further back.\nThe Addicks were 14th when they drew 0-0 at home to Mansfield on 14 December but 15 wins from 21 games since then, including nine straight victories at The Valley, has propelled them into contention and Nathan Jones' side will look to make it 10 in a row on home soil when they welcome Lincoln.\n\"It's all about us, we have to keep trying to win games, trying to get three points,\" Jones told the club website, external after the 2-1 win at Mansfield on Tuesday.\n\"There is a relentlessness about others as well so all we have to do is set our own tempo and see where we are.\"\nCounty, who have won three of their past four and 10 of their previous 15 matches, visit Exeter City.\nDerby have strung an excellent run of form together at just the right time to boost their survival hopes in the Championship and moved out of the bottom three with a 2-0 win over Preston in midweek.\nThat victory made it four wins in a row for John Eustace's side, which the first time the Rams have done so since March 2024 when they were in League One - and a first such run in the second tier since July 2020.\n\"I'm very proud of the football club, the players, the staff, the fans,\" Eustace told BBC Radio Derby.\n\"It's a huge effort, not down to any individual. It's important that we don't get too carried away. It makes no difference if we're out the bottom three [now].\n\"We want to be out of the bottom three after the last game of this season. That's all I'm worried about.\"\nSwansea are without a win in three (D1 L2) and are among any one of 10 teams who could still yet go down and will be dragged right back into the relegation mix should they suffer defeat.\nThe battle for promotion and the play-off spots in League Two really is quite astonishing with as many as 12 teams arguably still in the mix.\nAs if there wasn't already enough happening in the EFL world on Saturday lunchtime, League Two leaders Walsall welcome third-placed Port Vale.\nThe Saddlers are without a win in eight (D6 L2) and hold a narrow two-point advantage over Bradford in second and Vale, who have won four of their past five, and will go top with victory before the games at 15:00 BST.\nIf that happens, it will be the first time for 119 days Walsall have not been at the summit of the fourth tier.\nDoncaster had the League Two title in their own hands before Walsall equalised in their 2-2 draw on Tuesday - a goal which left Rovers fifth with a game in hand and three points off the top three before their trip to Cheltenham.\nElsewhere, Bradford host play-off chasing Crewe and another top of the table clash sees Notts County travel to Colchester, while AFC Wimbledon welcome Harrogate and Grimsby take on Morecambe.\nHigh stakes, indeed.", "url": "https://www.bbc.com/sport/football/articles/c99pr8vy0zdo"}