{"authors": ["Chris Collinson", "www.facebook.com"], "date_download": "2025-05-21 04:20:02", "date_modify": "2025-05-21 04:20:02", "date_publish": "2025-04-05 15:21:21", "description": "Liverpool news: The stats behind Liverpool's Premier League lead", "filename": "sport_football_articles_c14x037kjvpo_1747801202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ee4/live/c9bc6570-1231-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c14x037kjvpo_1747801202.html", "title": "Liverpool news: The stats behind Liverpool's Premier League lead", "title_page": "Liverpool news: The stats behind Liverpool's Premier League lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "To those suggesting Liverpool have not been that great this season, they are the 13th-best team in Premier League history after 30 games and only eight teams have taken more points at this stage in a season.\nThe Reds are also just the fifth team to record 73 points after 30 games. Weirdly, only one of those previous four teams went on to win the Premier League title, although none of them had bigger than a three-point lead at any stage.\nArne Slot's side have also recorded the fifth-biggest lead after 30 Premier League games, sitting 11 points clear at the top of the table.\nThe biggest lead that has ever been overturned after 30 games is just three points - with Newcastle United in 1995-96, Manchester United in 2011-12 and Arsenal in 2022-23 all having a three-point lead at this stage of the season and not going on to win the title.\nIt is also unusual for a team to have a 10-point plus lead with points in the low 70s, but it is not unprecedented. Manchester United won a one-horse title race in 2000-01 (70 points with a 16-point lead) and Manchester City did the same in 2020-21 (71 points with a 11-point lead).", "url": "https://www.bbc.com/sport/football/articles/c14x037kjvpo"}