{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-20 13:56:45", "date_modify": "2025-05-20 13:56:45", "date_publish": "2023-07-31 05:44:51", "description": "Zambia secure first Women's World Cup win by edging out Costa Rica in their final Group C match.", "filename": "sport_football_66357996_1747749405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3DCB/production/_130591851_gettyimages-1582313400.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66357996_1747749405.html", "title": "Costa Rica 1-3 Zambia: Women's World Cup debutants Zambia record first win", "title_page": "Costa Rica 1-3 Zambia: Women's World Cup debutants Zambia record first win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Zambia secured their first Women's World Cup win by edging out Costa Rica in their final Group C match.\nLushomo Mweemba opened the scoring for Zambia inside the first three minutes and Barbra Banda added a second from the spot midway through the first half.\nCosta Rica's Melissa Herrera pulled a goal shortly after the break, but Racheal Kundananji completed the win, netting a third in injury time.\nBoth sides had already been eliminated after two matches.\nZambia had lost 5-0 against both Japan and Spain, but their campaign at least ends on a high.\nThey made a brilliant start in Hamilton as Mweemba scored their first World Cup goal, volleying home Avell Chitundu's corner after two minutes and 11 seconds.\nSkipper Banda doubled their advantage from the spot - the 1000th goal in the Women's World Cup - after her shirt was pulled by Katherine Alvarado in the penalty area.\nCosta Rica, who were also chasing a first World Cup win in just their second tournament, rallied and struck the crossbar through Maria Paula Coto just before the break.\nAfter the restart Amelia Valverde's team halved the deficit with Herrera nodding in Valeria del Campo's header across goal.\nAn equaliser seemed inevitable with Zambian keeper Catherine Musonda catching Priscilla Chinchilla in the box, but a lengthy video assistant referee review ruled out a penalty kick due to an offside in the build-up.\nHerrera then found the net for a second time midway through the second half, but her strike from a tight angle was ruled out for offside.\nWith Costa Rica pushing for an equaliser, Banda's disguised pass sent through substitute Kundananji who sealed a famous win.\nZambia finished third in Group C, ahead of Costa Rica in fourth.", "url": "https://www.bbc.com/sport/football/66357996"}