{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-04-26 03:38:48", "date_modify": "2025-04-26 03:38:48", "date_publish": "2025-03-04 22:30:50", "description": "Club Brugge 1-3 Aston Villa: Marco Asensio's Champions League love affair continues", "filename": "sport_football_articles_cvgp8k53257o_1745638728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c062/live/0bcb33d0-f949-11ef-ab6a-cb409d79bd4e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgp8k53257o_1745638728.html", "title": "Club Brugge 1-3 Aston Villa: Marco Asensio's Champions League love affair continues", "title_page": "Club Brugge 1-3 Aston Villa: Marco Asensio's Champions League love affair continues  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Since their most recent Champions League outing against Celtic, Aston Villa have lost at Wolves and Crystal Palace, as well as dropped points at home to Ipswich.\nSo it was perhaps understandable there was slight concern among their fans before the Champions League last-16 first leg with Club Brugge in Belgium.\nThey needn't have worried.\nDespite riding their luck at times, Villa took a huge step towards the quarter-finals after establishing a handsome 3-1 lead to take into the return leg on 12 March.\nTyrone Mings was immense in defence, while three-times Real Madrid Champions League winner Marco Asensio continues to flourish in a competition he loves.\nWhen the Spaniard made it 3-1 after scoring an 88th-minute penalty, he became the first player to reach double figures for goals as a substitute in the Champions League - with 10 of his 13 goals in the competition coming from the bench.\nIs Asensio the shrewdest of all the signings made during the January transfer window?\nThe 29-year-old, who has joined on loan from Paris St-Germain until the end of the season, looks like he is loving life in a Villa shirt.\nAsensio has five goals in his past four appearances in three different competitions, while Tuesday was his first Champions League goal since April 2023 for Real Madrid against Chelsea.", "url": "https://www.bbc.co.uk/sport/football/articles/cvgp8k53257o"}