{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:34:32", "date_modify": "2025-04-26 04:34:32", "date_publish": "2025-02-28 13:08:27", "description": "New Blackburn Rovers boss Valerien Ismael says the club has the \"possibility to dream\" of a Premier League return.", "filename": "sport_football_articles_c0jggd86945o_1745642072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c39b/live/cafda2b0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0jggd86945o_1745642072.html", "title": "Valerien Ismael: Blackburn Rovers have the chance to dream", "title_page": "Valerien Ismael: Blackburn Rovers have the chance to dream  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"We have the possibility to dream... especially our fans. The most important thing is to have no regrets at the end of the season.\"\nThat's what new Blackburn Rovers boss Valerien Ismael told his players after arriving at the club earlier this week.\nBlackburn are sixth in the Championship with 12 games remaining and targeting a play-off spot to give them a chance of returning to the Premier League for the first time in 13 years.\nJohn Eustace might have laid the foundations before he left for Derby County, but if Ismael can guide Rovers over the line, it will also be their first play-off finish since relegation from the top flight in 2012.\n\"I think it's a great feeling because the players put the club in that position,\" Ismael told BBC Radio Lancashire in his first press conference.\nThe 49-year-old knows it won't be easy, though, describing it as a \"massive\" and \"difficult task\" with several other clubs vying for the same spot.\n\"But I think everyone is ready - you feel the positive energy around the training ground, within the team,\" Ismael said.\n\"The first step is ready with that mentality you need in this final push.\n\"Take the games one-by-one and make sure you give everything and at the end of the season, you are not guaranteed that you will be in the play-offs but at least you gave it a chance to compete until the end.\"\nIsmael's first challenge as Blackburn head coach is to try and pick up three points against one of at least 10 teams fighting for the top six when they welcome Norwich to Ewood Park on Saturday.\n\"I have already seen a lot of clips of them, how they play, the way they want to play, to control the ball,\" Ismael said. \"We are prepared, we are ready for the game.\"\nThe Frenchman hasn't spent more than 10 months in his previous managerial jobs in England with either Watford, West Bromwich Albion or Barnsley.\nIsmael says staying at a club for the long-term is \"always the purpose\" when you start but that \"results dictate most of the time, especially in the Championship\".\n\"There are so many games, it's a ruthless league. If you see the record, I'm not that bad,\" he said.\n\"At West Brom, I left the club in fifth position and Watford, until the end of January we were unbeaten in the league. After that, a lot of injuries and you go on a bad run - everyone can go on a bad run.\n\"I know what I am able to do, I just need at some point to have the support and trust.\"\nIsmael's vision for the long-term future at Blackburn is \"simple\", he says: \"To create an identity, a way to play but also to create a pathway for the young players.\"\n\"Blackburn Rovers means something special to me,\" he added. \"When I started my career with Racing Strasbourg in France, I was 19. That same year, Blackburn won the Premier League.\n\"It's the same for the young players now who look at (Erling) Haaland at Man City - the big name of English football. For me at that time, the big name in English football was Blackburn Rovers.\n\"So, it's something special and I just want to give my best, first of all in the short-term focus to support and to help. And in the long-term, to develop something the fans can be proud of.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c0jggd86945o"}