{"authors": ["Andrew Aloia", "www.facebook.com"], "date_download": "2025-05-21 07:33:09", "date_modify": "2025-05-21 07:33:09", "date_publish": "2025-05-20 14:48:09", "description": "Leicester Tigers confirm that former Ireland prop James Cronin is among its list of players being released at the end of the season.", "filename": "sport_rugby-union_articles_cn4qqjxdgq5o_1747812789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4705/live/41cfa630-3587-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn4qqjxdgq5o_1747812789.html", "title": "James Cronin: Leicester Tigers confirm prop among departing players", "title_page": "James Cronin: Leicester Tigers confirm prop among departing players - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Ireland prop James Cronin is leaving Leicester Tigers at the end of the season to take up a coaching job in his home county of Cork.\nThe 34-year-old made 47 appearances in three years for Tigers after arriving from French side Biarritz in the summer of 2022.\nHe is set to move into coaching with Irish lower-league side Highfield, external from next season.\nThe front-rower has featured 11 times off the bench for Michael Cheika's Tigers this season, with his only starts coming in the European Champions Cup and Premiership Rugby Cup competitions.\nCronin's impending departure comes with confirmation that captain Julian Montoya, who confirmed earlier this month that he will move on at the end of the season, is also among those leaving in the summer.\nBack-rower Matt Rogerson, who has been linked with reformed club Worcester,, external as well as Kyle Hatherell, Tim Hoyt, Matt Rogerson and Archie Vanes will also be released.\nEarlier on Tuesday, Tigers also announced that former England full-back Mike Brown will retire at the end of the season.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn4qqjxdgq5o"}