{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-04-26 07:27:14", "date_modify": "2025-04-26 07:27:14", "date_publish": "2025-02-27 20:14:59", "description": "La Liga president Javier Tebas reports Premier League champions Man City to the European Commission over sponsorship deals and subsidiary companies.", "filename": "sport_football_articles_c0rzzpnqywqo_1745652434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82bb/live/59aff0c0-f531-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rzzpnqywqo_1745652434.html", "title": "Manchester City: La Liga boss Javier Tebas reports club to European Commission", "title_page": "Manchester City: La Liga boss Javier Tebas reports club to European Commission - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "La Liga president Javier Tebas says he has reported Manchester City to the European Commission for alleged breaches of rules relating to state-owned companies.\nTebas - a long-standing critic of City - told media at the FT Business of Football Summit that the complaint was made in 2023.\nHe said he believed the case was currently in an \"investigation phase\" by the European Commission - the executive body of the European Union which develops and enforces laws for its member states.\nThe European Commission has confirmed receipt of La Liga's submission to BBC Sport.\nA Commission spokesperson would not comment on any ongoing assessments but said it would \"examine information regarding any alleged foreign subsidies distorting the internal market\".\nTebas said that the complaint centres on his belief that \"City have a structure that circumvents the rules\" including a group of companies in the United Arab Emirates outside the City Football Group.\nLa Liga argues that has given the Premier League champions a competitive advantage in both English competitions and the Champions League.\nCity have not commented on Tebas' allegations but club sources are aware of them, and strongly refute them.\nTebas said: \"City have a lot of companies in their group which lie outside the City Football Group structure, extra companies where they put their expenses.\n\"These other companies lose the money but not the club itself. We have reported Manchester City to the EU. We have the facts and figures.\n\"We asked for City to be checked. It's very important that all clubs are subject to the same transparency rules and governance on both the sporting and financial side.\n\"The City case is one where we believe they have put the losses on the companies that are not officially part of City Football Group.\"\nHe added: \"They have a scouting company, a marketing company. That's where they have very high expenses. They invoice City for less money.\n\"City have costs that are less than if they didn't have this circle of companies around.\"\nTebas said the complaint has been made under Foreign Subsidies Regulation that came into effect on 12 July 2023 and grants the EU powers to investigate state-controlled foreign subsidies.\nCity declined to comment, but sources close to the club said Tebas has a long history of attacking City.\nCity sources point to the club's accounts, which are a matter of public record, as proof of no wrongdoing.\nCity are awaiting the outcome of the hearing into their 115 charges for alleged Premier League financial rule breaches. If they are found guilty, they could face a massive points deduction or relegation.", "url": "https://www.bbc.co.uk/sport/football/articles/c0rzzpnqywqo"}