{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:38:36", "date_modify": "2025-05-20 12:38:36", "date_publish": "2023-08-03 18:09:20", "description": "Brendan Rodgers declares he has \"unfinished business\" in Scottish football as the Celtic manager aims to replicate last season's treble success.", "filename": "sport_football_66398581_1747744716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6DB3/production/_130638082_20807728.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66398581_1747744716.html", "title": "Brendan Rodgers: Celtic manager relishing 'pressure & expectation' of replicating success", "title_page": "Brendan Rodgers: Celtic manager relishing 'pressure & expectation' of replicating success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brendan Rodgers has declared he has \"unfinished business\" in Scottish football as the Celtic manager aims to replicate last season's treble success.\nThe 50-year-old, who replaced Ange Postecoglou in June, completed back-to-back domestic clean sweeps during his first spell as boss before leaving for Leicester City.\nCeltic start their Premiership defence against Ross County on Saturday, their first competitive game since the return of Rodgers, who is relishing the \"pressure and expectation\" he faces.\n\"I sit here with the knowledge of doing [the treble] twice,\" he said. \"So I understand what the pitfalls of success are. In order to have long-term success there are certain elements you need to guard against.\n\"For a club like Celtic it's always about winning, but winning in the best way you possibly can. That will be the idea again this season, to win three trophies, it's an incredible achievement.\n\"But it's a new season, new motivation and new desires. The mentality is, rather then defend it, we want to win it.\"", "url": "https://www.bbc.com/sport/football/66398581"}