{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:55", "date_modify": "2025-05-21 07:54:55", "date_publish": "2025-01-22 09:37:19", "description": "Former fast bowler Steven Finn explains why captain Jos Buttler and coach Brendon McCullum are the ideal combination to revive England's white-ball teams.", "filename": "sport_cricket_articles_c4g744054y9o_1747814095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a327/live/0312c070-d818-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c4g744054y9o_1747814095.html", "title": "Steven Finn on why Brendon McCullum and Jos Buttler are an ideal combination", "title_page": "Steven Finn on why Brendon McCullum and Jos Buttler are an ideal combination - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England were desperate for Brendon McCullum to add the white-ball team to his Test responsibilities.\nWhen England were beaten in the semi-finals of the T20 World Cup in June, it completed a dismal year in limited-overs cricket. Change was inevitable and the right call was made for coach Matthew Mott, rather than captain Jos Buttler, to walk the plank.\nI've seen first-hand why McCullum and Buttler can work well together. I played 62 England games alongside Buttler, not to mention countless days training, on tour and in the dressing room. I played against McCullum in 20 internationals and he was my T20 captain at Middlesex in 2017.\nNow McCullum has five Twenty20s and three one-dayers in India to mould his England team before the Champions Trophy next month. McCullum's mere presence will boost the players and smooth the path for Buttler to concentrate on what he does best: read the game and score runs.\nHere are five reasons why I believe the Baz-Buttler combination is ideal for England.\nDuring the T20 World Cup it was clear Buttler was frustrated to be answering questions on England's white-ball decline. Even when the questions are valid, it can become a daily grind for a captain who also has so many other responsibilities.\nIt was Mott's nature to be a quiet voice in the background, whereas McCullum will be on the front foot and lightening the load on the captain. McCullum spoke to the media in India on Monday, before Buttler did so on Tuesday.\nMcCullum's message to the dressing room will be simple. England's best white-ball captain and a great friend of McCullum, Eoin Morgan, was excellent at this. Players always see what the captain and coach say to the press, so it is another way for the leaders to get their message across.\nIn 2015 we were rebuilding after an awful World Cup, a fresh team in Morgan's image. In an ODI we were bowled out for 302 in 45.2 overs against New Zealand, who then chased them down in 49.\nMorgan was asked if we should have tried to bat out the overs, to eke out more runs. He simply responded that he wasn't disappointed and we were just aiming for more. The reinforcement of his message was heard in the dressing room.\nThese acts of leadership set England on a new course in white-ball cricket, culminating in world titles in both formats. McCullum is of the same mould.\nDuring the T20 World Cup, England had far too many influential voices in the dressing room. Along with Buttler and Mott, Andrew Flintoff and former West Indies captain Kieron Pollard were in there as coaching consultants. It muddied the waters between clarity and confusion.\nFor Buttler, or any captain, questioning the decisions you have made can lead to energy being wasted. Yes, you want robust debate with trusted allies, but there has to be cohesion and a streamlined approach.\nMcCullum's coaching methods are very simple. He cut the Test set-up right back, relying on a handful of assistants that have now joined him in the white-ball set-up.\nIf McCullum were a mechanic, he would be stripping this England sports car of unnecessary parts. No rear spoiler, no loud exhaust, leaving only what is needed and nothing that is not. Everything will run much more smoothly as a result.\nIn 2017 I was struggling for form. I was in and out of the various England squads and not playing any games. I was frustrated, chasing my tail trying to force a way back in and carrying a lot of weight on my shoulders\nMcCullum came to Middlesex, working with his fellow Kiwi Daniel Vettori, who was our coach. Straight away, McCullum made it feel as though the consequences did not matter.\nHe fully supported the decisions I made at the top of my mark, as if someone had put a pin in all of my anxieties. Most importantly, McCullum helped me focus on having fun whilst I was out there playing. After all, playing cricket is supposed to be enjoyable.\nI took 16 wickets in 10 games playing for McCullum. It was the only time that summer I felt fully free from the baggage cricket can bring.\nI expect he'll do the exact same thing with the England white-ball team, helping them find the fun that will release their undoubted talent. McCullum is a master at this.\nIn that same year I had been working on a slower ball delivered from the side of the hand. I would squeeze the ball between my middle finger and ring finger, roll my middle finger down the inside of the ball and it would loop up, all whilst keeping my arm speed the same. That was the plan, anyway.\nIt is a hard delivery to control and I was a player who liked to feel in control of what I was doing all the time. The unknown of letting a ball come out the side of my hand made me nervous.\nI worried about it in my sleep, but McCullum made it sound so simple. He fully backed me trying the ball in a game and reinforced the point that he didn't care what happened.\nThe first time I tried it in a game was against Gloucestershire at Uxbridge. McCullum had actually left by this point in the season, but had been on at me throughout the competition to try the new slower ball.\nI bowled the slower ball in to the pitch and the batter was through the shot way too early. The next ball I bowled a pace-on shorter ball and the batter was caught behind off the glove.\nIt was the previous delivery that planted the seed of doubt in the batters' mind about whether it could be a slower ball or not, and it got me the wicket. I took 4-24 to be player of the match.\nIt's not that McCullum doesn't care about the outcome. He does, passionately. But, having played the game, he knows that you have far more chance of succeeding and committing to what you are doing if you are relaxed. This is the basic premise of his coaching, one that will suit Buttler and this England team.\nThe England Test team under McCullum may appear to be a lot of golf and cliches about a friendly environment, but behind that is a ruthless operator.\nWhen McCullum backs players he truly believes in, he is not afraid to make hard decisions and stick by them.\nBen Foakes, Jonny Bairstow, James Anderson and Ollie Robinson have been on the wrong end of this ruthless edge. Sam Curran and Reece Topley, previous stalwarts of the England white-ball side, have been left out of the squads for India and the Champions Trophy.\nAlready McCullum has said Buttler has a \"smile\" on his face and the captain could have his \"best years ahead of him\".\nTogether, they could bring the good times back for England's white-ball teams.", "url": "https://www.bbc.com/sport/cricket/articles/c4g744054y9o"}