{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:55", "date_modify": "2025-05-21 08:01:55", "date_publish": "2025-01-31 00:00:00", "description": "India win the fourth T20 against England in Pune to win the series with a game to spare.", "filename": "sport_cricket_live_ce8n793pgjxt_1747814515.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_ce8n793pgjxt_1747814515.html", "title": "Relive India beating England in fourth T20 in Pune to win series", "title_page": "Relive India beating England in fourth T20 in Pune to win series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's us done from Pune as India take an insurmountable 3-1 lead in this five-match T20 series.\nTake a read of Matthew Henry's report to see how it played out.\nWe'll be back for the final T20 in Mumbai on Sunday (13:30 GMT).\nOtherwise, join us for coverage of day three of England women's Ashes Test against Australia in Melbourne from 03:30 GMT tomorrow morning, while you can also submit questions about The Hundred auction here.\nHave a good evening.\n'That was a top effort'\nIndia captain Suryakumar Yadav: \"That was a top effort from everyone on the field.\n\"We didn't want to go back after 10-3. They way we responded, the positive intent, the way Hardik and Dube showed their intent, it was great.\n\"We've been talking about expressing yourself, you bat the way you bat in the nets. I'm really happy, I think we're moving the right direction.\n\"I always knew that post-powerplay there was a time when we could control the game.\"\n'We should have gone on to win'\nEngland captain Jos Buttler: \"We started brilliantly, taking lots of wickets, and at the end the batting powerplay we were in a great position and I think we should have gone on to win the game.\n\"It is disappointing. We did some really good things in the game, but chasing wickets, I dropped a catch off Dube first ball and he went on to play a really good innings. With the bat we were in a fantastic position but lost a couple of wickets quickly together.\n\"We want to double down on the way we want to play and I've been really impressed with how we've committed to that and I think we can commit more and when we do that I think we'll get more out of ourselves.\"\nEngland played 'dumb' shots\nSir Alastair Cook\nEx-England captain on TNT Sports\nEngland were dumb with some of their shots and that is quite a hard thing to say because T20 cricket is a balancing act. Sometimes the modern thinking is not right.\nBen Duckett played beautifully today and we were 62-0 with one ball of the powerplay left. Just see it out and knock a single, then regroup again. You've done your job. I don't know if it is ego to just keep on playing their way. Just take a single and think about how important the next three or four overs against spin are going to be and your best player of spin can go at six or seven an over.\nI also have to have a go at Harry Brook too. If Brook had Chakravarthy for six runs they'd have needed just 10 in the final five overs with their best bowler done. He tried to play the ramp, almost as if his ego said that is the way we've been told to play. I get that you have to play with freedom to play T20 cricket, and to be able to express yourself, but you also have to play the situation in front of you and give yourself the best chance of ultimately winning the game. It was a good innings, but not a great innings, because a great innings wins the game. It has annoyed me. It is batting and playing smart, but it is old-fashioned and apparently you can't play in that way.\nConcussion sub made 'no sense whatsoever'\nSir Alastair Cook\nEx-England captain on TNT Sports\nYou've got to love cricket because it throws up so many stories. At half time you would never have thought that story would have been a concussion sub. He made such a big impact on the game.\nReplacing a big-hitting batting all-rounder, who has bowled one over in the IPL, with a guy who can't bat and bowls heavy seam makes no sense to me whatsoever.\nEngland should have still won the game and would have probably preferred a seamer to a spinner but I don't understand it. They had Washington Sundar who got replaced because they wanted more batting in the side.\nIt seems absolute madness that you are allowed to do it, but credit to the lad on debut, but he shouldn't be allowed to play there.", "url": "https://www.bbc.com/sport/cricket/live/ce8n793pgjxt"}