{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:47:35", "date_modify": "2025-05-20 14:47:35", "date_publish": "2023-07-28 07:58:08", "description": "Plymouth Argyle boss Steven Schumacher says joint-record signing Bali Mumba could have a future in midfield.", "filename": "sport_football_66327832_1747752455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8561/production/_130554143_balimumbaipswichawayrex1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66327832_1747752455.html", "title": "Bali Mumba: Plymouth Argyle's record signing could have midfield future", "title_page": "Bali Mumba: Plymouth Argyle's record signing could have midfield future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle boss Steven Schumacher says joint-record signing Bali Mumba could have a future in midfield.\nThe 21-year-old joined the Pilgrims for more than £1m last week having impressed at wing-back while on loan at Argyle last season when the club won the League One title.\nBut Schumacher says the former Norwich City man is very versatile.\n\"It's a bit more about how we see him playing for us and where we see his role and how he can develop,\" he said.\nMumba became the club's second £1m player in a week when he followed another former loanee in Morgan Whittaker back to Home Park.\nThe former England youth international impressed last season scoring six goals in 41 League One appearances and being named in the EFL's League One Team of the Season.\n\"We know he can play wing-back, he did that right wing-back or left wing-back role last season, he was outstanding,\" Schumacher said.\n\"I think he can play as an eight in midfield, he'd got the quality to go in there, he can play in the wide areas and he can play as a full-back.\n\"Some people will say Bali's defensive quality isn't his strongest point, but actually his data was quite good last year, his defensive work was good predominantly.\n\"He had times where he did switch off, and it cost us, but he's a young player and they make mistakes.\"", "url": "https://www.bbc.com/sport/football/66327832"}