{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:30", "date_modify": "2025-05-21 07:08:30", "date_publish": "2025-01-22 15:08:13", "description": "Kilmarnock: Robby McCrorie faces four weeks out with facial injury", "filename": "sport_articles_cr7ez4v3kg4o_1747811310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0fe4/live/f8275fc0-d8cd-11ef-bf89-cf1be2bb19ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr7ez4v3kg4o_1747811310.html", "title": "Kilmarnock: Robby McCrorie faces four weeks out with facial injury", "title_page": "Kilmarnock: Robby McCrorie faces four weeks out with facial injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock goalkeeper Robby McCrorie is facing a month on the sidelines after suffering a fractured cheekbone in the Scottish Cup defeat to Celtic last weekend.\nMcCrorie had to be substituted in the opening stages at Parkhead following a collision with Celtic winger Nicolas Kuhn.\nThe 26-year-old adds to Derek McInnes' long injury list that also includes Brad Lyons and Rory McKenzie before Saturday's trip to face Hearts.\n\"We've not got our troubles to seek,\" the Killie boss said.\n\"Robby has fractured his cheekbone, which was what we thought. He'll be out for probably the best part of three to four weeks. We will maybe get him in a mask.\n\"As a consequence of that, we have recalled Aidan Glavin from Elgin on an emergency loan with the intention of putting him back out to Elgin. I didn't want to do that, but needs must at the minute.\n\"Brad Lyons damaged his hamstring last week at Celtic Park as well. We had it scanned and he'll miss Saturday's game. Hopefully it's not going to be too much longer than that, he may have a chance for Dundee next week.\n\"Rory McKenzie's getting a scan on a stomach issue. It might be the onset of a hernia that he's been trying to manage the last wee while and it's got to the point now where it probably needs a wee bit of investigation. So we are without those lads.\n\"Matty Kennedy has upped his work, but this game is going to come to a quick for him, but hopefully we have him back full training next week. Kyle Magennis is back for this weekend.\"\nThe injury list - and the recall of loan players Jack Burroughs and Oli Bainbridge - means McInnes continues to look at the transfer market after Calvin Ramsay joined from Liverpool.\n\"Finances are tight and it's not easy to to get things done,\" he said.\n\"We are trying to deal with a situation with quite a lot of key players out and unavailable. So I think it's my job to continue to look. Whether we can get anything into the building remains to be seen.\"", "url": "https://www.bbc.com/sport/articles/cr7ez4v3kg4o"}