{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:01:58", "date_modify": "2025-05-20 13:01:58", "date_publish": "2023-08-01 00:00:00", "description": "Watch coverage as England face Fiji in the second stage of the Netball World Cup in Cape Town.", "filename": "sport_live_netball_66366853_1747746118.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2F43/production/_130599021_fiji-v-england_nwc-2023_badges.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_66366853_1747746118.html", "title": "Netball World Cup 2023 LIVE: Watch Fiji v England score, commentary & updates", "title_page": "Netball World Cup 2023 LIVE: Watch Fiji v England score, commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nFive wins in five for England, semi-final place confirmed.\nJob done for the Roses in Cape Town so far.\nNext up that huge match against Australia. Set your alarms bright and early on Thursday for that one with first centre pass at 08:00 BST.\nWe'll be back then but you can keep across all the latest from Cape Town here.\nSee you then!\n'There lies the value in trusting in your whole 12'\nFT: Fiji 28-89 England\nBBC Sport\nJess Thirlby speaking to BBC TV wn what selection we can expect against Australia: \"Obviously I can't give too much away, but we were pretty purposeful today.\n\"I think we definitely got out what we needed today to help inform where we start and also how our journey through the Australia game may look like.\n\"The fact we are playing all 12 shows you how confident I am in everyone's ability to come on and impact.\n\"I thought you saw again the impact Liv Tchine had when she came on. There lies the value in trusting in your whole 12.\"\n'Defensive contributions most impressive thing'\nFT: Fiji 28- 89 England\nBBC Sport\nEngland head coach Jess Thirlby speaking to BBC TV about what she liked most about the performance: \"I think the start [was the best part of the match].\n\"It is something that we have been building on game on game, and I think it was a really important one to finish the five games in five days ahead of Australia.\n\"So yes the start, the first half, how clinical we were, reducing those errors that we have wanted to as well.\n\"Also everyone's contribution defensively. It is always hard. It was important to ignore the scoreboard and stay disciplined to those processes that we really wanted to rehearse.\"\nWhat is coming up on Wednesday?\nTomorrow, we rest!\nWell, Pool G don't but Pool F and England do.\nAll matches tomorrow will be streamed across the BBC Sport website and app and the BBC iPlayer so you can keep across everything from Cape Town there.\nWhile England will be off chilling, enjoying some down time with family and friends and looking ahead to their huge match against Australia, the following teams are in action:\nZimbabwe v Singapore\nWales v Uganda\nJamaica v Trinidad and Tobago\nSouth Africa v New Zealand\nSri Lanka v Barbados\n'Today we just clicked'\nFT: Fiji 28- 89 England\nBBC Sport\nEngland shooter and player of the match Eleanor Cardwell speaking to BBC TV:\n\"We've been really working on that combination [with Housby] for the past few games.\n\"I think today we just clicked. It is always great to play with Helen [Housby], and Liv [Tchine] and Nat [Metcalf] in the circle as well.\"\nOn things the side did well today:\n\"Having confidence in our ability. Bringing a bit of flair to our game and just feeling confidence in everything that we are doing.\n\"We are excited, I love this group. It is an amazing group of girls. I'm happy for Chelsea [Pitman] as well getting her 50th cap, that's an amazing achievement, and I just love this bunch of girls.\"\n'Tchine offers England different option'\nAma Agbeze\nFormer England captain on BBC Two\nI've been impressed with Olivia Tchine in terms of the confidence she is playing with.\nShe seems like she's been out there for years. But this is her first World Cup and she's not got that many caps.\nHer playing style is different and offers a good option for England, another go to.\nEngland can score quickly with her, she can hold the front of the circle, she can hold the back. Lots of opportunities and options for the team in the shooting circle.\n'Rotation could have played part in inconsistency'\nFT: Fiji 28- 89 England\nAma Agbeze\nFormer England captain on BBC iPlayer\nWe did see a lot of rotation in the team, which makes it hard to gel and settle. I think that did play into things here.\nBut against a side like Fiji, England did do some incredible things, but I would expect England to be better than they were in terms of consistency.\nPost\nFT: Fiji 28-89 England\nAma Agbeze just admitted on BBC TV that she has perhaps been a little harsh on the Roses but they should be striving for perfection.\nThe step up in quality will be significant on Thursday and England can't afford to put a foot wrong if they are to get a result there.\n'Still haven't got that consistency'\nFT: Fiji 28- 89 England\nAma Agbeze\nFormer England captain on BBC iPlayer\nI think England will be frustrated that they didn't get to 100 goals.\nWe keep saying England need to be consistent and they started off really well but it is almost like they played different halves.\nEither they are really good at the start and then they tail off towards the end, or they build during a game.\nWe still haven't got that connection, to be consistent throughout a [whole] match.\nPost\nEboni Usoro Brown\nFormer England defender on BBC TV\nEngland have put in three quarters of really consistent performance but one thing they have been focused on throughout the tournament is minimising those unforced errors.\nThey don't want to let the solid performance so far be deterred by anything in the fourth quarter.\nPost\nQ4: Fiji 24-78 England\nGeva Mentor, just cool as you like.\nLydia Panapasa can barely even move before Mentor is there with the intercept.\nEngland have been working all tournament on those unforced errors. A few more have started to creep in in this second half but they're still in a dominant position.", "url": "https://www.bbc.com/sport/live/netball/66366853"}