{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 04:15:25", "date_modify": "2025-05-21 04:15:25", "date_publish": "2025-04-05 19:25:39", "description": "Interim Rangers manager Barry Ferguson fulminates after his side suffered a fifth consecutive home defeat.", "filename": "sport_football_articles_czx48gjkx2qo_1747800925.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/59a0/live/54f95fa0-1253-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx48gjkx2qo_1747800925.html", "title": "Rangers: Barry Ferguson 'not scared' to make change after another Ibrox loss", "title_page": "Rangers: Barry Ferguson 'not scared' to make change after another Ibrox loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Raging\" Rangers interim manager Barry Ferguson has vowed to \"make changes\" for the final few matches of the Scottish Premiership season after Hibernian meted out a record-breaking fifth consecutive defeat at Ibrox.\nOnly three of those have come on Ferguson's watch but this latest one - with Hibs ending a wait of more than seven years for a win in Govan - has pushed the patience of the stand-in boss beyond breaking point.\nFerguson cut an irate figure as he spoke to BBC Scotland after just his seventh match in charge of the club he served with distinction as a player.\n\"Angry, really angry in fact - that's the most simple way I can put it. There's no way I'm accepting that,\" the 47-year-old said.\n\"I said at half-time 'I need to see more, I want to see more aggression in our play' and I never saw it. That's the thing I'm raging with.\n\"I'm not going to kid anybody on. Hibs deserved it. They tackled harder, ran harder and wanted it more. It's sore for me to say that.\n\"I'll take the responsibility. I pick the team and I need to go away with the players and have a long hard look in the mirror.\"\nThe good work of a first derby win at Parkhead in five years has now been undone.\nShould leaders Celtic win at bottom club St Johnstone on Sunday, they can wrap up a 13th Premiership title in 14 seasons when they host Kilmarnock next Saturday.\nBoth of those games come before Rangers are next in domestic action.\nThe Ibrox side have long since been out of any nominal title race but Ferguson won't accept that as an excuse for under-performance.\n\"It's about pride,\" he said. \"This [season] is in real danger of just petering out. I know we're in the Europa League, but those are easy games to get up for.\n\"I will make changes; I'm not scared to make changes. I need a team that's willing to put their bodies on the line.\"\nRangers will indeed have to \"get up for\" the visit of Athletic Bilbao - the fourth-placed side in La Liga - on Thursday.\nFerguson will be desperate not to be the man who presides over a sixth successive Ibrox defeat. Furthermore, two matches against the Spaniards are also the only remaining fixtures with any real significance attached for Rangers.\nA place in a European semi-final is up for grabs but they will have to improve in all aspects of their game if they're to compete with a side who are among the favourites to win the Europa League in their own stadium in May.\nGiven Hibs can now add their names to a list of recent Ibrox winners that includes Queen's Park, St Mirren, Motherwell and Fenerbahce, the leap in performance levels required to be competitive on Thursday is of the quantum variety.\nThe Easter Road side were ahead inside 10 minutes when Jack Butland failed to deal with a Dylan Levitt shot, but visiting goalkeeper Jordan Smith was only tested a couple of times, with Ferguson furious Hibs showed a greater appetite for the fray.\nThat view was shared by former Ibrox midfielder Ian McCall on Sportsound.\n\"Rangers were defensively really poor, the goalkeeper doesn't inspire confidence, and your number nine isn't putting the ball in the back of the net,\" he said.\n\"Whoever the manager is going to be, there are big problems to fix, the balance of the team and their mental attitude.\"\nThe number nine in question is Cyriel Dessers. The Nigernian could - arguably should - have had a hat-trick but again spurned the chances that came his way.\nThe 30-year-old has 23 goals for the season - a respectable return - but were he more clinical, he could have double that.\nIf Dessers be one of the players Ferguson is losing patience with, one option would be to move Hamza Igamane up front. The other would be to restore Danilo to the starting XI.\nButland may also be sweating on his place in the team.\nThe former England international goalkeeper should have kept out Levitt's opener, the latest in a line of mistakes that has grown worrying long.\nFerguson may feel his experience is needed in the white-hot atmosphere of a European tie, while the Englishman's role in the impressive win at Fenerbahce should not be forgotten.\nAfter watching Rangers' Jekyll and Hyde performances as a pundit and club ambassador all season, Ferguson has now witnessed them from pitchside.\nHis patience has finally snapped. \"Absolutely miles off it,\" was how he described the performance against Hibs.\nThere were over 20 minutes, plus stoppage time, to play after Martin Boyle sprinted through the wide open Ibrox spaces to put the visitors two goals up. Rangers offered precious little in response.\nIt appears that will now be left to a manager who demands one simple thing from whichever line-up he picks for the remainder of the season - \"pride\".\nDepending on Thursday's result against Bilbao, it may be all Rangers have to play for in a sorry season of failure.", "url": "https://www.bbc.com/sport/football/articles/czx48gjkx2qo"}