{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:00", "date_modify": "2025-04-26 06:41:00", "date_publish": "2025-03-02 13:09:19", "description": "Motherwell 'met fire with fire' in Ibrox win - Halliday", "filename": "sport_articles_ckgy407gg5lo_1745649660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56ab/live/ffde1730-f764-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckgy407gg5lo_1745649660.html", "title": "Motherwell 'met fire with fire' in Ibrox win", "title_page": "Motherwell 'met fire with fire' in Ibrox win - Halliday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Andy Halliday believes Motherwell met \"fire with fire\" and followed manager Michael Wimmer's game plan \"perfectly\" in their win over Rangers on Saturday - almost exactly a year after their last win at Ibrox.\nWimmer's side sailed into a 2-0 lead and held on after Cyriel Dessers got one back for the hosts.\n\"It's a bold strategy, Motherwell coming to Ibrox and high-pressing, trying to play through the thirds,\" Halliday admitted. \"A lot of people might feel you could be on a hiding to nothing if you do that.\n\"But I thought the boys followed the game plan perfectly. We spoke in the changing room about how Rangers are going to expect to start fast. They've got a returning captain [Barry Ferguson], someone that's really respected here, you're going to expect a reaction from them.\n\"We tried to meet fire with fire, we started fast. It's not even just the result, it's the performance. We thoroughly deserved the three points.\"\nWimmer has only been in place for three games but has won two of them, turning the Steelmen's fortunes around, and Halliday was quick to praise his new gaffer.\n\"The manager had a game plan and it's up to us as players to try and stick to that as much as possible,\" Halliday said. \"There was key areas that we looked at out of possession, trying to press them in certain areas of the pitch. In possession was key too, if you come to Ibrox and turn over possession, you're going to be defending for 90 minutes.\n\"The second goal was the exact pattern we worked on this week, trying to steal the ball on one side of the pitch and work it quickly to the other side and exploit the spaces. The second goal is as good a goal as you're going to see this weekend. It was designed straight off the training ground.\"\n\"We won here last year, at the end of last season, which was a fantastic result. This one today felt that wee bit more special given how well the boys played.\"\nHalliday, a former Rangers midfielder, also commented on Ferguson's appointment and insisted he thinks it will work out for his old club.\n\"Rangers have got quality players and Barry and the guys will get it right given time. They've not had a lot of time on the training ground. They've not had the same amount of time on the grass [as we've had]. It was up to us to bring our 'A game' and Rangers to be off it a wee bit.\"", "url": "https://www.bbc.co.uk/sport/articles/ckgy407gg5lo"}