{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:19", "date_modify": "2025-05-21 07:31:19", "date_publish": "2025-03-29 00:00:00", "description": "Follow live text commentary and score updates from Saturday's fixtures across EFL League One and League Two.", "filename": "sport_football_live_c0mwx7e3w78t_1747812679.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c0mwx7e3w78t_1747812679.html", "title": "EFL League One & League Two LIVE: 21 fixtures", "title_page": "EFL League One & League Two LIVE: 21 fixtures - text and scores - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Back on Tuesday\n#bbcefl\nWell the sun was out, it even felt warmer, and the clocks go forward overnight - you can almost smell the drama lined up for the end of the season.\nBirmingham are striding away at the top of League One with Wrexham and Wycombe scrapping over second spot, while Reading are putting off-field issues to one side and are into the play-off places.\nShrewsbury and Cambridge United might be planning for League Two.\nSpeaking of which, Walsall are still top of the fourth tier,,, just, and Port Vale are back in the top three while Carlisle appear to be heading for the National League.\nYou can catch up with all the reports and reaction here and we'll see you on Tuesday for another busy one.\nTop three consolidate at top of League One\n#bbcefl\nWell it's as you were at the top of the third tier with each of the top five picking up victories today and looking increasingly likely to seal at least a play-off spot.\nWhich might mean a five-way scrap for one remaining place in the top six.\nHuddersfield's humbling at Charlton at lunchtime allowed crisis-club Reading to jump above the dotted line, while Blackpool's derby win over Bolton hurt the Trotters hopes while taking the Tangerines within five points of the play-offs themselves, albeit having played a game more.\nBirmingham's procession to promotion looks assured but Wycombe found a way to keep pace against Lincoln, while Wrexham have found a rich vein of form at the right time.\nCarlisle gloom deepens at foot of League Two\n#bbcefl\nWhat a win for Morecambe, who responded to Tranmere's Friday night victory by overcoming Swindon 1-0 at home to stay seven points adrift of safety with seven games remaining.\nIt was another bleak day for Carlisle and Mark Hughes, however, as they slumped to a 3-0 defeat against Doncaster to fall effectively 10 points shy of safety, such is their inferior goal difference.\nAccrington picked up a handy point against Bradford earlier, while Gillingham came back to draw at Harrogate to surely keep themselves away from trouble.\nLeague Two full-times\n#bbcefl\nDoncaster Rovers have gone fourth in League Two following their convincing 3-0 victory over Carlisle United, who drop to the foot of the table.\nCarlisle's bad day was compounded by Morecambe's 1-0 victory over Swindon Town, which means the Shrimps go above Mark Hughes' men.\nNotts County helped consolidate their League Two play-off hopes with a 2-0 victory at Newport County, while Fleetwood picked up an impressive 4-2 victory on the road at MK Dons.\nGillingham drew with Harrogate Town 1-1 in Gareth Ainsworth's first game in charge since his midweek appointment, while Salford City held on to beat Bromley 3-2.\nChesterfield picked up three points on the road with a 1-0 win at Barrow.\nEarlier today, Bradford City were held 0-0 at Accrington Stanley, while third-placed Port Vale picked up a crucial three points in their 1-0 victory at Crewe Alexandra.\n'Blues are just striding on towards promotion'\nFT: Birmingham 4-1 Shrewsbury\nMatt Mitchell\nBBC Radio WM summariser\nBirmingham City are just quietly going about their business. The confidence that they have played with today is something that may have been missing a little bit before the international break.\nBut they have hit the ground running and all the players were getting into the groove.\nI am made up that Alfie May has got his goals, it will do him the world of good going forward.\nBlues are just striding on towards promotion, the Championship and record totals - it is a fantastic season.\nLeague One full-times\n#bbcefl\nWycombe Wanderers have maintained the pressure on Wrexham in the race for second place as Cameron Humphreys got the winner in a 1-0 victory over Lincoln City. The Imps finished with 10 men after Paudie O'Connor was dismissed late on.\nReading are into the top six with Charlie Savage among the scorers in a 3-1 win over Peterborough United.\nWhat an impact Scott Lindsey has had on his return to Crawley. They thrashed Rotherham 4-0 with two goals from Kamari Doyle, along with goals from Gavan Holohan and Panutche Camara, to keep alive their survival hopes and heap more pressure on Millers boss Steve Evans.\nMaleace Asamoah scored his first senior goal for Wigan Athletic to earn a 1-1 draw with Barnsley after Davis Keillor-Dunn had scored for the Tykes.\nDom Dywer's second-half goal gave Mansfield Town a 2-1 win at Bristol Rovers.\nPost\nFT: Exeter 0-2 Wrexham\nChris Wathan\nBBC Sport Wales at St James Park\nYou have to say this has been comfortable for Wrexham. Save from a bit of pressure just after Rathbone's opener, Exeter have hardly threatened - but that's because Wrexham have not allowed them too. Wrexham have been too strong, too powerful. They haven't had to be flashy but that's a fifth win in six as they head into the final seven games. We've been here before, haven't we.\nFULL-TIME\nWalsall 1-1 AFC Wimbledon\nIt ends all-square at the Bescot Stadium and Walsall's winless run extends to seven games but they remain top of League Two.\nTaylor Allen's superb free-kick three minutes from time salvaged a point for the Saddler's who remain above Bradford City by one point.\nDons substitute Omar Bugiel had given the visitors the lead when he swept home a rebound five minutes after his introduction to the game.\nThe Saddlers late goal means the Dons drop to fifth now below Port Vale and Doncaster Rovers following their respected wins today.", "url": "https://www.bbc.com/sport/football/live/c0mwx7e3w78t"}