{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:42:36", "date_modify": "2025-05-20 13:42:36", "date_publish": "2023-08-01 13:34:56", "description": "Leigh Leopards sign ex-Wigan Warriors centre Oliver Gildart on a short-term deal until the end of the 2023 Super League season.", "filename": "sport_rugby-league_66373512_1747748556.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12BC4/production/_130604767_shutterstock_editorial_12461052h.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66373512_1747748556.html", "title": "Oliver Gildart: Leigh Leopards sign former Wigan Warriors centre on short-term deal", "title_page": "Oliver Gildart: Leigh Leopards sign former Wigan Warriors centre on short-term deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leigh Leopards have signed former Wigan Warriors centre Oliver Gildart on a short-term deal until the end of the 2023 Super League season.\nThe 26-year-old has spent the past two seasons in Australia where he has played with Wests Tigers, Sydney Roosters and the Dolphins in the NRL.\nGildart won two Super League titles with Wigan, in 2016 and 2018, and will cover the injured Ricky Leutele.\nHe joins the Leopards before linking up with Hull KR from next season.\nThe England international has already agreed a three-year deal with Leigh's Challenge Cup final opponents, to run from 2024, but will not be able to feature in the final because of the timing of his registration.\n\"Having received the bad news about Ricky it was important that we quickly brought in someone else of quality into the club before the signing deadline,\" Leigh head of rugby Chris Chester said.\n\"Oliver is a top-class English centre who has represented his country and although contracted elsewhere for 2024 he is fully committed to helping Leigh Leopards achieve their goals this season.\n\"Adrian [Lam] coached him at Wigan Warriors and knows him very well and he's really excited to be working with him again.\"", "url": "https://www.bbc.com/sport/rugby-league/66373512"}