{"authors": ["Alex Bysouth", "www.facebook.com"], "date_download": "2025-05-19 15:16:56", "date_modify": "2025-05-19 15:16:56", "date_publish": "2017-07-04 11:51:27", "description": "Can five-time Olympic cycling champion Sir Bradley Wiggins make it to Tokyo 2020 as a rower? BBC Sport investigates.", "filename": "sport_rowing_40490883_1747667816.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15CC9/production/_96798298_wiggins_getty1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rowing_40490883_1747667816.html", "title": "Sir Bradley Wiggins: Can five-time Olympic cycling champion make it as a rower?", "title_page": "Sir Bradley Wiggins: Can five-time Olympic cycling champion make it as a rower? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sir Bradley Wiggins is a five-time Olympic cycling champion, but will the 37-year-old's plans to swap his racing bike for a rowing boat see him reach a sixth Games?\nThe 2012 Tour de France winner retired from cycling in December 2016 and has taken up rowing in the gym to keep fit.\nHe first raised the idea of switching sports in his 2012 autobiography My Time, and has now outlined his intent to compete at the British Indoor Rowing Championships in December.\n\"I might be being a bit delusional, but the times suggest I'm not,\" he said. \"I'm going to see how far I can take it. Maybe a sixth Olympic gold?\"\nSo can Wiggins turn his rowing dreams into a reality? How does he go about bringing those plans to fruition? And what obstacles stand in his way on the road to Tokyo 2020?\nBBC Sport asked three-time Olympic champion Andrew Triggs Hodge what it will take for the mercurial cycling talent to become rowing royalty.\nTriggs Hodge, 38, has won gold medals at three different Games, adding four World Championship titles to boot, and the now-retired Great Britain rower is excited to see what Wiggins can offer the sport.\n\"It's awesome Wiggo has thought about transferring to rowing,\" he told BBC Sport. \"I think that's never been done before, so congratulations for at least attempting it.\n\"I love the fact that he is trying, and I can't wait to see what he can do.\n\"He's going to have to do something that hasn't been done before, so I wish him all the luck and he will be welcomed into the sport with open arms.\"\nWith the experience of five Olympic Games behind him on a bike, Wiggins appears to have put his hopes of reaching a sixth in a boat.\nRebecca Romero, who became the first Briton to win medals in two sports, external at a summer Olympics, successfully made the switch in the opposite direction, so how will Britain's most decorated Olympian fare?\n\"The best advice I can give him is he is going to have to put all that to bed,\" added Triggs Hodge. \"If he comes on to the scene expecting to be an Olympic champion, he will put himself under a lot of pressure.\n\"If he has got the confidence and the presence to say 'OK, I will start off as a novice rower and expect nothing more' but train with that desire and that passion to put himself in the picture and let his body dictate to him a little bit, then I think he will get the most out of himself.\n\"I hope everyone will give him the time and space to explore the sport at his own pace, not put any pressure on.\n\"Give him the respect first for trying, and then give him the few years he'll need to start performing - it will be a long journey and his last stroke will be his best.\n\"Until that point he is on a trajectory and we should definitely give him the time and space and credit for venturing on this journey.\"\nWiggins is not averse to attempting new things. He successfully made the transition from winning on the road to winning on the track and back again, clinching world and Olympic titles in both disciplines.\nTriggs Hodge says the former Team Sky rider obviously boasts a \"great engine\", but weight could be an issue for the 2012 Tour de France champion.\nWiggins said himself: \"I'm trying to get to 100 kilos, so I'd be 31 kilos heavier than when I went on Tour.\"\nAnd British Rowing performance director Sir David Tanner echoed those concerns in May: \"He's not the biggest of guys, so I'd guess if he did want to do rowing he'd want to be a lightweight, for which we only have two places these days.\"\n\"Physiologically he might be up for the challenge,\" explained Triggs Hodge. \"He's got a lot of work to do with his core and his upper body, especially when he gets into the boat, that'll be a big component.\n\"There's an aspect of retraining his body, retraining his aerobic system, his lactate system with the new muscles, a different capacity on his heart - there is a lot there to work and retrain.\n\"The tactical side in cycling is also huge. Getting a tactical advantage when you're in the peloton or in the time trial, so his advantage there is probably less so in rowing.\n\"But his biggest challenge is going to be the technical side. Rowing is a whole different ball game to cycling.\"\nOne obstacle facing the 37-year-old is his age. By the time the 2020 Tokyo Olympic Games arrive, Wiggins will be 40.\nEven the likes of Sir Steve Redgrave and Sir Matthew Pinsent bowed out before hitting the same age, and Triggs Hodge says transferring any skills later in life is a challenge.\n\"Most of the top people retire between 35 and 40,\" added Triggs Hodge, who announced he was hanging up his oar, external shortly before his 38th birthday earlier this year.\n\"The reason being, the training volume really takes a toll on the body. Less specific muscles or bones, more just the metabolism, your kind of 'wholeness'.\n\"Physiologically, if you are able to take it a bit easier you can go on indefinitely. It depends how his body is going to be able to adapt.\"\nTriggs Hodge says the challenge for a lot of young rowers is coping with the volume of training needed, rather than actually progressing as a rower.\n\"You tend to see that first when people get into the national team,\" he added. \"They'll take a step back or stay static for a few years. When their body is then able to cope with the training, they will move forward and progress.\n\"He'll have to cope with some adjustments and it usually takes a youthful body to get over that hump.\n\"It won't be easy. Everyone is mortal, everyone only has one body and he will to have to take his time like the Redgraves and Pinsents did when they were young.\"\nWiggins is used to competing as part of a team, winning Olympic team pursuit gold medals in 2008 and 2016 and experiencing success on the road, but Triggs Hodge says the tactical element of rowing is different.\n\"Cycling teams yield to the main guy, the one that is leading and one you want to push to the front,\" he said. \"In rowing, it is a whole new dynamic in the team environment.\"\nSo is there a particular event that would suit Wiggins best?\n\"It's going to be tricky whatever,\" added the Molesey Boat Club rower. \"The best he can do is get himself into the middle of an eight, that's where he'll pick up the skills the fastest.\n\"The challenge with rowing in an eight is the team aspect is the most different to an individual sport or a sport where you have a leading star. There is a big challenge there to integrate into a top team.\n\"The smaller the boat class you go, down to the pairs or a single, you rely on more precision technique - it's more about the individual. You have just got to dive in and see where you prefer to be, accept the challenges wherever they may lie.\n\"All credit to the guy. He's going to have a big challenge but I look forward to seeing him have a go.\"", "url": "https://www.bbc.com/sport/rowing/40490883"}