{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 07:44:38", "date_modify": "2025-05-21 07:44:38", "date_publish": "2025-05-20 12:17:28", "description": "Fans of the two Europa League final clubs have expressed anger at the small allocation of tickets given to wheelchair users and other disabled fans.", "filename": "sport_football_articles_cvg99d2m9vko_1747813478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2353/live/113f3650-3570-11f0-a288-d583f745f4b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg99d2m9vko_1747813478.html", "title": "Europa League final: Disabled Man Utd and Tottenham fans unhappy with Bilbao ticket allocation", "title_page": "Europa League final: Disabled Man Utd and Tottenham fans unhappy with Bilbao ticket allocation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Disabled fans of Manchester United and Tottenham have criticised the number of wheelchair tickets available for the Europa League final as \"insulting\" - with both clubs given 26 tickets each in a near 50,000-capacity Bilbao stadium.\nManchester United Disabled Supporters' Association and Spurs Ability, the fan groups representing disabled supporters, have expressed anger at the size of the allocation, which includes an additional 15 'easy access' seats, from an allocation of 15,000 tickets per club.\nIn response, competition organiser Uefa said it had provided 75 wheelchair positions - including neutral spaces - at the San Mames stadium, with free companion seat and guaranteed sightlines.\nUefa said 15% of those tickets remained unsold and available for purchase as of Tuesday morning. Both fan groups disputed this claim to BBC Sport.\nThe stadium, home to Spanish top-flight side Athletic Bilbao, has a capacity of more than 53,000 but this has been reduced to 49,600 for the final on Wednesday.\nThe stadium is usually capable of hosting 208 wheelchair and 102 easy access seats. That falls slightly short of the recommended provision in Uefa's own guidelines for stadiums of its size.\nBut the two supporters' groups and the disabled sports charity Level Playing Field have calculated that even within the San Mames' limitations, both clubs should still have 58 wheelchair spaces and a further 28 easy access tickets.\nSpurs Ability member Mark Spencer has spinal injuries but is not in a wheelchair. He has travelled to Bilbao by car without a ticket to watch the match in a fan park.\nHe told BBC Sport: \"To say I'm gutted is an understatement. I wasn't able to go to Madrid for the Champions League [final] in 2019 and I thought this might be my chance - but Uefa have just not given us the percentage of seating that they should be giving us under their own rules and regulations.\n\"You feel that you're being prevented from watching football and supporting your team because of a disability so it's quite insulting and very disappointing.\"\nManchester United Disabled Supporters' Association secretary Rick Clement said: \"Uefa, ultimately, have a responsibility to football fans to support your team. That should include people with disabilities.\"\nDr Rita Egan, another member of Spurs Ability, said the group has been \"dismayed\" by the allocation and accused Uefa of having \"ignored\" complaints by not replying to correspondence.\nLevel Playing Field chair Tony Taylor said: \"We have seen another failure from Uefa at a showpiece event.\n\"Accountability has been lacking before and now we can see more disregard for disabled fans, which ignores the governing body's own guidance and under-utilises the facilities available, without adequate justification.\"\nIn response, Uefa said it was \"working hard to improve both standards and experiences\" for disabled fans and that it took into account \"the quality of sightlines\", \"historical demand\" and the ratio between capacity and accessible seating.\nIt stated that for the Women's Champions League final last year at the same stadium, 59 of the 60 allocated seats were sold, and for the men's Europa League final last season between Atalanta and Bayer Leverkusen in Dublin, only 41 of the 93 allocated seats were sold.\nUefa also told BBC Sport that it \"investigated solutions\" for more accessible seats and spoke to disability access officers at United and Spurs.\nEuropean football's governing body added: \"While both indicated they could sell more accessible tickets, they also expressed a preference for maintaining the current allocations rather than increasing numbers at the expense of seat quality.\"", "url": "https://www.bbc.com/sport/football/articles/cvg99d2m9vko"}