{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:46:55", "date_modify": "2025-05-21 05:46:55", "date_publish": "2025-01-31 18:21:02", "description": "Ross County 'must believe' they can make history at Ibrox - Cowie", "filename": "sport_articles_cpql4p9ygg2o_1747806415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a853/live/83748a60-dff1-11ef-ba4f-b100425dc741.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpql4p9ygg2o_1747806415.html", "title": "County 'must believe' they can make history at Ibrox - Cowie", "title_page": "Ross County 'must believe' they can make history at Ibrox - Cowie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County manager Don Cowie says his side must believe they can secure a history-making fourth consecutive away league win when they take on Rangers at Ibrox on Sunday.\nThe Staggies had never won three successive league matches on the road before their current run - triumphs at Dundee, Aberdeen and Kilmarnock in December and January.\nCowie is fully aware of the size of task that awaits County in Glasgow, but takes confidence from their recent outings.\n\"It's a massive challenge, they've got the best home record in the country, which shows how strong they've been,\" Cowie said.\n\"I've got to look at the other side - we're looking to making it four away wins on the trot. We understand how big a challenge it will be to do that but we must believe that it's possible.\n\"You always have to keep it tight, to defend really well, your goalkeeper has to perform well.\"\nCowie says any side named by counterpart Philippe Clement will be strong, despite Rangers' tight turnaround from Thursday's Europa League win against Union Saint-Gilloise.\n\"That might have a bearing on their team selection,\" Cowie added.\n\"They do have some injuries. No matter who plays, it's still Rangers and still a squad full of real talent. It's about being together, being resolute and always looking to carry a threat to cause them problems.\"", "url": "https://www.bbc.com/sport/articles/cpql4p9ygg2o"}