{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:40", "date_modify": "2025-05-21 04:58:40", "date_publish": "2025-01-31 21:41:58", "description": "West Bromwich Albion sign Tottenham Hotspur striker Will Lankshear on loan until the end of the season.", "filename": "sport_football_articles_ce3nw4w4l5vo_1747803520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4c4/live/653100a0-e015-11ef-be98-798cbbed3362.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3nw4w4l5vo_1747803520.html", "title": "Will Lankshear: West Bromwich Albion sign Tottenham Hotspur youngster on loan", "title_page": "Will Lankshear: West Bromwich Albion sign Tottenham Hotspur youngster on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion have signed Tottenham Hotspur striker Will Lankshear on loan until the end of the season.\nThe 19-year-old has played six times for Spurs' first team, scoring his first goal in the 3-2 Europa League win over Galatasaray in November.\nIt will be the England youth international's first spell away from the Premier League side.\n\"I am delighted to join this great club. I'm looking forward to meeting my new team-mates and I can't wait to play in front of all the fans,\" Lankshear told the club website, external.\n\"This is a fantastic opportunity for me to compete for game time and, hopefully, score goals that can help the club push on to get promoted during my time here.\n\"Tony Mowbray is a manager who everyone says only good things about and I'm keen to learn as much from him as I can over the next few months.\"\nWest Brom sporting director Andrew Nestor added: \"We have felt since the summer that we would need to prioritise the addition of another striker in this window.\n\"We are pleased now to have brought in Will, who we have been watching for some time and has been among our top targets for reinforcement in this area.\"", "url": "https://www.bbc.com/sport/football/articles/ce3nw4w4l5vo"}