{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:17:35", "date_modify": "2025-05-21 05:17:35", "date_publish": "2025-01-05 07:29:40", "description": "Japan's Hideki Matsuyama sets a 54-hole tournament record as he keeps his one-shot lead at the PGA Tour season-opening event in Hawaii.", "filename": "sport_golf_articles_cg4z71gyk94o_1747804655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6916/live/6a0584b0-cb30-11ef-b5a2-dfe21659a751.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cg4z71gyk94o_1747804655.html", "title": "Hideki Matsuyama sets new 54-hole tournament record at The Sentry in Hawaii", "title_page": "Hideki Matsuyama sets new 54-hole tournament record at The Sentry in Hawaii - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japan's Hideki Matsuyama set a new 54-hole tournament record at the PGA Tour season-opening event in Hawaii at The Sentry.\nThe overnight leader shot a 62 to move to 27 under par - but still only leads by one shot after Collin Morikawa also went round in 62.\nBoth players fell one shot short of equalling the course record on a day when virtually no wind meant perfect conditions for low scores.\nMatsuyama, the 2021 Masters champion, rattled in 11 birdies, the most he has managed in a single PGA Tour round.\nThe 32-year-old could have equalled the course record with a long eagle putt at the 18th but took two putts for the final birdie of his round.\nFellow major winner Morikawa took the lead on the front nine with three birdies and an eagle in the first five holes.\nBut his advantage did not last long, with Matsuyama - who has dropped just one shot in the opening three rounds - catching him on the next hole.\n\"Collin played well and I just kind of followed him, so good day,\" Matsuyama said.\n\"It was a lot of fun, but I would like for him to take it easy on Sunday.\"\nMorikawa, the 2020 US PGA and 2021 Open champion, believes he can overhaul his rival.\n\"I'm going to put everything out there tomorrow because I have the goal to win,\" said the American.\n\"When you're playing that well, everyone talks about being in the zone, but you really are just focused on every shot.\"\nBelgium's Thomas Detry is four strokes further back on 22 under after a 64, one better overall than South Korea's Sungjae Im who also carded a 62, while England's Harry Hall is fifth on 20 under after a third-round 66.", "url": "https://www.bbc.com/sport/golf/articles/cg4z71gyk94o"}