{"authors": ["Amy MacBeath", "www.facebook.com"], "date_download": "2025-05-21 06:07:59", "date_modify": "2025-05-21 06:07:59", "date_publish": "2025-04-01 19:07:17", "description": "Ross County's Dylan Smith ready to kick on for club and country", "filename": "sport_articles_cp319p9kpplo_1747807679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7650/live/f7d076d0-0f2b-11f0-819f-fb51f256a881.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp319p9kpplo_1747807679.html", "title": "Smith ready to kick on for club and country", "title_page": "Ross County's Dylan Smith ready to kick on for club and country - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County youngster Dylan Smith is taking inspiration from fellow Inverness-born players Ryan Christie and Stuart Armstrong as he looks to build on his recent Scotland Under-21 debut.\nThe 18-year-old defender, who featured against Republic of Ireland and Iceland last month, said: \"Seeing those role models coming from the Highlands shows it's not impossible to play for your country from here, but I'll have a couple of years in the 21s and hopefully take another step from there.\"\nSmith has made two County appearances in 2025 after being recalled early from his season-long loan at League 1 leaders Arbroath, where regular game-time benefitted him \"massively\".\n\"Last season wasn't ideal for me, I came off the back of an injury, but I got the chance to prove I can play at a good level and thought I showed that,\" he added.\n\"Arbroath are doing well and I left top of the league as well so it was a good loan spell and I'm coming back stronger and fitter than I was last season.\"\nCounty boss Cowie said the coaching staff have a lot of belief in the teenager, who they have watched gradually improve since he joined as an apprentice at 16.\n\"We are absolutely delighted with where he is right now, the progression he's making and it's an unbelievable achievement for him from the Highlands making his debut for the Scotland Under-21 team,\" said Cowie.\n\"He's training extremely well, he's challenging, and that's on the back of a really good loan spell at Arbroath. But one thing at a time. The next challenge is playing in a regular basis in the Premiership.\"", "url": "https://www.bbc.com/sport/articles/cp319p9kpplo"}