{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:05", "date_modify": "2025-05-21 05:35:05", "date_publish": "2025-04-02 14:55:42", "description": "Wolves news: Jorgen Strand Larsen on 10th league goal", "filename": "sport_football_articles_c39jn1y018yo_1747805705.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a63f/live/ec175920-0fd1-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c39jn1y018yo_1747805705.html", "title": "Wolves news: Jorgen Strand Larsen on 10th league goal", "title_page": "Wolves news: Jorgen Strand Larsen on 10th league goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jorgen Strand Larsen says he is pleased to show the \"many people\" who have been \"doubting\" him after his 10th Premier League goal of the season secured a vital win over West Ham on Tuesday.\nStrand Larsen missed Norway's matches over the international break with a fractured hand but returned to action to - via a deflection off Max Kilman - score his third goal in two games.\n\"The ball went into the net,\" he said. \"It doesn't matter how, so I'm happy anyway.\n\"But 10 is always a goal for a striker and we have eight games to go.\n\"I think many people have been doubting me a little bit and I think it's nice to show them. I'm just happy to be here and play football.\n\"Sometimes as a striker it goes up and down - you will have moments where it's not going right. Today, I was a bit lucky, but that's how it is.\"\nVictory on Tuesday moved Wolves 12 points clear from the relegation zone and all but secured safety and Strand Larsen believes this will allow Vitor Pereira's side to play with more freedom for the remainder of the campaign.\n\"We have some stuff to work on, but with a gap now we can play with a little bit more confidence,\" he added.", "url": "https://www.bbc.com/sport/football/articles/c39jn1y018yo"}