{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:55", "date_modify": "2025-05-21 07:44:55", "date_publish": "2025-03-28 09:00:15", "description": "Man City news: Fan views on 2024-25 season", "filename": "sport_football_articles_cx2g2y1zngjo_1747813495.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2g2y1zngjo_1747813495.html", "title": "Man City news: Fan views on 2024-25 season", "title_page": "Man City news: Fan views on 2024-25 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As BBC Radio Manchester recently broadcast their Manchester City Fans' Forum, we asked if you think this season has been a disaster or one you can accept.\nHere are some of your comments:\nSteve: Ridiculous to say the season has been a disaster when the season isn't over. Even if we finished fourth it isn't too bad in an injury ravaged season. Manchester City will be back dominating next season. At least we aren't Manchester United.\nNick: Any City fan must surely be pretty relaxed about this season. Large numbers of the squad have just had four seasons as ridiculous and brilliant as you could dream of. Yes, losing Rodri hurt us, but other players have dropped off this season and that is fine. A regroup and three or four new players in the summer and next season you will see City again.\nEd: No other team has won the Premier League for four consecutive seasons because it is such a big ask. To expect to win for five consecutive seasons is probably impossible. So from a City perspective it has probably been a poor season. However I think there are 16 teams in the Premier League that would love to be in City's shoes at the moment and if they would consider themselves to have had a brilliant season. It's all about perspective.", "url": "https://www.bbc.com/sport/football/articles/cx2g2y1zngjo"}