{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:14:31", "date_modify": "2025-04-26 04:14:31", "date_publish": "2025-03-04 10:59:02", "description": "Arsenal opinion: How key is Champions League for Arteta future?", "filename": "sport_football_articles_c8j010m87ndo_1745640871.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f191/live/b4e35010-f8e5-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8j010m87ndo_1745640871.html", "title": "Arsenal opinion: How key is Champions League for Arteta future?", "title_page": "Arsenal opinion: How key is Champions League for Arteta future? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal fan Harry Symeou believes there will be questions asked of Mikel Arteta from a section of fans if the club fails to win silverware this season.\nSpeaking to BBC Radio 5 Live Breakfast, he said: \"I think the Premier League has gone in terms of our hopes of winning it. The Champions League feels like the one now for Arsenal.\n\"A full strength Arsenal side would be clear favourites by my estimations in this tie. But you look at the situation we're in, the players we have missing and the problems we have. Then you look at PSV who have been pretty handy in the competition so far, and you just never know.\n\"I think this is a much more interesting tie then it would've been six or seven weeks ago.\n\"I think there are sections of the fan base that have never been completely sold on Mikel Arteta because of his lack of experience prior. I think they're almost looking for a reason to say that Arsenal need someone with more experience.\n\"If the season ends without silverware, which I think is the most likely outcome now, I think there will be question marks around him from sections of the fans at least.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c8j010m87ndo"}