{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:35", "date_modify": "2025-05-21 06:52:35", "date_publish": "2025-03-29 19:11:13", "description": "Wrexham: No doubts over Jay Rodriguez - Phil Parkinson", "filename": "sport_football_articles_c75dnn17xezo_1747810355.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/453c/live/f49a01f0-0cd0-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75dnn17xezo_1747810355.html", "title": "Wrexham: No doubts over Jay Rodriguez", "title_page": "Wrexham: No doubts over Jay Rodriguez - Phil Parkinson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Parkinson said watching Jay Rodriguez in training proved why he was right to keep the former Burnley striker on penalty duty.\nRodriguez, 35, thumped home a 60th-minute spot-kick to wrap up Wrexham's 2-0 win at Exeter City, a result that kept them in the League One automatic promotion places.\nIt was Rodriguez's second goal since making the switch to north Wales in the January transfer window – and his second in as many games after breaking his duck in last week's win over Stockport County.\nThe Stockport goal also came following a Rodriguez spot-kick, but only after he saw his initial effort saved and struck on the rebound.\nThe once-capped England frontman called last weekend's missed penalty the worst of his career.\nBut he remained on spot-kick duties at St James Park after Parkinson kept a close eye on the veteran as they prepared for the Exeter trip.\nThe Wrexham boss said: \"There was no hesitation from me. He's an experienced player who's been at the top level. It was great for him to get his goal last week.\n\"There was a few taking penalties in training on Friday and I watched them closely. He was very confident and I was confident in him stepping up today.\"\nRodriguez slammed the ball home in front of the 900 travelling Wrexham fans as the Welsh club claimed a first win which came by more than a one-goal margin since beating Northampton six weeks ago.\nWrexham had won four of their past five games by a 1-0 scoreline having won 16 games by a single goal – the most in the division.\nWith Rodriguez adding to Rathbone's 23rd-minute opener, Parkinson said: \"We did speak about it at half-time; Exeter would have the wind with them, attacking that noisy terrace.\n\"But we didn't sit back, we took the game to them with some really good play – and a second goal makes it more comfortable on the touchline and for our supporters.\"", "url": "https://www.bbc.com/sport/football/articles/c75dnn17xezo"}