{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:05", "date_modify": "2025-05-21 03:56:05", "date_publish": "2025-01-15 10:40:08", "description": "Cardiff City: Signing a striker a priority for Omer Riza - Robert Earnshaw", "filename": "sport_football_articles_c863w3zxxq9o_1747799765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d7df/live/80fc4bc0-d32a-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c863w3zxxq9o_1747799765.html", "title": "Cardiff City: Signing a striker a priority for Omer Riza", "title_page": "Cardiff City: Signing a striker a priority for Omer Riza - Robert Earnshaw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Cardiff City striker Robert Earnshaw believes the club must strengthen their forward line during the current transfer window.\nEven though the Bluebirds climbed out of the Championship relegation zone with Tuesday's 1-1 draw against Watford, they remain one of the lowest scoring teams in the league.\nAfter having an offer rejected for Peterborough United striker Ricky-Jade Jones, Cardiff have now turned their attention to the Danish striker Yousef Salech.\nThe 22-year-old has scored 13 goals in 29 games for Swedish side Sirius, and is reportedly valued at between £3m and £4m.\n\"To be honest I don't know too much about him, but if they are looking for a striker I would agree [that they need one],\" said Earnshaw.\n\"I think that should be a priority. Look at last night's game, you have got to take your chances and you need forwards.\n\"They need to bring players in for sure, but it's got to be the right players who help improve the team.\n\"The more goals the better.\"\nCardiff are unbeaten in their last four Championship games, though three of those have been draws.\nEarnshaw is concerned about the prospect of seeing his former side in a relegation battle towards the end of the season.\nCardiff, who host Swansea City in the south Wales derby on Saturday, will slip back into the the bottom three if Portsmouth avoid defeat against Blackburn Rovers on Wednesday night.\n\"I always watch the games and I don't like what I am seeing right now to be honest with you,\" Earnshaw told BBC Radio Wales Breakfast.\n\"Listen they are unbeaten in a few games, brilliant, I think it's been a little bit of a turn.\n\"But we don't want to see Cardiff City in a relegation battle.\n\"I would love the club to continue [the unbeaten run] and get some wins, because in that league, if you continue [to struggle] and you are there in March and April, it's going to be very difficult to get out of it. I hope this month we will start to see some more wins.\"", "url": "https://www.bbc.com/sport/football/articles/c863w3zxxq9o"}