{"authors": ["Esha Nayar", "www.facebook.com"], "date_download": "2025-04-26 07:39:05", "date_modify": "2025-04-26 07:39:05", "date_publish": "2025-02-27 13:27:24", "description": "WPL: G Kamalini's rise reopens debate on young players in cricket", "filename": "sport_cricket_articles_cq5zz31ew55o_1745653145.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e52/live/98ce1f80-f50d-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cq5zz31ew55o_1745653145.html", "title": "WPL: G Kamalini's rise reopens debate on young players in cricket", "title_page": "WPL: G Kamalini's rise reopens debate on young players in cricket - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When is a cricketer too young to compete against adults in franchise competitions?\nThe rise of teenage stars in leagues around the world continued this month with Mumbai Indians' G Kamalini making her debut in this year's Women's Premier League aged just 16.\nThe teenager has batted twice in three games - remaining not out on both occasions and steering her side to victory over Royal Challengers Bangalore.\nIt has restarted the debate around young players in professional sport and Western Region Junior Cricket Association vice president Vanessa Pereira featured on this week's Stumped Podcast to discuss the pressure young cricketers are starting to face as more opportunities spring up.\n\"It's a dilemma for us,\" she said. \"These immature young people are now in an adult world with a variety of issues going on around them, some of which they understand, a lot of which they don't.\"\nThe conversation follows 15-year-old Caoimhe Bray's WBBL debut with the Sydney Sixers in October, making her the youngest player in the league's history.\n\"If these young players have proper support and management, they should be ok, but the fear is that they could get chewed up and spat out,\" added Pereira.\n\"Their parents are pushing as well and they don't want to disappoint their mum and dad, so it's a lot for the children to deal with. It's an ongoing challenge.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cq5zz31ew55o"}