{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:49", "date_modify": "2025-05-21 07:51:49", "date_publish": "2025-01-25 00:00:00", "description": "Listen to Sportsound and follow live text coverage of Saturday's SPFL fixtures, headlined by four Premiership games.", "filename": "sport_football_live_c5yex603ly3t_1747813909.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5yex603ly3t_1747813909.html", "title": "BBC Sport - BBC Sport", "title_page": "Saturday's Scottish football - radio & text: BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Real missed opportunity' for Kilmarnock\nFT: Hearts 3-2 Kilmarnock\nKilmarnock manager Derek McInnes tells BBC Scotland: \"I don't think we played too well, first half.\n\"[At the first goal] Joe Wright's impeded, [Elton] Kabangu is offside. If Kabangu doesn't do what he does, Joe Wright wins the header. He's in an offside position when Craig Gordon kicks it and it's such a poor decision.\n\"At one each, we felt good. We were playing better. We just needed to keep at that for a bit longer.\n\"We concede a corner, which we shouldn't, and then we don't deal with the ball in. A free header in Scottish football in your own box normally gets punished. We're disappointed to lose that goal.\n\"There's no doubt the third one quickly after is a mistake from my goalkeeper.\n\"We score a brilliant second goal. It's game on and we missed a few opportunities after that.\n\"This was a real missed opportunity. Two goals should've been enough today to get something from the game.\"\nAberdeen 'too exposed' during games - Thelin\nFT: Aberdeen 0-3 St Mirren\nAberdeen manager Jimmy Thelin tells BBC Scotland: \"I think me as a manager and my staff, we need to sit down and help the players more and we need to think how we can balance the team so we're not so exposed in some situations in the games.\n\"Against Ross County and Motherwell and this game, we were a little bit much too exposed in some areas of the game and that's hurt us too much.\n\"When you're on this run, you do some parts okay, but then the games turn around so quick and there we have to be... I have to work a lot with that and help the players to re-balance the team.\n\"It's a collective thing and I am the manager, I'm responsible, so I need to think about how I can help the players to cope with demands in the games and so we can protect each other much better outside the pitch.\"\nOn Slobodan Rubezic asking to be subbed off in the first half, he confirms the defender signalled he wanted to come off but wouldn't elaborate on the reasoning behind the decision.\n\"No, he signalled he wanted to change and that's why we changed,\" Thelin adds.\n\"I suppose so, I [haven’t] spoken with him after the game,\" he adds when asked if the defender is injured. \"So maybe he feels something and that's why we need to protect him there.\"\nGray frustrated by dropped points & penalty calls\nFT: Ross County 1-1 Hibernian\nHibernian head coach David Gray tells BBC Scotland: \"A point away from home is not a bad result especially given the pitch and the conditions.\n\"But once we got ourselves in front we were in total control and managed the conditions well. We played in the right areas and restricted Ross County to no chances bar the two penalties they got.\n\"When you're only 1-0 up you always run that risk of being pegged back, but right now it feels like two points dropped given the way the game went. We also have to be better in moments as well.\"\nOn the first penalty call, Gray says: \"Nobody appealed for it, which makes it hard to take. By the letter of his law his arm is away from his body. I'm not going to stand and make excuses, we gave away two penalties, which were avoidable.\n\"It was poor defending from Nicky Cadden at the back post - he knows that - he allows James Brown to get inside him.\n\"We should probably lose a goal there. But the moment he misses it and it goes past him, when you let the ball bounce it's impossible to turn with your arm at the side you naturally turn to open out.\n\"But there was nobody behind him, which adds to the frustration as to why it was given. The second penalty is avoidable again. It's a poor decision to dribble out from the back, then not stop the cross.\n\"So there's definitely areas we need to improve - albeit I think it's an extremely soft penalty.\"\nCowie delighted with impact of youngsters\nFT: Ross County 1-1 Hibernian\nRoss County manager Don Cowie hailed the impact of academy products Andrew MacLeod, George Robesten and Dylan Smith, who all played a part in the closing stages of Saturday's draw with Hibernian.\n\"It's an important point,\" he told BBC Scotland. \"We kept going right to the end and I'm delighted in terms of three academy products having a big impact in the last 15 minutes for us, so it's a big pat on the back to them.\n\"Jordan [White] has been very good with his penalties, it was a big moment in the game. We have the chance to take the lead and don't take it and then we get punished right before half-time.\n\"It's great composure from Ronan [Hale] when we get the second opportunity [from the penalty spot], he tucks it away. Andrew MacLeod does fantastic to win the ball on the transition and feeds young George [Robesten], who puts in a great ball and Kieran [Phillips] does what good strikers do to get across the front post and we get a penalty.\"\nHearts win 'helps with belief'\nFT: Hearts 3-2 Kilmarnock\nHearts head coach Neil Critchley tells BBC Scotland: \"We weren't great all game, we looked a little bit off the pace. We were a bit reactive.\n\"We normally play with real intensity but our quality, our touch... we misjudged things a little. We were a little bit off it but we scored goals at the right time - and good goals too.\n\"We had a few chances to make it 4-2 and we didn't finish the game off. But it's three points, it means we're six unbeaten and it helps with the belief in the group.\"\nMotherwell showed 'real fragility' - Kettlewell\nFT: St Johnstone 2-1 Motherwell\nMotherwell manager Stuart Kettlewell tells BBC Scotland: \"It feels worse because it's the next one, it feels worse because you're in the lead in the game.\n\"My biggest frustration is this mentality that allows us to keep dropping off games of football - whether that's physically or mentally.\n\"We've conceded three goals from set plays against St Johnstone, which is awful from our point of view. Talk about putting your body on the line and defending your penalty box.\n\"I thought we showed a real fragility about us in the second half. We had the 1-0 lead, we have been battered and bashed a bit since last weekend and you can see one or two go into their shell a wee bit and that's not what we need.\"\nSt Mirren 'got our just rewards' - Robinson\nFT: Aberdeen 0-3 St Mirren\nSt Mirren manager Stephen Robinson tells BBC Scotland: \"We've got our just rewards today, we've played as well as that previously but then ended up conceding a set play, which has been a large amount of our problems.\n\"You see the presence Zach Hemming means gives us today, people defended for their lives when they needed to be.\n\"What everyone will remember is the three goals, which were terrific, but we gave ourselves that base today that we haven't been doing previously, some really good stuff, really, really good finishes as well.\n\"I thought the front two were unplayable at times and I thought we deserved to win.\n\"Mikael [Mandron] gives us that presence and hold-up play and Toyosi [Olusanya] gives us that electric pace, which scares the life out of people but he showed a lot of composure and quality today as well, which he's adding to his game and I think there was a lot of very good performances. The strikers will get the headlines but, for me, Zach and the back five were terrific.\n\"I thought they gave us the base to win the game from.\"\n'Boos ring out from Dons fans'\nFT: Aberdeen 0-3 St Mirren\nTyrone Smith\nBBC Scotland at Pittodrie\nThe away support were in fine voice at Pittodrie, and why not, their team have been excellent.\nSt Mirren thoroughly deserved this, particularly after a dominant first-half display.\nFor as good as the Buddies were, Aberdeen were as bad, at both ends of the park.\nThe boos rang out at the final whistle from the home support, and that is something which is going to become even more commonplace if Jimmy Thelin cannot find a way to halt what is becoming an increasingly alarming slide by his side.", "url": "https://www.bbc.com/sport/football/live/c5yex603ly3t"}