{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:22:37", "date_modify": "2025-04-26 06:22:37", "date_publish": "2025-03-04 00:00:00", "description": "Follow live text commentary, score updates and match stats from Club Brugge vs Aston Villa in the UEFA Champions League", "filename": "sport_football_live_cly66dqp5j1t_1745648557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a480/live/50f8b7a0-f928-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cly66dqp5j1t_1745648557.html", "title": "UEFA Champions League", "title_page": "Club Brugge vs Aston Villa: UEFA Champions League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aston Villa will be favourites to progress to the Champions League quarter-finals after scoring two late goals to beat Club Brugge in Belgium.\nLeon Bailey had given the Premier League club a lightning start in the last-16 first-leg - Villa's first knockout tie in European football's premier competition since the 1982-83 quarter-finals.\nBailey marked his return to Belgium with a goal as the former Genk player produced a sumptuous half-volley after just two minutes and 15 seconds, following a headed assist by Tyrone Mings.\nIt was a satisfying moment for Mings after the England defender gave away a needless penalty for handball when these sides met in the group phase in November, which resulted in Club Brugge scoring the only goal of the game.\nBut Villa's lead lasted just 10 minutes, with Maxim de Cuyper levelling with a low finish, soon after Marcus Rashford had been denied by former Liverpool goalkeeper Simon Mignolet at the other end.\nIn a tight and tense contest, home captain Hans Vanaken went agonisingly close to making it 2-1 in the 69th minute with a header before ex-Norwich player Christos Tzolis wasted another big chance, blazing over from eight yards.\nHowever, Villa scored two late goals in six minutes to take a handsome lead back to Birmingham\nBrandon Mechele put past his own keeper in the 82nd-minute while stretching to intercept a cross by Morgan Rogers to put Villa ahead and then substitute Marco Asensio made it 3-1 from the penalty spot after Matty Cash had been fouled.\nThe return leg is at Villa Park on Wednesday, 12 March (20:00 GMT).\nVilla's 1,500 travelling fans celebrated wildly after the final whistle as their side took a huge step towards setting up a last-eight tie against the winners of the tie between Liverpool and Paris St-Germain.\nThis was an impressive showing by Unai Emery's side who will be confident of finishing the job in front of a sell-out crowd at Villa Park in eight days.\nThey had lost two of their previous three away games in Europe this season but goalkeeper Emiliano Martinez was restricted to just a handful of saves as Villa survived a couple of scares before their late goals.\nIf Mechele's own goal was unfortunate for the hosts, they can have no complaints about the third.\nAfter Cash was upended by Tzolis, Asensio - a three-time Champions League winner with Real Madrid - showed his class to produce a clinical finish from the spot.\nHe is the first player to reach double figures for goals as a substitute in the Champions League, with 10 of his 13 goals in the competition coming after he has come off the bench.\nEven Emery's second-half yellow card - for arguing with the match officials - failed to take the shine off another decent European performance by Villa.\nThey have now won six of their nine Champions League games this season.", "url": "https://www.bbc.co.uk/sport/football/live/cly66dqp5j1t"}