{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 07:29:36", "date_modify": "2025-05-21 07:29:36", "date_publish": "2025-01-03 22:45:05", "description": "Michael Tidser will not be in the Kelty Hearts dugout for Saturday's trip to face Montrose amid interest in the Scottish League 1 club's manager from Fife neighbours Dunfermline Athletic.", "filename": "sport_football_articles_cwy3x6dj560o_1747812576.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/065d/live/bb353bd0-c484-11ef-b3c5-5f67badfce5f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy3x6dj560o_1747812576.html", "title": "Michael Tidser not in Kelty Hearts dugout amid Dunfermline Athletic interest", "title_page": "Michael Tidser not in Kelty Hearts dugout amid Dunfermline Athletic interest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Tidser will not be in the Kelty Hearts dugout for Saturday's trip to face Montrose amid interest in the Scottish League 1 club's manager from Fife neighbours Dunfermline Athletic.\nThe 34-year-old former Greenock Morton midfielder has been linked with the vacancy at the Championship club following last week's sacking of James McPake.\nNow Kelty have announced on X, external that: \"Michael Tidser will not be able to take his place in the dugout for this weekend's William Hill League 1 fixture against Montrose.\"\nKelty added that, rather than assistant Kevin MacDonald, 31-year-old defender Thomas O'Ware \"will be in charge of the team and has our full support\".\nMcPake was axed after successive defeats left Dunfermline ninth in the second tier, with youth boss John McLaughlan in caretaker charge for Friday's 3-3 draw at home to leaders Falkirk.\nAmid reports of interest in Tidser, Kelty slipped to third place in League 1 after a 2-0 defeat away to bottom side Dumbarton.\nHaving joined Kelty from Falkirk four years ago, Glasgow-born Tidser has been player-manager since April 2023, leading his side to sixth place in Scottish League 1 last season. They currently sit one point behind Stenhousemuir and five off Arbroath.\nNow Dunfermline, who visit Partick Thistle on Saturday, want him to move the six miles to East End Park from New Central Park, the ground where their reserve team play their home games.\nTidser has played 11 times for the part-timers this season, his last being in a 0-0 draw with Cove Rangers on 14 December.\nHaving started his career as a Celtic youth, he went on to play with Ostersunds in Sweden before his first of two spells with Morton and also turned out for Rotherham United, Ross County and Oldham Athletic.\nDunfermline had dismissed McPake only two days after neighbours Raith Rovers started their search for a replacement manager following Neill Collins' move to Sacramento Republic and their Championship rivals have since appointed former Aberdeen boss Barry Robson.\nGerman football investment group Fussball GmbH put Dunfermline up for sale in August and are negotiating with United States investors.", "url": "https://www.bbc.com/sport/football/articles/cwy3x6dj560o"}