{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:27", "date_modify": "2025-04-26 03:37:27", "date_publish": "2025-03-08 00:00:00", "description": "Burnley keep up the pressure on the Championship's top two with a comfortable victory over 10-man Luton Town.", "filename": "sport_football_live_ckgz7ggpl8et_1745638647.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ckgz7ggpl8et_1745638647.html", "title": "Burnley 4-0 Luton Town: Clarents maintain promotion hopes", "title_page": "Burnley 4-0 Luton Town: Clarents maintain promotion hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Burnley kept up the pressure on the Championship's top two in the race for automatic promotion by maintaining their unbeaten home record with a comfortable victory over 10-man Luton Town.\nThe relegation-threatened Hatters had Kal Naismith sent off in the 19th minute after receiving two yellow cards and fell behind to a soft own goal from substitute Mark McGuinness.\nLyle Foster made it two with his first league goal since August and Josh Brownhill scored his third in four games with a simple close-range finish early in the second half.\nAshley Barnes added his first goal since returning to the club from Norwich in added time, but Burnley remain third because of second-placed Sheffield United's win over Preston North End. The gap between them is still just two points.\nThe clean sheet was their seventh in a row in home league games and 26th overall this season, while Luton – who ended a 12-match winless run by beating Portsmouth seven days earlier – suffered their 15th defeat in 18 on the road.\nBurnley, who were being watched by their big-name investor, former NFL star JJ Watt, had Foster back in the starting line-up in place of Zian Flemming.\nLuton boss Matt Bloomfield adopted a more defensively-minded formation with Elijah Adebayo as the sole front man – perhaps understandable from a team that had only taken five points out of a possible 51 away from home this season.\nThe Clarets dominated possession from the outset but it was not until Naismith was dismissed after going through Brownhill from behind that they produced their first meaningful effort with Connor Roberts' curling effort just too high.\nBloomfield reorganised by sending on McGuinness to replace midfielder Liam Walsh but he had only been on the pitch for five minutes when Burnley moved the ball from left to right before Marcus Edwards fed Roberts and the centre-back turned his cross into his own net.\nThings went from bad to worse for Luton – who never tested Burnley keeper James Trafford in the first half - when nothing was given after the ball appeared to hit Jaidon Anthony on the arm and he provided the assist for South African Foster to double the lead.\nThe third came just eight minutes into the second half as Brownhill slipped the ball through to winger Edwards and continued his run into the box to tap home as Luton's appeals that the ball had run out of play before the cross came in were in vain.\nHaving conceded four at home to Burnley early in the campaign, a repeat looked on the cards for the visitors as Brownhill's volley was just too high.\nBut as the home side switched into cruise control, the introduction of Jacob Brown for Adebayo breathed life into Luton and he was twice denied by Trafford in the space of a minute as they looked for a consolation.\nThat was as close as they came and Barnes sparked scenes of celebration around Turf Moor with the fourth as Burnley collected another three points.\nThey will be at home again on Tuesday against fellow promotion chasers West Brom, while Luton travel to Cardiff City in increasingly urgent need of finding a way to win on the road.\nBurnley head coach Scott Parker told BBC Radio Lancashire:\n\"Our performance was rock solid, showed our quality. Of course they got a man sent off pretty early in the game but sometimes that can prove pretty difficult [to play against].\n\"They're a difficult side. I know where they are in the division but they're fighting for their lives and we never gave them any oxygen today.\n\"We managed every scenario, nullified anything they could produce, defensively as a unit we were very good and in our moments [in attack], we were deadly and executed really well.\n\"They came here with a back five. Earlier on in the season playing against a stubborn team, we didn't move the ball or create the angles, our movement wasn't as precise as we'd like, but that was very different today.\"\nLuton Town boss Matt Bloomfield told BBC Three Counties Radio:\n\"For the first 18 minutes I thought we were excellent, our shape was very good and our discipline, and there were a few turnover moments when we were able to hit Burnley on the counter-attack.\n\"But with 10 men it was always going to be a very tough afternoon for us. In my opinion, the first one wasn't a yellow, it was right in front of me and he gets the ball.\n\"Kal's disappointed, understandably so. He's an experienced boy, he knows the game but I'm not going to criticise him. He's been excellent since we signed him.\n\"I'm proud of the way we kept going with 10 men, it would have been easy second half to go under and the boys stood up to be counted, they were fighting and we have to recognise that irrespective of the result.\"", "url": "https://www.bbc.co.uk/sport/football/live/ckgz7ggpl8et"}