{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:36", "date_modify": "2025-05-21 07:36:36", "date_publish": "2024-12-23 19:12:18", "description": "Southampton's new boss Ivan Juric says his side are capable of \"something exceptional\" in their fight against relegation from the Premier League.", "filename": "sport_football_articles_clyvdyylqwvo_1747812996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f329/live/42501360-c160-11ef-a964-0721b998793b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyvdyylqwvo_1747812996.html", "title": "Southampton's Ivan Juric says Saints capable of 'something exceptional'", "title_page": "Southampton's Ivan Juric says Saints capable of 'something exceptional' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton's new manager Ivan Juric says his side are capable of \"something exceptional\" in their fight against relegation from the Premier League.\nThe Saints head into Christmas rooted to the bottom of the table on six points, half a dozen adrift of Ipswich in 19th and eight away from safety.\nOnly four teams have ever retained their place from the same position on 25 December in 32 seasons of the Premier League - although West Brom (2004-05), Sunderland (2013-14), Leicester (2014-15) and Wolves (2022-23) had all earned 10 points at the same stage.\n\"It will be a very tough job and I know that in the history nobody stayed in the Premiership with this situation, but I think there are a lot of good players, and we have [to be] much better in some moments of the game,\" said Juric.\n\"I am optimistic. I'm really optimistic. Even the other day, I saw their mentality and it's the first step to doing better. I think we can do something exceptional. The guys have to be very motivated to do something that never, nobody did.\"\nThe Croatian, who has signed an 18-month contract at St Mary's, was in the stands for Sunday's goalless draw with Fulham while awaiting a work permit.\nHowever, the 49-year-old, who has also previously managed Genoa, Verona and Roma, will take charge for the first time when Southampton host West Ham on Boxing Day.\n\"It was a little bit of a dream, the Southampton opportunity,\" he added. \"I was thinking that life is short, I want to try new things and I want to travel to the other way of working, put myself in a difficult situation, and that's it.\n\"They [the players] don't know me but I know them. I said that I believe in them, they have quality, they can do it. Be positive, work hard, and everything is possible.\"\nAsked about his rumoured preference for heavy metal music and if it mirrored his tactical approach as a manager, Juric added: \"When I was young I liked death metal music a lot, and that's something I think my style of football is like.\n\"Work hard, press hard, play good, be intense, all this stuff. I think (the players) can do it.\n\"They are young, they are positive, they want to work hard. It's not easy to change the style immediately, but we have to be clever.", "url": "https://www.bbc.com/sport/football/articles/clyvdyylqwvo"}