{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:34", "date_modify": "2025-05-21 04:05:34", "date_publish": "2024-12-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Everton vs Nottingham Forest in the Premier League", "filename": "sport_football_live_cp830prkp1nt_1747800334.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cp830prkp1nt_1747800334.html", "title": "Everton vs Nottingham Forest: Wood and Gibbs-White score for visitors", "title_page": "Everton vs Nottingham Forest: Wood and Gibbs-White score for visitors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Nuno may not have been the universal choice as Steve Cooper's replacement just over a year ago, having enjoyed success at Midlands rivals Wolves.\nBut the Portuguese has performed an incredible job in his time at the club, lifting them from 17th in the table last December to battling among the league's best at the top end.\nForest have won five straight games and are unexpectedly sandwiched between Arne Slot's men and third-placed Arsenal, and though a title tilt may be a long shot, a top-four finish is not an unrealistic objective.\nForest have shown they are fine frontrunners, taking the lead in 15 of their 19 games so far this season, and Wood's wonderful finish shows his goalscoring form is not slowing down, while England international Gibbs-White struck shortly after scooping a presentable chance over.\nThe base of Forest's team is built on defensive solidity - conceding only 19 goals in as many games so far this campaign - and they are marshalled at the back by the towering Serbia international Nikola Milenkovic.\nSuch was the visitors' defensive robustness, Everton barely threatened and managed only two shots on target in the contest - Dominic Calvert-Lewin's tame header looping straight at Matz Sels in the 81st minute and fellow substitute Beto's effort being kept out by the Belgium goalkeeper late on.\nSean Dyche saw his side's four-game unbeaten run come to an end and they have won only three games all term, dropping down to 16th and only three points above the relegation zone.", "url": "https://www.bbc.com/sport/football/live/cp830prkp1nt"}