{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-04-26 03:57:59", "date_modify": "2025-04-26 03:57:59", "date_publish": "2025-03-04 13:27:11", "description": "Newcastle news: Opinion - Both cup chances withered away", "filename": "sport_football_articles_c201pw2rn32o_1745639879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c201pw2rn32o_1745639879.html", "title": "Opinion - Both cup chances withered away - BBC Sport", "title_page": "Newcastle news: Opinion - Both cup chances withered away - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "I did not want to write my piece this week. On Sunday, Newcastle United continued their tradition of having a key player sent off a few weeks before a cup final. Great news if you like tradition! Terrible news if you like Newcastle United.\nNot only did we lose a crucial cog in the NUFC machine, but we lost the game too, crashing out of the FA Cup in extra time thanks to a fumbling defence giving the ball as a little treat to Danny Welbeck in extra time.\nI was asked pre-game about the FA Cup fixture, and how excited I was for it, and I found it hard to even concentrate on answering the question without referencing the Carabao Cup final on the horizon.\nIn one game, both cup chances withered away.\nThat is not to say we cannot go to Wembley and give Liverpool a game, but it is to say it will be harder than before because we will not have Anthony Gordon.\nI do understand the frustration - Gordon's shirt is being pulled and it is a split-second irritation, but putting his hands on Jan Paul van Hecke's face and neck and pushing him down is a clear red card. The idea that Newcastle United will successfully appeal against the sending off is a fantastical one.\nSo it is now even harder to concentrate on our big trip to Wembley when we cannot use Gordon, and have other slight injury worries in the squad - ones that were compounded this weekend.\nWe had Alexander Isak back after a groin injury and he went off with some tightness in his thigh. Kieran Trippier also went off, feeling his back.\nWe really need all the resources we can get right now - and let's be honest, that is a pretty weak position to be in going into a cup final against the 2024-25 titans.", "url": "https://www.bbc.co.uk/sport/football/articles/c201pw2rn32o"}