{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 12:31:40", "date_modify": "2025-05-20 12:31:40", "date_publish": "2023-08-04 11:00:13", "description": "England will have \"confidence\" when they bid to reach a first World Cup final against defending champions New Zealand in Saturday's semi-final.", "filename": "sport_netball_66394705_1747744300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17E84/production/_130642979_gettyimages-1412944734.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66394705_1747744300.html", "title": "Netball World Cup 2023: England prepare to face New Zealand in semi-final", "title_page": "Netball World Cup 2023: England prepare to face New Zealand in semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England will have the \"confidence\" they can beat a shaky New Zealand in order to reach a first Netball World Cup final, says former captain Ama Agbeze.\nEngland finished top of Pool F with a first World Cup victory over 11-time champions Australia.\nBut head coach Jess Thirlby said it will mean nothing if the Roses cannot back it up against the Silver Ferns.\n\"You have to beat everyone and New Zealand have not been performing as well as they can,\" Agbeze said.\nEngland face New Zealand in the last four at 10:00 BST on Saturday, before Australia face Jamaica at 15:00. Both matches will be on the BBC iPlayer and the BBC Sport website and app.\nBased on form at this tournament, England will be quietly pleased to face world number two New Zealand after the Silver Ferns drew against South Africa and lost to Jamaica.\nBut Thirlby, speaking after England's win over the Diamonds, said she is \"not bothered\" who her side face.\n\"The advantage for us is that we have met New Zealand and Jamaica quite a lot over the last couple of years so we've got some evidence there,\" she said.\n\"But we appreciate that in-tournament form is also something we need to keep an eye on.\"\nEngland have grown into this tournament, overcoming slow starts and continuously trying to reduce a high error count as Thirlby experiments with her starting seven.\nThe Roses' 56-55 victory on Thursday was only the second time England have come out on top against Australia since the 2018 Commonwealth Games final, where England pipped them to gold.\nBut they have a better record against New Zealand, having beaten them in their final group match at the 2022 Commonwealth Games and winning their last series 2-1.\nHowever, England did lose the subsequent bronze-medal match at last year's Commonwealths to the Silver Ferns.\nAgbeze believes five-time champions New Zealand, who lost star shooter Grace Nweke to a knee injury, have not been at their best.\n\"England will have confidence that they can beat New Zealand,\" said Agbeze.\n\"They will have been watching people's form throughout the tournament and I think they don't want to meet Jamaica.\"", "url": "https://www.bbc.com/sport/netball/66394705"}