{"authors": ["Ryan Baldi", "www.facebook.com"], "date_download": "2025-05-21 07:58:31", "date_modify": "2025-05-21 07:58:31", "date_publish": "2024-12-23 11:01:59", "description": "Set-pieces used to be seen as the reserve of the underdog, but they are currently all the rage - so what goes into them?", "filename": "sport_football_articles_c4gzpjvv9v7o_1747814311.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80d7/live/80826b90-bfc8-11ef-8e5e-bb0fdcbb0bd5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gzpjvv9v7o_1747814311.html", "title": "Deliver, timing and the 'dark arts'", "title_page": "Deliver, timing and the 'dark arts' - the anatomy of a set-piece - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Set-pieces used to be seen as the reserve of the underdog - one of the few moments in a match where an unfancied side could level the playing field against talent-rich opposition with relentless practice and a physical advantage.\nBut thanks to Arsenal's dominance from dead balls over the past two seasons – and a frightening proficiency from corners in particular – set-pieces are all the rage, seen now as just another avenue for the kind of marginal gains sought by would-be overachievers and title contenders alike.\nBut what exactly goes into the making of killer corners?\nWhen Arsenal beat Manchester United 2-0 at Emirates Stadium on 4 December, both of their goals came from corners. One was headed in by Jurrien Timber and the other deflected into the net off William Saliba after a Thomas Partey knockdown.\nThat double took the Gunners' tally for goals from corners to a staggering 22 since the beginning of last season, more than any other club in Europe's top five leagues. Xabi Alonso's Bayer Leverkusen were a distant second with 17.\nMuch of the analysis of Arsenal's set-piece supremacy after the United victory centred on the quality of delivery provided by Declan Rice and Bukayo Saka. And former Blackburn Rovers midfielder Morten Gamst Pedersen, a set-piece specialist during his career, agrees that delivery is king.\n\"On an in-swinger, you can go toward the goalkeeper and if the keeper misses it, you can score directly,\" he says, a point proven by Son Heung-min's recent so-called 'Olimpico' goal direct from a corner in the Carabao Cup, also against Manchester United.\n\"An in-swinger will have more pace on the ball. I'd put it between the posts, on top of the goalie, like Arsenal do. And I'd always have to think about getting it past the first defender. That was what was in my mind as I got ready to take the kick.\n\"There are different techniques that you use depending on what type of delivery you want to put in. The people who are the best passers and crossers, they are usually the best at delivering set-pieces - Kevin de Bruyne can shoot, pass and he can deliver set-pieces. And a bit of confidence helps as well.\"\nRyan Shawcross, who became an expert at scoring headers from corners during a career spent predominantly with Stoke City, preferred a different style of delivery, but he also preaches the importance of a quality ball into the box.\n\"I always liked an out-swinger because I felt you could get a good purchase on the ball,\" Shawcross says. \"And I always favoured heading from the left-hand side if you're looking from behind the goal. You jump different from different sides because you take off on a different foot.\n\"But it's all about the delivery. Arsenal have got Declan Rice and Bukayo Saka who provide unbelievable deliveries. When we were really successful, we had Liam Lawrence, Jermaine Pennant, Matt Etherington. It's all about delivery and desire to go and head the ball.\"\nA defender by trade, Shawcross stands as one of the Premier League's most prolific scorers of headers in the 21st century - he nodded nine goals for Stoke. He also once scored seven league goals in a single Championship campaign thanks to his prowess attacking corners.\n\"Timing is key,\" he explains. \"That's your timing to get away from your marker, timing to jump and meet the ball.\n\"Your thought process as it's getting closer is, 'Right, what am I doing with the ball? Am I heading it down, am I going for power? To the right or to the left?'\n\"But a lot of the time, the ball will dictate what you do. You'll see it just hits the head and goes in. So it's about the contact. Make sure you get a good head on it and try to head it down if possible.\"\nShawcross also believes that – in addition to his height at 6ft 3ins – the fact he was a central defender worked to his advantage.\n\"As a centre-back, you're an expert in heading the ball,\" he says. \"If you think about myself and William Saliba - I'm not comparing myself to him, but we head the ball a lot.\n\"Centre-backs are better at heading the ball. Strikers, they flick the ball on a lot more, but centre-backs head the ball away, so they're used to that contact with the ball on the front of the head and getting distance and height. You take those principles and try to apply it to scoring a goal.\n\"I should have scored so many more. I should have gotten five a year.\"\nAside from the technical factors, Pedersen also believes there is a mental game at play when a team becomes successful from corners – their reputation breeds uncertainty within the opposition.\n\"At Blackburn, we led the league in set-piece goals at one stage,\" he says. \"When you get that fear from opponents, it helps you. You see that with Arsenal. Once you see that fear in the opponent, you keep attacking it. We could see that at Blackburn.\"\nThe role of players who are not necessarily the target of the delivery has become increasingly important, too. Glancing away from the set-piece taker to look at the players awaiting the cross reveals a carefully orchestrated routine of jostling and 'blocking' designed to create a free run at the ball for a team's strongest headers.\n\"The 'dark arts' are the main key to success from corners – blocking,\" says Stuart Reid, a freelance set-piece analyst who has worked with several professional clubs.\n\"Even if you're a side that doesn't have great aerial ability, most teams will at least have one player who's good in the air. If you use blocking, the chances are you can free up that player.\"\n\"Tony Pulis was massive on blocking,\" Shawcross adds of his former Stoke manager. \"We'd orchestrate two or three different blocks before the ball would come in, and that would give that player the space to attack the ball. We'd ideally have someone free at the front post, someone free at the back post, someone free in the middle and someone blocking the goalkeeper.\n\"All the stuff that's being waxed lyrically about now with Mikel Arteta, it was being done years ago by the Welsh genius Tony Pulis.\"\nCorner kicks still represent a relatively low-percentage scoring opportunity - only 4.6% of corners led to a goal last season, for example.\nBut as Arsenal are showing - with Arteta's men converting from 6% of their corners in 2023-24 - the work on the training ground can pay dividends.\n\"Big games get decided by set-pieces these days,\" Pedersen concludes. \"The better you get at set pieces, the more chance you have of winning these big games. It's a big X factor.\"", "url": "https://www.bbc.com/sport/football/articles/c4gzpjvv9v7o"}