{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:37", "date_modify": "2025-04-26 06:31:37", "date_publish": "2025-02-27 08:42:08", "description": "Newcastle Falcons prepare to host Gloucester in their Premiership Rugby Cup quarter-final, seeking to end a 21-year wait for silverware.", "filename": "sport_rugby-union_articles_c2kg5755l5zo_1745649097.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3644/live/1020dbb0-f44e-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c2kg5755l5zo_1745649097.html", "title": "Newcastle Falcons: Steve Diamond on mission to end club's 21-year trophy wait", "title_page": "Newcastle Falcons: Steve Diamond on mission to end club's 21-year trophy wait - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Steve Diamond will send his Newcastle Falcons side out on Friday night on a mission to end the club's wait for silverware.\nNewcastle welcome Gloucester in the Premiership Rugby Cup, continuing their bid to end a 21-year trophy drought.\nThe Falcons qualified for the knockout stages as top seeds from the group phase and will play all their matches at Kingston Park, including the final, if they advance.\n\"We don't want to get to a quarter-final and bow out or a semi-final and bow out,\" consultant director of rugby Diamond told BBC Sport.\n\"We want to try and win it and this is something we stand a chance of winning.\"\nNewcastle's last trophy came in 2004 when they defeated Sale Sharks 37-33 at Twickenham in the Powergen Cup.\nSince then, all of the current Premiership clubs have won a trophy - with the exception of the north east outfit.\nThe Falcons sit bottom of the league with two wins from their 11 games, but Diamond has targeted a strong showing in the Premiership Rugby Cup all season.\nAnd with Newcastle not losing as many of their players to international duty as many other clubs, they sense an opportunity.\n\"Our captain, Callum Chick, produced a really good presentation ahead of the group stages called '21',\" revealed Diamond, twice a winner in this competition with Sale in 2020 and Worcester Warriors two years later.\n\"It was about 21 years since we had won anything and he showed pictures of that day at Twickenham. Micky Ward, our defence coach, was playing for us.\n\"It really hit home with the players.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c2kg5755l5zo"}