{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:56:52", "date_modify": "2025-05-21 04:56:52", "date_publish": "2025-01-14 17:20:25", "description": "Gloucester director of rugby George Skivington is surprised Gareth Anscombe and Max Llewellyn were left out of Wales' Six Nations squad.", "filename": "sport_rugby-union_articles_c20g78g46yvo_1747803412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/356f/live/e90dd200-d26d-11ef-8926-89a9332957ee.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c20g78g46yvo_1747803412.html", "title": "Six Nations: Wales pair omission surprises Gloucester boss George Skivington", "title_page": "Six Nations: Wales pair omission surprises Gloucester boss George Skivington - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester director of rugby George Skivington says he is surprised Gareth Anscombe and centre Max Llewellyn were left out of Wales' Six Nations squad.\nSkivington says he was planning to be without the duo for the tournament but Wales coach Warren Gatland has omitted the fly-half and centre from his 34-man party.\n\"I was surprised, I had planned for both of them to be away,\" said Skivington.\n\"The Welsh camp have been pretty vocal around their reasons for doing it.\n\"Ultimately, it is up to coaches the squad they pick and the way they want to play.\n\"Both of those lads are in good form for us, and I was definitely surprised to see it, but you understand when you are selecting a squad you do what you think is right.\"\nAnscombe and Llewellyn have been pivotal performers during Gloucester's resurgence this season.\nThe west country club are just three points adrift of the Gallagher Premiership play-off places, and also on course to secure a European Challenge Cup last-16 spot.\nSkivington has backed the pair to bounce back if they are given recalls.\n\"They are both strong characters,\" said Skivington.\n\"They were very disappointed yesterday. They have come in today positive, and they will control what they control, and that's trying to put their best foot forward.\n\"Things change quickly, as we know, the door might open for them for one reason or another.\"\nThere is no place for 33-year-old Anscombe with Gatland querying whether he would get through to the next World Cup in 2027.\nWith Scarlets fly-half Sam Costelow missing the whole tournament with a broken collarbone, the uncapped 21-year-old Ospreys fly-half Dan Edwards and Ben Thomas, normally a centre for Cardiff, are the only starting number 10 options.\nAnscombe has been battling a knee injury but Skivington says he is fit for selection this weekend.\n\"Gareth has seen the highs and lows of the game so many times,\" said Skivington.\n\"He is well-versed in a bit of disappointment and how quickly that can swing around and you can get what you want.\"\nLlewellyn, whose 26th birthday was on the day the Wales squad was announced, started all three Tests at outside centre in the 2024 autumn series and is currently the Premiership's top try-scorer.\nDespite this fine form, Gatland has preferred other centre options such as Thomas, Eddie James, Joe Roberts, Owen Watkin and Nick Tompkins, suggesting Llewellyn needs to get more touches on the ball in games.\n\"It's probably tougher for Max because he has worked extremely hard recently to put himself in the position,\" said Skivington.\n\"He is one of the top try-scorers in the Premiership, he is playing really well, he got all those minutes in the autumn and was probably looking forward to using those lessons in the Six Nations.\n\"He is shocked not to be involved but is going to do everything he can to get selected.\"\nGloucester still have scrum-half Tomos Williams, lock Freddie Thomas and wing Josh Hathaway in the Wales squad.\nSkivington says he has had no direct contact with Gatland or any of his coaching staff in recent days.\n\"I haven't spoken to anyone personally around this selection,\" said Skivington.\n\"I know all these guys from a long time ago and I have had plenty of conversation with Warren over the years.\n\"I have no doubt when we see each other next we will have a good conversation around it.\n\"The relationships are good but I haven't asked any questions or asked for anything.\n\"I have talked with Max and Gareth and they have had their feedback individually from the coaches.\"\nSkivington has backed Gatland's credentials despite the Wales boss being under pressure following a record 12 Test defeats in a row.\n\"Warren is a far more experienced coach than me and been around the block a lot longer,\" said Skivington.\n\"He is going to know very strongly the way he wants to play rugby and how he wants to do things.\n\"International rugby is very different to the Premiership and Warren is the most well-versed head coach in the Six Nations.\n\"He knows international rugby and is going to know what he is doing. It's up to those guys of how they are going to do things and who they are going to select.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c20g78g46yvo"}