{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:12:05", "date_modify": "2025-05-20 14:12:05", "date_publish": "2023-07-30 06:23:27", "description": "Barcelona continue their pre-season tour of the USA with a 3-0 win over Real Madrid in Arlington, Texas.", "filename": "sport_football_66352708_1747750325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F706/production/_130583236_tv086562959.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352708_1747750325.html", "title": "Barcelona 3-0 Real Madrid: Barca continue USA tour by beating El Clasico rivals", "title_page": "Barcelona 3-0 Real Madrid: Barca continue USA tour by beating El Clasico rivals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona continued their pre-season tour of the USA with a 3-0 win over Real Madrid in Arlington, Texas.\nOusmane Dembele's early goal was followed up by late strikes from Fermin Lopez and Ferran Torres.\nNew signing Jude Bellingham played for Barca's El Clasico rivals Real and the England midfielder's header was one of five Real efforts that struck the woodwork at the AT&T Stadium.\n\"The result is a bit misleading,\" said Barca coach Xavi Hernandez.\n\"We shouldn't be overconfident. The result is very favourable but it doesn't mean we played a super match.\n\"It was a very even match in which Madrid also had many chances. There are many things to improve.\"\nNew Barca signing Oriel Romeu was the first to hit the woodwork at the home of the NFL's Dallas Cowboys as he rattled the Real crossbar with a thundering drive in the fourth minute.\nBut Barca took the lead shortly after as a cleverly worked free-kick resulted in Pedri sliding a diagonal pass into the path of Dembele, who drilled the ball inside the far corner from a tight angle.\nReal were awarded a penalty just five minutes later after Barca defender Ronald Araujo handled in the box but Vinicius Junior blasted the spot-kick against the bar.\nThe Brazil forward then fired against the underside of the bar and although Bellingham outjumped Barcelona goalkeeper Marc-Andre ter Stegen from the rebound, his header came back off a post before being scrambled behind.", "url": "https://www.bbc.com/sport/football/66352708"}