{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:56", "date_modify": "2025-05-21 04:04:56", "date_publish": "2025-04-04 00:00:00", "description": "Get all your Fantasy Premier League gameweek 31 tips and team news before Saturday’s deadline with guest expert Gianni Buttice.", "filename": "sport_football_live_cm2ezr12ge0t_1747800296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3558/live/795ba9d0-1158-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cm2ezr12ge0t_1747800296.html", "title": "Recap FPL Q&A with Gianni Buttice, plus tips and Premier League team news", "title_page": "Recap FPL Q&A with Gianni Buttice, plus tips and Premier League team news - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks for joining us!\nThis live page has finished updating.\nBut scroll down and view our summary section to recap the best of Gianni Buttice's tips for FPL gameweek 31.\nAnd it hasn't all been FPL chat today...\nWe've been reacting to the news that Kevin de Bruyne will leave Manchester City at the end of the season.\nDe Bruyne's statement\nMan City's statement\nWhat has Pep said?\nWe've also been delving into the situation at Tottenham after their 1-0 defeat at Chelsea last night.\n'My mistake was celebrating a goal' - Postecoglou\nSpurs heading for worst finish in over 20 years\n'I'll probably watch less football after retiring' - Ange on VAR\nEnjoy your weekend!\nget involved\n'Glasner my pick for a set-and-forget Assistant Manager'\nFPL Q&A with Gianni Buttice\nGianni Buttice\nFPL expert and eight-time top-50k finisher\nFPL Keeper: I’m using Assistant Manager chip on GW31-33. Who is the best set-and-forget manager for all three? Or would you switch it over the three weeks, and who?\nGianni: A few are on the AM chip during GW31-33! its all about the bonus for me but the earlier question on the AM chip with where he was at having already used it made me suggest a safer route but from scratch this week, I would go risky!\nI think the value in this chip is being able to roll the dice and chase the big points by not backing a safe manager with easier fixtures. Earlier this season I gained 56 points from the chip which makes it the most powerful in the game.\nOliver Glasner has already proved to be a good Assistant Manager who can activate the 10-win bonus points by causing an upset and beating a team at least five places above him in the league table.\nIf you’re looking for a set-and-forget option for the three active weeks, then the Frenchman would be my pick. As things stand in three of the five games (against Manchester City, Newcastle and Arsenal) across the three gameweeks, Glasner has the chance of hitting big returns by achieving the 10 win or the 5 draw bonus.\nAn alternative strategy would be to back Eddie Howe in gameweek 31 and 32 before shifting to Glasner in 33. Whilst bonus can’t be reached for Howe, the 6 point wins and the extra points for goals and clean sheets could accumulate nicely away to Leicester and then for the home double against Manchester United and Crystal Palace.\nMoving then to Glasner (and using up your weekly free transfer) for a double against Bournemouth and Arsenal with a shot at bonus points.\nget involved\n'Really enjoyed playing draft this season'\nFPL Q&A with Gianni Buttice\nGianni Buttice\nFPL expert and eight-time top-50k finisher\nScotty D: Hi - I'm in a FF Draft League and play Isak this week. Only Newcastle players available are Gordon, Barnes, Joelinton and Bruno G. Would you match up or look elsewhere? Thanks.\nGianni: Hey Scotty, I’ve really enjoyed playing draft this season so this is good to hear.\nCountering Isak is a good approach and all Newcastle attackers come with attractive upside this week. Harvey Barnes should start against his old club because Anthony Gordon hasn’t trained fully yet according to Howe so whilst I really like him for the double, I think reduced minutes are likely on Monday night.\nJoelinton is also a doubt and never strikes me as the best FPL asset knowing our currency is goals and assists.\nget involved\n'Assistant Manager most powerful of FPL chips'\nFPL Q&A with Gianni Buttice\nGianni Buttice\nFPL expert and eight-time top-50k finisher\nDaniel Lezano: Assistant manager query - I had Pep this week - do I swap for Newcastle’s Howe to take advantage of the Leicester match this week and DGW the following, or go for Brentford’s Frank for the league bonus then swap for Howe. Desperate to bring in Saka and avoid -4 hence the transfer dilemma.\nGianni: Now you’ve banked your Pep points, I would consider using a transfer on the Assistant Manager. This chip is the most powerful in the game and comes with a huge ceiling if bonus can be unlocked.\nHowever, if you plan to move to Eddie Howe in GW31, I would consider saving the transfer next week, using it on your XI (Saka next week) and go straight to Eddie Howe for Leicester away.\nBonus opportunities have been my preferred route but given where you’re at I would be happy backing Howe with three very winnable games in the next two gameweeks.\nget involved\n'Gordon is a high risk selection'\nFPL Q&A with Gianni Buttice\nGianni Buttice\nFPL expert and eight-time top-50k finisher\nDavid in Maspalomas: Forced to use my Wildcard this week, with injuries to Gabriel, Alexander-Arnold & Georginio, Keeping faith with my Palace trio though, as they have 2 double gameweeks coming up. Thoughts?\nGianni: Damn, that’s unlucky with injuries and it feels like the right time for you to pull the trigger. The core of the team is very similar to my Wildcard draft. I would try and get another Newcastle player or two in as they’re looking really sharp at the moment and have so much to play for in the run in.\nAnthony Gordon is high risk but you could bench him this weekend and he should be available for double gameweek 32, if not Jacob Murphy is an excellent enabler who I prefer to Morgan Gibbs-White.\nThe view from Fantasy 606\nAlistair Bruce-Ball\nCommentator on BBC Radio 5 Live\nWe have an epic title race on our hands on the Fantasy 606 podcast this season with just 18 points separating the listeners, Statman Dave and myself as we head into gameweek 31\nChris Sutton is a little off the pace having opted for his usual brand of maverick management which always wins him plenty of admirers but precious little silverware.\nOur listeners have combined superbly this season given that their team is managed by a different listener every week who comes on the podcast and makes all the decisions - transfers, selection, captaincy and whether to use a chip or not.\nIf you want to take on that enormous responsibility and try and take the listeners to a glorious title win this season then please send us an e-mail on fantasy606@bbc.co.uk\nget involved\n'I'd vice-captain Salah in case Isak doesn't play'\nFPL Q&A with Gianni Buttice\nGianni Buttice\nFPL expert and eight-time top-50k finisher\nAnon: Hi Gianni! I'm off on Easter holidays with the family tonight. If I had to set and forget a captain for the next two or three gameweeks who should it be? Cheers!\nGianni: Fair play for switching off from FPL when on holiday - I sometimes wish I could do the same!\nAlexander Isak would be my go-to. He has the double next week and if fit will be captained by the majority of the game. He’s likely to be my captain this week too with a trip to Leicester. I would vice-captain Mohamed Salah just in case Isak doesn’t make it for Monday night’s game. Enjoy the trip with the family.\nget involved\n'Salah is the best and a very risky sell'\nFPL Q&A with Gianni Buttice\nGianni Buttice\nFPL expert and eight-time top-50k finisher\nLiz: Should we be keeping Mo Salah until the end or jettison him during the double gameweeks for players who are playing twice?\nGianni: Hey Liz, us FPL managers do love a double gameweek and the rewards are often there for us but Mohamed Salah is the best player in the game and a very risky sell. He has 309 points this season with the next best players on 187 in Cole Palmer and Bryan Mbeumo. Single or double, he’s a lock in my team.\nAlthough for those happy to back against the template, it’s worth noting there are more obvious captains than Salah in for the majority of the run in as Liverpool don’t have the benefit of a double gameweeks.\nSome will ask \"Is Salah worth the spend if you’re not going to captain him?” but I would argue that with injuries to the likes of Erling Haaland, Gabriel and Trent Alexander-Arnold, FPL managers aren’t too tight for funds at the moment.", "url": "https://www.bbc.com/sport/football/live/cm2ezr12ge0t"}