{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:34:15", "date_modify": "2025-05-21 06:34:15", "date_publish": "2025-03-31 06:06:40", "description": "Former Ireland international Lindsay Peat feels the side's \"nice variety of tries\" in the Women's Six Nations victory over Italy provides \"redemption\" for their attack.", "filename": "sport_rugby-union_articles_c5ylkxrgpvno_1747809255.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fd4/live/4f9fa480-0da6-11f0-924e-95a7b50d8a26.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5ylkxrgpvno_1747809255.html", "title": "Women's Six Nations: Eight-try showing in 54-12 win over Italy gives Ireland 'redemption' says Lindsay Peat", "title_page": "Women's Six Nations: Eight-try showing in 54-12 win over Italy gives Ireland 'redemption' says Lindsay Peat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Ireland international Lindsay Peat felt the side's \"nice variety of tries\" in the Women's Six Nations victory over Italy on Sunday provided \"redemption\" for their attack.\nWhile there were plenty of positives from the 27-15 defeat to France in round one a week earlier, Ireland had stuttered at times with ball in hand and they relied on their set-piece for scores.\nThanks to what Peat called \"little tweaks\" at the Stadio Sergio Lanfranchi, they crossed four times in each half against Italy to secure their first win of the campaign.\n\"To put more points on Italy than England did last week did is a superb outcome,\" Peat told BBC Sport NI.\n\"This was about redemption, coming back. They'd unfinished business from last week.\n\"We saw the potential but could they be ruthless and finish the job? I think it's safe to say they did.\"\nAoife Dalton was named player of the match after setting Ireland on their way with their first try after only two minutes.\nThe centre also provided a key defensive intervention just before half time when holding the ball up over the line to force a turnover and caught the eye throughout with clever running lines.\nIt was a midfield performance that impressed former Ireland centre Eliza Downey who felt her pairing with Eve Higgins was instrumental in the win.\n\"A deserved player of the match, she was on the end of everything,\" Downey said.\n\"She's confident beyond her years and how she's linking up with the other players, how she's linking up with Higgins is really exciting.\"\nIn addition to the eight tries, fly-half Dannah O'Brien kicked brilliantly off the tee.\nAfter missing all three conversions eight days before, the 21-year-old added the extras from the touchline following Dalton's early score with Peat feeling that kick set the tone for her performance.\n\"There was a lot of pressure on those young shoulders after I suppose a below par performance by her standards last week,\" added Peat.\n\"We said before she needs to get a kick early to get her confidence back and you could see the shoulders up and chest out [after her first conversion].\"\nWith Aoibheann Reilly, 24, linking well with the 21-year-old pair of O'Brien and Dalton, Ireland have a youthful nine-10-12 axis.\n\"They're inexperienced but there's skill and talent,\" added Downey.\n\"They're malleable and they can be coached.\n\"There's leadership and there's great depth from those young players.\"\nIreland are next in action against England in Cork on 12 April before finishing their campaign with trips to Wales and Scotland.\nSitting third in the standings after the big win in Parma, Ireland will hope to finish strongly before turning their attention to the World Cup which starts in August.\nIreland, who failed to qualify for the last World Cup, will be in a pool with Spain, Japan and New Zealand at the tournament in England.\n\"You have to look at areas that don't go right for you and when you right the wrongs, that's how you grow,\" concluded Peat.\n\"The growth from last week to this week, they're the key moments that will extract the potential from this team.\n\"Hopefully they'll kick on the rest of the tournament and then the bigger picture is the World Cup.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c5ylkxrgpvno"}