{"authors": ["Ray Hunt", "www.facebook.com"], "date_download": "2025-05-21 06:21:37", "date_modify": "2025-05-21 06:21:37", "date_publish": "2025-03-31 15:02:38", "description": "Southampton news: Opinion - Fan writer on Ivan Juric's tactics for final nine games", "filename": "sport_football_articles_c20x719d18yo_1747808497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57d7/live/2bcb00b0-b62a-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20x719d18yo_1747808497.html", "title": "Opinion - Fan writer on Ivan Juric's tactics for final nine games - BBC Sport", "title_page": "Southampton news: Opinion - Fan writer on Ivan Juric's tactics for final nine games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Southampton fanbase are not really expecting too much from the run-in. If you are only searching for three more points to avoid becoming the worst team in Premier League history, then you are not really setting your sights too high.\nMost of us find ourselves fixture-watching and planning from where those elusive points could possibly emanate. In truth, it is hard to see where a single point is coming from the nine games remaining. West Ham and Leicester away seem the most likely, but both came away from St Mary's with maximum points.\nBut then, haven't most?\nIt is becoming ever clearer that Tyler Dibling will be getting a summer move to remain in the Premier League next season. There are reports that a number of clubs have shown interest and if you are to believe the rumours, we have slapped a £100m price tag on the teenager.\nIf we are to make the most and gain a fee anywhere near that figure then it is important to give Dibling as many games as possible in the run-in, in a formation that best deploys his and Mateus Fernandes' talents. Is making sure we get the most value from our current assets all we can hope for now?\nI would also like to see Ivan Juric drop the back five and play a recognised striker as the focal point. Our first point of the season and first senior goal for Dibling came by playing that system, as did our early success in the Carabao Cup, albeit against lower-league opposition.\nFor too many weeks now, we have been asking attacking midfielders to play that lone forward role - to no avail. It seems Juric is trying everything but the obvious. Juric's man-for-man marking becomes predictable and has left huge gaps in the middle which we are not equipped to deal with.\nWith Crystal Palace and Tottenham next up, I fear it will be more of the same.", "url": "https://www.bbc.com/sport/football/articles/c20x719d18yo"}