{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:35", "date_modify": "2025-05-21 07:08:35", "date_publish": "2025-01-13 22:23:54", "description": "Manchester United could receive a bid for Alejandro Garnacho, Bayern Munich want Kobbie Mainoo, and Manchester City are reportedly willing to let Kyle Walker leave on a free transfer.", "filename": "sport_football_articles_c0jn81lq03qo_1747811315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eae3/live/008028d0-d1f0-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0jn81lq03qo_1747811315.html", "title": "Football gossip: Garnacho, Mainoo, Walker, Rashford, Malen, Dubravka, Calvert-Lewin", "title_page": "Football gossip: Garnacho, Mainoo, Walker, Rashford, Malen, Dubravka, Calvert-Lewin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United could receive an offer for Alejandro Garnacho, Bayern Munich want Kobbie Mainoo, and Manchester City are willing to let Kyle Walker leave the club on a free transfer...\nManchester United are said to value winger Alejandro Garnacho, 20, at about £42m, amid interest from Napoli. (Sport Italia, external)\nBayern Munich have joined Chelsea in the race for 19-year-old Manchester United and England midfielder Kobbie Mainoo. (Sun), external\nManchester City are willing to allow defender Kyle Walker, 34, to depart for free this month amid interest from AC Milan and Inter Milan. (Gazzetta dello Sport, external)\nAC Milan will make a formal approach for Manchester United forward Marcus Rashford, 27, who is set to leave Old Trafford this month. (Sky Sports, external)\nBorussia Dortmund have also reportedly met with Rashford's representatives in the hope of striking a January deal. (Sky Sport Germany - in German, external)\nAston Villa have agreed a £19m deal to sign Dutch forward Donyell Malen, 25, from Borussia Dortmund. (The Athletic - subscription required, external)\nVilla have also opened discussions with Sevilla as they look to sign 24-year-old French defender Loic Bade. (L'Equipe - in French), external\nNewcastle goalkeeper Martin Dubravka, 35, is in negotiations over a pay rise to see out the final five months of his contract. (The i, external)\nLeicester are set to sign French full-back Woyo Coulibaly, 25, from Parma in a £3m deal. (Fabrizio Romano, external)\nChelsea will allow midfielder Carney Chukwuemeka, 21, to leave on loan this month, with Borussia Dortmund and Strasbourg interested. (Fabrizio Romano, external)\nNottingham Forest are open to offers for striker Emmanuel Dennis, 27, with interest from clubs in the Championship, Serie A and La Liga. (Sky Sports, external)\nPortugal defender Renato Veiga, 21, looks likely to leave Chelsea in January, with clubs in England, Germany, France and Italy showing interest. (Athletic), external\nMonaco have made a second proposal to West Ham for Edson Alvarez, 27, after their initial loan offer for the Mexico midfielder was rejected. (Mail), external\nNetherlands defender Tyrell Malacia, 25, could leave Manchester United on a loan deal this month. (Fabrizio Romano), external\nWest Ham are poised to enquire about Everton's Dominic Calvert-Lewin before possibly making a move for the 27-year-old England striker. (GiveMeSport), external\nLeicester are open to selling Belgium defender Wout Faes, 26, at the end of the season to ensure they meet profit and sustainability regulations. (Sky Sports Switzerland - in French), external\nReal Madrid are looking at possible managerial options to replace Carlo Ancelotti after losing 5-2 to Barcelona in the Spanish Super Cup final. (Relevo - in Spanish, external)\nLuton Town want to make Wycombe Wanderers boss Matt Bloomfield their new manager and are close to making an appointment. (The Guardian), external\nChampionship side Norwich City have joined the chase for highly-rated Peterborough striker Ricky-Jade Jones, 22, who is out of contract at the end of the season. (Football League World), external\nHull City are close to the loan signing of Leeds United forward Joe Gelhardt - who was wanted by ambitious League One side Wrexham. (Goal), external\nStoke City have an anxious wait ahead as striker Tom Cannon could be recalled by parent club Leicester, with manager Ruud van Nistelrooy saying \"there are decisions to be made\". (Stoke Sentinel), external\nBoth Sheffield United and Sheffield Wednesday are keen to sign Cannon if he becomes available. (Yorkshire Post), external\nMillwall are interested in signing forward Aaron Connolly from Sunderland. The 24-year-old only signed for the Black Cats in September but has struggled to make an impact and could be available. (Sunderland Echo), external\nLeeds striker Patrick Bamford is on a \"long list\" of players Blackburn Rovers are looking at as potential signings in January. (Lancashire Telegraph), external\nWest Brom are eyeing a move to hire Sean Dyche as their new manager after he was sacked by Everton. (LiverpoolWorld), external\nSheffield United and Luton are set to battle for the £4m signing of midfielder Timothy Ouma from Swedish top flight side IF Elfsborg. (Football League World), external\nMiddlesbrough have renewed their interest in Hull City left-back Ryan Giles and want to sign the 24-year-old in January. (HullLive), external", "url": "https://www.bbc.com/sport/football/articles/c0jn81lq03qo"}