{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-04-26 07:52:03", "date_modify": "2025-04-26 07:52:03", "date_publish": "2025-02-25 14:39:11", "description": "Some like it yacht for a Hearts pre-season...", "filename": "sport_articles_cwyjl0zzemlo_1745653923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/18c5/live/ba872160-ef8d-11ef-80a2-3b5266fd5b33.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cwyjl0zzemlo_1745653923.html", "title": "Some like it yacht for a Hearts pre-season...", "title_page": "Some like it yacht for a Hearts pre-season... - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Summer 2006. The season is over and Vladimir Romanov has experienced the sweet taste of Sottish Cup success.\nOf course, it's all down to his amazing footballing acumen, and he wastes no time cementing his influence over the Hearts team.\nBefore training for the new season can begin, he's secretly rebuilding the Hearts backroom staff again. Two new recruits come in.\nFirst, Eduard Malofeyev - a Russian football legend, one of the best players to ever pull on a Dynamo Minsk shirt. His CV includes a two-year stint as head coach of the USSR, though more recently he has been managing FC Kaunas, owned by a certain Vladimir Romanov.\nAnd then, maintaining the Eastern European vibe, is Ukrainian coach Anatoliy Korobochka. Vlad arranges for the new recruits to meet the cup-winning team at their training camp, which is best described as 'somewhere in the Mediterranean.'\nKorobochka spoke to the Romanov: Czar of Hearts podcast about his time at the club, and one of the more memorable pre-season trips, well, ever.\n\"Vladimir suggested to me we go to Monaco, to France, there would be a big white ship, and we would start our practice,\" he recalls.\n\"Everything around it gave an impression of luxury, that's true, and a lot of money had been spent.\"\nRomanov had decided Hearts' pre-season should include 10 days on an ocean-going yacht fit for an oligarch and his football team.\nHowever, instead of closely scrutinised training sessions and fitness routines, the Hearts squad found themselves on a Mediterranean cruise, moving along the coast every few days before hopping on to dry land and hoping to find a free pitch.\n\"I mean, it was shocking, to be honest with you, I think it cost like 600 grand to lease for that 10 days,\" Paul Hartley tells the podcast.\n\"We used to jump off the speedboats, go into the land to find somewhere to train. This is 10 days in the Med, on this big yacht.\"\nDespite the less-than-organised approach to the pre-season trip, Hartley wasn't too fazed by the lack of 5k runs and intricate drills.\nHe adds: \"It was a great, it was a good holiday.\n\"Honestly, it was great. It was terrible pre-season, but it was a good holiday.\"", "url": "https://www.bbc.co.uk/sport/articles/cwyjl0zzemlo"}