{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:00:06", "date_modify": "2025-05-21 04:00:06", "date_publish": "2025-04-07 06:50:29", "description": "Leicester vs Newcastle predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_ckg2nq29z07o_1747800006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg2nq29z07o_1747800006.html", "title": "Leicester vs Newcastle predictions: Chris Sutton on Premier League game", "title_page": "Leicester vs Newcastle predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester should have been relegated immediately for what they did at Etihad Stadium last Wednesday.\nFor a team who are desperate for a win, they showed absolutely zero attacking intent even when they went two goals down.\nAll they were interested in was building a wall and just stopping Manchester City. I felt sorry for their travelling fans because the team offered no threat whatsoever, and didn't even try to score.\nI can understand that everyone has a gameplan, but usually that changes when you go a goal or two behind. At 2-0, however, Leicester took their star striker Jamie Vardy off to put another midfielder on.\nThat tells you where Leicester are at right now - it felt like they were waving the white flag and going for damage limitation, rather than thinking they might as well give it a go and risk conceding more goals.\nWe know how nervy Manchester City have been this season, and Leicester caused them problems when they had a go at them at King Power Stadium at the end of last year.\nThis time, there was none of that. They were pretty pathetic and you have got to question what their manager Ruud van Nistelrooy was thinking.\nHis team have lost their past seven league games and have not scored in any of them, and it is even longer since they managed a point or a league goal at home.\nThat is not going to change here. Newcastle got an important win over Brentford in midweek to show there was no hangover from their Carabao Cup celebrations.\nEven if they hit the hotel mini-bar again on Sunday night, it wouldn't matter - they would still beat Leicester.\nSutton's prediction: 0-2", "url": "https://www.bbc.com/sport/football/articles/ckg2nq29z07o"}