{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:55:37", "date_modify": "2025-04-26 06:55:37", "date_publish": "2025-02-28 15:16:37", "description": "Oxford United can be a mid-table Championship side, says manager Gary Rowett.", "filename": "sport_football_articles_ckg8rj7k7n1o_1745650537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31c6/live/4d962990-f5e4-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8rj7k7n1o_1745650537.html", "title": "Oxford United: Gary Rowett says U's can be a mid-table side", "title_page": "Oxford United: Gary Rowett says U's can be a mid-table side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gary Rowett says Oxford United have shown they can be a mid-table Championship side, but need to go and prove it again.\nAfter a blistering start following Rowett's Christmas appointment with 17 points from seven matches, the U's have slipped back to 18th, eight points above the relegation zone, but are winless in six games since beating Luton on 21 January.\nThey have collected just three points from that run and scored only once, though Rowett told BBC Radio Oxford he wasn't unduly concerned at this stage.\n\"I've been in the Championship a long time,\" the former Birmingham, Derby, Stoke and Millwall manager said. \"It's the highs and lows of the division you can't avoid. I can probably name 10 teams that have had runs of probably double this length of time without winning a game at some point. Some of those teams might be in the top half.\n\"You have to look overall. You're aware that we have dropped off a tiny bit in certain elements of the performance, that's natural, scoring goals of course has been one of those we are working on.\n\"When we came in second from bottom, level on points with the bottom team, if you'd have said after another 13 games we'd be where we are in the league and disappointed with our recent form you'd have probably said 'I'm not sure that's going to happen'.\"\nRowett agreed there was a \"gulf\" between the division's leading teams and the rest, but added: \"I think there are a lot of teams in that middle level and that's something I've spoken to our players about.\n\"I think we've shown in the first seven games that we can be in that middle pack, what we've showed in the last six games is that we've found it hard to stay in that middle pack - I think that's just the reality of the division.\n\"It's all about performance and bouncing back and showing the determination when you lose and trying not to get too carried away when you win, and this cycle's no different.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8rj7k7n1o"}