{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:21:47", "date_modify": "2025-05-21 06:21:47", "date_publish": "2025-03-31 14:41:21", "description": "Salford Red Devils full-back Ryan Brierley reveals the club's difficulties have impacted the players' mental health", "filename": "sport_rugby-league_articles_cq6744jn4mqo_1747808507.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8cb2/live/1d80e7b0-0e38-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cq6744jn4mqo_1747808507.html", "title": "Salford Red Devils' Ryan Brierley on club's financial troubles", "title_page": "Salford Red Devils' Ryan Brierley on club's financial troubles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Salford Red Devils full-back Ryan Brierley says the club's troubles have been impacting the players' mental health.\nThe 33-year-old Scotland international also hinted that he could leave, following star players Marc Sneyd, Brad Singleton and Tim Lafai as the Red Devils struggle with the repercussions of an ongoing takeover.\nPlayers have not been paid on time in the last two months and as a result coach Paul Rowley has been restricted by a sustainability cap placed on the club after funds from an investment group led by Swiss banker Dario Berta failed to clear in time.\nThat has contributed to Salford, who finished fourth to reach the Super League play-offs last season, starting the season with just one win from their opening six fixtures and losing 54-0 to champions Wigan Warriors at the weekend.\nTwo players, believed to be Kallum Watkins and Chris Atkin, refused to play against Wigan, and Brierley confirmed that players had been threatened with a £2,000 fine and the withholding of their registration if they did not turn out.\nBrierley told the BBC: \"We've all got contractual agreements, when we're fit and healthy, to perform to the best of our ability.\n\"The club's stance was that if we were paid - at the time of that meeting, we weren't paid - we must be able to field a team and put our best foot forward, and if we didn't do that there would be repercussions and consequences, I suppose like there would be in any team.\n\"It's a really sensitive topic for us because of what we've been through over the last six months. It was a sensitive issue but ultimately there are people at the club who have got to protect the club, and players want to protect themselves and their families so it's a really touchy and awkward scenario.\"\nHe said the problems have taken their toll, adding: \"It's obviously been tough. When you see your friends and close team-mates struggling, it's not nice.\n\"Seeing players' mental wellbeing deteriorate in front of your eyes is certainly not nice. It's been a long process with a lot of us just hoping that there's light at the end of the tunnel.\"\nBrierley has been a key performer for Salford in recent seasons but he said his own future would be decided in the near future.\nHe said: \"You'd be foolish to ignore all the talk and the issues around the club so my agent will be doing his best to make sure my best interests are at heart and he looks after my priorities.\n\"Ultimately, while I'm contracted to Salford Red Devils and keep getting paid to be a professional rugby league player, I'll always put my best foot forward and put my hand up to play for this club.\n\"Those conversations will be ongoing over the next couple of days or weeks going forward but whilst I'm still contracted I've still got a job to do.\"\nRowley expressed a belief the crisis may be coming to an end, saying: \"I've always been looking to the middle of April for the proposed stadium purchase.\n\"So logic tells me you might need a few quid to purchase a stadium. This is purely me, not fact, but my rationale was to fasten my seat belt and hold on, with a couple of bumpy months coming up.\n\"That's just my rationale, which I explained to the players the other day. If that is right, and I'm not saying I'm right, then I guess the lack of communication throughout, outwardly and inwardly, has led to people making their own mind up.\"\nOf the two players who refused to play, Rowley said: \"I think the healthiest way for me is to focus on the players that were playing and in that dressing room because they deserve my full attention. I'll give my full energy to them.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/cq6744jn4mqo"}