{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 05:20:29", "date_modify": "2025-05-21 05:20:29", "date_publish": "2025-04-03 13:11:42", "description": "Arsenal defender Gabriel requires surgery on his hamstring that will rule him out for the remainder of the season.", "filename": "sport_football_articles_cdrgdvzx85ko_1747804829.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7949/live/94021410-108e-11f0-94b3-d3222284d093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdrgdvzx85ko_1747804829.html", "title": "Arsenal defender Gabriel to miss remainder of the season with hamstring injury", "title_page": "Arsenal defender Gabriel to miss remainder of the season with hamstring injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal defender Gabriel will miss the remainder of the season after the club confirmed he requires hamstring surgery.\nThe Brazilian was substituted in the first half of Arsenal's 2-1 win against Fulham at the Emirates stadium on Tuesday.\nThe former Lille defender has started 28 of Arsenal's 30 Premier League matches this term, helping the club to the best defensive record in the division with 25 goals conceded.\nArsenal say the 27-year-old is aiming to return to action in time for the start of the 2025-26 campaign.\n\"Gabi will undergo a surgical repair procedure to his hamstring in the coming days, and immediately begin his recovery and rehabilitation programme, with the aim to be ready for the start of next season,\" the club said.\nGabriel's absence could have a significant impact on the team, with the website Premier League Injuries reporting that Arsenal's win percentage drops significantly when he does not feature.\nSince his league debut, Arsenal have won 63.5% of the 159 games he has played, but only 40.9% of the 22 he has missed.\nIt is the 119th hamstring injury in the Premier League so far this season, an average of four injuries to the muscle each round of games.\nLast season saw 163 hamstring injuries - the highest for five years - according to figures from Premier Injuries.\nArsenal are second in the Premier League, 12 points behind leaders Liverpool with eight matches remaining.\nThe Gunners face holders Real Madrid in the Champions League quarter-finals.\nCarlo Ancelotti's side visit north London on 8 April (20:00 BST), before travelling to the Bernabeu for the second leg on 16 April (20:00 BST).", "url": "https://www.bbc.com/sport/football/articles/cdrgdvzx85ko"}