{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:37", "date_modify": "2025-05-20 12:20:37", "date_publish": "2023-08-05 00:00:00", "description": "England beat defending champions New Zealand to reach a first Netball World Cup final - follow reaction.", "filename": "sport_live_netball_65930745_1747743637.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/009C/production/_130665100_netball_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65930745_1747743637.html", "title": "Netball World Cup 2023 LIVE: Watch England v New Zealand live & follow text commentary", "title_page": "Netball World Cup 2023 LIVE: Watch England v New Zealand live & follow text commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nIt's goodbye, but only for now.\nWe'll be back at around 15:00 BST for more semi-final action to find out who will take on England for the gold medal on Sunday.\nWill it be Jamaica or Australia? As it is, I don't think England will care.\nTry to get your breath back, get some lunch. See you shortly.\n'We've already gone where no Roses side has gone before'\nFT: England 46-40 New Zealand\nBBC Sport\nEngland Head Coach Jess Thirlby speaking to BBC TV:\n\"I know it is predictable but it is just pride.I just feel like the journey this team have gone on...\n\"Everyone wants the same thing. Every team will say they are tight and they have learned and grown, but for the last few games there has just been a different feel to this campaign.\n\"Sometimes you just have to sit tight through the ups and downs, the wins and the lossess, and we have done that.\n\"To see out a game goal for goal hasn't really been characteristic of us yet. But to overcome Australia and then finish a game like that with a five or six goal run against the defending champions...\n\"I think the mental side of our game has massively shifted. Sometimes it takes 56 minutes before you get the reward but they kept at it and got it in the end.\"\nJamaica to take on Australia for place in final\nWell, that's not all folks. Jamaica will take on Australia at 15:00 BST for a place in the final.\nIf the Sunshine Girls come out on top it will be the first time we have ever had a Netball World Cup final which hasn't included Australia or New Zealand.\nYou can watch that match on BBC iPlayer from 15:00 BST.\n'Absolutely incredible! Wow!'\nFT: England 46-40 New Zealand\nBBC Sport\nEngland co-captain Nat Metcalf speaking to BBC TV:\n\"Absolutely incredible isn't it? I'm full of emotion right now. I was really emotional with about 45 seconds to go. I think the girls on court today were phenomenal, our bench, our back bench, the coaches, it was a massive team effort. I'm just so proud that we are in a World Cup final. Wow!\n\"It's been a tough year coming off the back of the Commonwealth games. finishing fourth is not where we wanted to finish. We've done the work and looked at everything, on court and off court, we've left no stone unturned. It is just pure pride to wear the red dress and line up alongside the girls every day.\"\nOn finally beating New Zealand at a World Cup:\n\"At times it didn't feel so magical out there. It was very hard out there at times because New Zealand are an incredible side. But two things were key, sticking to the game plan and processes and then the belief. Fran Williams' interception at the end, wow, her bread and butter and really helped to win the game for us.\"\nOn the final:\n\"We've got to celebrate and enjoy the moment, what a moment it is for England netball. But we need to make sure we stick to the processes and remain consistent as we have done the entire tournament.\"\n'Not bothered who we face in the final'\nFT: England 46-40 New Zealand\nBBC Sport\nEngland co-captain Layla Guscoth, speaking to BBC TV, on the performance of Fran Williams: \"We've got such a good defensive unit at the moment, not just Fran but Funmi, Geva, myself, we have such different skillsets and we all really work for each other.\n\"Fran is an incredible player and is such a big asset for this team. She played a huge part in our journey to this point.\"\nWho would you rather face in the final?\n\"I don't really care! I will be watching with great interest, I'm sure it is going to be a great semi-final [Jamaica v Australia]. But I'm not bothered who we face.\"\n'I can't believe it'\nFT: England 46-40 New Zealand\nBBC Sport\nEngland co-captain Layla Guscoth speaking to BBC TV:\n\"I can't believe it. We've had so much criticism over the last year and if people could see the amount of hard work we've put in... Everyone deserves it so much.\n\"Everyone here, everyone at home who has put so much into this team, we are so grateful to get the chance to play in a World Cup final. We celebrate, we rest and we come back tomorrow.\nOn how England pulled away in the fourth quarter:\n\"We've focused a lot on grinding out games. In the past if we went a goal down or tried to go goal for goal, we didn't have the headspace to cope with that. But we've worked a lot on how to just grind it out.\n\"We played number one in the world a few days ago, we played the world number two today, these games aren't going to be easy. We just have to stick with it and get the result in the end.\"", "url": "https://www.bbc.com/sport/live/netball/65930745"}