{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-19 15:32:21", "date_modify": "2025-05-19 15:32:21", "date_publish": "2017-07-03 17:56:47", "description": "British number one Johanna Konta wins at Wimbledon for only the second time, beating Hsieh Su-Wei in the first round.", "filename": "sport_tennis_40483984_1747668741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1715/production/_96790950_konta.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40483984_1747668741.html", "title": "Wimbledon 2017: Johanna Konta races through first round", "title_page": "Wimbledon 2017: Johanna Konta races through first round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British number one Johanna Konta won only her second match in the Wimbledon main draw as she beat Chinese Taipei's Hsieh Su-Wei in the first round.\nSixth seed Konta, 26, secured a 6-2 6-2 victory against the player who beat her at the French Open in May.\nShe showed few signs of a back injury which forced her to pull out of her Eastbourne semi-final last week.\nKonta will face Croatia's Donna Vekic, who beat her in the Nottingham Open final last month, in the second round.\nKonta needed little over an hour to power past Hsieh, breaking the world number 113's serve five times in a routine win.\n\"I'm very happy to come through that. She is a tricky player on any surface,\" said Konta.\n\"She beat me at the French Open and I was looking forward to playing her again to try and beat her.\"\nKonta is the first British woman to be ranked in the top 10 at Wimbledon since 1984, raising hopes she can become the first home player to win the ladies' singles title since Virginia Wade in 1977.\nKonta's form on the grass has been largely positive this year - she reached the Nottingham Open final, and made the last four at Eastbourne last week.\nBut between those two tournaments she struggled in a heavy defeat by American Coco Vandeweghe in Birmingham.\nThere had been doubts about her fitness after her heavy fall in Eastbourne, but she came through a practice session on Sunday and had no problems with her movement or power on Monday.\nWith a wide-open draw missing the pregnant Serena Williams, the Briton is one of several names being talked up as a contender.\nHowever, she had won only one main-draw match at the All England Club, beating Monica Puig before losing in last year's second round to 2014 finalist Eugenie Bouchard.\nFormer British number one Annabel Croft:\n\"It was a very business-like performance from Johanna Konta and her team will be pleased with that.\n\"Konta was fairly consistent and that will come together more as she goes through the tournament.\n\"She served well, had a very good second serve, her backhand was rock solid.\n\"All in all I thought it was a very good performance.\"", "url": "https://www.bbc.com/sport/tennis/40483984"}