{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:11", "date_modify": "2025-05-21 04:40:11", "date_publish": "2025-01-18 00:00:00", "description": "Follow live text commentary, score updates and match stats from Portadown vs Linfield in the Irish Premiership", "filename": "sport_football_live_czrl76n3lljt_1747802411.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_czrl76n3lljt_1747802411.html", "title": "Irish Premiership: Watch highlights as Cooper treble sees Blues past Ports", "title_page": "Irish Premiership: Watch highlights as Cooper treble sees Blues past Ports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nThat is all from us on a good day for Linfield, who move 15 points clear at the top of the table as Joel Cooper's hat-trick helped them to a 3-1 win against Portadown.\nCliftonville and Crusaders got back to winning ways with victories over Loughgall and Coleraine respectively.\nCarrick Rangers and Ballymena United played out a drab 0-0 draw.\nThe game at the Oval between Glentoran and Larne was abandoned early in the second half with the score at 0-0 following floodlight failure.\nYou can read the report from the games here.\nWe will have highlights and reaction to follow on the BBC Sport website, but for now, goodnight.\n'Great day for Linfield'\nFT: Portadown 1-3 Linfield\nColin Coates\nGlenavon first team coach on Sportsound\nGreat day for Linfield, that was a tricky game on a difficult pitch, but Joel Cooper's hat-trick has them ahead, a bit of a storm came from Portadown but Linfield used their experience and saw the game out. To go 15 points clear even with games played and games not played is a huge lead and you would be very surprised if they don't go on and win the Gibson Cup.\nFULL-TIME\nColeraine 0-2 Crusaders\nAll over at the Showgrounds where Crusaders leave with the points after a 2-0 win.\nJacob Blaney headed the visitors in front just after the half hour before second half sub' Harry Jewitt-White secured the win deep into added time.\nThe home side created a number of chances over the 90 minutes, hitting the woodwork twice, but were unable to find a way through an organised Crusaders backline.", "url": "https://www.bbc.com/sport/football/live/czrl76n3lljt"}