{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:12:22", "date_modify": "2025-05-21 06:12:22", "date_publish": "2025-04-01 12:35:51", "description": "Brighton news: Fabian Hurzeler praises Brajan Gruda's development", "filename": "sport_football_articles_crrz5knl1kvo_1747807942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3ad9/live/84ec2410-0ef5-11f0-b65c-119a1680d4e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crrz5knl1kvo_1747807942.html", "title": "Brighton news: Fabian Hurzeler praises Brajan Gruda's development", "title_page": "Brighton news: Fabian Hurzeler praises Brajan Gruda's development - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton boss Fabian Hurzeler says 20-year-old Brajan Gruda will be given the chance to \"step into the spotlight\" after revealing that starting XI mainstay Georginio Rutter has picked up an ankle injury which \"doesn't look great\" and could put him on the sidelines long term.\nGruda scored for Germany Under-21s during the international break and was handed a 45-minute runout in the Seagulls' FA Cup quarter-final defeat by Nottingham Forest.\nThe attacking midfielder joined Brighton from Mainz in August 2024, and Hurzeler was quizzed on the development he has shown since completing his move in his news conference before Albion host Aston Villa on Wednesday.\n\"He made a great impression in the last game against Nottingham Forest. He had a big impact on our game - he was very fluent, he defended quite well, he was very active and he created a lot of chances for us.\n\"I'm happy with his development so far - and now there is the chance for him to step into the spotlight, which I'm sure he is really looking forward to.\n\"It's the physical side of his game that he needs to improve. The intensity is what all of the new players we have this season need to adapt to. They have all said it themselves.\n\"It's the same procedures for Brajan. He is adapting, training hard and trying to keep improving every day.\n\"Some players will be ready a little bit earlier than others who will be ready a little bit later, but I'm sure he has the potential to help us. Hopefully we will see that for the rest of the season.\"", "url": "https://www.bbc.com/sport/football/articles/crrz5knl1kvo"}