{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:05", "date_modify": "2025-05-19 15:06:05", "date_publish": "2015-03-03 15:58:35", "description": "Paddy Barnes wins his latest World Series bout but Michael Conlan loses as both aim to secure Olympic berths.", "filename": "sport_boxing_31717200_1747667165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81087000/jpg/_81087467_inpho_00832455.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_31717200_1747667165.html", "title": "Paddy Barnes & Michael Conlan have mixed fortunes in Almaty", "title_page": "Paddy Barnes & Michael Conlan have mixed fortunes in Almaty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Belfast boxers Paddy Barnes and Michael Conlan had mixed fortunes in their latest World Series bouts which are serving as Olympic qualifiers.\nBarnes remains joint-top of the light-flyweight rankings after a fourth straight win for his Italian Thunder team in Almaty, Kazakhstan.\nHowever, Conlan slipped to third in the bantamweight rankings after a controversial defeat in Almaty.\nConlan appeared unlucky to lose a split decision to Kairat Yeraliyev.\nOne of the three judges felt Conlan, also representing Italian Thunder, had won all five rounds but the other two gave the verdict on a split decision to the current world-ranked number one.\nConlan needs to finish in the top two in the WSB bantamweight rankings to earn his Olympic berth through that route.\nAfter his latest victory over Kazakhstan's Asian champion Temirtas Zhussupoy, Barnes remains at the top of the light-flyweight rankings alongside Uzbekistan's Hasanboy Dusnatov.\nOnly the top ranked light-fly at the end of the regular World Series season in April will qualify for Rio via that route.\nBallymena welterweight Steven Donnelly is also in strong contention to book his Rio berth from the World Series.\nDonnelly, who is representing the Hussars of Poland, is currently third in the welterweight standings and the top three in the WSB division will qualify for the Olympics.", "url": "https://www.bbc.com/sport/boxing/31717200"}