{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:07", "date_modify": "2025-05-21 07:36:07", "date_publish": "2025-01-25 00:00:00", "description": "Listen to live radio commentary and follow live text coverage as Scarlets face Edinburgh in the United Rugby Championship.", "filename": "sport_rugby-union_live_cx2pj0d0wxpt_1747812967.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_cx2pj0d0wxpt_1747812967.html", "title": "URC: Scarlets v Edinburgh", "title_page": "URC: Scarlets v Edinburgh -  listen &  live text, BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nFT: Scarlets 30-24 Edinburgh\nThat's all from me on live text duties, as Scarlets edge out Edinburgh in a captivating URC contest.\nYou can read the match report or scroll back through this page if you want to relive the action.\nEdinburgh 'overzealous at times' - Everitt\nFT: Scarlets 30-24 Edinburgh\nEdinburgh head coach Sean Everitt tells Premier Sports: \"Very important two bonus points if you look at the jam in the log.\n\"Disappointed for the guys to not get the result. They were probably overzealous at times and gave away unnecessary penalties. I can't lack the effort and we'll take the two points.\n\"We lost the game in the third quarter - gave away four penalties and conceded two tries. We knew Scarlets would be strong after the half - they pegged us into our half.\"\n'Scoring mauls the difference' - Peel\nFT: Scarlets 30-24 Edinburgh\nScarlets head coach Dwayne Peel tells Premier Sports: \"We stayed in the fight and that's pleasing for us.\n\"We managed the game well second half, had a lot of territory and kept them out.\n\"We've got a young group of players. Ioan Lloyd controlled the game well from 10.\n\"The way they want to defend in Scotland - they want to hold the ball up in the middle and so we spoke about being physical in the middle of the field and controlling the pace of play.\n\"We probably weren't as accurate as we could have been, but scoring mauls is the difference between winning and losing games now.\n\"Johnny Williams has grown into a real leader. We know with the ball he's been good, but defensively he's grown in the last period.\"\n'Boys really stepped up'\nFT: Scarlets 30-24 Edinburgh\nScarlets captain Josh Macleod tells Premier Sports: \"That was big in the context of our season.\n\"They were just behind us in the table, and the boys really stepped up.\n\"[Johnny Williams] showed the player he is today, to come back from his knock and do what he did today. I'm very happy to be playing alongside him.\"\n'A different buzz about this squad'\nFT: Scarlets 30-24 Edinburgh\nScarlets centre and player of the match Johnny Williams tells Premier Sports: \"It was really good. The last one before a little break so that was massive for us.\n\"My role in the team is being a bit of a defensive leader. Putting those big shots in is what the team needs.\n\"From the start of the season the new recruits have been amazing for us. There's a different buzz about this squad.\"", "url": "https://www.bbc.com/sport/rugby-union/live/cx2pj0d0wxpt"}