{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:05", "date_modify": "2025-05-21 05:33:05", "date_publish": "2025-04-02 16:59:44", "description": "Portsmouth boss John Mousinho says staying up is the \"most important thing\" at this stage of the Championship season.", "filename": "sport_football_articles_cx20n050933o_1747805585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edcd/live/1ad04e10-0fe2-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx20n050933o_1747805585.html", "title": "Avoiding relegation is all that matters - Mousinho", "title_page": "Portsmouth FC: Avoiding relegation is all that matters - Mousinho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kusini Yengi is \"fine\" and has been back in full training this week after missing the 1-0 win over Blackburn with a hamstring injury he picked up on international duty in training with Australia.\nDefenders Rob Atkinson and Conor Shaughnessy are both \"very close to returning to full training\" but neither will be fit to play this weekend.\nAlex Milosevic is \"very hungry\" to make his debut and \"doing everything he can to get up to speed\" after signing in March until the end of the season.\nMillwall have been a \"very solid team this season\" and Alex Neil has done a \"good job\".\n\"I thought they were excellent [at Sunderland] and unlucky to lose 1-0,\" Mousinho told BBC Radio Solent. \"They're a very physical, dangerous side that can also play. It would be a bit of an error to think it's just going to be a physical game. They play some good football as well.\"\nOn how big an achievement it would be if Pompey finished in mid-table: \"Honestly, we're not thinking about that at the moment. The only thing we have to worry about is where we are in relation to the bottom three. That's the most important thing at this stage of the season.\"\nMousinho added: \"If we manage to do it, the next part of progression through the summer will be looking at how we turn ourselves into a more comfortable mid-table team next year.\"", "url": "https://www.bbc.com/sport/football/articles/cx20n050933o"}