{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-04-26 06:26:04", "date_modify": "2025-04-26 06:26:04", "date_publish": "2025-02-28 21:10:55", "description": "Armand Duplantis clears 6.27m at the All Star Perche event in France, while Britain's Molly Caudery has a big win in Madrid.", "filename": "sport_athletics_articles_c3rn8qq2elxo_1745648764.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d57/live/cf6350b0-f625-11ef-bf3c-6bef5f502c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_c3rn8qq2elxo_1745648764.html", "title": "Mondo Duplantis breaks men's pole vault world record for 11th time", "title_page": "Mondo Duplantis breaks men's pole vault world record for 11th time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Armand Duplantis improved his own men's pole vault world record to 6.27m at the All Star Perche event in Clermont-Ferrand, France.\nIt is the 11th time Olympic and world champion Duplantis has broken the world record in his career.\nThe Swedish 25-year-old secured victory at the event with a clearance over 6.02m before he attempted to improve his record mark, set in August, by one centimetre.\nDuplantis did so with his first attempt, five years after breaking the record for the first time with a height of 6.17m in February 2020.\nHe improved the world record to 6.25m when winning a second successive Olympic title at the Paris 2024 Games last summer and then went a centimetre higher in late August in Poland - the third occasion he improved his mark in 2024.\nDuplantis' first world record, which he achieved aged 20, beat a mark set by France's Renaud Lavillenie that had stood for nearly six years.\nHe has continued to progress the record in one-centimetre increments ever since, while securing 10 major international titles in the process.\nIn Paris, Duplantis became the first man to retain the Olympic pole vault title since American Bob Richards in 1952 and 1956, while in 2025 he will have the opportunity to complete hat-tricks of gold medals at both the indoor and outdoor world championships.\nBritain's Molly Caudery claimed the overall World Indoor Tour Gold title with victory at the final meeting of the series in Madrid.\nReigning world indoor pole vault champion Caudery, 24, cleared a season's best 4.85m as she took maximum points and beat Slovenia's Tina Sutej to the title.\nSutej, who had led the standings going into the final, was the only other athlete to clear 4.70m but she had no response to Caudery's first-time vault over 4.75m.\nIt meant England's Caudery, who added to her win in Karlsruhe and second place in Lievin, accumulated 27 points with her best three series performances - three points ahead of Sutej.\nHowever, Caudery later announced she would skip the European Indoor Athletics Championships, which start on Thursday in Apeldoorn in the Netherlands, to focus on defending her global title in Nanjing, China from 21-23 March.\n\"My team and I have made the tough decision not to compete in Apeldoorn, choosing instead to fully focus on the World Championships,\" she posted on Instagram., external\n\"I'm managing a small calf injury and after careful consideration, we believe this is the best way to ensure I can be 100% healthy for Worlds.\"\nOne of those due to be in action in Apeldoorn, fellow Briton Bianca Williams, ran a personal best of 7.16 seconds in the women's 60m to place second on the night in Madrid.\nThat performance came one week after Williams lowered her best to 7.19 secs when winning the British indoor title for the first time.", "url": "https://www.bbc.co.uk/sport/athletics/articles/c3rn8qq2elxo"}