{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 05:33:14", "date_modify": "2025-05-21 05:33:14", "date_publish": "2025-04-02 16:32:31", "description": "Worcestershire begin their County Championship season against Somerset at Taunton on Friday and are looking to defy the odds once again.", "filename": "sport_cricket_articles_cn7xmr8xx1mo_1747805594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0368/live/ca762410-0fb6-11f0-a36a-c7d6d61d7af6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cn7xmr8xx1mo_1747805594.html", "title": "County Championship: Worcestershire look to defy odds to stay in Division One", "title_page": "County Championship: Worcestershire look to defy odds to stay in Division One - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcestershire go into 2025 looking to break new ground.\nNot on their new proposed second home - that is still a long way down the pipeline as they analyse how best to combat the increased flood risk at their New Road home.\nThis season is simply all about trying to stay in English county cricket's top flight for a third successive season.\nSince the County Championship was turned into a two-division competition in 2000, the Pears have won promotion seven times.\nFive times out of the previous six, they were then relegated at the first attempt. But they did finish seventh to survive in 2011, before going down a year later.\nLast year they improved on that to finish sixth - their best finish in the 24 seasons of a two-tier Championship structure.\n\"We did remarkably well to finish top six,\" Pears head coach Alan Richardson told BBC Sport. \"And you'd like to think we can evolve from that.\n\"Historically, it hasn't always proved easy for us to stay in the top division.\"\nRichardson, who has now won promotion with the Pears both as player and coach, was in that 2011 team who stayed up. In fact, he proved to be a large part of the reason they did, taking 73 wickets, to earn him the honour of being voted one of Wisden's five cricketers of the year.\nLast season was more of a team effort as Brett D'Oliveira bravely defied a painful season-long shoulder injury.\nGareth Roderick, Jake Libby and Kashif Ali made key runs, all-rounder Matthew Waite stood up to be counted, now-retired Joe Leach pushed the pain barrier for one last time - and every member of the team made key contributions at one stage or another.\nIt helped them overcome the mid-season departure of New Zealander Nathan Smith, who has now moved on to Surrey.\nBut they also responded admirably to the early season loss of team-mate Josh Baker, when he died at the tragically young age of 20.\n\"It was a huge statement about this group that we got through that,\" said Richardson.\n\"We always knew last season was going to be very challenging and that we'd be tested and that we would need resilience and character - and then we had the tragic loss of Josh Baker on top of it all.\n\"Seeing how we got through it and how the players and all the people at the club looked after each other was incredible.\n\"It's something that will stay with this group of players. Josh will always be with us. His legacy will continue.\"\nAs for how this year will go, the Pears' warm-weather preparations could not have gone any better - both out at their Desert Springs Resort training camp in Andalucia in Spain and then back in Worcestershire at Kidderminster during an amazingly mild late March.\nLast year, they did not host any Championship cricket at New Road until 26 May because of a succession of floods.\n\"The weather has been very kind to us,\" said Richardson. \"We haven't missed a ball of pre-season, which is the first time in living memory for me.\n\"We had three fast bowlers out at the end of last season - Adam Finch, Ben Gibbon and Yadvinder Singh.\n\"All those guys have come through pre-season with flying colours.\"\nMention of the better weather does not mean to say there has not been flooding over the winter. But there has not been enough to prevent the team being ready to stage their first home game at the end of the month, after starting with away trips to Somerset, promoted Yorkshire and then to Essex.\n\"We've been challenged again,\" said chief executive Ashley Giles. \"But we're very much looking forward to the new season - and to starting again at New Road on 25 April.\"\n\"There have only been four full floods at New Road this winter. That's an improvement on last year.\"", "url": "https://www.bbc.com/sport/cricket/articles/cn7xmr8xx1mo"}