{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:16", "date_modify": "2025-05-20 13:35:16", "date_publish": "2023-08-01 18:03:50", "description": "Kent's Joey Evison and Ben Compton score two of four hundreds on the opening day of the One-Day Cup - with two hat-tricks as well.", "filename": "sport_cricket_66353695_1747748116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D732/production/_130609055_shutterstock_editorial_14031435ad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66353695_1747748116.html", "title": "One-Day Cup: Holders Kent win on day of four centuries and two hat-tricks", "title_page": "One-Day Cup: Holders Kent win on day of four centuries and two hat-tricks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joey Evison and Ben Compton scored centuries as One-Day Cup holders Kent began this season's competition with a rain-affected win over Yorkshire.\nEvison raced to 136 off 106 balls and Compton made 103 as they totalled 282-9, despite Matthew Revis' hat-trick.\nDurham's Liam Trevaskis also took a hat-trick but Worcestershire beat them by 42 runs at the Riverside.\nThere were also hundreds for Ollie Price and Fletcha Middleton in wins for Gloucestershire and Hampshire.\nThe game at Sedbergh School ended as a no result because of rain, with Essex 23-2 in the seventh over after Lancashire made 270-7 from 36 overs.\nKent made a poor start after being put in by Yorkshire at Scarborough and found themselves 49-4, thanks to Ben Coad's superb spell of 3-16, before Compton and Evison - opening partners in the 2022 final against Lancashire - put things right.\nWith Compton accumulating steadily, Evison went for his shots batting at six and hit seven sixes as he brought up his hundred from only 84 balls - before he was caught off Dom Leech in the 48th over.\nThe 49th was dramatic as Revis removed James Bazley, Grant Stewart and Hamidullah Qadri with successive deliveries, and Compton was run out by Dom Bess attempting a second run from the final ball of the innings.\nThe weather twice interrupted Yorkshire's innings and their DLS target was eventually rounded down to 120 off 17 overs but, after George Hill was stumped off Bazley for 35, they ended on 117-4 to lose by two runs.\nHampshire beat Middlesex by 18 runs via the DLS method at the Ageas Bowl after rain interrupted their chase, with the score on 238-5 after one ball of the 38th over.\nMiddleton hit a six and seven fours in his run-a-ball century, which was also marked by excellent running between the wickets as he shared stands of 74 with Nick Gubbins (40), 65 with Tom Prest (38) and 62 with Felix Organ (33).\nHe was out in the over after reaching his first three-figure score in any form of the game, caught behind as he tried to square cut Sam Robson's occasional leg-spin.\nEarlier, Middlesex totalled 309-7 in their 50 overs thanks chiefly to Ryan Higgins, who made 78 off 53 balls and James Cracknell's steady 64 at the start of the innings.\nThe start was delayed by two hours between Lancashire and Essex but Australian signing Beau Webster impressed for the visitors as he took 3-59, and caught Lancashire skipper Keaton Jennings at slip for 19.\nDane Vilas made 65 off 44 balls and former Sedbergh pupil Tom Aspinwall hit three sixes in his 22 off 10 balls at the end of the innings, before later taking an excellent catch to dismiss Robin Das off Will Williams in Essex's brief reply before the match was washed out.\nGloucestershire all-rounder Ollie Price continued his prolific form at Cheltenham's College Ground with a match-winning 116 not out as they beat Derbyshire by six wickets.\nHaider Ali's 82 off 65 balls and 50 from Luis Reece enabled the visitors to reach 298-9 despite Paul van Meekeren's 4-66, but, although Gloucestershire lost both openers early, Ireland's Harry Tector marked his debut after being signed on loan with four sixes in his 86 off 69.\nHe put on 142 in 20 overs with Price, who followed scores of 84 and 115 in recent Championship games at the same ground by reaching his first limited-overs century off 101 balls.\nJack Taylor helped himself to an unbeaten 51 off 47 as they finished the job with a stand of 92, Price punching the ball through mid-on for three as they reached 299-4 with 6.4 overs to spare.\nWorcestershire proved too strong for Durham at the Riverside despite the bowling of left-arm spinner Trevaskis, whose hat-trick gave him figures of 4-50.\nHe trapped Pears loan signing Rob Jones leg-before in the 22nd over and, with the final three balls of the 42nd, had Kashif Ali lbw for 76, made from just 59 balls, and bowled Matthew Waite and Joe Leach.\nKashif's stand of 82 with Jake Libby (45) had, though, laid the foundation for a good total - and Ben Cox finished things off with an unbeaten 57 off 49 balls as the visitors reached 318-9.\nOpener Graham Clark made 79 off 70 in reply but Josh Baker - who had him stumped by Cox - and Brett D'Oliveira claimed three wickets each and Durham were all out for 276 in the 27th over despite 60 not out by Jonny Bushnell, as they lost by 42 runs.", "url": "https://www.bbc.com/sport/cricket/66353695"}