{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:37:07", "date_modify": "2025-04-26 06:37:07", "date_publish": "2025-02-26 00:00:00", "description": "Latest Premier League news and build-up to Wednesday's matches with Arsenal, Man City and Liverpool all in action.", "filename": "sport_football_live_c2erx7z3xy8t_1745649427.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c2erx7z3xy8t_1745649427.html", "title": "Recap latest Premier League news & build-up: Arne Slot touchline ban, Erik ten Hag player criticism", "title_page": "Recap latest Premier League news & build-up: Arne Slot touchline ban, Erik ten Hag player criticism - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Recap Premier League build-up, team news & stats\nThat's all from us today.\nYou can click on the summary points towards the top of this page and scroll down the page for Premier League build-up, team news and key stats before Wednesday's games.\nWe'll be back this evening to bring you live text coverage of tonight's Premier League games from 18:00 GMT.\nAlternatively, we'll be back tomorrow morning from 07:00 GMT to do it all over again.\nSee you then!\nFormer Liverpool executive on Salah's contract situation\nLiverpool v Newcastle (20.15 GMT)\nNizaar Kinsella\nBBC Sport football news reporter\nWhen asked how to factor in Mohamed Salah's age into his contract situation at the FT Business of Football Summit, Ian Graham, former director of research at Liverpool said: “I helped with the work for the last contract extension which sees him through to this summer and, at the time, I thought for players of his age that I would recommend not to sign a contract.\n\"But this was the strength of the data that forces you to take an objective viewpoint and it surprises yourself. I was surprised at looking at his calibre of player and how they could go into their 30s performing at the same level.\n\"When those players drop off it tends to be a drop in minutes rather than quality. It tends to be a drop in minutes rather than performance. We decided to give him a contract in the summer of 2022 and that was a hard piece of work.\n\"I am delighted I am not responsible for that piece of work today. That’s the best piece not to do that today.”\nLiverpool v Newcastle - Sutton's prediction\nLiverpool v Newcastle (20:15 GMT)\nThis fixture has plenty of history behind it - Liverpool's 4-3 win at Anfield in 1996 will always be remembered as a Premier League classic.\nNewcastle come into it in good shape after a good win over Nottingham Forest, but the way Liverpool beat Manchester City was extremely impressive.\nIt was such a mature performance by Arne Slot's side to soak up City's possession and be so clinical in front of goal.\nI think we know by now that Slot's side will be hard to beat, while Newcastle are still quite up and down - they were very poor when they went to Etihad Stadium last week.\nThey are capable of giving Liverpool a good game but I am going to say that the leaders will take the points, and carry on their title charge.\nAlong with Forest striker Chris 'The Wood Chopper' Wood, Newcastle's Alexander Isak has been one of the best players in the Premier League this season, but there is only one candidate to be crowned Player of the Year.\nLiverpool's Mohamed Salah's numbers are extraordinary and he looks as hungry as ever. He has been relentless, and he is not done yet.\nChris Sutton's prediction: 2-1\nBradley out for 'a few weeks'\nLiverpool v Newcastle (20.15 GMT)\nLiverpool midfielder Alexis Mac Allister sustained bruising to his face during the weekend win over Manchester City but he is expected to be available.\nConor Bradley will remain sidelined for a \"few weeks\" with a muscle injury, according to head coach Arne Slot.\nNewcastle pair Sven Botman and Joelinton could both return from the knee injuries that have kept them out since the beginning of the month.\nFit-again midfielder Sandro Tonali made his comeback as a substitute against Nottingham Forest on Sunday.\nTottenham v Man City - Sutton's prediction\nTottenham v Man City (19:30 GMT)\nHow on earth am I supposed to predict what will happen here?\nIt's a fascinating game but it's impossible to call because it could end up 3-0 to either team.\nManchester City were subdued against Liverpool and while Jeremy Doku looked bright on their left flank, they didn't offer much of a threat elsewhere.\nTottenham put four goals past Ipswich but they could have conceded a few themselves, and you have to think City will have opportunities here.\nSpurs thumped Pep Guardiola's side 4-0 in November, but I am going for City to take the points this time. It will be close but they might just nick it.\nChris Sutton's prediction: 1-2\nMan Utd v Ipswich - Sutton's prediction\nMan Utd v Ipswich (19:30 GMT)\nManchester United drew at Ipswich in November, in Ruben Amorim's first game in charge.\nThree months on, Ipswich will head to Old Trafford thinking they have a decent chance of beating them. No-one fears United at the moment.\nYou just don't know which United side is going to turn up and, in the first half against Everton on Saturday, they were absolutely woeful.\nUnited do deserve some credit for the way they fought back from 2-0 down to draw 2-2 at Goodison Park but I am not convinced by them at all.\nIpswich ended up losing 4-1 to Tottenham at the weekend but they created a ridiculous amount of chances in that game, and they will get opportunities here too because Liam Delap is such a handful.\nA win for the Tractor Boys would be huge, especially now the gap to fourth-bottom Wolves has grown to five points, but despite United's many problems I just have a feeling Amorim will get a win, somehow.\nChris Sutton's prediction: 2-1\nHow long has Drogba known Mourinho?\nEarlier, when posting a statement in support of Jose Mourinho, Drogba said he knew Mourinho for \"xx\" years.\nHowever, since Drogba's initial post, he has since edited it and changed xx to 25 years.\nMourinho first signed Drogba from Marseille for Chelsea in July 2004 from Marseille.\nAfter departing Chelsea in 2012, Drogba returned for the 2014-15 season under Mourinho, where Chelsea won the fourth of their five Premier League titles.\nIn the season prior to the duo joining Chelsea in 2004, Drogba played twice against Mourinho while at Marseille when Mourinho managed Porto. Porto won both Champions League ties, but Drogba did score one goal.\nForest v Arsenal - Sutton's prediction\nNottingham Forest v Arsenal (19:30 GMT)\nSaturday's home defeat by West Ham was a real hammer blow for Arsenal's title hopes.\nThey need to bounce back and find a way of beating Nottingham Forest but this is a tough trip after such a devastating result, and I am not so sure they will take the points here either.\nForest are not in great form themselves, and got a bit of a walloping by Newcastle. Nuno Espirito Santo was clearly unhappy with some of his side's defending in that game.\nBut how are Arsenal going to score goals? I don't know at the moment.\nIf Gunners boss Mikel Arteta needs a left-back, he has got a few of them on the bench. Unfortunately he needs a centre-forward, and there is not one of those to be seen.\nChris Sutton's prediction: 1-1\nNothing to say Son will slow down - Postecoglou\nTottenham v Man City (19:30 GMT)\nTottenham Hotspur\nTottenham head coach Ange Postecoglou does not see winger and captain Son Heung-min slowing down any time soon.\nSon provided two assists for Brennan Johnson during Saturday's win at Ipswich Town and while the South Korea international has not scored in his last seven games, he has provided three assists in that time.\nPostecoglou said: \"Sonny's benefitted from the fact he's been able to have a break between games. We saw that on the weekend - he was outstanding, particularly in the first half.\n\"You never want to try to predict with players like Sonny how long he will go for because those kind of players always defy whatever odds there are.\n\"Even this year, as difficult as it has been for us, I think his numbers still stack up. You weigh him up against any winger in the league, he's still going to be top five.\n\"Those are the facts and if he's continuing to do that, there's nothing to say he should slow down.\"", "url": "https://www.bbc.co.uk/sport/football/live/c2erx7z3xy8t"}