{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-05-21 06:44:02", "date_modify": "2025-05-21 06:44:02", "date_publish": "2025-03-30 19:58:26", "description": "Scotland take gold at the men's World Curling Championship after a dramatic 5-4 victory over Switzerland in Moose Jaw, Canada.", "filename": "sport_articles_ckg251n8q0jo_1747809842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c08/live/53454d80-1344-11f0-b455-e103a8a19ce7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg251n8q0jo_1747809842.html", "title": "World Curling final: Scotland beat Switzerland to take historic gold", "title_page": "World Curling final: Scotland beat Switzerland to take historic gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bruce Mouat's \"amazing\" Scotland secured the World Men's Curling Championship title for a second time in historic fashion after a dramatic 5-4 victory over Switzerland in Moose Jaw, Canada.\nThe Scots had to confirm their world number one ranking the hard way, becoming the first team ever to win gold after coming through a quarter-final, having only finished fifth in the round-robin.\nThey edged past reigning champions Sweden, skipped by seven-time winner Niklas Edin, 8-7 in the play-off, avenging a 10-4 round-robin loss to the current Olympic champion.\nMouat's side followed that with a fine 7-4 win over Brad Jacobs' third-ranked hosts, who had topped the round-robin with only one defeat - also by the Scots.\nThat set up a repeat of the 2021 European Championship final against Yannick Schwaller's fourth-ranked Swiss, who had also beaten the Scots in the round robin.\nBut Mouat's team prevailed once more to add to a season in which they have already recorded a hat-trick of wins in the first three Grand Slam of Curling events of the season.\n\"Amazing, it's been an interesting season,\" Mouat said. \"We have had some amazing highs and lows, but this is the highest of the highs.\n\"It's top tier. I have described it as like Wimbledon for us.\"\nAs against the Swedes and Canadians, the Scots had the disadvantage of starting the final with their opponents having last stone advantage.\nFor the third match in a row, Mouat forced his opponents to score one at the opening end and, after three consecutive blank ends, the Scots scored two in the fifth end to edge in front.\nTheir opponents retook a narrow lead with a two of their own in the sixth, but the momentum - and the lead - changed hands again with a two for Scotland before Switzerland levelled the scores in the eighth end.\nA blank ninth end set up a tense finish, but the Scots held their nerve to come out on top in an epic encounter as Mouat celebrated on the ice with teammates Grant Hardie, Bobby Lammie and Hammy McMillan after he curled a stone into the middle of the house to take the title.\n\"It was a bit of a pinch me moment to get to draw the four foot to win a World Championship,\" the 30-year-old Scotland skip added. \"That's something I've dreamt of for a long time.\n\"Playing in Canada is unbelievable, the crowds you get.\"\nFor Mouat, who first won the world title two years ago, it was the sixth win in nine major championship finals.\nHis rink now join fellow Scots Team Whyte, who won The Masters in January, at the the final Grand Slam of Curling event of the season this week in Toronto looking to complete a full set of wins by Scottish teams in the major men's competitions this season.\nThe curtain raiser to that will be a first-ever Battle of the Sexes match against Rachel Homan's women's world champions from Canada.", "url": "https://www.bbc.com/sport/articles/ckg251n8q0jo"}