{"authors": ["Ellie Thomason", "www.facebook.com"], "date_download": "2025-05-21 07:34:35", "date_modify": "2025-05-21 07:34:35", "date_publish": "2025-03-26 07:19:18", "description": "One year on from being sacked as Leicester City Women manager after he breached the club's code of conduct by having a relationship with a player, Willie Kirk wants a second chance.", "filename": "sport_football_articles_c8rk6mzxgkzo_1747812875.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95a8/live/c958c8d0-0845-11f0-97d3-37df2b293ed1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rk6mzxgkzo_1747812875.html", "title": "Willie Kirk: Former Leicester WSL boss wants second chance after relationship with player", "title_page": "Willie Kirk: Former Leicester WSL boss wants second chance after relationship with player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One year on from being sacked as Leicester City Women manager, after admitting he was in a relationship with a player, Willie Kirk wants a second chance.\nThe 46-year-old was dismissed on 28 March 2024 with the Women's Super League club saying he breached the team's code of conduct.\nKirk knows what he did was wrong and while he is still happily in a relationship with the player, and they have lived together since August, the Scot remains out of work.\n\"I have applied for every WSL and Championship vacancy since I lost my job, apart from Arsenal and Manchester City,\" Kirk told BBC Sport. \"I never got one interview.\n\"I let myself down in terms of what happened at Leicester. I understand why clubs haven't wanted to get involved, I can see why people will be upset.\n\"But in the grand scheme of things I've not committed a serious crime. There is no jail term, but it feels like there has been a jail term.\"\nKirk has spent 14 years in the women's game and previously managed Everton, Bristol City and Hibernian. He was Casey Stoney's assistant at Manchester United for six months.\nBefore taking charge of Leicester, he was the club's director of football and while he feels he has unfinished business on the touchline, he is open to a similar role and is currently studying for a masters degree in sporting directorship.\n\"I'm really keen to get back into the game,\" Kirk said. \"In what capacity I am open to that, be it the women's game or the men's game.\n\"I have not ticked all the boxes that I wanted to tick in terms of being a head coach and achieving what I want to achieve.\n\"I have done enough in the game to deserve a second chance, but it's not me that is going to decide that. I need to keep doing what I am doing. Keep applying, keep working on myself. It's frustrating but it's also understandable.\"\nKirk was initially suspended by Leicester on 8 March, 2024 - the eve of the club's FA Cup quarter-final against Liverpool - to \"assist with an internal process\" after a complaint was lodged from someone outside the club.\nHe missed three games before being sacked after the conclusion of an investigation.\nPersonal relationships between players and coaches in women's football have been criticised for potentially creating a power imbalance in a squad.\nThey are not illegal as long as no minors are involved, albeit they can breach codes of conduct.\nEach WSL club has their own code of conduct and every club must have a safeguarding officer in place.\n\"I knew there was a code of conduct, I signed it like everyone else,\" Kirk said. \"As first-team manager you are there to lead by example and that is why I have never said I shouldn't have been sacked.\n\"I got pulled into a meeting on the Friday, 30 minutes before training and was questioned about it.\n\"Sometimes I think I should have denied it and taken it to the grave, but I don't think that would have sat well with me. I admitted it and that was it.\"\nKirk was separated from his ex-wife when the relationship began, which was when the player suffered an injury. The pair travelled to Italy together in the February international break and the club were made aware shortly after.\nKirk accepts a line had been crossed and said if he had his time again things would have been done differently.\n\"At the time of the investigation, we had already called it off,\" Kirk recalled. \"We said 'we have taken this too far, this is too close for comfort, we need to put this on the back-burner until the end of the season and then one of us leave the club. If we still feel this way we can do something about it'.\"\nKirk was on a permanent contract when he was sacked but did not receive any compensation because the club found him to have committed gross misconduct.\nHe has only been to two Leicester games since his exit and regrets the manner of his departure.\n\"I never saw the staff, never saw the players,\" Kirk added. I wanted the chance to apologise to everybody face-to-face. I think they would have felt very let down.\"\nKirk is not the first women's football manager to start a relationship with a player, but he hopes he is the last.\n\"It was quite public,\" he said of his dismissal. \"I hope people think 'we cannot do this'.\n\"I have learned a hell of a lot and you never want to go through a year like I have been through. It affects everything - your professional life, your personal life, your finances, your emotional well-being.\"\nKirk continues to co-parent his four-year-old son with his ex-wife and has applied for roles abroad that would allow him to continue to do so.\nHe hasn't ruled out international management and would drop lower down the leagues for the right project. Though his preference is to return to the women's game, he knows his chances of a fresh start could lie elsewhere.\n\"Being part of the evolution of the game, I just want to remain part of it,\" he said.\n\"It feels I would be allowed to go and do my job and wouldn't be prejudiced against if I get into the men's game and it would be a clean break.\"\nKirk is remorseful but remains hopeful a club will give him an opportunity in the near future.\nHe said: \"It will never be acceptable, but when will it be accepted? Obviously I'm going to say this about myself when I am trying to find a job, but the statistics show there is a good manager out of work.\n\"I get it, but when will somebody say enough is enough, this person deserves a second chance?\"", "url": "https://www.bbc.com/sport/football/articles/c8rk6mzxgkzo"}