{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:01", "date_modify": "2025-05-21 07:20:01", "date_publish": "2025-03-30 00:00:00", "description": "West Ham become just the third team to take points off Chelsea in the Women's Super League this season, Shekiera Martinez scoring a late equaliser to rescue a 2-2 draw.", "filename": "sport_football_live_cgkmv5dxld8t_1747812001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/32c2/live/974ff710-0d8f-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgkmv5dxld8t_1747812001.html", "title": "Chelsea 2-2 West Ham United: Shekiera Martinez scores late equaliser", "title_page": "Chelsea 2-2 West Ham United: Shekiera Martinez scores late equaliser - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham became just the third team to take points off Chelsea in the Women's Super League this season, Shekiera Martinez scoring a late equaliser to rescue a 2-2 draw.\nChelsea appeared to be cruising towards their 17th win of the campaign after scoring twice in the opening 21 minutes.\nHowever, Martinez's 42nd-minute strike dragged West Ham back into the game, before the Blues were left to rue their own missed opportunities in front of goal when the German forward levelled in stoppage time.\nThe draw moves West Ham up to seventh and cuts Chelsea's lead at the top of the WSL to six points. However, Sonia Bompastor's side remain unbeaten and on course for the title despite the \"disappointing result\".\nSpeaking to Sky Sports, Bompastor said: \"This block of fixtures has been crazy. Eight games in 28 days - we travelled a lot, we played four games in a row against Manchester City where the players left everything on the pitch.\n\"It is hard to have the energy but at Chelsea, we have enough depth and quality to finish this block of fixtures with a better result.\n\"We conceded too many situations defensively but when you look at the bigger picture, we are six points ahead of the second-placed team. Every team would wish to be in our position.\"\nChelsea flew out of the blocks at Kingsmeadow, having five shots in the opening 10 minutes before Maika Hamano made the breakthrough, volleying home on the turn after Ashley Lawrence headed a cross back across the box.\nAggie Beever-Jones doubled their lead five minutes later, linking up with Sjoeke Nusken and Catarina Macario before guiding the ball beyond Kinga Szemik with the outside of her boot.\nChelsea could have added several more, with Macario, Erin Cuthbert - who saw a long-range effort hit the bar - and Nusken all going close.\nMartinez pulled a goal back for West Ham on the stroke of half-time, hammering home from inside the box after being picked out by Riko Ueki.\nThe visitors grew into the game in the second period, with Hannah Hampton forced into a couple of sharp saves before Martinez headed back across the goal to rescue a deserved point for West Ham.\nAfter 21 minutes at Kingsmeadow, a Chelsea victory looked inevitable. The Blues had cruised into a 2-0 lead and were flexing their squad depth, with Hamano and Beever-Jones - two of the seven changes from Thursday's Champions League victory over Manchester City - on the scoresheet.\nAs half-time approached they continued to pepper the visitors' goal, and even when Martinez pulled one back in the 42nd minute, it remained Chelsea's game to lose. They had 73% possession and 16 shots to West Ham's four.\nHowever, they were left to rue their missed opportunities, with West Ham the better side for much of the second half and Martinez's late equaliser, scored in the first minute of added time, coming as no surprise.\nChelsea boss Bompastor may rue her side's wastefulness in front of goal but the result will likely have little impact on the title race, with the Blues comfortably clear of Arsenal and Manchester United.\nFor West Ham, however, whose manager Rehanne Skinner punched the air with delight at the final whistle, it continues a marked upturn in form since the winter break.\nWest Ham have picked up 11 points from a possible 24 since the beginning of January, winning three and drawing two of their eight matches, and are unbeaten in their past three league games.\nIn mid-December the Hammers sat 10th in the table, three points above the relegation zone, but are now seventh, with a 10-point buffer over 12th-placed Crystal Palace.\nSpeaking to Sky Sports, Skinner said: \"I'm delighted with the character and the way the team has gone about the game. The confidence has grown so much in the team and we are getting late goals in games. I'm delighted with the point.\n\"We got a lot of players in September and it took time for the team to gel. Now we are in a position where we are able to get results. There is just a belief.\"", "url": "https://www.bbc.com/sport/football/live/cgkmv5dxld8t"}