{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:00:27", "date_modify": "2025-05-20 13:00:27", "date_publish": "2023-08-01 12:30:38", "description": "European excitement and optimism of domestic silverware for Robson's Dons", "filename": "sport_articles_cw48xwpvq54o_1747746027.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1115/live/61a1dfa0-3066-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw48xwpvq54o_1747746027.html", "title": "European excitement and optimism of domestic silverware for Robson's Dons", "title_page": "European excitement and optimism of domestic silverware for Robson's Dons - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gary Scott, ABZ Football Podcast, external\nAfter an incredible run to the back end of last season, Barry Robson’s charges have an awful lot to look forward to this season.\nEuropean football guaranteed until Christmas - at least - has the Red Army licking their lips at the prospect of some huge trips to the continent while optimism runs high that Robson can end a near 10-year wait for silverware to return to the Pittodrie boardroom.\nA huge rebuild of the squad that got Aberdeen over the line last season was always on the cards given the sheer number of loan players that were on the books. 12 first-team players in total departed.\nThe Dons started their incoming business sharply with Angus MacDonald extending his stay towards the end of last campaign, Nicky Devlin signing on a pre-contract agreement from Livingston, before the club made a signing of real intent with the acquisition of Leighton Clarkson on a four-year deal from Liverpool.\nJoined in the north-east by his Liverpool team-mate, Rhys Williams – the towering centre-half joins on a season-long loan from the Anfield side. Graeme Shinnie made his return permanent from Wigan before we also saw the acquisition of Ester Sokler, a Slovenian striker from NK Radomlje in the Slovenian top-flight and Or Dadia, an Israeli full-back, joining on a season long loan from Hapoel Be’er Sheva (the Dons holding an exclusive option to buy).\nRoss Doohan, a former Scotland U21 goalkeeper also has signed up following his departure from Forest Green Rovers in England to fill the backup ‘keeper spot left by the aforementioned Lewis. Centre-half Slobodan Rubezic joined last night Novi Pazar, too.\nPre-season has, generally, been fairly positive, playing four and winning three games. The Dons race to a 3-0 half-time lead over English League One outfit, Charlton Athletic on Saturday was particularly impressive. The resurgence of Dante Polvara following his return from a loan spell back in his homeland with Charleston Battery may very well be one to watch.\nInjuries to Angus MacDonald and Rhys Williams do leave the Dons looking threadbare at the back heading into the campaign, although Rubezic's capture softens that blow a little.\nOn top of that, the side probably needs another left-sided option and some form of creative type to take the load off of Leighton Clarkson. Aberdeen’s lengthy pursuit of Croatian playmaker, Tonio Teklic, ended in disappointment when he opted to sign for Turkish Super Liga side, Trabzonspor, instead.\nRobson will be well aware of the pressures his side face as they attempt to fight on four fronts this season and with his desire to play a high intensity pressing game, a healthy squad is required to deal with the rigours that this can put the side under.\nWhile the European nights are the games everyone is looking forward to, Robson is savvy enough to recognise that the bread and butter of the league campaign and progression in the League Cup can’t be foregone in the early stages of the season if Aberdeen want to secure a return to Europe next season.\nThis podcast is more than hopeful of a return of the Scottish Cup to its rightful home in the North East of Scotland come May 2024.\nNo pressure, lads.\nPredicted Finish: 2nd\nStandout Player: Leighton Clarkson\nAFC Breakout Player: Dante Polvara", "url": "https://www.bbc.com/sport/articles/cw48xwpvq54o"}