{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:32:48", "date_modify": "2025-04-26 04:32:48", "date_publish": "2025-03-06 00:00:00", "description": "Follow live text commentary, score updates and match stats from Bodø / Glimt vs Olympiakos Piraeus in the UEFA Europa League", "filename": "sport_football_live_cx2e5z6eywvt_1745641968.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cx2e5z6eywvt_1745641968.html", "title": "Bodø / Glimt vs Olympiakos Piraeus: UEFA Europa League stats & head-to-head", "title_page": "Bodø / Glimt vs Olympiakos Piraeus: UEFA Europa League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bodø/Glimt have won six of their last eight home matches in major European competition (L2), both scoring and conceding in each game (23F 13A – 4.5 goals per game).\nOlympiakos are unbeaten in their last three away games in major European competition (W2 D1), keeping a clean sheet in each match; it’s their joint-longest run of shutouts along with between November 2011 and March 2012 across the UEFA Champions League and UEFA Europa League.\nAyoub El Kaabi has scored seven goals in eight UEFA Europa League appearances for Olympiakos this season, the most of any player in the competition. Since the start of last season, El Kaabi’s 21 major European goals are the most of any player.\nBodø/Glimt’s Patrick Berg has won possession 72 times in the UEFA Europa League this season, more than any other player, while he’s also made the most tackles (44) and only two players have made more interceptions (20).\nOnly Union Saint-Gilloise’s Kevin Rodríguez (23) has had more shots in this season’s UEFA Europa League without finding the back of the net than Bodø/Glimt’s Ulrik Saltnes (22 shots, 0 goals). However, the Norwegian’s xG figure of 2.8 is the highest of any player that is yet to score in the competition this term.", "url": "https://www.bbc.co.uk/sport/football/live/cx2e5z6eywvt"}