{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:35", "date_modify": "2025-05-21 05:56:35", "date_publish": "2024-12-24 17:07:25", "description": "The yet-to-be appointed new coach of Wales women is to report into a women's rugby lead, a role the Welsh Rugby Union (WRU) intends to establish in 2025.", "filename": "sport_rugby-union_articles_c17dzpeyl7go_1747806995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f3dd/live/5a95ddc0-c209-11ef-8a89-27b3f287e995.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c17dzpeyl7go_1747806995.html", "title": "Welsh Rugby Union to appoint women's lead in 2025", "title_page": "Welsh Rugby Union to appoint women's lead in 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The yet-to-be appointed new coach of Wales women will report into a women's rugby lead, a role the Welsh Rugby Union (WRU) intends to establish in 2025.\nThat new role is being created in the wake of Nigel Walker's departure as the governing body's executive director of rugby. Before his exit, Ioan Cunningham left his role as Wales women head coach.\nThe governing body stated: \"The high profile role will directly manage the Wales women head coach as well as set and implement strategy for the women's and girls' game across Wales and form an integral part of the WRU's high-performance team\".\nWalker stepped down following what the WRU described as a \"meticulous and far-reaching review\" into the high-performance element of the men's game, with Warren Gatland continuing as head coach of the Wales men's side despite a record 12-Test losing run.\nWalker, chief executive Abi Tierney and chair Richard Collier-Keywood have overseen a turbulent period in the WRU's history, with Welsh rugby's governing body saying in November it would apologise for its handling of contract negotiations with the senior women's team after admitting \"serious failings\".\nCollier-Keywood said that Walker, who was involved in the initial negotiations, had accepted \"things should have been done better\".\nThe row came less than a year after a damning independent review into the WRU's culture following a BBC Wales investigation found it was sexist, misogynistic, racist and homophobic, with those aspects not properly challenged.\nThe WRU has now published its full report into its governance of the women's game.\nAs a result, the governing body also announced:", "url": "https://www.bbc.com/sport/rugby-union/articles/c17dzpeyl7go"}