{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:54:22", "date_modify": "2025-05-21 05:54:22", "date_publish": "2025-01-19 00:00:00", "description": "Follow live text updates from Edinburgh's Challenge Cup meeting with Black Lion and listen to radio commentary of Bayonne v Gloucester.", "filename": "sport_rugby-union_live_ckgn7xjl1w3t_1747806862.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_ckgn7xjl1w3t_1747806862.html", "title": "Challenge Cup: Edinburgh host Black Lion & Gloucester face Bayonne", "title_page": "Challenge Cup: Edinburgh host Black Lion & Gloucester face Bayonne - live text, BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThat'll do us for the weekend. A comfortable win for Edinburgh, a bruising loss for Glasgow.\nAnd of course, we're all holding our breath to find out the news on Sione Tuipulotu's injury. Fingers crossed he's all okay, and it's nothing too serious.\nThe place to find out this week will be our dedicated Scottish rugby topic page. Get it bookmarked!\nPost\nFT: Edinburgh 36-15 Black Lion\nA little more Sean Everitt for you: \"We pride ourselves on work rate, we've been talking about intent and the guys certainly showed that.\n\"It was pleasing to see a good performance from Lewis Wells on the wing. He'll only build on that. He's a good player with a lot of potential.\n\"A guy like Tom Dodd who hasn't had much game time, he did really well with the opp he got. There's a lot of positives we can take out of this game.\n\"We want to go deep into the competition. It's a tough competition to win, if you look at the teams that will come down from the Champions Cup - like Bath, top of the Premiership - they'll be tough to knock over.\n\"When you go into the last 16 it's knockout rugby and it's about being clinical in everything you do. That's what we need to focus on regardless of who you play.\"\n'Hats off' to the forwards - Everitt\nFT: Edinburgh 36-15 Black Lion\nEdinburgh head coach Sean Everitt tells Premier Sports: \"It was a good performance. We started off well, the guys stuck to the process and we were good in structure.\n\"We scored some great tries from counter-attack, so I'm happy with that and happy with the lead we had going into the second half.\n\"It's not easy to play with seven forward but hats off to them for their performance. I'm just pleased we got the five points against a tricky team.\"\nCrosbie on causing nightmares\nFT: Edinburgh 36-15 Black Lion\nPlayer of the Match and Edinburgh flanker Luke Crosbie tells Premier Sports: \"The body is all good, we knew they were going to be a physical team - especially first 40 minutes - but we're pleased with the performance.\n\"Just building up, defensively just getting involved and stuck in - its what I like doing.\n\"My game, both sides of that ball, has that physicality in contact. Defensively I'm trying to slow the ball down, stealing it or getting the numbers in the ruck. Their attack coach, I'm trying to make his day a nightmare, that's how I look at it.\n\"We've shown in the last couple of games that we need to stick to our game plan. We have game plan that we can take a breath, take control, and take the ball up the field.\"\n\"For us forwards, we just think about the gain line. We need to earn the right to get the ball out wide to players like Darcy and Duhan.\"\n'A very good day for Edinburgh'\nFT: Edinburgh 36-15 Black Lion\nChris Paterson\nFormer Scotland international on Premier Sports\nEdinburgh started particularly well, scoring within 90 seconds, and followed up with excellent defence.\nBlack Lion gave themselves their own troubles with the amount of penalties they conceded in the first half.\nEdinburgh's maul started well and got better and better. A comfortable win with the bonus point wrapped up in the 46th minute.\nAll in all, a very good day for Edinburgh and a lot of good individual perofrmances as well.", "url": "https://www.bbc.com/sport/rugby-union/live/ckgn7xjl1w3t"}