{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:08:05", "date_modify": "2025-05-21 04:08:05", "date_publish": "2025-01-24 00:02:38", "description": "The Manchester United futures of Alejandro Garnacho and Marcus Rashford remain uncertain after Thursday's Europa League win against Rangers", "filename": "sport_football_articles_cg45r5w1592o_1747800485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa3d/live/7e0ab810-d9e3-11ef-adef-c513391a5e32.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg45r5w1592o_1747800485.html", "title": "Man Utd 2-1 Rangers: Doubt remains over futures of Marcus Rashford and Alejandro Garnacho", "title_page": "Man Utd 2-1 Rangers: Doubt remains over futures of Marcus Rashford and Alejandro Garnacho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United moved to within touching distance of a place in the Europa League last 16 but doubt persists over whether Alejandro Garnacho and Marcus Rashford will still be around to help them in the knockout phase of the competition.\nHead coach Ruben Amorim said after the dramatic 2-1 win over Rangers at Old Trafford that he \"did not know what will happen\" before the transfer window closes on 3 February.\nThere are rumours around a number of United players, including Brazilian wideman Antony, who has been linked with a loan to Spanish club Real Betis, and Dutch full-back Tyrell Malacia, who is looking to relaunch his career after a nightmare spell of injuries.\nBut it is Garnacho and Rashford who are attracting most attention.\nWhile Rashford was again overlooked by Amorim, extending an absence from the pitch that dates back to United's previous Europa League game against Viktoria Plzen on 12 December, Garnacho started for the third time in four games and twice came close to scoring his first goal since 28 November.\nSelling Garnacho could fund bringing in some players that at least fit the Portuguese's system rather than having to mould those who have been brought to the club by four different managers, going all the way back to Louis van Gaal.\n\"They are not other manager's players, now they are my players,\" said Amorim.\n\"You know the situation of the club. Before doing anything, we have to think what brought us to this situation. We have to be really clear on everything.\n\"I understand the question but they are my players at the moment and my focus is on the next game.\n\"I don't know what will happen. Until the window is closed, anything can happen.\"\nChelsea and Napoli have both expressed interest in 20-year-old Garnacho.\nUnited did not respond to questions around a reported bid from Chelsea that is said to be around the £60m fee they are looking for.\nThe club have been open around the fact their profit and sustainability rules (PSR) situation is tight and they have written to a leading fans group to admit they are in danger of a breach unless costs are cut.\nUnder PSR rules, selling a home-grown player like Garnacho creates more room within their submission.\nYet, United know such a move would go down badly with fans who repeatedly chanted the Argentina international's name during the win over Rangers.\n\"Let's see in the next days,\" said Amorim. \"He's a Manchester United player and was really important for us today.\n\"I think he's improving in every aspect of the game, he was better today playing inside, also outside, changing positions, he's improving the recovering position. Sometimes he shows some frustration and that is good because he wants more. He has the potential to be so much better in every situation in the game.\"\nSigned from Atletico Madrid in 2020, Garnacho has made 118 first-team appearances for United since making his debut in 2022 and scored 23 goals.\nHe has netted eight times in 32 appearances this season but, with United's next home game not until the day before the close of the transfer window against Crystal Palace, was he saying goodbye to the Old Trafford faithful?\nFormer United Champions League winner Rio Ferdinand told TNT Sports: \"The fans were making their feelings very clear. They love him. He gets you on the edge of your seat.\n\"I don't think he would be the one initiating this move. I don't think he's the one going: 'I want to leave'.\n\"But the system goes against him. Amorim doesn't play with out and out wingers, so you don't see the best of him. That will be one of the main reasons why they may listen to offers.\"\nFerdinand feels the situation around Marcus Rashford is more clear cut.\nAlthough Rashford played a full part in training on Wednesday, he was not in the matchday squad, which has been the case for every match but one of the 10 United have now played since his last appearance against Viktoria Plzen on 12 December.\nSources close to Rashford are adamant the 27-year-old has no issue with Amorim and is willing to play for the club again.\nHopes of a move to AC Milan have been dashed by the impending arrival of Kyle Walker as the Italian club can only sign one English player this month.\nA potential loan to Barcelona depends on the exit of a couple of players and neither Eric Garcia nor Ansu Fati have shown much inclination to leave the Nou Camp.\nQuite where that would leave Rashford if he was still at Old Trafford when the transfer window closes is open to debate.\nBut Ferdinand does not believe Amorim wants him around.\n\"The club want to get him out, you can see that,\" he said.\n\"He needs to go to a new club and a new environment. That would be best for both parties.\n\"When he burst on the scene I always remembered him smiling, living the dream. I have not seen those emotions for a long time.\"", "url": "https://www.bbc.com/sport/football/articles/cg45r5w1592o"}