{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:53:14", "date_modify": "2025-04-26 07:53:14", "date_publish": "2025-02-25 14:14:39", "description": "The Premier League is urged to back the Football Supporters' Association's call for a division-wide ticket price freeze next season.", "filename": "sport_football_articles_c8rk5k5n784o_1745653994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69a4/live/8ac8ed20-f37d-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8rk5k5n784o_1745653994.html", "title": "Premier League ticket prices: FSA urges league to back price freeze for 2025-26", "title_page": "Premier League ticket prices: FSA urges league to back price freeze for 2025-26 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Football Supporters' Association has written to the Premier League urging the organisation to support a division-wide ticket price freeze next season, as part of its 'Stop Exploiting Loyalty' campaign.\nBrentford and Liverpool recently committed to freeze prices, while there have been fan protests at Premier League clubs such as Manchester United, Tottenham and Manchester City in recent weeks.\nWith many clubs currently deciding ticket prices for next season, the FSA says the issue is at a \"critical juncture\" and wants the Premier League to give its support.\n\"The FSA's #StopExploitingLoyalty campaign pulls all of those together with a single focus which calls for price freezes, an end to the attack on concessions and increased supporter engagement,\" said the FSA.\nAs well as a price freeze, the FSA said it wants protection of all concessions and for improved dialogue between clubs and supporters over ticketing issues.\nManchester City and Liverpool fans joined together before Sunday's Premier League match at Etihad Stadium to unveil a banner protesting against the rise in ticket prices.\nManchester United fans protested outside Old Trafford before their win against Everton on 1 December after the club removed concessionary discounts on members' tickets.\nIt means no discount will be applied for children or pensioners, with all members' tickets being priced at £66.\nUnited say the move affects only 3% of tickets.\nDefending the changes, co-owner Sir Jim Ratcliffe said: \"I don't think it makes sense for a Manchester United ticket to cost less than a ticket to see Fulham.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c8rk5k5n784o"}