{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:31", "date_modify": "2025-05-21 05:23:31", "date_publish": "2025-02-09 01:17:51", "description": "Super Bowl 2025: New Orleans has 'rolled out the red carpet' for big-game return", "filename": "sport_articles_cz7e5n4v012o_1747805011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ffc/live/7d8f43e0-e683-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz7e5n4v012o_1747805011.html", "title": "Super Bowl 2025: New Orleans has 'rolled out the red carpet' for big-game return", "title_page": "Super Bowl 2025: New Orleans has 'rolled out the red carpet' for big-game return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Kansas City Chiefs wrapped up their week of Super Bowl preparations with a short walk-through on Saturday morning, as a mini Mardi Gras parade wound across the city.\nThe session lasted approximately 30 minutes, and coach Andy Reid said his players will get some free time before gathering for a team meeting in the evening.\nThe Chiefs practiced in the uniforms they will wear Sunday against the Philadelphia Eagles, with white jerseys and red pants, and after Chiefs owner Clark Hunt addressed the team upon the conclusion of practice, everybody made their way to a set of risers positioned at the end of the field for a team photo.\nThe next time Kansas City takes the field, it will be to play for its third consecutive Super Bowl title - and fourth in six seasons.\nOn the Super Bowl experience so far in host city New Orleans, Reid said: \"It's been great. The people have been phenomenal.\n\"The law enforcement people who have chaperoned us around like crazy have been great; we appreciate all that. I just think this city rolled out the red carpet. It's a great place to have a Super Bowl.\"", "url": "https://www.bbc.com/sport/articles/cz7e5n4v012o"}