{"authors": ["Dafydd Pritchard", "www.facebook.com"], "date_download": "2025-05-21 05:23:06", "date_modify": "2025-05-21 05:23:06", "date_publish": "2025-04-03 15:30:08", "description": "Omer Riza admits Cardiff City are nervous about being relegated from the Championship, but insists he has \"full confidence\" they will survive.", "filename": "sport_football_articles_c4g9p817584o_1747804986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c98/live/b2105170-1074-11f0-ab54-518aaf61f940.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g9p817584o_1747804986.html", "title": "Omer Riza: Boss says Cardiff 'nervous' but confident of survival", "title_page": "Omer Riza: Boss says Cardiff 'nervous' but confident of survival - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Omer Riza admits Cardiff City are nervous about all they could lose with relegation from the Championship, but insists he has \"full confidence\" they will survive.\nThe Bluebirds dropped into the bottom three following Derby County's win over Preston North End on Wednesday.\nOne point adrift of safety, Cardiff have seven games to save themselves from falling to the third tier of English football for the first time since 2003.\nThis is the third season out of four in which the Welsh club have been embroiled in a battle to avoid relegation, while Riza is their 13th permanent manager in 14 years.\nAnd while he acknowledges Cardiff's lack of stability has contributed to their recent struggles, the 45-year-old believes they can stay up.\n\"We've been in this predicament for quite some time and surviving at the end of it would be like winning a cup final,\" said Riza.\n\"People get nervous. There's a lot to lose. There's a lot riding on it, the history of the club, the players themselves, what they can lose, what the club can lose, what we can lose as staff, as fans. We understand all of this. The pressures are there, but these pressures, you either sink or swim and I want us to make sure we swim.\n\"I've got full confidence in my players, I've got full confidence in my staff, I've got full confidence in the club and what we've done so far to get out of this situation, full confidence in our fans to keep doing what they've been doing all season, and I've got full confidence in myself to make sure we get out of this situation.\"\nRiza became manager in daunting circumstances, initially on an interim basis after Erol Bulut was sacked last September following Cardiff's worst start to a league season in their history.\nA former Watford coach whose only previous English Football League managerial experience was a short and unsuccessful stint at Leyton Orient, Riza oversaw a significant initial improvement and was eventually handed a contract last December to make him Cardiff boss until the end of this season.\nGiven how long and drawn out those talks were, former players and fans were critical of club owner Vincent Tan, chairman Mehmet Dalman and chief executive Ken Choo for the lack of clarity surrounding Riza's future.\nSupporters have since taken to the streets to protest about the board's running of the club but Riza, unsurprisingly, defended his employers.\n\"All the conversations I've had with the board, whether it be Vincent Tan, Ken or Mehmet, the focus is on us getting the job done and putting the club in a good light,\" he said.\nWhen asked about the club's managerial instability and perceived lack of long-term planning, Riza added: \"A bit of stability is key to a club, knowing there's a plan there that can be really looked at and people can see 'this might happen' and think 'there's a plan in place', whether that's a style of play or type of player.\n\"Those sorts of things could be improved moving forward, in terms of trying to improve the club.\"\nAlthough the team's performances have been better than they were during the dismal early few weeks of the season under Bulut, Cardiff have never pulled themselves clear of the bottom three.\nRiza was close to becoming the 14th Bluebirds manager to depart under Tan, only to be saved by last month's win at Blackburn Rovers.\nHowever, a disappointing draw at home to Sheffield Wednesday last weekend increased the pressure again.\nOn Saturday Cardiff travel to 15th-place Queens Park Rangers – who have picked up just one point in their past five matches – before visiting Preston on Tuesday.\n\"We've got a game coming up this weekend and it's one we need to win,\" said Riza.\n\"QPR, if they lose on Saturday, are within two points of us. Our aim is to pick up points to stay out of the bottom three.\n\"Of course it's paramount we stay up. Of course I want to stay here, it's a massive club and I've loved every minute here. But we've got to look at what's in hand and that's to survive.\"", "url": "https://www.bbc.com/sport/football/articles/c4g9p817584o"}