{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:56", "date_modify": "2025-05-21 06:09:56", "date_publish": "2025-03-31 10:41:54", "description": "Gloucester centre Seb Atkinson will \"be up there\" in England head coach Steve Borthwick's mind, believes his club boss George Skivington.", "filename": "sport_rugby-union_articles_cvgn30xlep3o_1747807796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c82/live/5ab2e400-0daa-11f0-8389-ad5d3ae4a0b9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvgn30xlep3o_1747807796.html", "title": "Seb Atkinson: Gloucester centre on England radar, says George Skivington", "title_page": "Seb Atkinson: Gloucester centre on England radar, says George Skivington - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester centre Seb Atkinson will \"be up there\" on England head coach Steve Borthwick's radar, believes his club director of rugby George Skivington.\nThe 22-year-old scored a first-half hat-trick in a player of the match display in Saturday's 53-28 win over Bristol, with Borthwick in the Kingsholm crowd watching.\nAtkinson has made 54 appearances for the club and scored eight tries since moving to the Cherry and Whites from Worcester in 2022.\nAsked who he believed Borthwick was watching during the match, Skivington said Atkinson \"would be up there\".\n\"There's a couple of our young lads coming through now - Jack Clement would be in that bracket as well,\" Skivington told BBC Radio Gloucestershire.\n\"Certainly me and Steve have talked over Seb Atkinson so I think it was a great night for him to do what he did.\"\nAtkinson signed a new contract with the club in February and has played every minute at inside centre in 11 out of 13 Premiership matches so far.\nSkivington said Atkinson was one of the \"top three\" names who would be picked out by his team-mates as key to the club's strong performances this season.\nVictory against the Bears moved Gloucester back into the top four, level on points with third-placed Leicester.\n\"He's got brilliant power and it's deceptive I think, he's got a great skillset. He's a brilliant individual,\" Skivington said.\n\"He's in the leadership group at his age already which says a lot, he takes this very seriously. He's not here to mess around and get paid and go home, he's here to win.\n\"Internally he'd be one of the top three names mentioned as to why things are going well at the club, if you asked the boys.\"\nAtkinson added it would \"be nice\" to be on the England radar but that club honours are his main focus.\n\"I'm just focussing on what we're doing at Gloucester and pushing on to the end of the season and if that comes, it comes,\" Atkinson said.\n\"I'm trying to find a balance of my game. I know that my passing game's really strong but trying to find some carrying, breaking tackles, fighting the extra few metres to get us on the front foot is something I've been working on really hard this year and I was glad I could show that.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvgn30xlep3o"}