{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 14:15:07", "date_modify": "2025-05-20 14:15:07", "date_publish": "2023-07-29 17:38:30", "description": "England give themselves a golden opportunity to level the Ashes series with a joyful batting display on the third day of the fifth Test against Australia at The Oval.", "filename": "sport_cricket_66342558_1747750507.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EDD7/production/_130578806_jonnybairstowandjoeroot.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66342558_1747750507.html", "title": "The Ashes 2023: England set up chance to level series with Australia", "title_page": "The Ashes 2023: England set up chance to level series with Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England gave themselves a golden opportunity to level the Ashes series on day three of the fifth Test before Stuart Broad announced his retirement.\nThe home side piled up 389-9, a lead of 377 over Australia at The Oval, with Broad unbeaten on two when he spoke at the end of the day to confirm this will be his final game of cricket.\nAlmost all of the top order made contributions. Zak Crawley set the tone by driving Mitchell Starc's first ball of the day for four, laying the platform for an opening stand of 79 with Ben Duckett.\nCrawley made 73 and Duckett 42, the same score as captain Ben Stokes, who was promoted to number three in place of the injured Moeen Ali.\nWhen England endured a slight wobble in losing two wickets for nine runs, Joe Root and Jonny Bairstow combined for a fifth-wicket stand of 110. Root fell nine runs short of a deserved century, while Bairstow was out for 78.\nMoeen, batting at number seven, added a cameo of 29, but was part of a flurry of England wickets late in the day. Starc picked up 4-94 and off-spinner Todd Murphy 3-110 as England lost 4-19.\nBy that stage, England had already got to the stage where Australia would need to complete the highest-ever successful chase in a Test on this ground.\nThere is rain forecast for Sunday, though not enough bad weather to emulate the wet end to the drawn fourth Test at Old Trafford or ruin what will be an emotional farewell to Broad, England's second highest wicket-taker of all time.\nEngland are looking to draw the series 2-2, while Australia are looking for the 3-1 win that would give them a first success in this country for 22 years.\nThis match was beautifully poised after two days, both first innings complete with Australia only 12 runs ahead, leaving England's batting effort on Saturday to shape the contest.\nWhat followed was one last show of England's swashbuckling style, a final Bazballing handed to the Australians to send them on the plane with their heads spinning. It was never reckless or careless, but a supreme demonstration of controlled aggression, positive intent and crisp shotmaking.\nEngland wiped out the deficit inside the first over and never looked back - never before has an Australian bowler leaked more than the 13 runs conceded by Starc in the opening over of an Ashes innings. Australia instantly retreated and were powerless to stop England building their lead on a true pitch.\nIn contrast to Australia's crawl on day two, when they scored only 54 runs in the morning session, England had as many inside 10 overs. When Root reverse-scooped Mitchell Marsh for six, it was England's 41st maximum of the series, an Ashes record. Only once before in Ashes Tests have England reached 300 quicker than the 57.4 overs here and that was at Old Trafford last week.\nThe late collapse took some of the shine off England's day and left them short of where they might have been.\nWhen last man James Anderson made his way to the crease, Australia dawdled long enough to ensure they would not have to bat on Saturday evening, meaning his batting partner Broad will emerge to a hero's welcome on Sunday morning.\nIn scoring 412 runs, Root has enjoyed his most successful Ashes series with the bat since before his spell as captain.\nHe batted with all his trademark class, poise and urgency. He looked destined for a hundred before Murphy got one to keep low, the second time in as many matches Root has been undone by variable bounce and he left visibly frustrated.\nBairstow was a reassuring presence when England needed it, doing the bulk of the scoring in his partnership with Root. He crunched the ball through the off side with meaty cuts and drives.\nAfter being left on 99 not out at Old Trafford, he had a first Test ton for more than a year in his sights, only to edge behind off Starc.\nMoeen, struggling with a groin injury, was given a rousing ovation in what is likely to be his last Test. On 10, he top-edged a hook off Starc that a diving Hazlewood got nowhere near at fine leg, a moment that summed up Australia's day.\nWith the lower-order swiping, Moeen, Chris Woakes and Mark Wood all holed out, leaving Anderson fending off Starc bouncers in the company of Broad, the veteran bowlers batting in tandem in what will be their last Test together.\nWhen Anderson reverse-swept Murphy in the final over and followed up with a slog for back-to-back boundaries, it drew the loudest cheer of the day, almost matched when he successfully overturned being given out lbw.", "url": "https://www.bbc.com/sport/cricket/66342558"}