{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-04-26 08:03:14", "date_modify": "2025-04-26 08:03:14", "date_publish": "2025-02-26 16:24:57", "description": "Key figures in Formula 1's governing body the FIA are barred from a meeting on Wednesday in a dispute with president Mohammed Ben Sulayem.", "filename": "sport_formula1_articles_c8j08dmmjx1o_1745654594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78a0/live/338597e0-f457-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_c8j08dmmjx1o_1745654594.html", "title": "Formula 1: Key figures barred from FIA meeting after refusing to sign NDA in dispute with Mohammed Ben Sulayem", "title_page": "Formula 1: Key figures barred from FIA meeting after refusing to sign NDA in dispute with Mohammed Ben Sulayem - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Key figures in Formula 1's governing body the FIA were barred from a meeting of the organisation's world motorsport council on Wednesday in a dispute with president Mohammed Ben Sulayem.\nRobert Reid, the FIA's deputy president for sport, and David Richards, the UK's representative, were among those denied access after refusing to sign a non-disclosure agreement (NDA).\nThe document forbids members from discussing matters pertinent to the FIA outside official meetings, BBC Sport has been told.\nInsiders say Ben Sulayem demanded the new NDA, a stricter form of a document by which members were already bound, because of his concerns about leaks to the media.\nLegal letters have been exchanged and the dispute has raised questions as to whether decisions made by the world council - including regarding rules for the forthcoming F1 season - will be legitimate.\nThe most high profile of these was the confirmed adoption of a mandatory minimum of two pit stops at the Monaco Grand Prix.\nFIA statutes dictate members of the world motorsport council \"may attend any meeting\" and \"have the right to vote\".\nReid and Richards both refused to comment when approached by BBC Sport.\nAn FIA spokesperson said: \"As is routine in all organisations, including the BBC, the FIA implements procedures including non-disclosure agreements to ensure confidential relationships between all parties, to safeguard personal information, and to protect our regulatory interests.\n\"Unauthorised disclosure of confidential information undermines our ability to fully fulfil our mission and adversely impacts our capabilities to generate revenues to support our member clubs in our shared objective of growing motorsport participation, increasing accessibility, and cultivating innovation.\n\"The steps we have taken to preserve confidentiality have been overwhelmingly supported by a super majority of WMSC members.\"\nEmirati Ben Sulayem has been the subject of a series of controversies since he took office in December 2021, including around his views on women, his approach to F1, changes to the statutes reducing accountability, the dismissal of a number of senior figures and rule changes regarding F1 drivers' public behaviour.\nThe FIA is also the subject of legal action from Susie Wolff, the head of the all-female F1 Academy series and wife of Mercedes F1 boss Toto Wolff, after a compliance inquiry into the Wolffs was launched and then rescinded in the space of two days in 2023.\nReid was a key member of Ben Sulayem's presidential team but the Scot, a former rally co-driver, has fallen out of favour with the FIA president.\nBen Sulayem has, increasingly, in recent months complained about what he perceives as a bias against him by the British media, and Reid appears to have been lumped in with this in his mind.\nRichards also supported Ben Sulayem in the election in 2021, but was vocal in his opposition to the statute changes introduced last December.\nBen Sulayem is running for re-election at the end of his first term in December this year. No-one has yet put themselves forward to stand against him.\nFIA insiders have speculated Ben Sulayem's actions on the NDA could be founded in fears that negative stories may appear in the media, or because he is planning further changes to the statutes at this June's general assembly that would make it difficult for anyone to stand against him in the election.", "url": "https://www.bbc.co.uk/sport/formula1/articles/c8j08dmmjx1o"}