{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 06:52:40", "date_modify": "2025-04-26 06:52:40", "date_publish": "2025-02-28 17:09:54", "description": "Dundee United believes the way VAR was used to deny them a goal against Hibs was \"not within the rules\".", "filename": "sport_football_articles_c39vjk8zl8lo_1745650360.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff8e/live/74f50480-f5f2-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c39vjk8zl8lo_1745650360.html", "title": "Disallowing Sam Dalby goal 'not within the rules'", "title_page": "Disallowing Sam Dalby goal 'not within the rules' - Dundee United's Jim Goodwin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dundee United manager Jim Goodwin stands by his view that the way the video assistant referee (VAR) was used to deny his side a goal in Wednesday's defeat by Hibernian was \"not within the rules\" despite a \"productive\" meeting with Scottish FA head of refereeing Willie Collum.\nUnited thought Sam Dalby had put them 2-1 up in the second half at Tannadice, but the goal was chalked off following a lengthy VAR intervention after the striker was judged to have headed the ball on to his own arm before it flew into the net.\n\"I said after the game if somebody showed me an angle that proved my statement after the game was wrong then I would apologise, but I stand by everything that I said,\" Goodwin said.\n\"There isn't a conclusive angle that shows there was any handball and therefore we believe the goal should have stood and it should have put us 2-1 up in a very important game.\"\nThe United boss said he had met Collum on Thursday.\n\"I am not going to go into too much detail with regards to the type of conversation we had and Willie's views,\" Goodwin said.\n\"I just said to Willie that we all had a meeting at Hampden at the beginning of the season and the IFAB rules were all made aware to us and the biggest rule probably is that 'clear and obvious' one.\n\"The VAR can only intervene with an on-field decision if they have got significant footage that shows there was a clear and obvious error and I think from the audio - and from the video angles that we have seen - there is no suggestion of a hand ball within the Sam Dalby goal'.\n\"So that is the big gripe for us. We believe the goal should have stood. Willie will no doubt speak about it himself, maybe in the early part of next week, and give his own feelings on it.\n\"To disallow a goal the way it was disallowed on Wednesday night with no real conclusive evidence is not within the rules - it is as simple as that.\"\nGoodwin says he is still \"a big advocate\" for VAR but that his issue is with the way the technology is being used.\nHe suggested perhaps the way to avoid high-profile incidents like the one involving Dalby is for the Scottish game to dig deep to pay for \"the top VAR package that is available\".\n\"I am led to believe that each club in the Premiership is paying in excess of £100,000 a year for the equipment,\" he explained.\n\"Now, I don't think that we are paying for the top VAR package that is available and it is just whether clubs are willing to pay that little bit more to make sure that we get even more camera angles.\n\"If we had the different camera angles that they have got in the English Premier League then you would be able to see 100% whether that ball was in or out [in the recent Hibernian-Celtic game]. The same with the Sam Dalby one - had we had a better VAR system in place then there might have been better camera angles to show whether there was a hand ball or not.\n\"It is all about money at the end of the day, it comes down to the investment. I am not one, at this moment in time, for throwing VAR in the bin. I don't think that is the way forward, I just think we have got to get better at using the technology.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c39vjk8zl8lo"}