{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:28:55", "date_modify": "2025-04-26 04:28:55", "date_publish": "2025-03-02 08:40:35", "description": "World number three Lydia Ko puts in a strong final round to win her first HSBC Women's World Championship in Singapore.", "filename": "sport_golf_articles_cwyd3j8ey7po_1745641735.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2468/live/98161590-f73b-11ef-9c7c-091eceaea8c7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cwyd3j8ey7po_1745641735.html", "title": "HSBC Women's World Championship: Lydia Ko finishes strongly to win", "title_page": "HSBC Women's World Championship: Lydia Ko finishes strongly to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Women's World Championship - final leaderboard\n-13 L Ko (NZ); -9 A Furue (Jpn), J Thitkul (Tha); -7 J-H Im (Kor), G Lopez (Mex), C Hull (Eng); -6 H Green (Aus), A-L Kim (Kor), Y Noh (US), H-J Kim (Kor)\nSelected others: -4 C Ciganda (Spa); -2 L Maguire (Ire); -1 C Boutier (Fra)\nFull leaderboard\nWorld number three Lydia Ko moved clear of the rest of the field in the final round to win her first HSBC Women's World Championship in Singapore.\nThe New Zealander, a three-time major winner, started the final round one shot ahead of England's Charley Hull.\nBut three successive birdies from the sixth put the 27-year-old Olympic champion in a strong position and Ko finished with a round of 69 for a 13-under total, four clear of Thailand's Jeeno Thitikul and Japan's Ayaka Furue.\nHull, who said after Saturday's third round that she had been struggling with illness, slipped out of contention with a final two-over-par round of 74 for a seven-under total in a share of third.\nKo's victory was her first in 11 appearances at the event on the Tanjong Course at Sentosa Golf Club - and her 23rd LPGA win.\n\"I just wanted to focus on my game as it was a pretty tight leaderboard,\" she said.\n\"I didn't know if I would win. But to win here in Singapore and get all the love, not only this year but for the years that I've come, it means a lot.\"", "url": "https://www.bbc.co.uk/sport/golf/articles/cwyd3j8ey7po"}