{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 07:54:21", "date_modify": "2025-05-21 07:54:21", "date_publish": "2025-05-20 05:48:27", "description": "\"I always win things in my second year,\" said Ange Postecoglou, who hopes to guide Tottenham to glory in the Europa League final.", "filename": "sport_football_articles_c4g3wpwlj4jo_1747814061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bca/live/cc8c5270-303a-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g3wpwlj4jo_1747814061.html", "title": "Ange Postecoglou: What trophies did he win in second seasons with his clubs?", "title_page": "Ange Postecoglou: What trophies did he win in second seasons with his clubs? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I always win things in my second year. Nothing has changed. I don't say things unless I believe them.\"\nTottenham manager Ange Postecoglou, having just seen his side lose 1-0 at home to rivals Arsenal back in September, was in defiant mood and that quote has followed and been repeated to him all season.\nHis side came close to proving him right earlier this year.\nSpurs held a 1-0 lead after the first leg of their Carabao Cup semi-final against Liverpool, only to then capitulate 4-0 in the reverse fixture at Anfield.\nBut Tottenham fell at the fourth-round hurdle of the FA Cup, losing at Aston Villa, while the club are on course for their worst campaign in the Premier League era as they are 17th with one game to go and a mammoth 45 points behind champions Liverpool.\nYet, the 59-year-old Australian, who began working at Spurs in July 2023, is one game away from having the last laugh.\nHe will take charge of Spurs for the 100th time on Wednesday when they play Manchester United in the Europa League final in Bilbao.\nA win would take Spurs into the Champions League, silence Postecoglou's critics, maintain his superb second-year record and maybe keep him in his job.\nHe won the Australian title with both South Melbourne and Brisbane Roar and the Japanese league with Yokohama F. Marinos - all in his second season or second full season in charge.\nPostecoglou also won the Asian Cup two years after becoming Australia boss - and the Scottish championship in both seasons with Celtic.\nThe 59-year-old did not see out two seasons in charge of the three clubs he failed to win anything at - smaller clubs Panachaiki and Whittlesea Zebras, and Melbourne Victory, whom he left after 18 months for the Australia job.\nWe have taken a look at how he has enjoyed second-season success throughout his career.\nMatches: 113. Wins: 83 Draws: 12. Losses: 18. Goals scored: 284. Goals conceded: 108.\nPostecoglou came to Celtic in June 2021, just after Steven Gerrard had guided Rangers to the Scottish Premiership title.\nBut the Australian did not need two seasons before winning, as he took the Bhoys to five trophies in his two years at the club.\nIn his first campaign they became Scottish champions and won the League Cup, before they added the Scottish Cup to make it a domestic treble in his second year with him then before moving to Tottenham.\nFormer England goalkeeper Joe Hart had already won two Premier League titles with Manchester City before he was instrumental in Celtic's success. He felt one of Postecoglou's main strengths was getting his players to view the game in a different way and teach them new skills.\n\"He is top, really, really good,\" said Hart after Postecoglou's second Scottish title victory in May 2023. \"He is really clear in what he wants and the biggest buzz for me is playing for someone who is pushing me and I am learning new things every day - it makes me feel alive.\n\"I have played in different teams that have been successful. Identity in football has always been there, but in terms of having a real way of playing, this is the first time I have been part of a team with that.\n\"I genuinely feel comfortable making risky passes, short passes, and if someone does miss a pass or a tackle and the ball goes in, I don't think any of us would even flinch because that's what we are being asked to do.\"\nMatches: 161. Wins: 79. Draws: 30. Losses: 52. Goals scored: 313. Goals conceded: 228.\nBefore Celtic, Postecoglou had a three-and-a-half-year spell in Japan with Yokohama F. Marinos.\nHe went there in January 2018 and almost won a trophy in his first 10 months, only to lose 1-0 to Shonan Bellmare in the J.League Cup.\nBut success was not too far away as his side then won the J1 League to become Japanese champions, finishing six points clear of FC Tokyo.\nThat title took the side into the Japanese Super Cup (their version of the Community Shield), but Yokohama could not add another trophy as they lost 3-2 on penalties against Vissel Kobe after Yokohama had fought back from 1-0, 2-1 and 3-2 down to leave it at 3-3 after 90 minutes.\n\"Ange really gave the club purpose,\" said Dan Orlowitz from the Japan Times.\n\"It was a refreshing style of football that the league hadn't really seen. Even when YFM struggled results-wise in 2018 it was very clear that the players and above all Ange believed in what he was doing.\n\"The fans believed in him as a result, and over the next year he let go of players who weren't a good fit for the system and brought in players who were a great fit. All of that added up to the triumph of 2019.\"\nMatches: 83. Wins: 42. Draws: 24. Losses: 17. Goals scored: 142. Goals conceded: 91.\nBefore becoming Australia manager, Postecoglou had an 18-month spell at Melbourne Victory, but was not there long enough to have a second full season.\nThat came after he had great success with another Australian side in Brisbane Roar. In a two-and-a-half-year spell, they won the A-League Championship in 2010-11 and retained their title the following year.\n\"Ange's massive strength is his ability to be able to bring players along that journey and buy into what he does,\" former Brisbane captain Matt Smith told BBC Sport.\n\"There's zero tolerance for players that don't want to follow. We were never made to feel comfortable, we were always pushing to be better, always developing, always working harder than any group I've experienced before.\n\"It didn't matter if you were the biggest player in the dressing room or the youngest - if you weren't pulling your weight or following his principles, he was very ruthless.\"", "url": "https://www.bbc.com/sport/football/articles/c4g3wpwlj4jo"}