{"authors": ["Andrew Aloia", "www.facebook.com"], "date_download": "2025-05-21 04:48:09", "date_modify": "2025-05-21 04:48:09", "date_publish": "2025-01-23 13:32:19", "description": "Notts County striker Alassana Jatta has been linked with Plymouth, Portsmouth and Bolton, but what chance do they have of signing him?", "filename": "sport_football_articles_cq6g9edeg9qo_1747802889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45f7/live/af55ba40-d98a-11ef-9467-577a0b7c8ee7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq6g9edeg9qo_1747802889.html", "title": "Alassana Jatta: Could Notts County's leading scorer be on the move in January?", "title_page": "Alassana Jatta: Could Notts County's leading scorer be on the move in January? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Will Alassana Jatta stay with Notts County, or will be be swept off during the transfer window and into a higher division?\nThat is the question that was put to Magpies boss Stuart Maynard on Thursday after their leading scorer was linked with Championship sides Plymouth Argyle and Portsmouth, as well as League One club Bolton Wanderers.\nReports say that Plymouth have had a £750,000 bid turned down for the 26-year-old Gambian, who has scored 15 goals in all competitions for the League Two Magpies this season.\nNone of the transfer speculation around the striker has come as a surprise to Maynard.\n\"You are going to get interest from a lot of clubs, from the Championship and abroad, when a player like AJ comes in and performs to the level he has,\" he told BBC Radio Nottingham.\n\"It's where we are at as a football club now. If we want success and to keep going through the leagues and keep being at the top of the division to complete, then we need to make sure that when we sign players they we will then have interest from other clubs because they will be performing that well.\"\nBut will Notts be able to hold out and keep Jatta at Meadow Lane to help in their quest for promotion?\n\"He is our player at the minute, but everyone does have a value,\" Maynard said.\n\"And that's the biggest thing, I can't say to you yes or no.\n\"He loves it at the football club, he comes in and works so hard every day and he will continue to do that.\"", "url": "https://www.bbc.com/sport/football/articles/cq6g9edeg9qo"}