{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:50:47", "date_modify": "2025-05-20 11:50:47", "date_publish": "2023-07-25 17:32:50", "description": "Tom Lawes takes 4-41 as Surrey bowl out Somerset for 170, but are 138-4 in reply at the close.", "filename": "sport_cricket_66300312_1747741847.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0AAB/production/_130513720_gettyimages-1569495767.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300312_1747741847.html", "title": "County Championship: Somerset fight back after collapse against Surrey", "title_page": "County Championship: Somerset fight back after collapse against Surrey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Lawes ran through the top order as First Division leaders Surrey bowled out Somerset for 170 after losing the toss on the opening day of the County Championship match at Taunton.\nThe home side were dismissed in 56.3 overs, with 20-year-old seamer Lawes sending back three of the top four on his way to figures of 4-41 as Tom Kohler-Cadmore top scored with 59.\nBy stumps, Surrey had replied with 138-4, Tom Latham leading the way with 67 not out and fellow New Zealand Test player Matt Henry marking the last appearance of a prolific spell in red and white ball cricket for Somerset by taking 3-26.\nA day dominated by seam bowling began with Somerset's total on 12 when Tom Lammonby clipped a Dan Worrall half-volley off his legs straight to Jamie Smith at mid-wicket.\nTom Abell flicked at a leg side delivery from Lawes and feathered a catch through to wicketkeeper Ben Foakes to make it 32-2 and with only nine runs added, Sean Dickson, on 25, fended at a delivery from Lawes and edged to Latham at second slip.\nKohler-Cadmore hit off-spinner Will Jacks back over his head for six - but it was a rare moment of cheer for Somerset supporters in a 2,000 crowd.\nGeorge Bartlett became a third victim for Lawes, caught by Jacks at third slip and it might have been worse for the hosts but for the same fielder spilling a sharp chance, diving to his left, to give Kohler-Cadmore a life on 22, Jamie Overton being the unlucky bowler.\nWith his side in trouble, James Rew took 32 balls to get off the mark and was unbeaten on four at lunch, which was taken at 85-4, Kohler-Cadmore having moved to 32.\nHopes of a substantial stand between the pair ended soon after the interval when Rew got a top edge aiming to pull a short ball from Jordan Clark and skied a simple catch to Foakes.\nKasey Aldridge helped Kohler-Cadmore add 47 for the sixth wicket, contributing 18 before edging Overton, back on his old stamping ground, to Latham in the slips.\nKohler-Cadmore's innings ended in disappointing fashion when he aimed a big shot at a wide delivery from Lawes and dragged the ball onto his stumps. The former Yorkshire player had faced 101 balls, striking seven fours and a six.\nCraig Overton glanced his first ball from twin brother Jamie to fine leg for four, provoking two unfriendly short balls, the second of which he gloved through to the immaculate Foakes.\nHenry managed a few belligerent blows before falling for 16 and tea was taken when Ben Green was bowled by a full ball from Worrall.\nSomerset had batted poorly, but they managed an early breakthrough in the final session when, without a run on the board, Surrey skipper Rory Burns edged a defensive shot off Henry to Craig Overton at second slip.\nThe same combination accounted for Dom Sibley with the total on 15, Overton holding another straightforward chance off Henry, who was maintaining an exemplary line and length.\nSmith narrowly avoided the same fate when, on four, he edged just short of Overton, as Henry finished a superb opening spell with 2-16.\nMomentum changed when Smith hit boundaries off four successive balls from Overton, who had switched to the River End. Batting started to look comfortable under cloudless skies as Latham helped put together a half-century stand in 67 balls.\nIt was a surprise when Green broke through in the opening over of his first Championship appearance of the season. Having proved a golden arm in the Blast, the medium-pacer had Smith caught at mid-wicket by Lammonby, stretching out his left arm.\nHenry's return to the attack saw him strike again with his third ball, Foakes nicking to wicketkeeper Rew to make it 95-4.\nLatham, on 43, survived a chance to Dickson at third slip off Overton and the experienced Kiwi left-hander went on to an 83-ball 50, well supported by Jacks as Surrey closed just 32 runs behind.", "url": "https://www.bbc.com/sport/cricket/66300312"}