{"authors": ["Karan Vinod", "www.facebook.com"], "date_download": "2025-05-21 07:45:37", "date_modify": "2025-05-21 07:45:37", "date_publish": "2025-05-20 11:46:55", "description": "Enzo Maresca press conference: Real Betis vs Chelsea preview", "filename": "sport_football_articles_c1lddnyz97no_1747813537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8254/live/3cea8160-6de3-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1lddnyz97no_1747813537.html", "title": "Enzo Maresca press conference: Real Betis vs Chelsea preview", "title_page": "Enzo Maresca press conference: Real Betis vs Chelsea preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Maresca confirmed that Marc Guiu and Christopher Nkunku have started to take part in group training but are still not fully fit.\nOn the starting goalkeeper for the final: \"Filip (Jorgensen) is going to play the final because he played all the competition. And it is unfair now that you are in the final, and he's not playing the final. So, for the Betis game, it will be Filip plus 10 players. I don't know which 10 they are but for sure, Filip is going to play because he deserves to play the final.\"\nMaresca reiterated that the \"focus will be on Nottingham\" as he hasn't seen the players since the win against Manchester United and will be focused on the final only after the Forest game.\nOn the scheduling of fixtures leading up to the final: \"I am not happy, 100%. You cannot allow a team 48 hours more than the other team to play in a European competition final.\"\nMaresca also said that it is \"important to win a European Cup for Chelsea\", highlighting the importance for the club and the fans at this moment in time as it confirms that they are going in the \"right direction.\"\nMore on establishing a winning mentality: \"Very important to build a winner's mentality and you cannot win the Champions League or the Europa League if you are in the Conference League. When you are in that competition, you have to be focused to win that competition.\"\nMaresca is looking forward to a \"special\" clash against Betis manager Manuel Pellegrini and labelled him as his \"professional dad\" as the Chelsea manager turns to him for advice. He also stated that he spoke to Pellegrini yesterday and learnt how to \"manage players\" and everything that comes with the job over the years.\nOn facing Isco after having played with him: \"He is a top player, his career speaks for itself after many years with Real Madrid. We played together when Isco was very young, he joined from Valencia and we had a top team.\"", "url": "https://www.bbc.com/sport/football/articles/c1lddnyz97no"}