{"authors": ["James Jones", "www.facebook.com"], "date_download": "2025-04-26 07:56:16", "date_modify": "2025-04-26 07:56:16", "date_publish": "2025-02-25 12:23:20", "description": "West Ham news: Opinion - Fans can start to get excited about Graham Potter", "filename": "sport_football_articles_ckg8n1vyxd9o_1745654176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0c2/live/79c50fe0-b62f-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8n1vyxd9o_1745654176.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - Fans can start to get excited about Graham Potter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For two years in a row, West Ham have rocked up to the Emirates and put a huge dent in Arsenal's Premier League title hopes.\nWe have done it without conceding a single goal, too.\nLast year, it was David Moyes who masterminded the victory but West Ham were sixth in the table at the time. It was a result that surprised many, but not everyone.\nThis year was different. West Ham have struggled all season. We have been better under Graham Potter but there are still many problems that need to be fixed. Home defeats by Crystal Palace and Brentford are evidence of that.\nThere would not have been many people who gave West Ham any hope against Mikel Arteta's side on Saturday - especially when the starting XI was announced and, like Arsenal, there was no recognised striker in sight.\nEvan Ferguson is still getting up to speed and therefore was not risked from the start again.\nBut a goal and a victory was still achieved and while Arsenal will continue to rue their injury problems in attack, West Ham and Potter go on adapting and making do with what they have.\nThat has been the most impressive thing about Potter's early reign at West Ham. An injury crisis and a striker shortage has not prevented him from making progress. He has got the team playing well, is giving young players like Ollie Scarles the chance to shine and has an entire squad bought into to his plans.\nWhat follows next is consistency. If Potter can oversee a run of positive results, starting with the visit of Leicester on Thursday, then it does not take a lot of imagination to wonder what might be possible with a full squad of fit players at his disposal.\nThat win at Arsenal proves West Ham fans can be excited about what is to come in the future with Potter at the wheel.", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8n1vyxd9o"}