{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:44:32", "date_modify": "2025-04-26 03:44:32", "date_publish": "2025-03-05 07:09:48", "description": "Steve Smith retires from one-day international cricket following Australia's Champions Trophy defeat by India.", "filename": "sport_cricket_articles_cx2x01728x4o_1745639072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fc4/live/4ea3f3c0-f98c-11ef-a2f8-a75ed602e363.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cx2x01728x4o_1745639072.html", "title": "Australia's Steve Smith retires from ODI cricket after Champions Trophy exit", "title_page": "Australia's Steve Smith retires from ODI cricket after Champions Trophy exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Steve Smith has retired from one-day international cricket following Australia's semi-final exit from the Champions Trophy.\nThe 35-year-old made 170 appearances for Australia in his 50-over career, hitting 12 centuries and winning the ODI World Cup in 2015 and 2023.\nSmith captained the side in Pat Cummins' absence during his final ODI appearance on Tuesday, when Australia suffered a four-wicket loss to India in Dubai in the Champions Trophy.\nThe former Sussex batsman will remain available for Test and T20 selection for his country.\n\"There have been so many amazing times and wonderful memories. Winning two World Cups was a great highlight along with the many fantastic team-mates who shared the journey,\" said Smith, Australian men's ODI player of the year in 2015 and 2021.\n\"Now is a great opportunity for people to start preparing for the 2027 ODI World Cup so it feels like the right time to make way.\n\"Test cricket remains a priority and I am really looking forward to the World Test Championship final, the West Indies in the winter and then England at home. I feel I still have a lot to contribute on that stage.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cx2x01728x4o"}