{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:45", "date_modify": "2025-04-26 06:47:45", "date_publish": "2025-03-01 12:00:25", "description": "Tottenham news: Jamie Donley on loan spell at Leyton Orient", "filename": "sport_football_articles_c7983wgdj00o_1745650065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06b5/live/74e39700-f600-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7983wgdj00o_1745650065.html", "title": "Tottenham news: Jamie Donley on loan spell at Leyton Orient", "title_page": "Tottenham news: Jamie Donley on loan spell at Leyton Orient - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tottenham's Jamie Donley is delighted with his \"successful loan\" spell so far at League One Leyton Orient.\nThe 20-year-old attacking midfielder has scored six goals and assisted five more in 26 league appearances for Orient this season, with Richie Wellens' side currently occupying sixth place and the final play-off position.\n\"I want to play in these games,\" he told BBC Radio London. \"I want to show everyone what I can do.\n\"People say to go out and explore men's football instead of just playing under-21s football and now I'm at this stage, I'm glad I've gone and done that. I've obviously had the down moment in my career where I wasn't playing and getting in the squad but I've come out of the other side.\n\"Now I'm doing well - I'm playing lots of minutes and it's coming out as a successful loan for me.\n\"Coming from Tottenham, everyone expects you to be this amazing player and just to hit the ground running straight away but it's not that easy coming as my first loan into men's football.\n\"The gaffer always told me he knows the quality I have and it's just about showing that. Luckily, I've shown that over the last few months.\"\nDonley's most high-profile moment this season came when his 50-yard shot cannoned off the bar and into the net via goalkeeper Stefan Ortega during the eventual 2-1 loss to Manchester City in the FA Cup fourth round.\n\"Having that moment against Man City shows I can do it and I can perform against these teams,\" he added on the goal. \"I'll see what happens next season.\n\"It's been quite an experience getting the attention. It's nice to get it but it doesn't really affect me and I keep on doing what I'm doing. It's obviously a really special moment for me and the club. The support we had that day was unbelievable.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c7983wgdj00o"}