{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:33", "date_modify": "2025-04-26 03:37:33", "date_publish": "2025-03-08 00:00:00", "description": "Bobby Thomas grabs an injury-time winner to inflict late heartbreak on former manager Mark Robins as Coventry see off Stoke to claim their fifth straight victory.", "filename": "sport_football_live_c1jp5jj2kx1t_1745638653.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5949/live/527c5d10-fc2b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c1jp5jj2kx1t_1745638653.html", "title": "Coventry City 3-2 Stoke City: Bobby Thomas hits late winner", "title_page": "Coventry City 3-2 Stoke City: Bobby Thomas hits late winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bobby Thomas smashed in a 97th-minute winner to inflict late heartbreak on former manager Mark Robins as Coventry saw off Stoke to claim their fifth-straight Championship victory.\nVictor Torp's first-half double put the Sky Blues 2-0 up, heading in Milan van Ewijk's throw-in before Tatsuhiro Sakamoto set him up to add to his side's advantage soon afterwards.\nCoventry felt they should have had a penalty when Stoke goalkeeper Viktor Johansson appeared to take out Ephron Mason-Clark – but the Potters seemed to have salvaged a point when substitute Sam Gallagher scored twice after the break.\nHowever, Robins' return to the CBS Arena ended in disappointment as Stoke half-cleared a cross in the seventh minute of added time and centre-back Thomas lashed in a left-foot drive to secure the points.\nCoventry have now won nine of their past 10 league matches under Frank Lampard and are fifth in the table.\nRobins, dismissed by Coventry last November after seven-and-a-half years in charge, was warmly applauded by the crowd and his side started strongly, controlling midfield and repeatedly breaching the Sky Blues' backline in the opening 15 minutes.\nBen Pearson's threaded pass picked out Lewis Koumas in space, but his first-time attempt was tipped behind by Oliver Dovin and Ali Al-Hamadi might also have done better with a shot that was charged down.\nBut Stoke were disrupted by Pearson's exit with what looked like a hamstring problem and Torp – returning to the line-up in place of the injured Jack Rudoni – punished them twice in quick succession.\nStoke failed to pick up the midfielder from Van Ewijk's throw and his neatly-directed header beat the diving Johansson, before Sakamoto glided away from Enda Stevens, cutting the ball back for Torp to control and finish.\nCoventry should have stretched their lead further before half-time as Josh Eccles' curling drive crashed back off a post and then Mason-Clark, running onto Sakamoto's pass and lifting the ball over Johansson, was clattered by the keeper.\nReferee David Webb declined to award a penalty, however, and Robins shook up his frontline at the interval, sending on Gallagher and Million Manhoef in an effort to retrieve the deficit.\nManhoef caused problems straight away for Coventry, creating a chance that Al-Hamadi might have done better with and cutting in from the right flank to force a save from Dovin.\nThe visitors gained a lifeline when Coventry conceded possession on the halfway line and Wouter Burger surged into the penalty area, holding off his man and squaring for Gallagher to tap the ball home.\nIt looked as though Robins' half-time changes had paid off handsomely five minutes from time when Manhoef whipped over a free-kick for Gallagher to head into the net and silence the crowd.\nBut Thomas – whose winner against QPR last month also came in injury time – displayed the same knack once more as Jamie Allen's cross was headed out to him and a low finish beat the despairing Johansson.\nCoventry manager Frank Lampard:\n\"Bobby (Thomas) has popped up with some big goals for us and that's what we're in football for. There will be times I sit here and I'll be disappointed and there's times when you know the Coventry fans have gone away with an amazing game and an amazing feeling at the end.\n\"I thought we started the second half pretty well but it felt cagey. You're always aware a goal changes the game and it did.\n\"If we get the penalty we should have had, it wouldn't have been done at half-time but it was clear, and everyone in the stadium knew that.\n\"Their second goal was offside as well but they had a bit of momentum which we grabbed back a bit in that extra time, so I'm just really happy.\"\nStoke City manager Mark Robins:\n\"The three goals were terrible and that's where we're lacking. We make really naive choices, we win the ball, knock it down to them in midfield – those are the things that are costing us in games and they need to realise that.\n\"To allow them to get a cross in, to allow Bobby Thomas to pick up a ball in our penalty area and allow him to drag it onto his left foot and then not stand in the way of a shot is unforgivable.\n\"We started brightly, we created three chances before they'd had a shot on target. Then their first effort on goal ends up in the back of our net.\n\"It's too easy, we've allowed him to jump into our centre half, who doesn't see him coming, and allows him to get a header and flick it into the far corner.\n\"We were a bit negative and I don't know why. I've got to say they're there for the taking and today we could have won this game.\"", "url": "https://www.bbc.co.uk/sport/football/live/c1jp5jj2kx1t"}