{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:53:21", "date_modify": "2025-05-21 07:53:21", "date_publish": "2025-05-20 06:23:37", "description": "Brighton news: Fabian Hurzeler says Albion used Liverpool goal 'as wake-up signal'", "filename": "sport_football_articles_c5y553lzv87o_1747814001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f04d/live/3c3fc050-3542-11f0-b0a8-0d69e851e1e1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y553lzv87o_1747814001.html", "title": "Brighton news: Fabian Hurzeler says Albion used Liverpool goal 'as wake-up signal'", "title_page": "Brighton news: Fabian Hurzeler says Albion used Liverpool goal 'as wake-up signal' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton boss Fabian Hurzeler, speaking to BBC Match of the Day: \"There have been a lot of highs and lows throughout the season. It is important you don't overreact and it is important to stay grounded and humble because there is still one game to go. But I'm really proud of the team.\n\"It's not only about playing a football game and the tactical side but it's about the mental side too. We only can be successful if you stick together and we proved that so we are very happy.\n\"The players changed the intensity on the pitch. They used the goal as the wake-up signal. Liverpool were impressive in the first 20 minutes but I was happy with the reaction.\"\nOn Brajan Gruda's performance: \"That was his best game, yes. It's important to understand that behind the player is a person and it's a very young person. He comes from a different country and he's away from his family. He never gave up and always tried to improve in training and showed character. He gets the reward for all his hard work.\"\nOn 17-year-old Harry Howell: \"It's a special player for his young age. I always give young players the chance because it's not about your age if you're good enough.\n\"Everyone knows their role, if you're a sub then you can come into the game. You always have to be ready to have an impact on it.\"\nDid you know?", "url": "https://www.bbc.com/sport/football/articles/c5y553lzv87o"}