{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:22:31", "date_modify": "2025-05-19 15:22:31", "date_publish": "2017-07-04 07:50:06", "description": "Niall McGinn completes his move to South Korean club Gwangju after the forward rejects a contract extension with Aberdeen.", "filename": "sport_football_40491989_1747668151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/143A1/production/_96794828_13567009.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40491989_1747668151.html", "title": "Niall McGinn completes switch from Aberdeen to Gwangju in South Korea", "title_page": "Niall McGinn completes switch from Aberdeen to Gwangju in South Korea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland forward Niall McGinn has completed his move from Aberdeen to South Korean top-flight club Gwangju.\nThe 29-year-old, who joined the Scottish Premiership club from Celtic in 2012, rejected an offer to extend his stay at Pittodrie.\nHe has now announced on Twitter that he is looking forward to a \"new chapter\" and \"a new, exciting challenge\".\n\"After five great years, I am moving on, but I will always remember my Aberdeen days very fondly,\" he said.\n\"When I joined Aberdeen in 2012, I had no idea of the great times that lay ahead.\"\nMcGinn leaves Derek McInnes' side after a season in which they finished runners-up in the Premiership to Celtic and also lost to the Glasgow side in the Scottish Cup and League Cup finals.\nHe joins Gwangju with Nam Ki-il's side sitting bottom of the K-League Classic after 17 games of the 2017 season and admitted to the club website that he realises his new team are \"in a difficult situation\".\n\"Since I met the club president a few weeks ago in Belfast, I have been researching Asian football and Korean football in particular,\" he said.\n\"I have been very impressed with what I have discovered.", "url": "https://www.bbc.com/sport/football/40491989"}