{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:11:24", "date_modify": "2025-05-21 07:11:24", "date_publish": "2025-03-30 08:49:11", "description": "Swansea City: Josh Tymon took Leeds penalty because Zan Vipotnik was on bench - Alan Sheehan", "filename": "sport_football_articles_cql630vpnk2o_1747811484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c94b/live/f721b440-0d3e-11f0-8aec-538548a4922f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cql630vpnk2o_1747811484.html", "title": "Swansea City: Josh Tymon took Leeds penalty because Zan Vipotnik was on bench", "title_page": "Swansea City: Josh Tymon took Leeds penalty because Zan Vipotnik was on bench - Alan Sheehan  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan revealed Josh Tymon stepped up to take Swansea City's spot-kick at Leeds United because new regular penalty-taker Zan Vipotnik was on the bench.\nLong-serving club skipper Matt Grimes has been Swansea's preferred choice on penalties in recent years.\nBut following Grimes' January move to Coventry City, Swansea needed a new man to take the responsibility from 12 yards after Leeds defender Joe Rodon was penalised for a foul on Lewis O'Brien.\nLeft-wingback Tymon grabbed the ball – but was left with head in hands as Leeds keeper guessed right and saved a penalty which could have been struck more sweetly.\nCaretaker head coach Sheehan said it was left to the players on the pitch to decide who took the spot-kick – and insisted there would be no criticism of Tymon.\n\"That's between the players. This is the leadership and ownership we want them to take,\" Sheehan said.\n\"It's the first penalty since Grimesy left, Vipotnik would normally take it.\n\"Anybody who has the courage to take a penalty at Elland Road, that's fine. It happens. We move on.\"\nThe penalty miss came after Leeds went in front inside 35 seconds through Brenden Aaronson.", "url": "https://www.bbc.com/sport/football/articles/cql630vpnk2o"}