{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:12:55", "date_modify": "2025-05-21 07:12:55", "date_publish": "2025-02-08 09:02:01", "description": "Birmingham vs Newcastle predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_cy5k29vwkeyo_1747811575.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5k29vwkeyo_1747811575.html", "title": "Birmingham vs Newcastle predictions: Chris Sutton on FA Cup tie", "title_page": "Birmingham vs Newcastle  predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There were raucous scenes at St James' Park on Wednesday night after Newcastle had beaten Arsenal in the Carabao Cup semi-finals.\nWhat a brilliant result over two legs against the Gunners, and why wouldn't Magpies fans want more of the same in the FA Cup as well?\nThey want to end their long wait for a trophy and they will head for St Andrew's on a high.\nI do wonder if Newcastle boss Eddie Howe will rest one or two of his key men, because his side are going for a top-four finish in the Premier League too.\nBut if I were him I would not be resting anyone against a Birmingham side who are in fantastic form at the top of League One.\nI am a big fan of Birmingham boss Chris Davies, who spent time working with Brendan Rogers at a few clubs, including Celtic, but has stepped up as a manager himself. I always admire people who do that.\nDavies has signed a few players from north of the border for the Blues, and also spent more than £10m on Jay Stansfield from Fulham in August.\nThat is a bit of clout for a League One club to have, but Birmingham wanted to go straight back up after being relegated last season, and it looks like it will pay off.\nThis is a shot to nothing for them against Newcastle, and I think they will give them a good game - but I am going with Newcastle to come out on top.\nSutton's prediction: 1-2", "url": "https://www.bbc.com/sport/football/articles/cy5k29vwkeyo"}