{"authors": ["Rob Stevens & Emery Makumeno", "www.facebook.com"], "date_download": "2025-05-21 04:35:16", "date_modify": "2025-05-21 04:35:16", "date_publish": "2025-02-02 13:23:36", "description": "DR Congo calls on Arsenal, PSG and Bayern Munich to end their “blood stained” sponsorship deals with Visit Rwanda amid a worsening humanitarian crisis in the country.", "filename": "sport_football_articles_cp3w76rl476o_1747802116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04de/live/df71da80-e162-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp3w76rl476o_1747802116.html", "title": "Calls for Arsenal, PSG and Bayern Munich to end Visit Rwanda deals", "title_page": "Calls for Arsenal, PSG and Bayern Munich to end Visit Rwanda deals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Democratic Republic of Congo has called on Arsenal, Bayern Munich and Paris St-Germain to end their \"blood stained\" sponsorship deals with Visit Rwanda amid a worsening humanitarian crisis in the country.\nThe appeal comes as M23 rebels captured Goma, the largest city in eastern DR Congo, while the United Nations' refugee agency estimates more than 400,000 people have been forced from their homes this year.\nA group of UN experts maintains the Rwandan army is in \"de facto control of M23 operations\".\nDR Congo's Foreign Minister Thérèse Kayikwamba Wagner has written to the owners of Arsenal and PSG and to Bayern president Herbert Hainer to \"question the morality\" of the deals.\nShe highlighted how Visit Rwanda's sponsorship could be funded by the illicit mining of blood minerals in the occupied parts of DR Congo, before being transported across the border and exported from Rwanda.\nIn her letter to Arsenal, Kayikwamba Wagner stated that Rwanda's \"culpability\" for the ongoing conflict \"has become incontrovertible\" after the UN reported that 4,000 Rwandan troops are active in the DRC.\n\"It is time Arsenal ended its blood-stained sponsorship deals with this oppressor nation. If not for your own consciences, then the clubs should do it for the victims of Rwandan aggression,\" she wrote.\nIn response, the Rwanda Development Board has attacked what it describes as DR Congo's attempts to \"undermine\" the sporting partnerships via \"misinformation and political pressure\", stating that the Visit Rwanda initiative \"showcases Rwanda's commitment to peace, stability, and inclusive growth\".\nArsenal, PSG, Bayern Munich and Visit Rwanda have been contacted for comment.\nThe Visit Rwanda campaign has successfully raised the east African country's profile but Rwanda's government has been accused of investing in sport to enhance its global image - a strategy labelled by critics as 'sportswashing'.\nA sleeve partnership with Arsenal began in 2018, with the latest sponsorship reported to be worth more than £10m ($12.39 million) per year.\nA sponsorship with PSG was agreed the following year, and Bayern Munich signed a five-year football development and tourism promotion partnership with Rwanda in 2023.\nMeanwhile, Rwanda President Paul Kagame has announced a bid to stage a Formula 1 race and Kigali is set to be the venue for cycling's World Road Championships in September.\nOn Friday the UCI, cycling's world governing body, said there were no plans to relocate the event away from Rwanda.\nThe Central Africa director at Human Rights Watch, a campaign group which investigates and reports on cases of abuse around the globe, says these deals and events help hide Rwanda's \"abysmal track record\" on human rights.\n\"Rwanda has major flaws with due process which violate its own internal laws or international standards,\" HRW's Lewis Mudge told BBC Sport Africa last month.\n\"Increasingly we're seeing the space for freedom of expression, for some degree of political autonomy, is actually shrinking.\"\nThe Rwandan government has dismissed accusations of sportswashing, with its chief tourism officer Irene Murerwa calling them \"a distraction\" from the \"amazing and outstanding achievements the country has made\".", "url": "https://www.bbc.com/sport/football/articles/cp3w76rl476o"}