{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:53", "date_modify": "2025-04-26 04:26:53", "date_publish": "2025-03-03 11:22:09", "description": "Oisin McConville tells The GAA Social that the FRC \"needs to get in a room\" with managers and referees to work on improving the new football rules.", "filename": "sport_articles_cqx0edgee5eo_1745641613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c624/live/ac491500-f81f-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cqx0edgee5eo_1745641613.html", "title": "The GAA Social: 'Honeymoon over' for new football rules says Oisin McConville", "title_page": "The GAA Social: 'Honeymoon over' for new football rules says Oisin McConville - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Oisin McConville believes the Football Review Committee (FRC) \"needs to get in a room\" with inter-county managers and referees after a weekend which he says showed \"the honeymoon period is over for the new rules\".\nSpeaking on The GAA Social on BBC Sounds, McConville says many of the new football rules are resulting in positive change but he believes the burden being placed on referees to police them is too great.\n\"We don't want to come on here and rubbish everything the FRC have done,\" McConville told the BBC's GAA podcast.\n\"They have accomplished a lot but I think now massive consultation is needed. It's time for a consultation. Time to get managers, coaches, referees and the FRC into a room and see what's manageable.\"\nMcConville said the weekend Football League action - and in particular Armagh's contest with Dublin - showed that the new rule requiring keepers to get kickouts away with 20 seconds of the ball going dead has too harsh a penalty with a 13-metre free being awarded to the opposition.\n\"A lot of it is geared towards speeding the game up but we can't expect lads to have no breathers at all in games,\" added the Wicklow manager.\n\"That was the point Jim McGuinness was making as well……these lads can't go hell for leather for 75, 80 minutes. It's just not possible. Five replacements is not enough [either].\"\nMcConville has long been an advocate of gaelic football introducing a second referee and believes the introduction of the new rules makes such a change an absolute necessity - although this is something that would have to be adopted at Congress.\n\"The amount of things that a referee has to look at. All of the focus now is on the 20 seconds [for the goalkeepers] and some of the other [off-the-ball] stuff [in the middle of the field] doesn't seem to matter as much.\n\"If we want to keep the 20 seconds, let's alleviate some of the burden that's on the referee and give that to an umpire or linesman or fourth official [to deal with] because there's no way a referee can keep across all that's going on.\"\nMcConville believes the introduction of two referees could even have the effect of attracting more people into refereeing.\n\"I'd throw my hat into the ring to be a referee if I thought I had a buddy at the other end of the pitch and we both had each other's back. I think we've missed a trick. It's time for two referees. I've only been saying this for about 15 years.\n\"It now feels the game has got that fast…..I mean the transition….I see it in Division Four and as you go up the divisions, it's even quicker again. With the top teams, you're not catching them. You're making the decision from 60 yards away. We've made life very tough for referees.\n\"If you keep making mistakes because you've got too much on your plate, then it's time to take a little bit off the plate.\"\nThe issue of goalkeepers not taking kickouts within the 20 seconds stipulated wasn't the only new rules that caused controversy over the past weekend.\nWestmeath manager Dermot McCabe was left angered by Meath's last-kick match-winning goal in the crucial Division Two game at Mullingar and left the Lake County still without a league point and now looking odds-on to suffer relegation.\nMcCabe insisted that goal was scored by Conor Duke three seconds after the hooter should have sounded.\nWicklow manager McConville pointed out that the hooter is not being used in Division Three and Division Four games which means that there is \"not a level playing field\" across the divisions.\n\"If we can't get it right at inter-county level in four divisions, what chance have we passing that down to grassroots? No chance.\n\"It feels like the honeymoon period is over for the rules and we're really getting down into the nitty gritty of it.\n\"We always knew we'd get to the stage where these games would mean a bit more. And when they mean a bit more, it puts the microscope on a lot of things. Small decisions can have massive consequences and can make a massive difference to your season.\"\nAfter asking for online feedback from inter-county and club managers plus the National Referees' Panel, the FRC is scheduled to meet early this week to discuss potential adjustments to the new rules which would then be adjudicated on by the GAA's Central Council on 13 March.", "url": "https://www.bbc.co.uk/sport/articles/cqx0edgee5eo"}