{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:19", "date_modify": "2025-05-21 07:45:19", "date_publish": "2025-01-03 21:43:08", "description": "England fly-half Marcus Smith scores 18 points as Harlequins end a three-match Premiership winless streak with victory at Newcastle.", "filename": "sport_rugby-union_articles_cn54n2y5e4eo_1747813519.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30bc/live/2b276fe0-ca1a-11ef-9ca4-e15068af8864.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn54n2y5e4eo_1747813519.html", "title": "Premiership: Newcastle 14-38 Harlequins: Marcus Smith helps Quins end losing run", "title_page": "Premiership: Newcastle 14-38 Harlequins: Marcus Smith helps Quins end losing run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England fly-half Marcus Smith scored 18 points as Harlequins ended a three-match Premiership winless run with a bonus-point victory over Newcastle Falcons at Kingston Park.\nAdam Radwan drew the Falcons level after James Chisholm's early score, but Jarrod Evans brilliantly teed up Smith to restore the Quins lead before half-time.\nSmith booted a penalty to stretch the lead to 10 points after the break, but Ben Redshaw touched down after a kick ahead bounced off a corner post to bring Newcastle within three.\nHowever, late tries from Jack Walker, Oscar Beard and Sam Riley quashed home hopes of a grandstand finish and wrapped up Harlequins' fourth league win of the season.\nThree tries in the final 10 minutes gave Quins their biggest-ever points tally at Kingston Park and keeps them in the play-off mix in sixth, while Falcons remain bottom after an eighth league reverse of the season.\nHaving shipped four tries in the opening 15 minutes against Northampton Saints last weekend, the Falcons started better but fell behind after 10 minutes when hard yards from the visiting forwards left the hosts short-handed, and Chisholm bolted through to stretch for the line.\nQuins' stride was disrupted by an early injury to Rodrigo Isgro who was replaced by fly-half Evans - forcing Smith to full-back.\nThe visitors then lost Dino Lamb to injury and replacement Irne Herbst was sent to the sin-bin within a minute for a high tackle on Ben Palframan.\nFalcons eventually made the man advantage count to level the scores when Freddie Lockwood barged towards the Quins line before play was spread wide for Radwan to finish unopposed.\nWith their running game dotted with handling errors and the line-out misfiring, the visitors again turned to their forwards who helped restore the lead within four minutes.\nThey pummelled their way towards the Falcons line before Evans looped a superb pinpoint pass over the heads of four defenders to Smith who cut a brilliant line and scorched under the posts.\nA simple penalty extended the lead after the Harlequins backs showed glimpses of their threat, but having lost four times from winning positions this season, the visitors were far from their confident, fluent best.\nAnd they looked in peril of adding to this unwanted statistic when Ben Stevenson shinned a kick ahead against the corner post and Redshaw just reached the loose ball in time.\nBrett Connon's conversion made it 17-14 with 14 minutes left, but hopes of a third Premiership home win in five for Newcastle soon evaporated when Walker finished off more drives from the powerful Quins pack.\nSmith's crossfield kick gave Beard a simple finish, via Cadan Murley, after a charge down from the disruptive Jack Kenningham, and Riley found gaps in a tiring defence to add gloss with a last-gasp try.\nNewcastle Falcons consultant director of rugby Steve Diamond told BBC Radio Newcastle:\n\"It's probably the most disappointed I've been since I've been here.\n\"It was men v boys in certain areas of the game, but they've got an international quality front row that came on for an international quality front row.\n\"If you get in the changing room and ask the players they will be bitterly disappointed.\n\"It doesn't matter how many caps you've got, or how much inexperience you've got, we were good enough to have that game within seven points at the end and it didn't end up that way, and that's what we've got to look at.\"\nHarlequins head coach Danny Wilson said:\n\"A team that's good at home, we gave a huge amount of respect this week to what they're like at home, forget last week's result against Northampton on the road.\n\"I think Steve Diamond's put a backbone into them at home, a tough team to break down.\n\"You probably saw that as well, it took us a while to get where we needed to get to, we had to do it a different way.\n\"I thought our driving line-out in particular was a real weapon for us tonight, it gave us a foothold in the game and eventually got us to where we needed to tonight.\n\"I'm most proud of the fact the players have come here tonight and professionally responded to the Big Game last week, good week's training, and come here to get the job done.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cn54n2y5e4eo"}