{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:15:11", "date_modify": "2025-05-20 13:15:11", "date_publish": "2023-07-24 19:01:17", "description": "Max Johnston leaves Edinburgh for Austria, where the right-back hopes to sign for Sturm Graz after rejecting a new contract with Motherwell.", "filename": "sport_football_66295417_1747746911.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7AE4/production/_130506413_johnston.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66295417_1747746911.html", "title": "Max Johnston: Sturm Graz move from Motherwell is 'crazy' seven months after Cove Rangers loan", "title_page": "Max Johnston: Sturm Graz move from Motherwell is 'crazy' seven months after Cove Rangers loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Johnston admits \"it's crazy\" to think he was playing for Cove Rangers seven months ago but is now on the verge of playing in the Champions League with Sturm Graz.\nThe 19-year-old, who rejected a new contract with Motherwell, headed out to Austria from Edinburgh on Monday.\nA four-year deal with the Bundesliga runners-up reportedly awaits, external the Scotland youth right-back.\n\"I am buzzing - I'm hoping to get something done,\" he told Sky Sports.\n\"It will be great to go over and actually see the place in person. It's crazy to think I was at Cove at the start of the season, but to be honest, that's exactly what I needed.\"\nA product of the Fir Park outfit's youth system, Johnston made his first-team debut in February 2021 but only became a regular starter in February on his return from his loan spell in the second tier with Cove.\nMiddlesbrough-born Johnston, who ended the previous season on loan to Queen of the South, made 19 appearances in his final months with Motherwell and was named young player of the year by Scotland's sports writers.\nThere were other interested parties in the player, for whom Motherwell will be due a compensation fee, but Johnston said: \"I had a chat with the manager and the style of play, which suits me, and European football is a massive attraction.\"\nChristian Ilzer's Sturm finished seven points behind Red Bull Salzburg in their domestic top-flight last season but lifted the Austrian Cup by beating Rapid Wien.\nThey face a tough Champions League third qualifying round opener against PSV Eindhoven next month, but continued European football is guaranteed via the Europa League should they lose.\nJohnston says the success of fellow full-back Aaron Hickey, whose move to Bologna led to a subsequent transfer to Brentford in England's top flight, current Bologna midfielder Lewis Ferguson and Hellas Verona defender Josh Doig proved a \"huge inspiration\" in persuading him to move abroad.\n\"You see how well these boys have done and they've gone on to be full internationals as well,\" he said. \"It's every boy's dream to play for their country and hopefully I can follow suit.\"\nJohnston leaves Fir Park having only realised for a few months the dream he had since the age of 12 of playing for Motherwell, but added \"it's amazing how quickly football changes\" if you \"work hard\" as he looks to make the most of \"a great opportunity\".", "url": "https://www.bbc.com/sport/football/66295417"}