{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:17", "date_modify": "2025-04-26 06:44:17", "date_publish": "2025-03-01 17:22:30", "description": "Stefanos Tsitsipas secures his maiden Dubai Tennis Championships title with a straight-set victory over Felix Auger-Aliassime in the final.", "filename": "sport_tennis_articles_cm2yexv87rno_1745649857.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0360/live/009c9860-f6b9-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_cm2yexv87rno_1745649857.html", "title": "Dubai Tennis Championships: Stefanos Tsitsipas beats Felix Auger-Aliassime to claim maiden title", "title_page": "Dubai Tennis Championships: Stefanos Tsitsipas beats Felix Auger-Aliassime to claim maiden title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stefanos Tsitsipas secured a maiden ATP 500 title with a straight-set victory over Felix Auger-Aliassime in the final of the Dubai Tennis Championships.\nThe 26-year-old Greek produced a strong performance to beat his in-form Canadian opponent 6-3 6-3.\nThe fourth seed had reached the final of the tournament twice before, losing to Novak Djokovic in 2019 and then again to Roger Federer a year later.\nSaturday's win was world number 11 Tsitsipas' 12th tour-level title, and the biggest outdoor hard-court trophy of his career.\nHe defeated 24-year-old Auger-Aliassime - who is leading the ATP Tour this season with 16 match wins and two titles - in one hour and 28 minutes, and will return to the top 10 of the world rankings on Monday for the first time since May 2024.\n\"It's a big relief that I'm able to hold that trophy after the third attempt,\" said Tsitsipas.\n\"It's something that I had in the back of my mind, and I'm happy to say I accomplished it.\n\"To be owning a spot in the top 10 is definitely one of the greatest feelings a tennis player can experience.\n\"It comes with hard work and sacrifices, but I'm happy that I'm in a position where I can really celebrate.\"", "url": "https://www.bbc.co.uk/sport/tennis/articles/cm2yexv87rno"}