{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:58:27", "date_modify": "2025-05-21 03:58:27", "date_publish": "2025-04-07 08:18:31", "description": "Fulham 3-2 Liverpool: Fan views", "filename": "sport_football_articles_cz95eq7j1d4o_1747799907.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz95eq7j1d4o_1747799907.html", "title": "Fulham 3-2 Liverpool: Fan views", "title_page": "Fulham 3-2 Liverpool: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's Premier League game between Fulham and Liverpool.\nHere are some of your comments:\nFulham fans\nBill: Super performance and a great bounceback from the Crystal Palace game. First half was stunning and and we were pretty much untouchable. Showed great character in second half to hold the lead and finally win. Four points out of six against the best in the land.\nRichard: Big win for Fulham on the back of a fine first half. Hanging on at the end but you need some luck against the top teams who are not invincible. Calvin Bassey, Sander Berge and Rodrigo Muniz excellent for Fulham. Europe still on.\nNick: Played outstandingly. Bassey came back with force, Ryan Sessegnon showed he can make an impact and Muniz completely fooled the Liverpool defence.\nLiverpool fans\nPhil: Liverpool looked like they didn't want to win the game until Luis Diaz and Conor Bradley came on. So many back passes. Need a bit of heavy metal football back in our game.\nSteve: No panic but what a lacklustre display. A masterclass in giving the ball away. We seem to excel in giving ourselves a second half challenge, which we failed at on this occasion although at least upped our game. Taking nothing away from Fulham who played really well, but I would expect to take something out of that game.", "url": "https://www.bbc.com/sport/football/articles/cz95eq7j1d4o"}