{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:50", "date_modify": "2025-05-19 15:10:50", "date_publish": "2015-02-13 10:20:02", "description": "After debate following knocks to George North, ex-Wales captain Gareth Thomas admits he sometimes carried on while concussed.", "filename": "sport_rugby-union_31441188_1747667450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80960000/png/_80960820_gareththomascolumnimage.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31441188_1747667450.html", "title": "Six Nations 2015: I've played when concussed says Gareth Thomas", "title_page": "Six Nations 2015: I've played when concussed says Gareth Thomas - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In his 2015 Six Nations column for the BBC Scrum V website, former Wales captain Gareth Thomas looks at the aftermath of his country's opening loss to England. He gives his own views following the concussion debate, sparked by George North's injury, and assesses Sunday's trip to play Scotland at Murrayfield.\nI've played in games where I know I've been concussed, yet if the doctor asked me if I was OK then I'd just say: \"Yes.\"\nIf you're a doctor trying to assess a player who's not telling you exactly how he feels because he wants to be on that field, then it's a very difficult scenario.\nPlayers can pressure the doctors because they want to stay on... it makes the decision very difficult.\nThere's grey areas and until it's made into something that's black and white then there's always going to be debate on whether players should or shouldn't have stayed on.\nThere's been a lot of times when I've said to team-mates, or they've said to me, \"right, you need to go off\", but ultimately it's you as an individual who makes the decision.\nIt's almost like a mental illness, there's nothing you can see... then it's very difficult to just walk off the field when visibly nothing really seems to be wrong with you.\nThere's a call maybe for someone even suspected of concussion to stay off.\nFrom the outside looking in you'd think that because you're not playing rugby for a lot longer than you are playing, then safeguard your health.\nBut ultimately when you're in that environment, when you train every day and dedicate your life to something, you want to be on the field doing it.\nBecause it's a relatively new kind of injury that we're looking at and seeing the dangerous effects of it, it's going to take a while for players to understand why they shouldn't cheat baseline tests.\nCoach Warren Gatland has stuck with his old faithful, the brigade that kind of picks itself - and up until last week's 21-16 loss to England justifiably picked itself.\nThis team has been in this situation before in 2013 where we lost to Ireland in the first game of the tournament and went on to win it.\nWhen Sunday comes it's the players' opportunity to repay the faith that's been shown in them.\nI think Liam Williams would have come in regardless of an injury to North, although that made it an easier decision to make.\nThe back three, as a unit, didn't really play to their full potential and Liam Williams - from the couple of minutes he came on - lit it up.\nNorth has become a bit of a household name, and rightly so because he's a great player, a great specimen.\nFellow wing Alex Cuthbert goes under the radar sometimes... but he can give you a lot more. If I was picking the team I'd leave Cuthbert in there.\nBut elsewhere there was definitely the potential to shake the team up a little bit.\nThe scrum creaked quite a lot against England and are we going to pick a front row that can get around the field, or are we going to pick a front row that can scrummage first and foremost and anything they can do after that is a bonus?\nEverybody was talking about how good England were at the contact area and so physical against us, and I think Scotland will be very physical there.\nI think it was an opportunity to start with Justin Tipuric and Sam Warburton, play two number sevens and have more speed around the park.\nWales need to physically dominate Scotland because that's how they get themselves on the front foot... they need to step up.\nWith both Wales and Scotland having had a defeat in the first round then they're both in the last-chance saloon of realistically winning the tournament.\nScotland have a lot of good players, they're a good team this year, but also they have a lot of good inside knowledge.\nThe Scotland director of rugby is Scott Johnson, who coached Wales,, external and their forwards coach is Jonathan Humphreys, the former Wales hooker and captain.\nThey're going to have a lot of knowledge, not just about how we play but individually as well.\nThere's a lot of people talking about the structure we play and are we being found out?\nIt's a very difficult proposition for Wales to go there, because even though Scotland lost at the weekend they lost in a manner they can take a lot of positives from.\nGareth Thomas was speaking to BBC Wales Sport's Bruce Pope", "url": "https://www.bbc.com/sport/rugby-union/31441188"}