{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 07:42:32", "date_modify": "2025-05-21 07:42:32", "date_publish": "2025-01-22 10:14:22", "description": "USA defender Naomi Girma agrees terms to join Chelsea on a long-term deal for a world record transfer.", "filename": "sport_football_articles_cqjv74w2l8po_1747813352.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8a2/live/59ef35e0-d8a4-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqjv74w2l8po_1747813352.html", "title": "Naomi Girma: Chelsea to sign USA defender for world record fee", "title_page": "Naomi Girma: Chelsea to sign USA defender for world record fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "USA defender Naomi Girma has agreed terms to join Chelsea on a long-term deal for a world record transfer.\nThe fee is believed to be the most expensive transfer for a female footballer, in the region of £900,000 ($1.1m) and exceeding the £685,000 Bay FC paid for Zambia's Racheal Kundananji in February 2024.\nIt would also see the 24-year-old become the first women's million dollar player.\nWomen's Super League champions Chelsea were in a tussle with French giants Lyon for her signature, with Girma widely regarded as one of the best players in the world.\nShe is set to leave San Diego Wave - now managed by former Arsenal boss Jonas Eidevall - and will become manager Sonia Bompastor's first January signing at the club.\nGirma was a priority target for Chelsea this window having lost centre-back Kadeisha Buchanan to an anterior cruciate ligament (ACL) injury.\nThey currently sit top of the WSL table with a seven-point lead over Arsenal and have qualified for the knockout stages of the Women's Champions League.\nThe club signed Levante striker Mayra Ramirez in January last year for a British record £384,000 fee, plus up to £42,600 in add-ons.", "url": "https://www.bbc.com/sport/football/articles/cqjv74w2l8po"}