{"authors": ["Grant Young", "www.facebook.com"], "date_download": "2025-04-26 04:14:25", "date_modify": "2025-04-26 04:14:25", "date_publish": "2025-03-04 11:08:40", "description": "Glasgow Warriors fan voice: 'Alarming panic in calamitous ending'", "filename": "sport_articles_cx2rkrjnvejo_1745640865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f2b/live/bcdb42a0-f8e5-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx2rkrjnvejo_1745640865.html", "title": "'Alarming panic in calamitous ending'", "title_page": "Glasgow Warriors fan voice: 'Alarming panic in calamitous ending' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glasgow were moments away from stealing the full five points on Saturday evening in a game where they largely looked second best.\nWhen Duncan Weir split the post to take Glasgow two points clear, adulation filled the stands. What then unfolded, though, was a serious of calamitous mistakes.\nOspreys, despite their lowly league position, travelled north with a plan. They struck the heart of Glasgow's defence and broke it down three times in the first half.\nGlasgow pride themselves on defensive intensity but something was off. Ospreys pinned high balls on the returning Adam Hastings, who at 15 looked uncomfortable and fragile dealing with the aerial threat.\nThe impressive Max Mann's size and bulk were missed when he went off with a head knock midway through the first half and never returned.\nThen we have the final 20 seconds. Warriors have become a well-drilled and disciplined team. However, the sheer panic off the final restart was alarming.\nThe catch off the kick by JP du Preez was perfect. All he had to do was fall down, present the ball for the nine to kick out as time expired or let the forwards hit one more up then kick the ball out.\nInstead, he threw an offload to Facundo Cordero, who panicked and threw it to Sean Kennedy and a penalty was ultimately coughed up to allow the visitors to snatch victory.\nI'm baffled why firstly Du Preez just didn't keep the ball but also how unaware the next two players were of how little time was on the clock. Glasgow went from securing the five points to walking off with only two.\nThe panicked ending, after working so hard, puts Warriors back closer to the pack rather than trying to keep up with Leinster.\nIt's back to the drawing board as the team now need to wait two weeks to go again with Munster in town. What this defeat tells us is there are zero easy games in the URC.", "url": "https://www.bbc.co.uk/sport/articles/cx2rkrjnvejo"}