{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 05:12:42", "date_modify": "2025-05-21 05:12:42", "date_publish": "2025-01-23 11:11:36", "description": "Rangers captain Tavernier has extra motivation for Man United upset", "filename": "sport_articles_cg7z1xy9z75o_1747804362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b47f/live/484b32e0-d97a-11ef-a5c8-1da73bd59591.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg7z1xy9z75o_1747804362.html", "title": "Rangers captain Tavernier has extra motivation for Man United upset", "title_page": "Rangers captain Tavernier has extra motivation for Man United upset - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Why is Rangers captain James Tavernier extra determined to win at Old Trafford?\n\"It would definitely be special, especially being a Leeds fan playing against Man Utd,\" said Tavernier.\n\"I've got a lot of friends and family coming here but everyone's sorted [for tickets].\"\nThe right-back is relishing the Europa League trip to the Theatre of Dreams, where his only previous appearance was as a Newcastle United youngster in 2012.\n\"It was in the Capital One Cup and I lost – so I'd like to come here and get a good win. I'm really excited,\" Tavernier said.\n\"The only thing I remember was that Wayne Rooney was in centre midfield and was running the show.\n\"I was young and it was obviously a little bit daunting coming to Man United. I'm well experienced now so you sort of block a lot more noise out and just focus on the game.\n\"I know everyone in the team has that in them because they mostly all been involved in big games.\"\nRangers are well placed to qualify for the Europa League knockout stage and Tavernier feels their good form in that competition has helped them through domestic difficulties.\n\"We've lacked consistency this season but I feel that in Europe we've handled ourselves really well,\" he added.\n\"This competition has always been good for us, rising to big challenges. Obviously, what United have done lately in conceding early, we're just going to stick to our gameplan and try to get right in their faces, try to get after them.\"", "url": "https://www.bbc.com/sport/articles/cg7z1xy9z75o"}