{"authors": ["James Jones", "www.facebook.com"], "date_download": "2025-05-21 07:46:24", "date_modify": "2025-05-21 07:46:24", "date_publish": "2025-05-20 11:35:07", "description": "West Ham news: Opinion - Season of struggle nears its end", "filename": "sport_football_articles_clyz2pjd7pxo_1747813584.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0c2/live/79c50fe0-b62f-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyz2pjd7pxo_1747813584.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - Season of struggle nears its end  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another week down and another week closer to a much-needed break for West Ham fans.\nThis season has been a cocktail of disappointment, anger, frustration and disbelief. It is fair to say every West Ham supporter on the planet will be overjoyed when the final whistle blows at Portman Road on Sunday.\nHaving parted ways with David Moyes last summer, there was an element of excitement and anticipation for what the future might hold, especially after new boss Julen Lopetegui wasted no time in splashing almost £150m on new players.\nThe Spaniard flopped, though, and despite impressive away wins at Crystal Palace and Newcastle, failed to convince anyone he was the man to lead the club into a new era.\nGraham Potter has also struggled to convince many fans at this stage, but it is still very difficult to make a fair judgment on him, given he is working with a squad of players who were on the decline under Moyes and struggled for any kind of form under Lopetegui.\nIt will take at least one transfer window, if not more, for Potter to really put his own stamp on this team.\nThat is why I am trying so hard to remain positive about what next season might bring. I know many are pessimistic and many have already written Potter off, but I am reserving my judgement until we are able to see a squad of players built by Potter playing in Potter's preferred system.\nUntil then, I am just looking forward to the final whistle this weekend. Because I need a break from this team after this season.\nWe go again next season.", "url": "https://www.bbc.com/sport/football/articles/clyz2pjd7pxo"}