{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:03:44", "date_modify": "2025-05-21 07:03:44", "date_publish": "2025-03-29 00:00:00", "description": "Cameron Humphreys' goal keeps Wycombe in the hunt for automatic promotion as they beat Lincoln, who have Paudie O'Connor sent off.", "filename": "sport_football_live_cvg1919471qt_1747811024.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvg1919471qt_1747811024.html", "title": "Wycombe Wanderers 1-0 Lincoln City", "title_page": "Wycombe Wanderers 1-0 Lincoln City - Humphrey's goal gives Chairboys win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cameron Humphreys' second-half strike kept Wycombe's automatic promotion chances alive with a home win against 10-man Lincoln.\nThe home side had several promising moments in the opening stages with Adam Reach and Luke Leahy working well on the left-hand side, and found main man Richard Kone on numerous occasions but to no avail.\nThe first 45 minutes saw both goalkeepers, Will Norris and George Wickens, have little to nothing to do as both teams struggled to create clear-cut chances.\nFor the Chairboys, Josh Scowen and Xavier fired over from range, while Reeco Hackett went close for the Imps, but his effort went wide of the mark.\nThe best chance of the half fell in favour of Mike Dodds' side as Reach's deflected cross was tipped onto the crossbar by Wickens.\nThe second half looked like it was going to be another frustrating afternoon for the Adams Park faithful, as their push for a place in the automatic spots seems to be slipping away following a run of inconsistent form.\nBut in the 65th minute they managed to break the deadlock thanks to Humphreys' seventh goal of the season.\nReach's backheel on the touchline found Leahy, who decided to play a long ball into the box.\nLincoln's Sean Roughan missed kicked his clearance and stumbled which allowed the on-loan Ipswich man through on goal.\nHe then rounded Wickens and slotted home his third in 10 games.\nAnd in the final few seconds, Lincoln captain Paudie O'Conner was shown a straight red card for lashing out at Joe Low.\nWycombe remain third but move onto 74 points, three behind Wrexham, while Lincoln are 12th and neither in danger of relegation nor holding a realistic chance of promotion.", "url": "https://www.bbc.com/sport/football/live/cvg1919471qt"}