{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:54:14", "date_modify": "2025-05-20 14:54:14", "date_publish": "2023-07-28 00:00:00", "description": "Follow live text updates and BBC radio commentary from the third and fourth days of round 12 of the 2023 County Championship.", "filename": "sport_live_cricket_64959329_1747752854.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_64959329_1747752854.html", "title": "County Championship LIVE: Score, commentary & updates from round 12", "title_page": "County Championship LIVE: Score, commentary & updates from round 12 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's All Folks\nNottinghamshire were the day’s only winners – and big winners too - as they crushed Kent by 321 runs after bowling their opponents out for just 85 at Trent Bridge.\nThe hosts batted on for over an hour in the morning, with Will Young hitting 87 and Joe Clarke blazing 73 from just 40 balls to extend their second-innings lead to 406.\nBut any fears they might have left it too late to declare were quickly dispelled, as Dane Paterson (5-41) and the country's top wicket taker Brett Hutton (4-44) rolled Kent in only 21.3 overs.\nNotts’ resounding victory lifts them to sixth place in Division One, with a 33-point cushion over Kent, who drop into the bottom two after their third straight defeat going into final red-ball break.\nThey are two points better off than Lancashire, who briefly looked like they might force victory against Northants, but could not bowl them out.\nIn Division Two, Glamorgan moved up to second place despite failing to force a victory – or even capture a wicket during the final day’s play at Derby – as the home side comfortably batted out a draw.\nBut they will be replaced in second by Worcestershire tomorrow, whether or not the Pears, 421 ahead overnight, can bowl out Gloucestershire at Cheltenham. If the hosts actually reach any target they are set, then Glammy woukd stay second.\nDerbyshire openers Luis Reece, who finished 200 not out, and Harry Came both hit career-best scores as rhey set a county record first-wicket partnership by scoring 360 without loss after their side had been made to follow on.\nBut rain was the only winner at Scarborough, where the match between Yorkshire and Durham was abandoned as a draw, leaving the visitors a healthy 54 points clear at the summit and the White Rose bottom following their hefty points deduction.\n'The rest have to catch us' - Durham coach\nDurham head coach Ryan Campbell was pretty relaxed about having to spend two wasted two days at sodden Scarbrorough - as the eight points from the draw actually increased the Divison Two pacesetters' lead going into the One-Day Cup break.\n\"We have dominated the competition so far,\" he told BBC Radio Newcastle. \"We have put ourselves in a position where, come September, we have such a lead, the rest are going to have to try and catch us.”\nDurham are now 54 points clear of nearest challengers Glamorgan, possibly less if Worcestershire win at Cheltenham tomorrow, with Sussex and Leicestershire very much still in the mix.\nBut his main concern was the frustation of not getting to entertain the always discerning Scarborough crowd\nHe added: “It’s disappointing isn’t it? I am new to all of this but, when you play at an outground like Scarborough and you take cricket to the people, you want to play and put on a good show for people.\n\"Unfortunately the ground copped so much water yesterday and last night it is not surprising we couldn’t get back out there. It’s not that it was wet on top, it was soft and moving around under foot. And you don't want players getting injured.\"", "url": "https://www.bbc.com/sport/live/cricket/64959329"}