{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:04:57", "date_modify": "2025-05-19 15:04:57", "date_publish": "2015-03-07 00:00:00", "description": "Text and radio commentary, Final Score, interaction and analysis as the first FA Cup quarter-final goes to a replay.", "filename": "sport_live_football_31580475_1747667097.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_football_31580475_1747667097.html", "title": "FA Cup quarter-finals - Bradford v Reading", "title_page": "FA Cup quarter-finals - Bradford v Reading - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nBBC Final Score\nSo we don't know who the first team definitely into the FA Cup semi-finals will be, but will there be a winner in the Aston Villa and West Brom tie? That game kicks off at 17:30 GMT and you can watch it on Match of the Day Live.\nFor now, Final Score is well under way where you can catch all the goals as they go in. Join Jason Mohammad, Kevin Kilbane and Stuart Pearce on the Red Button and online from 14:30 GMT and the programme is also live on BBC One from 16:30 to 17:00 GMT - except in Scotland where viewers can watch Sportscene.\nWe also have dedicated live text commentary on the Premier League game between QPR and Tottenham, and another on the Football League. Plenty for you to get your teeth into.\nPlayer reaction\nBradford striker Jon Stead on BT Sport: \"It was a dogfight. Two teams going at it 100% and it was a proper cup tie. We are disappointed. We feel we can do better than we showed today.\n\"We have done half a job but we have huge belief that we can still go through in the replay.\"\nManager reaction\nBradford City boss Phil Parkinson, speaking to BT Sport: \"We have to give Reading credit they came here and made it very difficult with the extra man in midfield but I thought our lads did excellent. They were very professional and made sure we stayed in the game.\n\"I thought we got a bit of momentum in the second half and were the team in the ascendancy. We look forward to the replay.\"\nPost\nChris Waddle at Valley Parade\nBBC Radio 5 live\n\"Bradford played the conditions well, especially the second half. First half it wasn't really a match: you hit the ball forward and we'll hit the ball forward.\n\"Reading have come and done a job. Their game plan was not to lose today, and it has worked. Back at the Madejski, it's a better surface and Reading should win it. Bradford might be in the same division as Reading next season so there is not much between the sides, but playing at home you should win.\n\"We came here anticipating a shock maybe. Both teams were evenly matched and the pitch was great leveller today.\"\nPost\nAlex Pearce goes up to challenge for a ball with Francois Zoko and is on the wrong end of a nasty clash of heads. Blood is pouring from his nose and there is a pause in play. Reading have used all their subs, if he can't carry on they will have to continue with 10 men for the final few minutes.\nPost\nChris Waddle at Valley Parade\nBBC Radio 5 live\n\"When that ball was bouncing around in the box there was an almighty scramble. The people around us thought it had gone in the net - I did as well - but somehow they kept it out.\n\"That's all Reading have got at the minute, just the counter attack. It's been all Bradford.\"\nPost\nChris Waddle at Valley Parade\nBBC Radio 5 live\nOn Yakubu coming on: \"One thing you know - although I don't think he will enjoy the surface - is the song goes give him a chance and he will score. Let's hope he does.\"\nFive live commentator John Murray adds: \"Yakubu looking strong shall we say. Those blue and white hoops not doing him any favours.\"", "url": "https://www.bbc.com/sport/live/football/31580475"}