{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:43", "date_modify": "2025-05-21 03:39:43", "date_publish": "2025-02-01 18:16:25", "description": "Everton 4-0 Leicester City: What David Moyes said", "filename": "sport_football_articles_cn01y1qkpjgo_1747798783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d480/live/a00a3800-e0c8-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn01y1qkpjgo_1747798783.html", "title": "Everton 4-0 Leicester City: What David Moyes said", "title_page": "Everton 4-0 Leicester City: What David Moyes said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton boss David Moyes has been speaking to BBC Sport about the win: \"Things are sweeter than we felt a couple weeks ago. Great credit to the players for another outstanding performance. It is good to see they are making good progress.\n\"When you get a goal so quickly, it is a great confidence boost and a great start. We backed it up with the second goal, which then allows us to play. We were a bit unlucky to not score a few more at that time. At times, our first-half performance was very good.\n\"I'm really pleased for Beto because I'm only just getting to know him. He has probably felt it has been difficult for him. We need someone to score goals - we are short on centre-forwards and losing Dom [Calvert-Lewin] was a big blow - so he came in and took his goals very well.\n\"We have played well in games, we have passed it well and made opportunities to score. I'm glad with the way we are playing. We are doing a lot of good things. There's a lot we can try to make better.\n\"The job is to make sure we are a Premier League team. The last three results will go a long way to making that happen.\n\"I found the noise incredible. I remember what it was always like. You have to give them something to shout about, and we did that from the start.\"", "url": "https://www.bbc.com/sport/football/articles/cn01y1qkpjgo"}