{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:12:37", "date_modify": "2025-05-21 04:12:37", "date_publish": "2025-04-10 00:00:00", "description": "Ten-man Rangers produce a heroic performance to retain a fighting chance of Europa League progression, with Liam Kelly's late penalty save decisive in earning an unlikely draw with Athletic Bilbao.", "filename": "sport_football_live_ckgeyng3dnlt_1747800757.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckgeyng3dnlt_1747800757.html", "title": "Rangers 0-0 Athletic Club", "title_page": "Rangers 0-0 Athletic Club - Liam Kelly saves penalty for 10-man hosts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ten-man Rangers produced a heroic performance to retain a fighting chance of Europa League progression, with Liam Kelly's late penalty save decisive in earning an unlikely draw with Athletic Bilbao.\nThe Spanish side arrived in Glasgow as favourites with Rangers under pressure off the back of a record five consecutive defeats at home.\nTheir cause seemed doomed when Robin Propper was adjudged to have brought down Inaki Williams. After a video assistant referee (VAR) intervention, as last man, his yellow card turned red after just 13 minutes.\nRangers, though, held firm - and survived a number of scares - before substitute Alex Berenguer stepped up to take the most controversial of late penalties, but Kelly diverted the ball over with his leg to the delight of the home crowd.\nThe omission of Jack Butland in goal after what head coach Barry Ferguson described as \"one of the toughest things I've had to do\", with Kelly in from the start, was such a big call on such a massive occasion. For him to emerge as the hero was full justification.\nStarting Kelly and 18-year-old midfielder Bailey Rice among six changes from the defeat by Hibernian last weekend showed Ferguson was true to his word to be decisive following another domestic downfall.\nAthletic Club clearly bring threat and Maroan Sannadi had already shown that before Rangers' suffered that disastrous early setback.\nPropper's challenge on Williams was rash and, as last man, it is hard to argue his overturned yellow card did not merit a red.\nIt looked like Rangers' troubles were far from over, but yet again they mustered another memorable European performance to stay in the tie, with Ferguson saying the \"few home truths\" he had with his players had \"sunk in\".\nSannadi was a constant threat until substituted. Early in the second half, he went down under Leon Balogun's challenge, was booked but seemed to have a case for a penalty. It was a big let-off.\nAs it was moments later when Sannadi stretched to reach Inaki Williams' sharp cross and, with the goal gaping, and Kelly completely exposed, the striker blazed just wide.\nThe visitors repeatedly pushed and thought they had the opener when Berenguer fired home from close range.\nConfusion reigned all around Ibrox as VAR intervened, offside was given to rule out the strike, but then a twist as Dujon Sterling was penalised for the slightest of handballs in the build-up.\nIt was to be Kelly's big moment. He stuck up a leg as he dived to his right and clipped the ball over the bar to Berenguer's dismay.\nBig ties demand big moments and they do not come much bigger as Rangers survived mounting pressure to earn a memorable outcome.\nWhere to start? It must be with Kelly.\nFerguson's decision to drop Butland for what, to date, was Rangers' biggest game of the season was a huge statement.\nKelly was thrust into this massive occasion and fully justified it. Surely he has staked his claim to continue as number one with that big moment and a more than creditable performance overall?\nRangers have shipped goals for fun of late, but to emerge from this first leg unscathed, in these circumstances, was nothing short of incredible.\nPropper's red card ripped up their best laid plans. That they stood firm in a manner that belied belief would have been everything their interim boss would have demanded.\nIt was a 0-0 that had nothing like 0-0 about it. What drama. It must feel like a win.\nIt remains a tough task to travel and progress to the last four of this competition against opposition of this quality.\nHowever, to their credit, in the most dramatic of fashions, they held on to retain a fighting chance.\nRangers interim head coach Barry Ferguson: \"Really proud of the effort and the commitment that my players showed. Obviously difficult when you go down to 10 men.\n\"What I've seen tonight out there was a team that took the instructions on. I think anybody watching the game would have seen a team that will run through brick walls for each other.\"", "url": "https://www.bbc.com/sport/football/live/ckgeyng3dnlt"}