{"authors": ["Adam Cottier", "www.facebook.com"], "date_download": "2025-05-21 04:28:28", "date_modify": "2025-05-21 04:28:28", "date_publish": "2025-04-05 10:58:07", "description": "BBC Radio Five Live reporter Adam Cottier gives his assessment on Middlesbrough's return to form following their 2-0 victory at Blackburn Rovers.", "filename": "sport_football_articles_cm2ev4rzvy7o_1747801708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c56f/live/cb54ea20-120d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2ev4rzvy7o_1747801708.html", "title": "Michael Carrick: Middlesbrough boss must take credit for good form", "title_page": "Michael Carrick: Middlesbrough boss must take credit for good form - Cottier - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Middlesbrough will face more difficult assignments in the run-in than the one that transpired at Ewood Park on Friday night, but their return to form in recent weeks has been stark. Such momentum could give them edge in the play-off race.\nWhen I last saw Middlesbrough, reporting for BBC Radio 5 Live in the middle of February, I witnessed a team short of guile, with vulnerability in defence and no control in midfield.\nThat was their 3-1 defeat at Sheffield United amid a five-match losing run.\nAgainst a toothless and beleaguered Blackburn side, this time, they exposed the vulnerabilities of their opponents with a ruthless start, scoring two goals inside the first eight minutes.\nThey looked more streetwise, more confident and managed the game expertly.\nThere appears to be strong unity, too, between players, fans and a manager in Michael Carrick, who must take great credit for guiding his team back to form, two and a half years into a job he clearly loves doing.\nTommy Conway's exquisite touch and finish in the opening 80 seconds of the game was the highlight - he's steadily stepping into the boots vacated by Emmanuel Latte-Lath as an instinctive and reliable goalscorer.\nA play-off place is in Boro's grasp, as they look to end their eight-year wait for another go in the Premier League, so long as they maintain such good mentality and strength.", "url": "https://www.bbc.com/sport/football/articles/cm2ev4rzvy7o"}