{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:25", "date_modify": "2025-05-21 08:01:25", "date_publish": "2025-03-28 00:00:00", "description": "Watch live coverage from the Netball Super League as Manchester Thunder take on Nottingham Forest.", "filename": "sport_netball_live_c17e942dz1pt_1747814485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8cc8/live/6f5bbd10-0967-11f0-94d4-6f954f5dcfa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_netball_live_c17e942dz1pt_1747814485.html", "title": "Netball Super League LIVE: Manchester Thunder vs Nottingham Forest", "title_page": "Netball Super League LIVE: Manchester Thunder vs Nottingham Forest - watch stream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who's in action?\nManchester Thunder v Nottingham Forest (19:30 GMT)\nBBC Sport\nFour-time champions Manchester Thunder and Netball Super League newcomers Nottingham Forest will face off in the third round of the the new Netball Super League season on Friday.\nThunder were dominant las time out in beating Birmingham Panthers 77-47 to claim their first win of the 2025 season.\nAfter defeat by holders Loughborough Lightning on the opening weekend, Thunder were much improved in Birmingham.\nThe Panthers kept it close in the first quarter but Karen Greig's side pulled away in the second to lead 36-21 at half-time and doubled their advantage in the second half, with 47 goals from South Africa's Elmere van der Berg.\nNottingham Forest also claimed their first win too as they beat Cardiff Dragons 70-54 at Motorpoint Arena.\nRolene Streutker scored 31 goals for Forest, with Dragons' goal shooter Georgia Rowe getting 33 in a losing cause.\nNo draws, timeouts & more points on offer - NSL introduces new rules\nBBC Sport\nThe Netball Super League has introduced three further rule changes for the 2025 season as part of the revamped competition.\nUnlike in previous seasons, games will not be allowed to end in a draw, with matches going to extra time if the scores are level after 60 minutes.\nTactical timeouts have also been introduced, while there will be a new system for distributing points, with one point on offer for losing teams who finish within five points or less of their opponent.\nThe league, the sport's elite domestic competition in the UK, is being reformed from 2025 as part of plans to make the division professional.\nIn the latest series of rule changes, there will be 10 minutes of extra time, with a one-minute half-time break, if the score between teams is level after 60 minutes.\nIf the score is still level at end of extra time, play will continue until one team reaches a two-goal lead.\nRead the full story here.\nHow to get into netball\nIs it for me?\nNo matter what your fitness level is, there is a position on court for everyone. Netball is a semi-contact sport, so men and women and boys and girls can all play on the same side. There's also a strong sense of friendship and team-bonding within netball teams.\nFind a club in England, , externalWales,, external Scotland, external or Northern Ireland, external to get going.\nWhat can I expect when I start?\nNetball is an all over body workout so is great for general fitness and improving muscle tone.\nYou don't need any special kit, just clothes that you feel comfortable exercising in and trainers.\nYou move through the court by running and jumping so it helps with balance and co-ordination.\nWalking Netball, external is growing in popularity and is a low-impact way to play the game with no age limits - younger or older!\nDisability Netball is similar to the traditional game but with a few adaptations such as using a ball with a bell inside for people with visual impairments or installing an induction loop for those who are hearing-impaired. Find your nearest club on Parasport UK., external", "url": "https://www.bbc.com/sport/netball/live/c17e942dz1pt"}