{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:02", "date_modify": "2025-05-21 06:07:02", "date_publish": "2025-01-14 10:54:23", "description": "French sailor Charlie Dalin sets a new record on his way to winning the round-the-world Vendee Globe race.", "filename": "sport_sailing_articles_c4g3x0zj7rjo_1747807622.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f023/live/b06e0b70-d260-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_sailing_articles_c4g3x0zj7rjo_1747807622.html", "title": "Vendee Globe: Charlie Dalin sets new record to win round-the-world race", "title_page": "Vendee Globe: Charlie Dalin sets new record to win round-the-world race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "French sailor Charlie Dalin made up for the disappointment of four years ago as he set a record on his way to winning the round-the-world Vendee Globe race.\nThe 40-year-old covered the 24,300-mile (39,100km) route in a time of 64 days, 19 hours, 22 minutes and 49 seconds to beat Armel Le Cleac'h's mark set in 2017 by more than nine days.\nDalin had finished second in the last edition of the solo race in 2021, crossing the line first before being relegated to second when runner-up Yannick Bestaven was given a time bonus for helping in the rescue of a rival which led him being declared the winner.\nThis time, Dalin led for the majority of the race with his closest challenger, Yoann Richomme more than half a day behind.\n\"I have never experienced such emotions. It's unbelievable,\" said Dalin, who was joined by his wife and seven-year-old son on his boat Macif after he crossed the finish line off the coast of Brittany.\n\"I have been dreaming about this Vendee Globe since the day after the 2021 Vendee Globe.\n\"For four years, my team and I have been working hard and giving everything we have to make this super boat. That is what we live for and we've achieved our aim.\"\nBestaven's title defence ended at the end of December due to a series of problems with his boat.", "url": "https://www.bbc.com/sport/sailing/articles/c4g3x0zj7rjo"}