{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-20 12:08:55", "date_modify": "2025-05-20 12:08:55", "date_publish": "2023-08-05 10:26:19", "description": "Livingston and Aberdeen share the points after a drab and goalless Scottish Premiership opener.", "filename": "sport_football_66194495_1747742935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/163C4/production/_130667019_20811336-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194495_1747742935.html", "title": "Livingston 0-0 Aberdeen: Points shared in match of few chances", "title_page": "Livingston 0-0 Aberdeen: Points shared in match of few chances - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Livingston and Aberdeen shared the points after a drab goalless Scottish Premiership opener in West Lothian.\nKelle Roos was called into action once with 15 minutes left as Ayo Obileye's downwards header searched for the corner.\nThere was a first-half Aberdeen penalty appeal from Bojan Miovski after a shirt tug by Obileye, but referee John Beaton was unmoved.\nOver 4,000 away supporters travelled down to Tony Macaroni Arena, but their team did not produce a single shot on target.\nLate on, substitute Bruce Anderson was taken off on a stretcher following a nasty collision with Aberdeen debutant Slobodan Rubezic.\nThere's always talk that teams are raring to go and eager to get the league campaign back underway. However, neither side looked as though they'd returned from their summer holidays in a poor encounter which lacked any sort of quality.\nPasses could not be strung together, the ball could barely be kept on the deck. Very little football was played in a rather robust contest.\nRubezic was first to enter the book for a nasty nick on Kurtis Guthrie. Later, Barry Robson joined him after his frustrations were evidently growing on the touchline.\nFollowing the departure of his namesake, Nicky Devlin, Michael Devlin donned the captain's armband in West Lothian and he came closest to taking control of the game when he rifled a shot from 30 yards out, deep into a lengthy stoppage time, but his effort flew wide.\nHopefully both sides have got this out of their system early on in the season and the game is never referred to again.\nThere was no oomph from an Aberdeen side who have generated high-expectations this season for the way they ended the last campaign and the summer signings they had made. Big changes will need to be made from that showing if there is to be any success domestically or joy on the continent this year.\nLivingston frustrated their visitors, and that's always to be expected at the Tony Macaroni. But David Martindale's side offered little signs of hope of their own.", "url": "https://www.bbc.com/sport/football/66194495"}