{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:25:57", "date_modify": "2025-04-26 04:25:57", "date_publish": "2025-03-03 11:48:07", "description": "Cardiff City: The young Bluebird who made the most of his FA Cup chance", "filename": "sport_football_articles_czx7yr0dx71o_1745641557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6a3/live/c5cc2950-f823-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czx7yr0dx71o_1745641557.html", "title": "Cardiff City: The young Bluebird who made the most of his FA Cup chance", "title_page": "Cardiff City: The young Bluebird who made the most of his FA Cup chance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "His debut was hailed as \"brilliant\" by a Cardiff City icon and he is a regular in an impressive Wales youth side full of future talent.\nAnd now Bluebirds boss Omer Riza has admitted Dylan Lawlor has become a first-team option after being \"surprised\" by the 19-year-old's eye-catching display at Premier League Aston Villa.\nLawlor had not played a minute of senior football before he was thrown in against Marcus Rashford and Ollie Watkins in Friday night's FA Cup fifth-round tie at Villa Park.\nDespite the 2-0 defeat, former Cardiff City striker Nathan Blake said there were plenty of positives to take as Cardiff turn their focus back to their Championship survival bid – with Lawlor's performance one of them.\nCriticised in recent years for failing to produce enough first-team players, Cardiff fielded six academy products at Villa (not including long-established graduate Aaron Ramsey), with Lawlor in a backline containing Wales Under-19 team-mate Luey Giles.\n\"He was superb,\" Riza said of Caerphilly-born Lawlor, who joined the club at the age of seven.\n\"He surprised me a little bit today with some of the things he did. I know he is a good-quality player and in possession he is really good, and he was very calm and collected.\n\"But I thought, defensively, he picked up good positions, dealt with one-on-one situations, read the game well. It was a brilliant debut.\"\nLawlor has had to bide his time at club level but has been part of Chris Gunter's Under-19 team that has reached the Elite group of their European Championship qualifiers alongside Manchester United hot prospect Gabrielle Biancheri.\nHe was also part of the Wales Under-17 side that reached the Euro finals two years ago, scoring the goal to seal qualification.\nLawlor described his debut as \"surreal\" but Riza hinted he could now experience more opportunities having had recent availability problems at the back.\n\"We have had Jesper's [Daland] injury, Will [Fish] hasn't played loads of minutes and he's again played two 90s in a row, Goutas was suspended; we have had a few issues in that position, so it's a good option to have,\" he said.\n\"Joel Bagan can do it and Perry can fill in but it's just nice for him [Lawlor].\"", "url": "https://www.bbc.co.uk/sport/football/articles/czx7yr0dx71o"}