{"authors": ["Mike Peter", "www.facebook.com"], "date_download": "2025-05-20 12:35:58", "date_modify": "2025-05-20 12:35:58", "date_publish": "2023-08-03 16:32:21", "description": "Alice Davidson-Richards stars with the ball as Northern Superchargers beat Birmingham Phoenix by seven wickets at Headingley.", "filename": "sport_cricket_66399765_1747744558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5478/production/_130642612_gettyimages-1589942593.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66399765_1747744558.html", "title": "The Hundred 2023: Alice Davidson-Richards powers Northern Superchargers to win over Birmingham Phoenix", "title_page": "The Hundred 2023: Alice Davidson-Richards powers Northern Superchargers to win over Birmingham Phoenix - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n3 August 2023\nThe Hundred, women's competition: Northern Superchargers v Birmingham Phoenix\nBirmingham Phoenix 110-8: Devine 46 (36); Davidson-Richards 3-20\nNorthern Superchargers 112-3: Litchfield 42* (29); Wong 1-9\nNorthern Superchargers won by seven wickets\nScorecard,Table\nAlice Davidson-Richards starred with the ball as Northern Superchargers beat Birmingham Phoenix by seven wickets.\nThe all-rounder took 3-20, as the away side struggled to 110-8, with only opener Sophie Devine (46) offering some resistance.\nPhoebe Litchfield (42*) combined with Marie Kelly and captain Hollie Armitage to put the Superchargers in command.\nArmitage fell with 16 runs needed, but Litchfield and Davidson-Richards saw their side home with 22 balls to spare.\nWhat else do you need to know?\nDavidson-Richards didn't just star with her bowling. Her catch dismissed Phoenix captain Eve Jones, she ran out Emily Arlott and she finished the game with a six down the ground.\nEngland wicketkeeper Amy Jones and Australia's Tess Flintoff suffered near identical dismissals, with both finding Leah Dobson at deep square-leg while pulling short balls from Davidson-Richards.\nSuperchargers topscorer Phoebe Litchfield was a late replacement signing, with the Australia batter coming in for her injured international team-mate Alyssa Healy. The 20-year-old came into the tournament in good form after hitting her debut international century against Ireland.\nEngland seamer Issy Wong bowled just five deliveries as the Phoenix fielded eight bowlers, but picked up the wicket of India superstar Jemimah Rodrigues, lbw for just 16.\n'Wasn't too shabby' - what they said\nMatch Hero Davidson-Richards talking to Sky Sports: \"As days go it wasn't too shabby. They were playing some lovely shots to start, their top-order will definitely get away some days. It was about keeping it simple and bowling your best ball.\n\"The other batters did the hard work, I just knocked a few over. It was a slightly slower wicket but it played great.\n\"We were really close [to the knockout stage] last year and it was frustrating. We're definitely aiming for the knockouts. It's about doing what we do best for as long as possible and hope the other team blinks first.\"\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August.", "url": "https://www.bbc.com/sport/cricket/66399765"}