{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:38", "date_modify": "2025-05-21 03:55:38", "date_publish": "2025-02-01 16:20:58", "description": "Nottingham Forest 7-0 Brighton: What Lewis Dunk said", "filename": "sport_football_articles_cn01y5rk15jo_1747799738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51a8/live/77876160-e0b8-11ef-a56b-833ca503b60b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn01y5rk15jo_1747799738.html", "title": "Nottingham Forest 7-0 Brighton: What Lewis Dunk said", "title_page": "Nottingham Forest 7-0 Brighton: What Lewis Dunk said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton captain Lewis Dunk has been speaking to TNT Sports about the heavy defeat: \"Everything went wrong, it was embarrassing. We let ourselves down. We let the travelling fans down. We let the fans at home down. We have to take it on ourselves. It was us out there that performed like that. We have to look at ourselves in the mirror and bounce back next week.\n\"I don't think we played with enough intensity or wanted it enough. It's not nice to say as a football player, but we weren't good enough today. As a whole team, we didn't deserve [anything]. It could have been even more [goals].\n\"We knew that we were coming here for a tough game, they are flying in the league and it is always a tough place to come. That tough? Probably not - and that is on ourselves. We have to work hard now and make sure we don't let ourselves or the fans down like that again.\n\"It is doing it on the training field, working hard every day and wanting it every day. It starts on the training pitch. Three games ago, we were on top of the world again weren't we, after two wins in a row. Now we are rock bottom again.\n\"This season has been a rollercoaster. The manager speaks about consistency all the time and that is a prime example of not showing any. We have to work at it. There is a lot of work to do to get to where we want to get to.\n\"There wasn't much to say [after the game]. We let ourselves down, let the fans down, let him [Fabian Hurzeler] down. There was nothing to say.\"", "url": "https://www.bbc.com/sport/football/articles/cn01y5rk15jo"}