{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:45", "date_modify": "2025-05-19 14:31:45", "date_publish": "2017-08-23 11:45:15", "description": "Leicestershire T20 captain Clint McKay is hoping his side's winning momentum can help them reach T20 Blast Finals Day", "filename": "sport_cricket_41025206_1747665105.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17E25/production/_97492879_gettyimages-830362738.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_41025206_1747665105.html", "title": "Clint McKay: Winning run can help Leicestershire reach T20 Blast Finals Day", "title_page": "Clint McKay: Winning run can help Leicestershire reach T20 Blast Finals Day - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicestershire T20 captain Clint McKay is hoping his side's four-game winning run can be the momentum to secure a place in the T20 Blast Finals Day.\nThe Foxes, who go to Glamorgan in Wednesday's quarter-final, claimed the final North Group qualifying spot.\nMcKay is hoping to keep the winning run going in Cardiff as the Foxes look to return to Finals Day for the first time since winning the trophy in 2011.\n\"To win four in a row gives us confidence at Cardiff,\" said McKay.\n\"We always believed we have a very good team and if we turn up and play our best we can beat anyone, as we showed throughout the group stage.\"\nLeicestershire set the early pace in the North Group with four straight victories, but they lost the next five to leave them needing four wins to qualify.\n\"We took a lot of confidence from those first four games,\" McKay told BBC Radio Leicester.\n\"Going into the last four we knew it was do-or-die, so the boys went out and played with freedom.\n\"We know we've got a quality squad and some exciting young guys coming through, so it's great for them to know we can beat anybody on our day.\"", "url": "https://www.bbc.com/sport/cricket/41025206"}