{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 06:11:16", "date_modify": "2025-05-21 06:11:16", "date_publish": "2025-02-08 14:22:10", "description": "Rory Darge backs Tom Jordan to continue 'whirlwind' rise against Ireland", "filename": "sport_articles_cqx91e93qj1o_1747807876.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a2d1/live/797f8cd0-e627-11ef-a00c-b940b4c70dcc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqx91e93qj1o_1747807876.html", "title": "Rory Darge backs Tom Jordan to continue 'whirlwind' rise against Ireland", "title_page": "Rory Darge backs Tom Jordan to continue 'whirlwind' rise against Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rory Darge has backed Glasgow Warriors team-mate Tom Jordan to excel on his first Test start at inside centre against Ireland on Sunday.\nJordan, 26, has been a mainstay in the Warriors team at fly-half, leading Glasgow to the URC title last season.\nHe made his international debut at full-back against Fiji in November and started at 15 the following week against South Africa.\nAfter an impressive appearance off the bench against Italy, Jordan has been selected to start at 12 against the Irish, and Darge has backed his clubmate to continue his rapid rise.\n\"It's been pretty whirlwind, hasn't it?\" Darge said.\n\"He's just gone from strength to strength. He's already shown that he can play at Test match level. Last week when he came on, he brought real energy. For his first cap, he was playing at full-back. He slotted in really well and did a job.\n\"He'll be really excited to go out and play at 12, where he's probably played most of his rugby. But then at Glasgow, he's played a lot of 10. It just shows the sort of quality player he is, that he can cover and play to a really high standard in all those positions.\"\n\"With Sione [Tuipulotu] being out of the squad, everyone has to bring a little bit more of their leadership because he's a massively important player to us in terms of leadership and his performances. I'm really excited to see Tom go.\"", "url": "https://www.bbc.com/sport/articles/cqx91e93qj1o"}