{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 07:26:07", "date_modify": "2025-05-21 07:26:07", "date_publish": "2025-03-28 14:43:29", "description": "England Lions all-rounder Ed Barnard signs a new three-year deal with Warwickshire.", "filename": "sport_cricket_articles_crrdr7w9yeeo_1747812367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c85/live/0054d120-0bda-11f0-aaa1-f15ca00ec6e1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_crrdr7w9yeeo_1747812367.html", "title": "Ed Barnard: Warwickshire all-rounder signs new three-year contract", "title_page": "Ed Barnard: Warwickshire all-rounder signs new three-year contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire's England Lions all-rounder Ed Barnard has extended his contract with the Bears by signing a new deal keeping him at Edgbaston until the end of the 2027 season.\nThe Shrewsbury-born 29-year-old was about to enter the final season of his existing three-year deal, following his move from Midlands neighbours Worcestershire.\nBut he has added two more years to that, with an option for an additional third year beyond.\n\"I feel confident going into the new season,\" he said. \"I've had a good winter, gym and technical stuff pre-Christmas but since then I've been outside playing competitive cricket. I had a good time in Australia and in Abu Dhabi, and feel like we're in a good place to hit the season hard.\"\n\"We've a great chance of competing for trophies in all three formats,\" Barnard added.\n\"We want to get off to a good start in the County Championship and get some early momentum.\"\nWhile Warwickshire under-performed in the Championship in 2024, winning just once in 14 games, the Bears again shone in the group stages of the T20 Blast, topping the table again as they won 10 of their 14 matches.\nBarnard played in only five of them and the former Blast winner, who triumphed with Worcestershire at Edgbaston in 2018, was then surprisingly left out of the Bears quarter-final line-up as they suffered a defeat at the last eight stage for the fourth year running.\n\"Moving to Warwickshire, I knew they had a strong Blast team,\" said the son of former Shropshire paceman Andy Barnard.\n\"It wasn't going to be easy to be in the team the whole time straight away. I've been involved but obviously if you're not playing at times it's frustrating.\n\"T20 is part of my game I've worked really hard on. In the Blast we've won more games than any other side over the last two years [21 out of 28 group games] so I'm sure it'll come right soon.\"\nAs well as hitting 1,322 runs and claiming 54 wickets in the Championship, Barnard has also been the Bears' star turn in the One-Day Cup, twice helping his side to the knockout stage.\nWarwickshire open the new county season with a home Championship game at Edgbaston against former Bears boss Paul Farbrace's Sussex, starting Friday 5 April.", "url": "https://www.bbc.com/sport/cricket/articles/crrdr7w9yeeo"}