{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:54", "date_modify": "2025-05-21 07:47:54", "date_publish": "2024-12-23 16:08:16", "description": "Valencia sack head coach Ruben Baraja after just two wins in 17 La Liga matches this season.", "filename": "sport_football_articles_cqjzgnjn0jlo_1747813674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6a9/live/59a14c00-c142-11ef-8b03-dd8e953e490a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqjzgnjn0jlo_1747813674.html", "title": "Ruben Baraja: Valencia fire club legend from head coach role after poor run", "title_page": "Ruben Baraja: Valencia fire club legend from head coach role after poor run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Valencia have sacked head coach Ruben Baraja after just two wins in 17 La Liga matches this season.\nBaraja, who played for the club between 2000 and 2010, returned in a managerial role in February 2023.\nHe secured survival by two points in the 2022-23 season before guiding Valencia to a ninth-placed finish last term.\nHowever, the 49-year-old departs with the club 19th in La Liga, four points from safety.\n\"He helped stabilise the team in a complicated situation and last season, he contributed to implementing competitive values that brought Valencia closer to the fight for European positions,\" the club said.\nValencia said Baraja was \"one of the greatest legends\" in the club's history and the decision to fire him \"has been very difficult to make\".\nBaraja won five trophies in 10 seasons at the club as a player, including two league titles and the Uefa Cup.\nIn his final game as manager, Valencia drew 2-2 with Alaves on Sunday to move off the bottom of the table on goal difference over Real Valladolid.\nThe former Spain international, who played at the 2002 World Cup, has previously managed Elche, Rayo Vallecano, Sporting Gijon, Tenerife and Zaragoza.\nValencia will face reigning champions Real Madrid in their next La Liga game on 3 January.", "url": "https://www.bbc.com/sport/football/articles/cqjzgnjn0jlo"}