{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:16", "date_modify": "2025-05-21 07:08:16", "date_publish": "2025-03-27 22:46:17", "description": "Novak Djokovic overcomes American Sebastian Korda in their rescheduled match to reach the semi-finals of the Miami Open.", "filename": "sport_tennis_articles_cg70llnznklo_1747811296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d42b/live/73073d80-0b57-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cg70llnznklo_1747811296.html", "title": "Miami Open: Novak Djokovic beats Sebastian Korda to reach semi-finals", "title_page": "Miami Open: Novak Djokovic beats Sebastian Korda to reach semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Novak Djokovic overcame American Sebastian Korda in their rescheduled match to reach the semi-finals of the Miami Open.\nThe world number five rallied in the second set from a break down to close out a 6-3 7-6 (7-4) victory.\nThe 37-year-old is the oldest player to reach the last four of an ATP Masters 1,000 event and is going for a seventh title in Miami.\nThe match was due to be played on Wednesday but was postponed to Thursday at short notice after Emma Raducanu's quarter-final match did not finish until after 23:00, past the ATP's cut-off point.\n\"You wait an entire day and if it's for the rain I guess you accept it, but this was scheduled and then the matches and everything just extended so much,\" Djokovic told Sky Sports.\n\"The match was postponed for today and it wasn't too early so it was OK to get some sleep. I didn't go to bed until 2.30am so it disrupts your body rhythm - so I'm just happy to come through.\"\nDjokovic will face Bulgarian 14th seed Grigor Dimitrov in the semi-finals on Friday as he continues his pursuit of a 100th ATP title.", "url": "https://www.bbc.com/sport/tennis/articles/cg70llnznklo"}