{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:13", "date_modify": "2025-04-26 03:53:13", "date_publish": "2025-03-03 09:02:11", "description": "Man Utd 1-1 Fulham AET (3-4 on penalties): Fan views on FA Cup game", "filename": "sport_football_articles_cgr2550j08eo_1745639593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgr2550j08eo_1745639593.html", "title": "Man Utd 1-1 Fulham AET (3-4 on penalties): Fan views on FA Cup game", "title_page": "Man Utd 1-1 Fulham AET (3-4 on penalties): Fan views on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the FA Cup fifth round tie between Manchester United and Fulham.\nHere are some of your comments:\nAgim: This sums up our season. Not one player can hold their head up and say Manchester United have been unlucky. Our performances have been really poor this season. No structure, poor defence, no natural goalscorer. Alejandro Garnacho looks like a ghost, Joshua Zirkzee and Rasmus Hojlund are so poor. The new boy Chido Obi doesn't look the real deal for me. The pain continues for United fans.\nJohn: Until Bruno Fernendes' goal, the lads were out for a Sunday stroll. They were walking around aimlessly, confused and waiting for the other guys to give them a kick. I expect nothing more.\nChris: Where is the progress Ruben Amorim is talking about? I can't see it. Fulham's bench had players that would have walked into United's starting XI. Disappointed doesn't even cover it.\nReeves: Terrible! Victor Lindelof and Zirkzee cost us the game!\nLaura: I'm sorry to say it has become embarrassing to be a Manchester United fan. I've supported them all my life but it's just got to the point where I'm sure the fans are thinking: 'Do the players actually care?' If you wear a Manchester United kit, wear it with pride, play with passion and desire, and show us fans how much you want to win. This performance was just diabolical. Amorim needs to change the format, as it clearly doesn't work and it never would in the Premier League. The sooner he realises this the better.", "url": "https://www.bbc.co.uk/sport/football/articles/cgr2550j08eo"}