{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:08:54", "date_modify": "2025-05-21 04:08:54", "date_publish": "2025-04-06 13:31:46", "description": "Oxford United boss Gary Rowett praises his side for taking the fight to Sheffield United in their 1-0 victory at the Kassam Stadium.", "filename": "sport_football_articles_cvgp91717xro_1747800534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ae5/live/c69dd330-12e8-11f0-8bc5-d317b6dd5c85.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp91717xro_1747800534.html", "title": "Oxford United: Gary Rowett praises side after Sheffield United win", "title_page": "Oxford United: Gary Rowett praises side after Sheffield United win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United boss Gary Rowett praised his side for taking the fight to Sheffield United in their 1-0 victory at the Kassam Stadium.\nSiriki Dembele scored the only goal to blunt the Blades' promotion charge and ease Oxford's own relegation fears.\nRowett said his side deserved the win because of the battling qualities they showed.\n\"From the word go, we looked on it today,\" he told BBC Radio Oxford.\n\"We had to make it a little scruffy, we had to make it into a fight, but we know how good a side they are.\n\"One thing that did help, I thought the atmosphere was brilliant from the start, and that made such a massive difference to me, the staff and the players.\"\nThe U's are now four points clear of danger but Rowett said they must continue to perform.\n\"It's nowhere near job done, but it gives us a fantastic opportunity to go again on Wednesday against QPR who are fighting for their own points, but we've got to enjoy the performance and the desire of today.\n\"You've got to dig in, do whatever it takes to get the three points, and then put your feet up and watch whatever it is you like on a Saturday night.\"", "url": "https://www.bbc.com/sport/football/articles/cvgp91717xro"}