{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:23", "date_modify": "2025-05-21 06:32:23", "date_publish": "2025-03-31 17:24:08", "description": "Brian Graham and Mark Wilson will remain in charge of Partick Thistle for the rest of the season, the Scottish Championship club have announced.", "filename": "sport_football_articles_cy0ylnpwrgwo_1747809143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/36e3/live/43c633f0-0e54-11f0-935b-db45f1a7a4cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0ylnpwrgwo_1747809143.html", "title": "Brian Graham & Mark Wilson see out season in charge of Partick Thistle", "title_page": "Brian Graham & Mark Wilson see out season in charge of Partick Thistle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brian Graham and Mark Wilson will remain in charge of Partick Thistle for the rest of the season, the Scottish Championship club have announced.\nMen's team striker and women's team manager Graham, 37, and under-18s coach Wilson, 40, were placed in interim charge following Kris Doolan's departure in mid-February.\nThistle occupy fourth place in the division, the final promotion play-off spot, and have five regular season fixtures remaining. Their unbeaten six-match run has garnered 12 points.\n\"Brian and Mark have gone about managing the team well and the players have responded to them by delivering strong performances,\" said chairman Richard Beastall.\n\"When you appoint an interim management team there is always a period of uncertainty over how long they will be in place, and we are glad to remove that uncertainty for the rest of the season.\n\"Having Brian and Mark in place has allowed the club to take their time over the crucial appointment of a sporting director and we are hoping to confirm that appointment this week.\"", "url": "https://www.bbc.com/sport/football/articles/cy0ylnpwrgwo"}