{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:21:05", "date_modify": "2025-05-21 05:21:05", "date_publish": "2025-01-14 17:48:36", "description": "The PFL is effectively axing the Bellator brand as Patricio 'Pitbull' Freire takes to social media to vent his frustration.", "filename": "sport_mixed-martial-arts_articles_czj37ly380ko_1747804865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/73bc/live/ac17e830-d296-11ef-b526-d36fb212fcf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_czj37ly380ko_1747804865.html", "title": "MMA: PFL ends Bellator brand as Pitbull appeals to Francis Ngannou", "title_page": "MMA: PFL ends Bellator brand as Pitbull appeals to Francis Ngannou - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Patricio 'Pitbull' Freire has appealed to heavyweight Francis Ngannou to intervene in his contract dispute with the PFL.\nPitbull, 37, has not fought since March and asked the PFL to release him from his contract last December.\nThe Brazilian has heavily criticised PFL on social media after confirmation the Bellator promotion in its current guise would be dissolved.\n\"Hey Francis Ngannou, are you aware of all the absurd things PFL is doing to fighters and putting on the new contracts?\" Pitbull said in a series of posts on X about the PFL.\n\"Will you ever speak up for us? I'm thinking it's time we start a PFL Fighters Union. What do you think?\"\nNo such union exists in the biggest MMA promotions, including the UFC and PFL.\nThere was no immediate response to Pitbull's messages from Ngannou, whose high profile in the PFL ranks is arguably unmatched, having previously starred in UFC and competed in the boxing ring, where he took on Tyson Fury and Anthony Joshua in two fights staged in Riyadh.\nPitbull is a veteran of Bellator, winning world titles in two divisions, and is the last fighter to have held its featherweight championship.\nThe PFL acquired Bellator in late 2023 in a merger and then launched the Bellator Champion Series events in 2024 to house some of its biggest stars.\nPitbull fought at a Belfast event, stopping Jeremy Kennedy to improve his record to 36-7.\nPFL chairman Donn Davis issued a statement soon after Pitbull vented his frustration on X, explaining why the Bellator branding is being largely discontinued.\n\"PFL acquired Bellator MMA one year ago primarily for its great fighter roster,\" the PFL statement read.\n\"Going forward all events and content will be PFL branded.\n\"The Bellator brand carries a rich history that will continue to be respected and appreciated through select feature title bouts.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/czj37ly380ko"}