{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 06:09:53", "date_modify": "2025-05-21 06:09:53", "date_publish": "2025-01-31 12:53:32", "description": "The Blues manager seems more open than ever to a goalkeeper change after a series of high-profile mistakes from his first-choice option.", "filename": "sport_football_articles_cgly68wrgj0o_1747807793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/487a/live/cd8255f0-dfcf-11ef-a108-5b0fc408bc51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgly68wrgj0o_1747807793.html", "title": "Enzo Maresca: Chelsea boss open to dropping goalkeeper Robert Sanchez for Filip Jorgensen", "title_page": "Enzo Maresca: Chelsea boss open to dropping goalkeeper Robert Sanchez for Filip Jorgensen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea manager Enzo Maresca says he has yet to decide which goalkeeper will face West Ham on Monday - having previously backed number one Robert Sanchez despite high-profile mistakes.\nSanchez, 27, has been the Italian coach's first-choice keeper but has made a joint Premier League-high of five mistakes leading to goals this season.\nHaving previously said mistakes are common with his style of play, Maresca hinted at a possible change with deputy Filip Jorgensen an option - as former Chelsea manager Graham Potter returns to Stamford Bridge on Monday with the Hammers.\n\"Not yet,\" Maresca replied when asked if he had decided which goalkeeper is playing, adding: \"We have two or three days for the decision.\n\"The good thing is that any decision I take, I feel good because every time Filip has played since we started, he has done well.\n\"Filip or Robert, we will see but any decision will be okay.\"\nMaresca was asked whether Jorgensen is pressuring him to start another league game having had just two league starts this season.\n\"I don't think so because the first time I spoke with Filip in June or July, I was clear that the number one choice was Robert,\" he added.\n\"For sure, if the number one is Robert and then because we have two good goalkeepers, we can make some different decisions.\n\"This doesn't mean that Robert can make a mistake every game and is always going to play. The number one choice was Robert and we will see on Monday.\"", "url": "https://www.bbc.com/sport/football/articles/cgly68wrgj0o"}