{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:59:28", "date_modify": "2025-05-19 14:59:28", "date_publish": "2015-03-08 10:13:30", "description": "BBC Sport celebrates pioneering women in sport and their remarkable stories on International Women's Day.", "filename": "sport_31761963_1747666768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81475000/jpg/_81475460_patmoss_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_31761963_1747666768.html", "title": "International Women's Day: Pioneering sports women", "title_page": "International Women's Day: Pioneering sports women - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Beryl Burton won seven world titles, 96 national titles and was the best British all-rounder for 25 consecutive years to stake her claim as the greatest British female cyclist of all time.\nIn 1967 she rode 277.25 miles in 12 hours to break the women's - and men's - world record. It took a man two years to reclaim and Burton still holds the women's record.\n\"Why didn't I know about her? If she was a man, everybody would know about her,\" actress Maxine Peake said.\nRead the full feature\nSir Stirling Moss is a Formula 1 legend but his sister Pat was equally adept behind the wheel of a rally car. She earned the reputation as the world's leading woman rally driver throughout the 1950s and '60s.\nIn 1960 she beat the men to win the Liège-Sofia-Liège. This was an amazing achievement and it only enhanced her iconic status in the rallying community.\nHer co-driver Ann Wisdom said: \"They [men] probably did think it was strange at first - two women in a funny little car.\n\"But once they got used to Pat winning it wasn't strange at all, they expected her to beat them. Not many girls had the chance to drive for a works team and get paid. There was no one as good as Pat, she was a brilliant driver.\"\nRead the full feature\nIt has taken nearly 90 years, but on 11 April the women of the Oxford and Cambridge University Boat teams will race on the same day as the men.\nThey are finally being allowed to compete on the same tideway course as the men and have equal television coverage and funding from sponsors.\nAnnie Vernon, who rode in the 2003 race, said: \"I will be in the BBC commentary box for the race, and I will be reflecting on my own Boat Race, and on those in the decades before who played their part in the journey to that moment. Fighters, trailblazers, but above all - women.\"\nRead the full feature", "url": "https://www.bbc.com/sport/31761963"}