{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:22:39", "date_modify": "2025-05-20 12:22:39", "date_publish": "2023-08-04 14:30:47", "description": "BBC Scotland pundits offer their predictions on the eve of the Scottish Premiership resuming.", "filename": "sport_football_66364552_1747743759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D02F/production/_130659235_bbc-sport-index-imagery-4-split-images-gradient-5c71e1dc-9601-4351-b4ff-45892e864e01.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66364552_1747743759.html", "title": "Scottish Premiership: BBC Scotland pundits give their season predictions", "title_page": "Scottish Premiership: BBC Scotland pundits give their season predictions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The new Scottish Premiership season is almost upon us and that means it's time for our Sportsound pundits to make a few predictions.\nWho is going to finish top of the pile and who are the early favourites for the dreaded drop?\nCeltic have collected 11 of the past 12 titles and it's been almost 40 years since we had a non-Old Firm winner.\nBut what does this season have in store? Our experts gaze into the crystal ball to give us some predictions...\nWillie Miller: It's really difficult to see past Celtic. Rangers have brought in a lot of new recruits but it might just be too much for them to topple their big rivals.\nKenny Miller: My heart wants to say Rangers, but that's not with any real confidence. Since Michael Beale arrived it's been nip and tuck between the Old Firm and I think they are far stronger all over the pitch. I can't call it though, I really feel it could be one of the closest title races in a while.\nLeanne Crichton: Celtic are favourites because they have maintained the strength of their squad and then there's the stability of bringing a manager like Brendan Rodgers back.\nStephen Craigan: Celtic have more continuity regards players than they did at this time last season and I think that really helps. When you look at Rangers, they have made lots of changes and we don't really know what they will bring.\nWillie Miller: It's Aberdeen again, for me. Barry Robson showed what he is capable of last season and they have recruited well. I think it may take time for Hearts to settle with their new management set-up.\nKenny Miller: It will be between Hearts and Aberdeen again. Barry Robson did a brilliant job when he took over last season, but I think Hearts will maybe just nick it this time. Hearts have got a strong team and Aberdeen will have to find a way of dealing with European football.\nLeanne Crichton: Aberdeen have got good stability too, keeping Graeme Shinnie and Leighton Clarkson is important. I fancy Hearts to go well, but Aberdeen will edge it.\nStephen Craigan: Aberdeen jump to mind, but I'm wary that they have eight extra games in Europe between now and Christmas. I worry about their strength in depth. I'm not so sure Hearts will make it much further in Europe, so I'll go with them finishing above Aberdeen.\nWillie Miller: Derek McInnes is too good a manager to be lingering near the foot of the table, so I'll say Kilmarnock. If they can add a bit more up top, they can be the season's surprise package and perhaps sneak into the top six.\nKenny Miller: Motherwell finished last season in a wonderful vein of form and it will be interesting to see what kind of start they make. They have lost a lot of goals in Kevin van Veen and a real star in Max Johnston, but, if they get close to the levels Stuart Kettlewell had them playing, they should make the top six and could be challenging for Europe.\nLeanne Crichton: I'm looking forward to seeing how Motherwell build on the good work Stuart Kettlewell did, but van Veen's goals won't be easy to replace. Lennon Miller is a brilliant talent and he'll be a player to watch.\nWillie Miller: There must be heavy clouds over St Johnstone after starting so poorly in the League Cup. I think the Saints will struggle.\nKenny Miller: There's not a lot between the teams outside of the the big five. It will be tough for Dundee coming back up, it's dealing with that step up the consistent rise in quality that you are facing week-in, week out.\nLeanne Crichton: Newly promoted teams tend to struggle and the budget cuts at Livingston are significant, but alarm bells are ringing at St Johnstone. I don't know if they are reluctant to spend and rebuild the squad because the club is up for sale.\nStephen Craigan: The League Cup isn't always a marker; look at St Mirren and Hibs last year - they missed out on qualification but then went on to finish in the top six. I'm not as optimistic for St Johnstone after losing three from four against lower league opposition. I fear for them because they are short of numbers and quality right now.", "url": "https://www.bbc.com/sport/football/66364552"}