{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-04-26 07:26:02", "date_modify": "2025-04-26 07:26:02", "date_publish": "2025-02-27 22:47:29", "description": "Bojan Krkic endured highs and lows in his playing career and is now using his experience to guide the next generation back at Barcelona.", "filename": "sport_football_articles_cedll61l9xyo_1745652362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fb09/live/b8de2810-f53a-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cedll61l9xyo_1745652362.html", "title": "Bojan Krkic: The Barcelona wonderkid guiding the next generation at La Masia", "title_page": "Bojan Krkic: The Barcelona wonderkid guiding the next generation at La Masia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bojan Krkic has been through many of the highs and lows that football has to offer - from being hyped as the next big thing to suffering a serious injury that hampered his hopes of hitting the heights he was perhaps capable of.\nBut the former Barcelona wonderkid is now using all of that experience to help guide the next generation of stars, preparing them for both the good times and the bad.\nHe is back at the club he started his career at, working in a football co-ordinator role at Barcelona, with his primary focus on monitoring the youth at the club's famed La Masia - the youth academy he came through.\nBojan told BBC Radio 5 Live's Euro Leagues podcast: \"I am quite young at 34, I could still be playing but the decisions you have to make in life sometimes you have to decide, and I decided to stop playing and start a new life in football.\n\"Right now there are many things to do in this big club, co-ordinate all the young players who come to train with us, to evaluate these young players and see when they can be ready to train with us, and when they have some struggle situations - injured or whatever - to chat with them.\"\nIn many ways, Bojan is the perfect person for aspiring footballers to seek guidance from.\nHe was once dubbed 'the next Lionel Messi' and while for plenty it would be an honour to be compared to one of football's greatest, it is a label that also carries with it a great weight of expectation.\nAfter scoring 900 goals for the Barcelona youth teams, he made his first-team debut at the age of 17 years and 19 days, breaking the record set by Messi.\nHe went on to score an impressive 12 goals in 48 matches in his first season in senior football, with his displays further enhancing those comparisons with the Argentina star.\nBut for Bojan, he did not want to be the next Messi - only Bojan.\n\"I knew what player I was,\" he added.\n\"I knew the good things I had, the things I had to work on. I knew I was not Messi or anyone, I was Bojan.\n\"But when people demand for you to be at that level, it is difficult to live with that expectation.\n\"It was difficult to find a way.\"\nBojan's career appeared to be skyrocketing.\nIn February 2008, only a few months after making his first-team debut at Barcelona, he was called up by Spain to play in a friendly against France.\nBut his international debut was delayed as he withdrew, and then declined an invitation to be part of the Spain squad for Euro 2008 - a tournament they went on to win.\nIllness and personal reasons were cited at the time for him pulling out of both but a decade later, Bojan says he was suffering from anxiety issues.\n\"As a football player the people do not know what is behind the football bit,\" he added.\n\"In the moment I suffered a lot but at the same point I knew it was something that was making me strong.\n\"At the end of my career I wanted to tell my story, but not as Bojan the footballer but Bojan the human, because I know this is a story that can not only help football people but also in general.\n\"As soon as I told my story I felt I closed all the experiences.\"\nBojan may not have been the next Messi but he was forging an impressive career at Stoke, with his form leading to links with moves to Liverpool and Manchester United.\nBut a serious knee injury in January 2015 disrupted his progress and he was never the same again. Spells at Mainz and Alaves followed before he finished his career in Japan, retiring in 2022.\nThe following year he returned to Barcelona, taking on the football co-ordinator role, and while he may only be a couple of years older than some of those in the current first-team, he is enjoying his new life off the pitch.\n\"I don't miss playing football,\" he said.\n\"I feel that was the end of a chapter in my life, I felt proud about what I did and what I learned from the good and the bad experiences.\n\"I see the players now when they are training and playing and I feel already I did this, and now I am on another step and looking forward.\"\nListen to the full interview with Bojan Krkic on the Euro Leagues podcast on BBC Sounds.", "url": "https://www.bbc.co.uk/sport/football/articles/cedll61l9xyo"}