{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:44", "date_modify": "2025-05-20 14:34:44", "date_publish": "2023-07-25 16:11:38", "description": "St Helens boss Paul Wellens accuses the RFL of failing to protect players after Agnatius Paasi and Alex Walmsley suffered long-term injuries.", "filename": "sport_rugby-league_66301945_1747751684.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4813/production/_130515481_11c602066918a3d2fe721e98a079cae858fcb95b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301945_1747751684.html", "title": "Paul Wellens: St Helens boss accuses RFL of failing to protect players after Leigh cup loss", "title_page": "Paul Wellens: St Helens boss accuses RFL of failing to protect players after Leigh cup loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Helens boss Paul Wellens has accused the RFL of failing to protect players after Agnatius Paasi and Alex Walmsley suffered long-term injuries in their Challenge Cup loss to Leigh Leopards.\nThe pair have knee ligament injuries, with Paasi out for nine months, while Walmsley is out for 12 weeks.\nJohn Asiata, who tackled them, was not charged by the match review panel.\nWellens said Morgan Knowles and Louie McCarthy-Scarsbrook could also be out having been tackled by Asiata.\n\"In my opinion, and I think very few will disagree with me, this weekend the governing body has failed in its duty to protect its players,\" Wellens told BBC Radio Merseyside.\n\"It's important to consider here that this isn't an emotional response to losing a cup game. I congratulate Leigh wholeheartedly for the way they played at the weekend and I congratulate them and wish them well in the final in a few weeks' time.\"\nIn response, the RFL told BBC Sport: \"Nobody wants to see injuries to players and we wish each of them the earliest possible recovery.\n\"We assure all clubs that we will consult, consider and decide whether this type of tackle or technique is acceptable in our sport.\n\"As with any change to the laws of the game or to on-field regulations, we will undertake a thorough review with all stakeholders, including coaches and the laws committee, but any changes cannot happen in-season.\"\nWellens alleged that the match review panel had made their decision not to charge Asiata before they had seen Paasi and Walmsley's scan results, something which did not follow his experience of such matters in the past.\n\"The RFL, before the match review panel met to adjudicate on those decisions, were provided with detailed medical reports from our medical staff,\" he added.\n\"When I spoke to the match review panel who had reviewed that game, by 18:30 on Monday evening and after the decision not to charge John Asiata was made, they had still not seen those scan reports by that point.\n\"What I want to ask is: why? Because that is a very different procedure to which Morgan Knowles was subjected to when he was part of a similar scenario after a game on Good Friday in which unfortunately Mike Cooper suffered an ACL injury.\n\"What we've got to consider here when making decisions not to charge players who are tackling in that manner, is that we give the green light for coaches and players at all levels - Super League, Championship, League One, academy, scholarship, women and, dare I say, the community game - for players to be able to tackle like that.\n\"As I sit here now as someone who loves rugby league, that doesn't sit with me well.\"", "url": "https://www.bbc.com/sport/rugby-league/66301945"}