{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:04:21", "date_modify": "2025-04-26 07:04:21", "date_publish": "2025-02-28 07:12:38", "description": "Stephen Curry hits a season-high 56 points, including 12 three-pointers, as the Golden State Warriors beat the Orlando Magic for a fifth win in a row.", "filename": "sport_basketball_articles_c0jgglqx271o_1745651061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ad1/live/3caa7390-f5c9-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_basketball_articles_c0jgglqx271o_1745651061.html", "title": "NBA: Stephen Curry hits 12 three-pointers for Golden State Warriors against Orlando Magic", "title_page": "NBA: Stephen Curry hits 12 three-pointers for Golden State Warriors against Orlando Magic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stephen Curry hit 12 three-pointers in a game for the third time as the Golden State Warriors beat the Orlando Magic 121-115.\nThe 36-year-old finished with a season-best 56 points as the Warriors made it five wins in a row.\nCurry was in an inspired mood, outscoring the Magic in the third quarter with 22 points to their 21.\nThe pick of the two-time most valuable player's three-pointers came at the end of the second quarter, when he hit a buzzer-beater from well within his own half.\nCurry's haul came from just 25 shots - the second-fewest in NBA history in a match with 55-plus points behind the 24 James Harden needed with the Houston Rockets in 2019.\n\"I think the fans here tonight, even the Magic fans, they know they're witnessing the greatest shooter ever, and one of the greatest performers ever,\" Warriors coach Steve Kerr said.\n\"It's not just the shots going in, it's just the fluidity, the beauty of his movement and motion and his audacity, the shots that he's willing to take.\n\"He's an incredible performer and he put on quite a show tonight.\"\nCurry's career-high match total came against the Portland Trail Blazers in 2021, when he netted 62 points.\nHe has hit 12 or more three-pointers in a single game three times in his career, with his haul of 13 coming against the New Orleans Pelicans in 2016.", "url": "https://www.bbc.co.uk/sport/basketball/articles/c0jgglqx271o"}