{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:18", "date_modify": "2025-05-21 06:16:18", "date_publish": "2025-02-08 16:19:29", "description": "Donegal make it two wins from two in Division One as they beat Kerry 0-23 to 1-18 at Fitzgerald Stadium.", "filename": "sport_articles_cz0ljdkgglyo_1747808178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b9a7/live/7c8d19f0-e632-11ef-a00c-b940b4c70dcc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz0ljdkgglyo_1747808178.html", "title": "Donegal claim two-point win against Kerry in Division One", "title_page": "Kerry 1-16 Donegal 0-23: Donegal claim two-point win against Kerry in Division One - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal made it two wins from two in Division One as they beat Kerry 0-23 to 1-18 at Fitzgerald Stadium.\nThe game was originally scheduled to be played on Saturday 25 January, but it postponed due to Storm Eowyn and rearranged for this weekend.\nDonegal, who were once again without Michael Murphy, led by four points at half-time after an end-to-end first half.\nThey managed to keep the scoreboard ticking over in the second half to claim the win, despite Diarmuid O'Connor scoring a late goal for the Kingdom as they attempted another late fightback.\nJim McGuinness' side, who picked up a four-point win against Dublin in their opener, got the ball rolling as Ryan McHugh kicked an early two pointer.\nThe two sides then exchanged points for the next half hour before Donegal pulled away in the latter stages of the first half with three scores in a row to lead 0-7 to 0-11 at the break.\nKerry, who scored three late goals to beat Derry 5-15 to 1-24, last weekend, roared back at the start of the second half with three consecutive points of their own.\nOisin Gallen then landed another two-pointer to stretch Donegal's lead, which they extended to as much as six points at one stage.\nThe Kingdom continued to fight until the end, racking up four straight scores before O'Connor scored a goal on 67 minutes to bring them back to within a point.\nHowever, three late scores from Tir Chonaill helped them stave off a comeback as they saw out the narrow win.", "url": "https://www.bbc.com/sport/articles/cz0ljdkgglyo"}