{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:33", "date_modify": "2025-05-21 03:43:33", "date_publish": "2024-12-22 11:10:52", "description": "Rhys Edwards suffers the first loss of his professional career after losing on points to Peter McGrail in their super-featherweight fight in Riyadh, Saudi Arabia, on the Oleksandr Usyk v Tyson Fury undercard.", "filename": "sport_boxing_articles_cy894p2v19po_1747799013.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d83c/live/a7cdddc0-c053-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cy894p2v19po_1747799013.html", "title": "Rhys Edwards suffers first loss at hands of Peter McGrail on Usyk v Fury undercard", "title_page": "Rhys Edwards suffers first loss at hands of Peter McGrail on Usyk v Fury undercard - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rhys Edwards suffered the first loss of his professional career after losing on points to Peter McGrail in their super-featherweight fight in Riyadh, Saudi Arabia, on the undercard of the rematch between Oleksandr Usyk and Tyson Fury.\nWelshman Edwards, 24, stepped in at four days' notice to take the fight, after Dennis McCann returned an adverse finding following a drugs test to leave McGrail without an opponent.\nEvertonian McGrail, 28, overcame an accidental clash of heads in the third round which opened up a cut on his right eye, to see off Edwards over 10 furious rounds via unanimous decision by margins of 96-95, 96-94 and 96-94 to move to 11-1 (6 KOs).\n\"I rate Rhys highly, I knew I was in for a good, tough fight tonight,\" McGrail told The Stomping Ground after the bout.\n\"That's what I got but I got the job done. People have probably underestimated Rhys but... he's given me things to work on.\"\nEdwards, trained by former WBU world middleweight champion Gary Lockett, had been preparing to face Leon Woodstock in mid-January and the Tonypandy fighter impressed in defeat despite losing his perfect record to fall to 16-1 (6 KOs).\n\"It was a well-matched fight and big respect to Peter, he's quality, but now I've showed my level, showed where I belong and I can perform on the biggest stages,\" Edwards said, also speaking to The Stomping Ground.\n\"It's the biggest platform I've ever boxed on - on the undercard of Usyk v Fury - it's a pinch myself moment. I've loved everything this week, bit gutted I didn't get the win but I'm proud of myself, proud of my performance.\"\nAfter taking the fight at short notice, Edwards said he would \"definitely be interested\" in a rematch with McGrail but said he was ready to face anybody next.", "url": "https://www.bbc.com/sport/boxing/articles/cy894p2v19po"}