{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:27", "date_modify": "2025-05-21 07:16:27", "date_publish": "2025-01-14 00:00:00", "description": "Leyton Orient knock out Championship side Derby County via a penalty shootout to set up FA Cup fourth round tie against Manchester City with Preston beating Charlton 2-1 and Wigan winning 2-0 at Mansfield.", "filename": "sport_football_live_c626lgrv75gt_1747811787.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c626lgrv75gt_1747811787.html", "title": "FA Cup: Leyton Orient beat Derby County on penalties as Wigan Atheltic and Preston also advance", "title_page": "FA Cup: Leyton Orient beat Derby County on penalties as Wigan Atheltic and Preston also advance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "O, what a night\n#bbcfootball\nIt had to be a penalty shootout, in the final game of the round, to drag maximum drama out of six straight days of wholesome third round fare.\nThey'll be talking about tonight's win over Derby, and presumably the Man City game too, for years to come in E10 while Leyton Orient's League One rivals Wigan will also get to rub shoulders with top-tier visitors as Thelo Aasgaard's terrific double ensured victory at Mansfield and secured a home tie with Fulham.\nPreston saw-off Charlton thanks to a spot of Osmajic of the Cup to book themselves a home date with Wycombe, at what might be a good time, seeing as how the League One high-fliers lost manager Matt Bloomfield to Luton today.\nThanks for your company on our bonus night, caused by the weekend weather.\nWe're hoping for slightly better conditions later in the week when we're back with a full programme of EFL action.\nUntil then, goodbye for now.\nLEYTON ORIENT WIN ON PENALTIES\nLeyton Orient 1-1 Derby - Orient win 6-5 on pens)\nMan City are heading to Brisbane Road on the weekend of 7-8 February.\nZech Obiero holds his nerve to convert from the spot and send the home fans wild.\nLeague One's red-hot Orient have toppled Derby County - who thumped them 3-0 home and away last season - to book a date with the champions on what will surely be one of the greatest days in the club's long and proud history.\nDerby probably have other priorities this season, but that is now two straight years in which they have exited at the first hurdle.", "url": "https://www.bbc.com/sport/football/live/c626lgrv75gt"}