{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:24", "date_modify": "2025-05-21 05:56:24", "date_publish": "2025-01-19 00:04:18", "description": "Former England footballer Wayne Bridge will face YouTuber KSI in a boxing bout on 29 March.", "filename": "sport_boxing_articles_cn01j5r2qvlo_1747806984.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8a4/live/6ad52450-d5f2-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cn01j5r2qvlo_1747806984.html", "title": "KSI v Wayne Bridge: Ex-England footballer to face YouTuber in boxing bout", "title_page": "KSI v Wayne Bridge: Ex-England footballer to face YouTuber in boxing bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England footballer Wayne Bridge will face YouTuber KSI in a boxing bout on 29 March.\nThe contest - at a venue currently unknown - was announced during a Misfits boxing event in Manchester on Saturday.\nBridge, 44, won 36 England caps and played in the Premier League for clubs including Chelsea and Manchester City.\nHe retired from football in 2014 and fought TV star Spencer Matthews in a charity bout for Sport Relief in 2018.\nKSI, whose real name is Olajide William Olatunji, has fought on several occasions, including against Tommy Fury in 2023.\nKSI lost on points on that occasion, in a bout which was not licensed by the British Boxing Board of Control (BBBofC) which governs the sport in the United Kingdom because KSI did not hold a professional boxing licence.\nMost of KSI's boxing career have not been professional fights, and it is unclear which outfit will oversee his contest with Bridge.\nKSI's bout with Fury was overseen by the Professional Boxing Association (PBA), but Misfits have since stopped working with the outfit.\nCrossover bouts involving influencers and social media personalities have gained huge traction with audiences in recent years, despite questions about whether they damage the credibility of the sport.", "url": "https://www.bbc.com/sport/boxing/articles/cn01j5r2qvlo"}