{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:04:59", "date_modify": "2025-05-20 12:04:59", "date_publish": "2023-08-05 11:49:35", "description": "Adam Idah's stoppage-time winner earns Norwich a deserved Championship win in their opener against a dogged Hull.", "filename": "sport_football_66345305_1747742699.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13EA8/production/_130667518_f1679b7f28a0da9d03edd5895a6fd425ba2af103.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345305_1747742699.html", "title": "Norwich City 2-1 Hull City: Canaries strike late through Adam Idah to beat Tigers", "title_page": "Norwich City 2-1 Hull City: Canaries strike late through Adam Idah to beat Tigers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cruel as it was on the Tigers, Idah's strike was rich reward for a stylish attacking performance which saw David Wagner's side create 28 opportunities.\nWhile Wagner and counterpart Liam Rosenior had similar storylines coming in to their first full seasons in the job, they had contrasting experiences on the touchline.\nThere was much for the Canaries' German boss to savour on an afternoon which saw Rosenior sent off late on for protesting that Idah was in an offside position when he nipped in to deny Hull a point.\nThe Canaries dominated possession and territory and made chances at will.\nThey set the tone early on when summer signing Ashley Barnes, one of three Norwich debutants, teed up Gabriel Sara only for the midfielder's curled effort to soar over the bar.\nRowe saw a strike hit the post, while last season's top scorer Josh Sargent also threatened.\nBut it was the visitors who went ahead with one of just two attempts on target in the first half, Manchester City loanee Delap robbing Ben Gibson and finishing smartly following Shane Duffy's sloppy pass.\nHowever, Norwich remained on top, Onel Hernandez had a shot cleared off the line by Lewis Coyle, the impressive Jack Stacey smashed an attempt wastefully over the bar - as did Hernandez - and Duffy headed narrowly wide.\nSargent also went close with a header that produced a superb save from the busy Ingram and Barnes nodded an attempt off target, before Rowe finally made it 1-1 deep into added time - one of 18 attempts on goal by the home side before the break.\nThe second half followed a similar pattern without reward, until Idah's late heroics secured just their third opening weekend success in 21 games.\nNorwich City boss David Wagner told BBC Radio Norfolk:\n\"It's not a question or a shadow of a doubt that this win was fully deserved. The times when we scored late in stoppage time looks a little bit lucky, but it was anything but lucky.\n\"The first half we were outstanding, an absolute threat offensively and defensively. We controlled everything apart from this one situation where our centre-halves have to solve the situation better, for sure.\n\"But how the players reacted and struck together afterwards and came from behind was great. The second half was not as good as the first half. This is the truth and we have some work to do, but we won the game and I am over the moon about the performance.\n\"The atmosphere was electric in the stands and on the pitch as well. This was exactly what we needed. In the first half every single supporter felt how well they played. They kept going and kept going and the supporters kept supporting and this was why we were successful.\"\nHull City assistant head coach Justin Walker told BBC Radio Humberside:\n\"They are a good side. I'm not taking that away from them, but we are furious with the way it ended for us.\n\"I think it's clear to see. We are bitterly disappointed. I have to be careful for obvious reasons. We will be better in terms of performance as the season goes but I think we fully merited a point.\n\"If you are going to bring out so many new rules, you have to carry them out and execute them. There is debate whether the ball went out for a corner in the first place after the five-minute period anyway. We've played that and the ball goes out to a wide area which is a safe place to therefore blow the whistle.\n\"Potentially there is another foul in the box as the ball is delivered. If you're not 100% he's offside then you can't give it. I am disappointed for everybody. It's a bitter pill to swallow.\"", "url": "https://www.bbc.com/sport/football/66345305"}