{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:33:27", "date_modify": "2025-05-21 06:33:27", "date_publish": "2024-12-24 10:15:48", "description": "Celtic spurred by Tannadice 'hurt', says Callum McGregor", "filename": "sport_articles_cje91ldxlgko_1747809207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d047/live/7ff2c8a0-c1df-11ef-ad94-73cffd90711a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cje91ldxlgko_1747809207.html", "title": "Celtic spurred by Tannadice 'hurt'", "title_page": "Celtic spurred by Tannadice 'hurt', says Callum McGregor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Callum McGregor says Celtic's high standards meant dropping points at Tannadice felt \"like the end of the world\", but has urged his team to swiftly return to winning ways against Motherwell on Boxing Day.\nThe goalless draw with Dundee United was only the second time this season that Celtic have dropped Premiership points, and they ended the weekend with their lead over Rangers at the top cut to nine points.\n\"The lead we have has been a product of how good we've been this season,\" skipper McGregor said.\n\"But we don't want to have too many of these days where you start to chase your tail a little bit.\n\"We understand what the problem was and we dust ourselves down and move on from it.\n\"We can get back on the horse quickly on Boxing Day and try to get three points, and then it just rolls on again.\n\"The success that we've had over a long period of time now means every dropped point feels like a defeat, it feels like the end of the world.\n\"It's good for the players to see that and understand how it feels, because we're a team that's used to winning all the time.\n\"Sometimes it's okay to be disappointed and feel hurt and try to use that momentum in the coming games.\n\"The boys speak about it all the time. As soon as you drop points it feels like you've lost. It's a weird feeling, the place is quiet and it doesn't have its usual feel.\n\"You try and limit the amount of times throughout the season that you feel like that.\"", "url": "https://www.bbc.com/sport/articles/cje91ldxlgko"}