{"authors": ["Simon Stone", "Dan Roan", "www.facebook.com"], "date_download": "2025-05-21 06:36:55", "date_modify": "2025-05-21 06:36:55", "date_publish": "2025-01-31 10:50:01", "description": "Al-Nassr end their attempts to sign Brighton's Kaoru Mitoma after the Seagulls make it clear they have no intention of selling the Japan forward.", "filename": "sport_football_articles_cx2m33dmn7xo_1747809415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f14/live/a6a24f50-dfbe-11ef-abda-2fd5234899ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2m33dmn7xo_1747809415.html", "title": "Brighton: Al-Nassr end attempts to sign Seagulls winger Kaoru Mitoma", "title_page": "Brighton: Al-Nassr end attempts to sign Seagulls winger Kaoru Mitoma - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Al-Nassr have ended their attempts to sign Brighton's Kaoru Mitoma after the Seagulls made it clear they have no intention of selling the Japan forward.\nThe south coast club turned down a 65m euro (£54.42m) bid from the Saudi Pro-League side, but had expected a further offer.\nHowever, in additional communication between the two clubs, Brighton underlined they had no need to sell the 27-year-old and would not be changing their stance, no matter what was offered.\nBrighton also felt Mitoma had no interest in leaving the Amex Stadium. Consequently, Al-Nassr now accept the deal will not happen.\nThe Saudi Pro-League transfer window closes on Friday evening.\nMitoma has made 92 appearances and scored 18 goals in all competitions since joining Brighton from J League side Kawasaki Frontale in 2021.\nThe winger is the only Brighton player to have featured in all 23 Premier League games so far this season, with Fabian Hurzeler's side currently ninth in the table.\nHe signed a contract extension in October 2023 that runs to June 2027.", "url": "https://www.bbc.com/sport/football/articles/cx2m33dmn7xo"}