{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:05", "date_modify": "2025-05-21 04:04:05", "date_publish": "2025-04-04 06:18:11", "description": "Stephen Curry scores 37 points to outscore LeBron James and lead the Golden State Warriors to a 123-116 victory over the Los Angeles Lakers.", "filename": "sport_basketball_articles_c5yg4v79yvgo_1747800245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f5c/live/1b4513f0-1116-11f0-9e42-81e635c39ce1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_c5yg4v79yvgo_1747800245.html", "title": "NBA: Stephen Curry leads Golden State Warriors to victory over Los Angeles Lakers", "title_page": "NBA: Stephen Curry leads Golden State Warriors to victory over Los Angeles Lakers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stephen Curry scored 37 points to outscore LeBron James and lead the Golden State Warriors to a 123-116 victory over the Los Angeles Lakers.\nBrandin Podziemski contributed a further 28 points with a career-high eight three-pointers as the Warriors maintained their late-season momentum.\nJames replied with 33 points for the Lakers, with Austin Reaves adding 31 including a career-high nine three-pointers.\nBut the home defeat left the Lakers fourth in the Western Conference, one game better than a Warriors team which has now won four in succession and 20 of their past 24 games since Jimmy Butler - who scored seven of his 11 points in the fourth quarter - joined from the Miami Heat in February.\nThe Lakers won the first three games between the teams this season but could not produce a fightback after closing to within five points at 105-100.\nElsewhere, Ja Morant clinched victory on the buzzer for the Memphis Grizzlies over the Miami Heat, completing his 30-point game to seal a 110-108 win.\nGiannis Antetokounmpo recorded a triple-double to lead the Milwaukee Bucks to a 126-113 victory over the host Philadelphia 76ers, scoring 35 points, a career-high 20 assists and 17 rebounds.\nShaedon Sharpe equalled his career-best 36 points as the Portland Trail Blazers defeated the Toronto Raptors 112-103.", "url": "https://www.bbc.com/sport/basketball/articles/c5yg4v79yvgo"}