{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:36:47", "date_modify": "2025-04-26 04:36:47", "date_publish": "2025-02-28 11:37:26", "description": "The Wolfhounds moved one step closer to defending their Celtic Challenge title as they ended Gwalia Lightning's title hopes.", "filename": "sport_rugby-union_articles_c20dd32rydxo_1745642207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7a6/live/0ca85f20-f6b1-11ef-acd4-091c140b24c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c20dd32rydxo_1745642207.html", "title": "Lightning's Celtic Challenge title hopes ended by Wolfhounds loss", "title_page": "Lightning's Celtic Challenge title hopes ended by Wolfhounds loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolfhounds moved one step closer to defending their Celtic Challenge title as they ended Gwalia Lightning's title hopes in a try-packed 80 minutes in Ystrad Mynach.\nWolfhounds ran in seven tries in the first half, as they put Lightning under relentless pressure.\nWolfhounds captain Claire Boles scored the first try for the Irish side, before centre Leah Tarpey finished a break-away try under Lightning's sticks.\nA third try for Wolfhounds came inside the first fifteen minutes, wing Vicky Elmes Kinlan moving the Irish side into a healthy 17-0 lead.\nThe bonus point was wrapped up soon after as Eve Higgins crossed before Boles scored her second try of the game seven minutes before the break.\nThere was still time for wing Katie Corrigan to get involved in the try-scoring action, and for Boles to score her hat-trick try before half-time.\nKinlan's second try of the game put Wolfhounds 48-0 up, before Gwalia finally showed some resistance.\nRhodd Parry got Gwalia on the board with their first try of the game, and Lightning captain Bryonie King added a second try for the hosts under the posts.\nGwalia wing Caitlin Lewis scored the game's final try, but the result had long been decided.\nElsewhere, Clovers' win over Edinburgh means the 2024-25 Celtic Challenge will be won by one of the two Irish sides.\nGwalia will finish the season in third place, regardless of results in the final round of fixtures.\nThey can, however, dent Clovers' title hopes, when they host the Irish side at Ystrad Mynach on Saturday, 8 March.\nWolfhounds can seal the title with victory on the same day against Edinburgh at Donnybrook Stadium in Dublin.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c20dd32rydxo"}