{"authors": ["Drew Heatley", "www.facebook.com"], "date_download": "2025-04-26 07:56:02", "date_modify": "2025-04-26 07:56:02", "date_publish": "2025-02-25 12:24:56", "description": "Fulham news: Opinion - Where do Marco Silva's side go from here?", "filename": "sport_football_articles_cr42rkrykd3o_1745654162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed37/live/daad5110-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr42rkrykd3o_1745654162.html", "title": "Opinion - Where do Marco Silva's side go from here? - BBC Sport", "title_page": "Fulham news: Opinion - Where do Marco Silva's side go from here? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We have a lot more in common with Crystal Palace than many Fulham fans care to admit.\nIn the wake of our defeat on Saturday, more than a few shots were fired at Palace for 'coasting' in the Premier League.\nThe Eagles are in their 11th consecutive top flight season, during which they have finished no higher than 10th, but finished no lower than 15th.\nFrom 2001 to 2014, we enjoyed 13 Premier League campaigns in a row, then spent the best part of a decade trying to get back to that level of consistency.\nBut what some people call consistency others call mediocrity - and that is where Fulham fans are divided. Are we targeting the next level, or are we content?\nOur January transfer window indicates that the club sits in the latter camp. Bringing 36-year-old Willian in to fill a gap in depth on the wing suggests that we do not expect to be dusting off our passports this summer.\nLet's be clear, Fulham do not have the squad depth to compete in Europe next season. If we achieve it, either through our league position or by winning the FA Cup, we will need to spend a lot - and spend wisely - this summer.\nWe started the campaign with just 24 first-team squad members. You could argue you need double that to sustain challenges domestically and on the continent.\nGames like Saturday show how far off we are from the clubs fighting for a place in the top eight. And yet we are safe from any threat of relegation, meaning we will enjoy a fourth straight season of Premier League football. That is something we would have bitten your hand off for in 2022 and something that the majority of Palace fans are content with.\nCould mid-table safety be considered dull? Sure. Is it a solid base from which to attempt to reach a higher level? Absolutely.\nFulham must decide which side of that line they sit on.", "url": "https://www.bbc.co.uk/sport/football/articles/cr42rkrykd3o"}