{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:39", "date_modify": "2025-05-21 05:34:39", "date_publish": "2025-01-23 07:51:58", "description": "PSG 4-2 Man City: Phil McNulty on a 'defeat that exposed every flaw'", "filename": "sport_football_articles_cwyw7q5dvzlo_1747805679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f4d/live/d34c1f00-d95a-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwyw7q5dvzlo_1747805679.html", "title": "PSG 4-2 Man City: Phil McNulty on a 'defeat that exposed every flaw'", "title_page": "PSG 4-2 Man City: Phil McNulty on a 'defeat that exposed every flaw' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The manner in which Manchester City collapsed in the Stade Drance, crumbling in the face of PSG's thrilling attacking assault, exposed every flaw that has seen Pep Guardiola's side slide into a steep decline this season.\nThey are off the pace in defence of their domestic title, while they now need a win against Club Brugge at Etihad Stadium to go into the Champions League play-offs, their standing of 25th in the new table something that should serve as a source of embarrassment to everyone at the club.\nGuardiola's Manchester City of old would have completed the job after going two up. Not this version. Not the version that has lost eight points from winning positions in the Champions League and 14 in the Premier League.\nIn a PSG barrage, City faced 26 shots - the highest total against them since the Champions League game against Real Madrid in September 2012 when the Spaniards had 35.\nGuardiola, as he stood soaked and stunned on the sidelines, powerless to prevent a defeat which should have been far more emphatic, may now realise he has an even bigger rebuilding job on his hands than he thought.\nWhat was unthinkable at the start of the season will now be troubling the thoughts of a manager and team in danger of elimination before the last 16.", "url": "https://www.bbc.com/sport/football/articles/cwyw7q5dvzlo"}