{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:37", "date_modify": "2025-05-21 07:06:37", "date_publish": "2025-03-29 00:00:00", "description": "Zan Vipotnik scores in added time to earn Swansea City a dramatic 2-2 draw with Championship promotion hopefuls Leeds United at Elland Road.", "filename": "sport_football_live_c5y2n2n0456t_1747811197.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y2n2n0456t_1747811197.html", "title": "Leeds United 2-2 Swansea City: Hosts' automatic promotion hopes hit by last-gasp equaliser", "title_page": "Leeds United 2-2 Swansea City: Hosts' automatic promotion hopes hit by last-gasp equaliser - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United's automatic promotion hopes suffered another blow as Zan Vipotnik's 96th-minute goal earned Swansea City a 2-2 draw on a dramatic afternoon at Elland Road.\nLeeds had looked like claiming an unconvincing win after substitute Wilfried Gnonto drilled them in front four minutes from the end of normal time, but Vipotnik's low drive meant the Whites missed the chance to reclaim top spot in the Championship.\nDaniel Farke's side had first gone ahead after just 35 seconds when Brenden Aaronson finished off a goalmouth scramble by poking home from point-blank range.\nIllan Meslier then saved his team as he kept out Josh Tymon's first-half penalty - only for the Leeds goalkeeper to go from hero to villain as his fumble allowed Swansea defender Harry Darling to score a simple equaliser.\nGnonto thought he had won it with almost his first touch after coming off the bench only for Vipotnik's shot from a tight angle to go under Meslier and into the net.\nLeeds stay second, two points behind leaders Sheffield United - who went top by beating Coventry on Friday night - and only ahead of third-placed Burnley on goal difference.\nMore worrying for Farke is that his team are in their worst form of the season, having won only once in their past five matches.\nSwansea, meanwhile, are 16th, seven points above the relegation zone with seven matches remaining this season.\nAny hope the Welsh side had of keeping things tight early on disappeared in the game's first passage of play, as Jayden Bogle found space down the right before drilling in a cross which led to the opening goal.\nIt was not pretty, with Joel Piroe seeing two efforts blocked before Aaronson prodded in from four yards out.\nTo their credit, Swansea did not fold despite their desperate opening.\nThe penalty came when Lewis O'Brien beat Joe Rodon to Ronald's pass and tumbled under the former Swansea defender's challenge.\nLeeds were unhappy with referee Ben Toner's decision, but home smiles returned as Meslier dived low to his left to paw out Tymon's poorly struck spot-kick.\nStill Leeds could not relax, with Swansea growing in confidence as their opponents struggled for fluency and control.\nThe hosts' rearguard wobbled once more before the break, with Ben Cabango flicking on Tymon's free-kick and Hannes Delcroix appearing to get a touch before the ball ricocheted off the post and into Meslier's arms.\nLeeds improved to an extent in the second half, with Dan James leading the way against his former club as he curled beyond the far post.\nLeeds United manager Daniel Farke:\n\"Of course it's a heartbreaking moment when you concede in such a situation and in this manner.\n\"But if you want to take part in sports, you can't expect that the sun is always shining.\n\"You have to suffer a little bit, that's normal, but then we go again. The sun will shine again.\n\"Overall it was for me it was a typical first game after an international break, a scruffy game.\n\"Without the last situation, it would have been a perfect, hard-fought win. We were not at our best football-wise first half, but the heart we showed and how we reacted was exactly what you need.\"\nSwansea caretaker head coach Alan Sheehan:\n\"To come here and have an absolute nightmare start, we let the spaces become too big and then they are in our box, a couple of ricochets and it's a goal.\n\"Then after that, we get a penalty and miss it, another setback. Howe do we respond to that? We hit the post and it bounces back into the keeper's arms. How do you respond to that?\n\"Do you back off or go toe to toe with a team like this? We want to be able to go toe to toe in the right moments and be as brave as we can be.\n\"How we did it with the setbacks we had in this game, one point is the least we deserved coming to the best team in the division.\"", "url": "https://www.bbc.com/sport/football/live/c5y2n2n0456t"}