{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:53:57", "date_modify": "2025-05-20 11:53:57", "date_publish": "2023-08-05 18:46:27", "description": "Everton 1-0 Sporting: Sean Dyche offers injury update", "filename": "sport_articles_c89rqwjq750o_1747742037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48ab/live/1ebbac50-33bf-11ee-a5b1-25db812f6efa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c89rqwjq750o_1747742037.html", "title": "Everton 1-0 Sporting: Sean Dyche offers injury update", "title_page": "Everton 1-0 Sporting: Sean Dyche offers injury update - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sean Dyche is hopeful James Tarkowski’s injury is “just a knock” after the Everton centre-back was forced off during the 1-0 win over Sporting Lisbon.\nHe joined summer signing Arnaut Danjuma on the sidelines, with the former Villareal man not risked against the Portuguese giants, and Dwight McNeil also missing through injury.\n\"We are being ultra careful with [Tarkowski],” Dyche told Everton's website, external. \"I think it is more of a knock but we’ll check and give it a day to calm down. These games are about people getting minutes and we really seek to safeguard and log how much people play.\n\"Danjuma we need to wait to see. It is showing more like a knock so we are hopeful he will be back on the grass next week.\n\"For Dwight McNeil, it is not going to be days, but a little period out.\"\nHe also confirmed the club were still in the market for new faces with just seven days left until the season kicks off against Fulham at Goodison Park.\n\"The fans are aware of the realities for this season but for me it’s a positive reality,\" he said. \"We have got some very good players here who want to play for the club.\n\"But we are a bit stretched so we are trying to sign players who can make us stronger.\"", "url": "https://www.bbc.com/sport/articles/c89rqwjq750o"}