{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:50:46", "date_modify": "2025-05-21 04:50:46", "date_publish": "2025-01-14 23:18:55", "description": "Forwards coach Jimmy Duffy says Ulster \"know exactly what we need to do\" as they bid to extend their interest in European competition this season.", "filename": "sport_articles_ckgyr4939dno_1747803046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d02/live/de455db0-d296-11ef-b526-d36fb212fcf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgyr4939dno_1747803046.html", "title": "Investec Champions Cup: What do Ulster need to progress to knockout rounds?", "title_page": "Investec Champions Cup: What do Ulster need to progress to knockout rounds?  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Forwards coach Jimmy Duffy says Ulster \"know exactly what we need to do\" as they bid to extend their interest in European competition this season.\nDespite three heavy defeats in the Investec Champions Cup pool stages, Ulster retain slim hopes of advancing to the knockout rounds ahead of Friday's home encounter with Exeter Chiefs.\nIn order to reach the next stage, Ulster would need:\nFailing that, a draw or victory of any kind over Exeter would secure passage into the last 16 of the Challenge Cup.\nUlster dropped into the second-tier competition last season after failing to progress in the Champions Cup, beating Montpellier in the round of 16 before a heavy quarter-final loss away to Clermont.\n\"I know where we are in everything,\" Duffy told reporters on Tuesday.\n\"It's all about those fundamentals. We go out to win every game, be smart and put ourselves in a position to win it and then we'll know what we need to do.\"\nWhile Ulster's Champions Cup defeats have come at the hands of three in-form teams - Toulouse, Bordeaux and Leicester - Exeter have also struggled in this season's competition, with three defeats leaving the Premiership side with a points difference of -113 (Ulster are on -89).\nThe Chiefs have endured a difficult domestic campaign too, sitting second-from-bottom in the Premiership, but Duffy points to their recent 22-15 win over Gloucester as an example of their quality.\n\"We're playing against a very experienced side who have been close in games,\" added Duffy.\n\"[They] had a big win against Gloucester a couple of weeks ago so we know exactly what we need to do: number one, put ourselves in a position to win, minimise those errors that cost us last week and we'll chase what we need to chase.\"", "url": "https://www.bbc.com/sport/articles/ckgyr4939dno"}