{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:20:08", "date_modify": "2025-05-21 05:20:08", "date_publish": "2025-04-03 13:28:51", "description": "Durham are determined to try and \"dethrone\" Surrey this season says opening batter Emilio Gay.", "filename": "sport_cricket_articles_cvgqljqpm0zo_1747804808.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/50c9/live/d2aba4b0-108e-11f0-94b3-d3222284d093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvgqljqpm0zo_1747804808.html", "title": "Durham out to 'dethrone' Surrey says new batter Emilio Gay", "title_page": "Durham out to 'dethrone' Surrey says new batter Emilio Gay - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Durham are determined to try and \"dethrone\" Surrey this season says opening batter Emilio Gay.\nChampions Surrey are aiming for a fourth successive County Championship title but Durham are one of nine teams attempting to stop them.\nDurham finished fifth on their Division One return last year and Gay is one of the players brought in to strengthen their team for 2025.\n\"One thing (director of cricket) Marcus North emphasised to me was Durham wanting to be the best club,\" Gay told BBC Radio Newcastle.\n\"Everything we do, on and off the pitch, is geared towards that. It's definitely a goal of ours to try to dethrone Surrey, so to speak.\"\nGay moved to Chester-le-Street from Northamptonshire initially on a two-game loan at the end of last season, ahead of joining on a three-year deal.\nAlong with ex-Warwickshire captain Will Rhodes, his arrival will add further power to Durham's batting.\nAnd it is the chance to battle at the top end of the Championship that is fuelling the 24-year-old's excitement ahead of their season opener at Trent Bridge against Nottinghamshire on Friday.\n\"You want dressing rooms that are looking to compete at the top, not just be satisfied with coasting along,\" Gay added.\n\"That's what I've come and I've got. It's no secret why Durham have produced so many England players, it's because they're always looking to be the best.\n\"As someone new to the club, it's refreshing to see such drive and hunger in a dressing room that wants nothing but to win.\"", "url": "https://www.bbc.com/sport/cricket/articles/cvgqljqpm0zo"}