{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-21 05:49:12", "date_modify": "2025-05-21 05:49:12", "date_publish": "2025-01-31 16:15:11", "description": "Manchester City boss Gareth Taylor says it is \"really disappointing\" how a transfer saga between Chloe Kelly and the club came to an end.", "filename": "sport_football_articles_c4gx9r8w1eeo_1747806552.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c98a/live/625abdb0-dfea-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gx9r8w1eeo_1747806552.html", "title": "Chloe Kelly: Manchester City boss Gareth Taylor says it was 'really disappointing' how transfer saga ended", "title_page": "Chloe Kelly: Manchester City boss Gareth Taylor says it was 'really disappointing' how transfer saga ended - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Gareth Taylor said it is \"really disappointing\" how a bitter transfer saga between Chloe Kelly and the club came to an end.\nKelly joined City's Women's Super League rivals Arsenal in a loan deal on deadline day after being the subject of heavy transfer speculation throughout the past month.\nThe 27-year-old England international posted on Instagram on Wednesday that she wanted \"to be happy again\" and did not see her future at City beyond the summer.\n\"It's been really disappointing to come to this and the ending it transpired to,\" Taylor said in a news conference on Friday.\n\"We never like to hear a player has not had a good experience of being at a club and I'm sure that's not the case for the whole period, maybe just this more recent period from not playing.\n\"We're in a selection-based business where difficult decisions have to be made for the betterment of the team. Sometimes players can fall on the sharp end of that.\"\nKelly, who had made just one league start for City this season, was concerned about her place in the England squad with the 2025 European Championship taking place in July.\nThe forward added on Wednesday: \"With the Euros fast approaching, this summer is a huge one and I want to be in a position to give it my best shot to represent my country.\n\"However, to be dictated whom I can and can't join with only four months left of the football season is having a huge impact on not only my career by my mental wellbeing.\"\nManchester United had made an offer for Kelly on Thursday but it was rejected by City before a loan agreement with Arsenal was struck.\nIn a separate Instagram post on Thursday, Kelly accused people at the club of trying to \"assassinate my character\" by \"briefing journalists against me\".\nWhen asked about the player's comments, Taylor said: \"I don't live in that world of social media, as any head coach would tell you it's not good for your health.\n\"I've tried to give you a bit of insight, I can't really go into real detail on our side of the story. We wish her all the best at her new club.\"", "url": "https://www.bbc.com/sport/football/articles/c4gx9r8w1eeo"}