{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:57:34", "date_modify": "2025-04-26 07:57:34", "date_publish": "2025-02-25 12:17:49", "description": "Arsenal news: 'Club need to make Premier League history' - Arteta", "filename": "sport_football_articles_cy0588gl58vo_1745654254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ace/live/ac308db0-f36e-11ef-add3-5160ab1f5b9d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy0588gl58vo_1745654254.html", "title": "Arsenal news: 'Club need to make Premier League history'", "title_page": "Arsenal news: 'Club need to make Premier League history' - Arteta - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mikel Arteta says Arsenal will have to make \"history\" to win the Premier League given the injury setbacks and points deficit they are battling.\nThe Gunners face a trip to Champions League hopefuls Nottingham Forest on Wednesday night, after suffering a disappointing defeat to West Ham on Saturday at the Emirates.\nSpeaking about their chances of winning the league ahead of their trip to The City Ground, Arteta said: \"The difficulty is higher than three days ago. But, if you are going to win the Premier League you have to do something special.\n\"If you are going to win the Premier League with the circumstances we have you will probably have to do something that nobody else has done in the history of the Premier League.\"\nArsenal are currently nine points off league leaders Liverpool but have a game in hand. After finishing second in the last two Premier League seasons, Arteta - who has refused to say his side are too far behind - insists his staff and players still believe.\n\"We know how quickly things can change - you have to be there, we all deserve to continue in that fight,\" Arteta added.", "url": "https://www.bbc.co.uk/sport/football/articles/cy0588gl58vo"}