{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:51", "date_modify": "2025-04-26 06:13:51", "date_publish": "2025-03-05 00:00:00", "description": "Bayern Munich have one foot in the quarter-finals of the Champions League after a comfortable win against 10-man Bayer Leverkusen in the first leg of their last-16 clash.", "filename": "sport_football_live_cly212pqyjlt_1745648031.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8655/live/84256b40-fa05-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cly212pqyjlt_1745648031.html", "title": "Bayern Munich 3-0 Bayer Leverkusen: Harry Kane double bolster hosts' quarter-final hopes", "title_page": "Bayern Munich 3-0 Bayer Leverkusen: Harry Kane double bolster hosts' quarter-final hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bayern Munich have one foot in the quarter-finals of the Champions League after a Harry Kane double helped them to comfortable win against 10-man Bayer Leverkusen in the first leg of their last-16 tie.\nKane gave the hosts an early breakthrough in the all-German meeting before Jamal Musiala doubled their lead by capitalising on a mistake from Leverkusen goalkeeper Matej Kovar.\nThe visitors went down to 10 men after a second yellow for Nordi Mukiele just past the hour mark, then Kane scored his 31st goal of the season from the penalty spot to seal the victory.\nIt only took Bayern nine minutes to draw first blood as Kane popped up in front of Mukiele to head home a perfectly-weighted cross from Michael Olise.\nThe visitors almost found a way back when Dayot Upamecano's dreadful backpass was intercepted by Jeremie Frimpong inside the box, but Bayern captain Manuel Neuer came to his team-mate's rescue with a brilliant save to deny Leverkusen a swift equaliser.\nVincent Kompany's side were denied a second as Musiala headed Joshua Kimmich's corner against the crossbar.\nAfter being outplayed in the first half, Leverkusen's hopes of a comeback in the second were dashed when Kovar let a Kimmich cross slip through his gloves for Musiala to poke into an open goal.\nMukiele was then dismissed for a reckless challenge on Kingsley Coman before Kane was dragged down to the floor by substitute Edmond Tapsoba during a corner.\nReferee Michael Oliver pointed to the spot after a video assistant referee (VAR) review and the England captain made no mistake from 12 yards to pull the Bundesliga leaders further ahead.\n\"This is the Champions League, this is the biggest game of all,\" Kane told TNT Sports after the game.\n\"We're playing against a team who have had an unbelievable couple of seasons. If we don't carry it on, then it doesn't mean anything.\n\"We're here to send a message not just to everyone but to ourselves.\"\nKane's nine-goal haul is the most by an English player in a single Champions League campaign and the joint-most in a European Cup campaign alongside Dennis Viollet, who scored nine goals for Manchester United in 1956-57.\nThe 31-year-old also has nine goals in the Champions League knockout stages now, with Frank Lampard (15) and Wayne Rooney (14) the only Englishmen ahead of him in that regard.\nHe has now scored more goals across all competitions than any other player in Europe's top five leagues since he joined Bayern (75).\nSeventeen of them have come in the Champions League, which is also more than any other player in the competition in that time.\nFormer Germany international Thomas Hitzlsperger told BBC Match of the Day: \"Kane was instrumental to the win. I have seen him when he is quiet and doesn't score and people say has he reached a peak already. But his record speaks for itself, he is so important.\"\nAthletic journalist Rory Smith, added: \"There is a genuine debate at times over his mobility. There was a game against Frankurt recently he missed and Bayern looked more fluid.\n\"But he is such a reliable goalscorer even if he detracts from the fluency of the team a bit, how do you keep him out?\"\nThe second leg at BayArena will take place on Tuesday, 11 March (20:00 GMT).\nIt was a night where everything that could have gone wrong for Leverkusen, went wrong.\nXabi Alonso's side came into the game having not lost to Bayern this season - earning two draws in the league and a win in the German Cup in December.\nBut their decision to leave Patrik Schick and Victor Boniface on the bench and play without a recognised striker left the German champions without an outlet on the few occasions they made some progress in the opposition's half.\nIndividual mistakes also did not help Die Werkself as Mukiele was far too passive in the box to allow Kane to head in the early opener.\nAlonso's decision to pick Kovar in front of Lukas Hradecky to guard the Leverkusen goal will also be scrutinised after the Czech shot-stopper's error let Bayern double their advantage in the second half.\nTheir misery was compounded when Mukiele planted his studs on Coman's calf from behind, leaving the referee with no option but to dismiss him for a second bookable offence.\nTapsoba's introduction to shore up the 10-man side also backfired as the centre-back put his arms around Kane to bring him down and conceded the penalty from which the striker sent them three goals clear.\n\"It's the first leg, we can't get carried away and we know what type of team they are, next week will be tough,\" the former Tottenham star said.\n\"There was a lot of talk around the last game. We came into it fresh and it's where the game was won. We made it difficult for them. Tuesday will be no different. We have to be ready.\"\nOnly Barcelona's Robert Lewandowski (34 goals) has scored more for a club in Europe's big five leagues this season than Kane.\nIn the end, Leverkusen were fortunate not to fall further behind on a forgettable night as Bayern substitute Joao Palhinha brushed the woodwork in the stoppage time.\n\"A lot went against us today, but that was our own fault. We didn't have good control and made big mistakes,\" Leverkusen boss Alonso said.\nOn the other hand, Kompany's only concern on an otherwise spotless night was an injury to Neuer, who was replaced by Jonas Urbig in Bayern goal.", "url": "https://www.bbc.co.uk/sport/football/live/cly212pqyjlt"}