{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:39:35", "date_modify": "2025-05-19 14:39:35", "date_publish": "2017-07-11 23:05:10", "description": "English semi-professional club Lewes believe they have become the first in the UK to pay their men's and women's teams the same amount.", "filename": "sport_football_40576013_1747665575.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6445/production/_96896652_cal.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40576013_1747665575.html", "title": "Lewes: English semi-pro club to pay men and women the same", "title_page": "Lewes: English semi-pro club to pay men and women the same - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An English semi-professional club believe they have become the first in the UK to pay their men's and women's teams the same amount.\nLewes FC's women's team plays in the Premier League Southern Division - the third tier of the women's game.\nThe men compete in the Isthmian League Division One South, their eighth tier.\nDirector Jacquie Agnew said: \"We hope to spark a change that will help put an end to the excuses for why such a deep pay disparity has persisted.\"\nAs well as giving women's manager John Donoghue the same budget as male counterpart Darren Freeman, the East Sussex club say they will also ensure the same level of coaching staff, equipment and facilities are provided to the two sides.\nThe move is part of the club's Equality FC campaign, which is funded by a combination of the club, donors and sponsors.\nBoth teams already play at the same home ground - The Dripping Pan - and will share 'Equality FC' as their shirt sponsor next season.\n\"We believe that there should be a level playing field for women in football,\" added Agnew.\n\"Lewes FC can show that equal pay can be implemented to the benefit of both women and men in sport and beyond.\"", "url": "https://www.bbc.com/sport/football/40576013"}