{"authors": ["Tim Oscroft", "www.facebook.com"], "date_download": "2025-05-21 05:46:52", "date_modify": "2025-05-21 05:46:52", "date_publish": "2025-01-05 06:20:34", "description": "Australia race to victory on day three of the Fifth Test in Sydney with Scott Boland taking 6-45 to help regain the Border-Gavaskar Trophy.", "filename": "sport_cricket_articles_czjdxnyl1e7o_1747806412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a545/live/36a5e2b0-cb2e-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_czjdxnyl1e7o_1747806412.html", "title": "Australia beat India by six wickets to seal 3-1 Border-Gavaskar Trophy win", "title_page": "Australia beat India by six wickets to seal 3-1 Border-Gavaskar Trophy win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia raced to victory on day three of the fifth Test in Sydney to beat India by six wickets and win the five-match series 3-1.\nFast bowler Scott Boland took 6-45 with India adding just 16 runs to their overnight score to be bowled out for 157.\nIndia took three wickets before lunch despite captain Jasprit Bumrah being unable to bowl because of injury, but Travis Head and Beau Webster saw Australia to their target of 162 in just 27 overs to regain the Border-Gavaskar Trophy.\nThe result also means Pat Cummins' side qualify for the World Test Championship final at Lord's in June, when they will face South Africa.\nVirat Kohli, playing his last Test in Australia, led India in the field in Bumrah's absence.\nOpener Sam Konstas hit 22 off 17 deliveries as Australia made a fast start to their run chase, but his dismissal from a wild slog off Prasidh Krishna began an Australian wobble that saw the hosts also lose Marnus Labuschagne and Steve Smith to leave them on 58-3.\nSmith's dismissal for four left him one run short of 10,000 in Tests, but Head and Webster put on 58 to take Australia to their target, with debutant Webster hitting the winning runs off Washington Sundar.\nBoland had swung the Test in Australia's favour with a superb spell on the second evening that was only slightly damaged by Rishabh Pant's violent innings of 61.\nThe popular 35-year-old bowler took the last wickets of India's innings to give him 10 in the match, having Mohammed Siraj caught at slip and then bowling the struggling Bumrah when India's captain missed a hoick.\nKonstas gave Australia's pursuit of 162 a predictably hectic start alongside Usman Khawaja until the impressive Krishna removed him, Labuschagne and Smith.\nKhawaja calmed the nerves until he bottom-edged Siraj through to Pant, but Head and Webster smoothly ticked off the remaining runs.\nAll-rounder Webster capped a memorable debut, in which he scored 57 in the first innings and took a wicket as well as two catches, with a calm 39 not out.\nSmith was left frustrated that his attempt to become the fourth Australian to reach 10,000 runs came up short, but with a Test series in Sri Lanka starting on 29 January, the former captain will not have to wait too long to join Allan Border, Ricky Ponting and Steve Waugh in passing the landmark.\nIndia can only imagine what might have happened had Player of the Series winner Bumrah been fit to bowl on a wicket that was still tricky to bat on.\nThe 31-year-old was outstanding in claiming 32 wickets over the five Tests, and he would surely have had more had the Brisbane match not been affected by rain and had he not suffered a back spasm on the second day in Sydney.\nAnother what-might-have-been was the dismissal of Pant for 61 on day two, when another hour of the explosive left-hander would have set Australia a more testing target.\nSiraj also impressed in taking 20 wickets in the series, but an expensive spell from the 30-year-old at the start of Australia's run-chase gave the home side vital momentum against India's depleted attack.\nKohli was fired up by the wickets of Labuschagne and Smith but could do little to stop Australia's victory push in his 18th and final Test appearance in the country.\nAustralia captain Pat Cummins: \"It has been an amazing series, it has been in the calendar for a while, one you've had your eye on it for a year or two. It has lived up to all the hype.\n\"I am immensely proud, we have spent a lot of time together as a group over the years. We knew we were not at our best at Perth, but it is never as bad as it seems. We doubled down on what makes us a good side, and had a lot of fun along the way as well.\n\"We talk about needing a squad, especially in these five-match series, you rarely play the same 11. Three debutants came in and contributed at different times, it feels like we are building something nice.\n\"There were some key moments from some of our mainstays who really stood up, and you need that to beat a side like India and in those key moments those guys put their hands up.\"\nIndia captain Jasprit Bumrah: \"There are lots of ifs and buts. The whole series was well fought and today as well we were in the game, so it was not like it was totally one-sided.\n\"This is how Test cricket goes in those moments when whatever team holds their nerve for the longest time, sticks together and tries to find a way out of that will win the series.\n\"It was a great series, congratulations to Australia, they fought really well for a well-deserved win.\"", "url": "https://www.bbc.com/sport/cricket/articles/czjdxnyl1e7o"}