{"authors": ["Jamie Currie", "www.facebook.com"], "date_download": "2025-05-21 06:15:10", "date_modify": "2025-05-21 06:15:10", "date_publish": "2025-04-01 10:43:18", "description": "Fan voice: Can Rangers solve their lacklustre starts?", "filename": "sport_articles_c2depz47rplo_1747808110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4967/live/ee130720-0ed6-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c2depz47rplo_1747808110.html", "title": "Fan voice: Can Rangers solve their lacklustre starts?", "title_page": "Fan voice: Can Rangers solve their lacklustre starts? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After the derby win at Parkhead before the international break, I was hopeful Rangers would go up to Dens on Saturday and deliver a drama-free evening with a victory.\nThis is Rangers, though, and things don't happen like that. Seven goals, 12 Cyriel Dessers shots and a dramatic 93rd-minute winner after looking like a shambles for most of the game.\nLast time I was at Dens we got a late winner under Giovanni van Bronckhorst from Connor Goldson. This time we get one from Dessers.\nIt's all fine and well winning a few games in that manner but we can't afford to start matches the way we have been doing.\nIt's all very lacklustre and lacking in control and intensity and when you throw in a goalkeeping howler it doesn't bode well.\nHowever, those are things that can be and should be worked on this week prior to facing Hibs. David Gray's side are far better than Dundee and if we start like we did at Dens, the visitors have it in them to pull off a Motherwell-type result.\nWhere I will give the players credit is their ability to fight back and dig in. That's a massive improvement and that mentality needs to remain in the dressing room no matter who is in the dugout next season.\nBut for now, we have to try to win at Ibrox on Saturday and continue adding to the confidence before the Europa League quarter-final with Athletic Bilbao comes around.", "url": "https://www.bbc.com/sport/articles/c2depz47rplo"}