{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-21 07:48:00", "date_modify": "2025-05-21 07:48:00", "date_publish": "2025-05-18 19:44:12", "description": "Mikel Arteta says he is \"unsatisfied and upset\" that Arsenal are finishing another season without a major trophy.", "filename": "sport_football_articles_c0qgnwxz4v2o_1747813680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00fa/live/a33985b0-341c-11f0-a567-098a56a9dd1a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0qgnwxz4v2o_1747813680.html", "title": "Mikel Arteta: 'We are upset and unsatisfied'", "title_page": "Mikel Arteta: 'We are upset and unsatisfied' - boss on Arsenal's season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikel Arteta says he is \"unsatisfied and upset\" that Arsenal are finishing another season without a major trophy.\nThe Gunners manager delivered a powerful and emotional speech as he addressed fans at Emirates Stadium after Sunday's 1-0 win over Newcastle - Arsenal's final home match of the season.\nThe result guarantees Arsenal a place in next season's Champions League but it is now five years since the Gunners last won a major trophy - the FA Cup in 2020.\nThey were comfortably beaten to the Premier League title by Liverpool, were knocked out of the Champions League and Carabao Cup in the semi-finals, and went out of the FA Cup in the third round.\nArteta said he is ready to \"give his life\" to deliver a trophy for Arsenal.\n\"Liverpool have a trophy - we don't have a trophy,\" Arteta, who has delivered one FA Cup since he was appointed head coach in December 2019, said in his media conference.\n\"We are unsatisfied and upset. But I think we are on the right trajectory.\n\"What I can promise is that I will do my very best [to win a trophy] and I will give my life, and get every drop of everybody here to squeeze it and get the best out of them.\"\nAsked whether he thought fans still backed him, Arteta added: \"That's what I feel but they want more, they have expectations. We need to believe we are going to do it together.\"", "url": "https://www.bbc.com/sport/football/articles/c0qgnwxz4v2o"}