{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:04:06", "date_modify": "2025-05-21 07:04:06", "date_publish": "2025-01-13 20:27:07", "description": "Ronnie O'Sullivan says he made the \"nightmare\" decision to withdraw from the Masters on medical grounds as he \"lost the plot\" at last Thursday.", "filename": "sport_snooker_articles_cgmyv88ygy3o_1747811046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/330a/live/7f838bc0-d1e8-11ef-a174-4f716b9e5ce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_cgmyv88ygy3o_1747811046.html", "title": "Ronnie O'Sullivan: Masters withdrawal was 'nightmare' decision after Rocket 'lost the plot'", "title_page": "Ronnie O'Sullivan: Masters withdrawal was 'nightmare' decision after Rocket 'lost the plot' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ronnie O'Sullivan says he made the \"nightmare\" decision to withdraw from the Masters on medical grounds after he \"lost the plot\" last Thursday.\nThe defending champion had been planning to go after a record-extending ninth title and was scheduled to face John Higgins on Sunday in a blockbuster opening to the tournament at Alexandra Palace.\nHowever, the 49-year-old elected not to play in the invitational event for the top 16 ranked players after a mix of fatigue and pressure spilled out during a 3-2 Championship League defeat by Robert Milkins in Leicester.\n'The Rocket', who looked clearly frustrated, broke his cue and threw it in a bin and pulled out of his final group game later that day.\nOn Friday, it was announced he would also miss the Masters and be replaced by Neil Robertson in the line-up.\n\"It was a nightmare decision really to make,\" O'Sullivan told Eurosport.\n\"If you had asked me on Sunday if I was ready to play, I'd probably have been OK. It is such a massive tournament.\"\nO'Sullivan, along with several of his fellow elite players, featured in lucrative exhibition events in the Far East in recent weeks.\nThose followed on from his appearance at the Riyadh Season Snooker Championship in Saudi Arabia in late December.\n\"I've obviously been on this three-week trip, away playing, and I think I just exhausted myself,\" O'Sullivan said.\n\"[There was] a lot of pressure while I was away and the build-up of all that kind of got too much. I lost the plot on Thursday and snapped my cue so that's unplayable, so I just knew at that moment in time, the right decision was not to play.\n\"It's such a big tournament I felt whoever was going to come in should at least have a couple of days' notice.\"\nO'Sullivan has won 41 ranking events and seven world titles during a storied career since turning professional in 1992 and claimed his first Masters crown in 1995 at the age of 19.\nHis success 12 months ago at the age of 48 means that he holds records for being the oldest and youngest ever winner of the Triple Crown event.\nHe also decided to miss the Masters in 2020.\nO'Sullivan, who confirmed that he is now \"all right\", will need to get used to a different cue as he prepares to return to the sport, having wrecked the last one.\n\"It was in the bin, one of them wheelie bins, but my mate said we can't leave that here, so he got it out and brought it with us,\" O'Sullivan said.\n\"I've got a couple of other cues that I can start practising with because there's some tournaments coming up. I'm going to continue to play so I need to get used to the cue now.\"", "url": "https://www.bbc.com/sport/snooker/articles/cgmyv88ygy3o"}