{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:32:00", "date_modify": "2025-04-26 07:32:00", "date_publish": "2025-02-27 16:49:41", "description": "Middlesbrough boss Michael Carrick speaks to BBC Radio Tees before Saturday's Championship home game against Derby County.", "filename": "sport_football_articles_cy4lljdjg04o_1745652720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bdb/live/00a2fac0-f529-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy4lljdjg04o_1745652720.html", "title": "Carrick on 'momentum' and 'challenging' Derby clash", "title_page": "Middlesbrough: Michael Carrick on 'momentum' and 'challenging' Derby clash - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The fitness of centre-backs George Edmundson and Rav van den Berg will be assessed after they both picked up injuries in the past two games. Jonny Howson, Riley McGree and Ben Doak all remain out.\nCarrick is \"delighted\" for Marcus Forss who scored his first goal since returning from an injury lay-off in the 3-1 win at Stoke on Tuesday.\nThe head coach said: \"He's worked hard to get back in and around it, to get back to fitness and it was a good moment for him. I thought he played really well the other night. His goal was a fantastic finish.\"\nOn the mood around the squad after ending a run of five straight defeats: \"It's been good, honestly I've not noticed a massive difference, especially around the boys. The way they've behaved and the energy and the noise around the place, it's still there. Certainly on the inside, it's a nicer feeling.\"\nOn facing Derby: \"It will be a challenging game for us. They're near the bottom of the league and they've got a lot to play for and a lot to fight for. They made it difficult for us when we played them at their home.\"\nCarrick added: \"We definitely know what we're in for. We're not getting carried away by any stretch by the fact we've won one game and all of a sudden everything's great - it's one step at a time.\"\nOn trying to build momentum: \"Momentum is big. It went against us for a period of time and we need to create that. It's only us that can do that by winning games ultimately. It's not going to be created by one day or two days, it's over a period of time. We have to have all eyes on this and not get too far ahead of ourselves.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy4lljdjg04o"}