{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:20:21", "date_modify": "2025-05-21 05:20:21", "date_publish": "2025-02-09 04:33:17", "description": "Swansea City: Looking beyond this season would be 'naive' - Luke Williams", "filename": "sport_football_articles_c9d53vlv4y9o_1747804821.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a67/live/f413c8f0-e526-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9d53vlv4y9o_1747804821.html", "title": "Swansea City: Looking beyond this season would be 'naive'", "title_page": "Swansea City: Looking beyond this season would be 'naive' - Luke Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams says it would be \"naive\" of Swansea City to look beyond the current campaign as they bid to halt their alarming run of poor form.\nThe Swans had been within striking distance of the Championship play-off places following back-to-back wins against Queens Park Rangers and Luton Town after Christmas.\nBut they have plummeted to 17th in the table and are now just six points above the bottom three having picked up only one point from the last 18 on offer.\nAnd Williams says his side's recent results have ensured the club has forgotten the \"positive feelings\" they had earlier on in the campaign.\n\"What we have got to do is get the group supported and in the best place to play as well as they possibly can,\" explained Williams.\n\"We know this group of players can win enough games but looking further than that in terms of this season would just be naive of us.\n\"People want to see that we are going in the right direction. At times this season it has felt like that.\n\"Then we have had a bad run, we have lost the captain and the window hasn't gone the way [we wanted it to].\n\"Then people, me included, forget a lot of the positive feelings and performances we had.\"\nBristol City have earned 16 of the 18 points on offer from their past six league matches at Ashton Gate and sit on the cusp of the top six going into the contest with Swansea.\n\"They are a good team. We had a really tough game against them earlier in the season, with two teams who were quite evenly matched,\" added Williams.\n\"They will be well supported, a good atmosphere, but our players want to play. They have to make a performance if we are going to have a chance in this game.\"", "url": "https://www.bbc.com/sport/football/articles/c9d53vlv4y9o"}