{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:40", "date_modify": "2025-05-21 04:38:40", "date_publish": "2025-01-18 00:00:00", "description": "Rayan Kolli's second-half winner inflicts a first defeat of 2025 on bottom team Plymouth Argyle.", "filename": "sport_football_live_cvg45p1r4nzt_1747802320.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvg45p1r4nzt_1747802320.html", "title": "Plymouth Argyle 0-1 Queens Park Rangers: Rayan Kolli scores R's winner", "title_page": "Plymouth Argyle 0-1 Queens Park Rangers: Rayan Kolli scores R's winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Teenage substitute Rayan Kolli struck a second-half winner as Queens Park Rangers inflicted a first defeat on new Plymouth Argyle head coach Miron Muslic.\nThe loss was Plymouth's first in five games and leaves them in a perilous position at the bottom of the Championship.\nArgyle goalkeeper Dan Grimshaw kept them in the game with a string of fine saves until the 19-year-old Kolli beat him with a fine finish into the bottom corner.\nIt secured a third successive league win for QPR and moved them into the top half of the Championship for the first time in almost two years.\nAustrian Muslic, the replacement for Wayne Rooney, had seen his new team draw with Oxford United in his first game in charge, but he watched as the R's, buoyed by a strong run of form across the winter, had the better chances of the first period.\nIt was only thanks to Grimshaw that the score remained level, as he made a good scrambling save to deny Morgan Fox, but he made an even better one when he kept out Michael Frey's effort from six yards when the Swiss striker looked certain to score.\nGrimshaw excelled again shortly after half-time as he made a second save to prevent Frey from scoring, after Jimmy Dunne's shot found the striker unmarked only eight yards out.\nHe produced another fine save in a one-on-one with Ilias Chair but his one-man resistance was finally broken by Kolli when the youngster, sent on for Frey, poked home his fifth goal of a very promising season.\nPlymouth struggled to create anything in search of an equaliser, with the visitors much closer to adding a second.\nIt was only a third loss of the campaign at Home Park but Plymouth have now not won in the Championship since 5 November - a run of 13 games.\nThey have not won away all season and welcome promotion-chasing Burnley on Wednesday in their next game, with things not getting any easier as they try to drag themselves out of danger.\nBut it is now only one defeat in league 12 games for Marti Cifuentes' outfit as they continue to move in the right direction.\nQueens Park Rangers head coach Marti Cifuentes:\n\"I am very happy, not only for the result but the fact it is not easy to come here and get three points as Plymouth's home form has been stable.\n\"The way we performed, we created enough chances to not suffer. It was a very strong performance from a collective point of view and some really good individual performances as well.\n\"We know taking chances is the difference between being high and low in the table but the reality is that we had five or six clear chances. Their keeper made some brilliant saves.\"", "url": "https://www.bbc.com/sport/football/live/cvg45p1r4nzt"}