{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-05-21 05:45:30", "date_modify": "2025-05-21 05:45:30", "date_publish": "2025-04-02 13:53:37", "description": "Ange Postecoglou press conference: Chelsea vs Tottenham", "filename": "sport_football_articles_cwyn1wz2qngo_1747806330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwyn1wz2qngo_1747806330.html", "title": "Ange Postecoglou press conference: Chelsea vs Tottenham", "title_page": "Ange Postecoglou press conference: Chelsea vs Tottenham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Postecoglou had no issue with Mauricio Pochettino's recent comments about wanting to return to the club: \"If he wants to come back one day, then I hope it happens for him. I don't feel disrespected.\"\nHe dismissed further questions about his future as Tottenham manager: \"I don't deal with it. It doesn't rock my world - it doesn't consume me. I know my responsibilities are and I am sure if the club decides to go in a different direction, there are some outstanding candidates for it. And you know what, maybe someone will think: 'Ange Postecoglou is not a bad coach - maybe we'll take a punt on him'.\"\nIn doing so, he reiterated his commitment to what he is trying to achieve at Tottenham: \"I am passionate about what we're doing. I was brought in to change the way the club plays, rejuvenate the squad and bring success. I am focused on that and that is what I'll keep doing.\"\nPostecoglou confirmed there are \"no new injuries\" in his squad, but Thursday's match will likely come too soon for Richarlison: \"[There is] a chance to play the weekend if he keeps training as he has been. [Dejan] Kulusevski and Kevin [Danso] should return in the next few weeks.\nHe was positive about the international break: \"Guys like [Cristian] Romero, Destiny [Udogie], [Mathys] Tel, Wilson [Odobert] and all these guys who missed a lot of football recently all got some good game time.\nOn facing opponents Chelsea at Stamford Bridge: \"Talented squad with good manager. They've had a positive season in terms of what they're trying to build. Playing away from home, against a loud fanbase, against a quality opponent where certainly, if we can come through that test it gives you confidence about what is ahead.\"\nHe added: \"They've also been hit with injuries. At their place, they're a tough team to beat. We know we have to play well to beat them. We need to try to build some momentum into the rest of the season and finish in a positive way.\"", "url": "https://www.bbc.com/sport/football/articles/cwyn1wz2qngo"}