{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:20", "date_modify": "2025-05-21 07:42:20", "date_publish": "2025-01-22 10:24:31", "description": "Motherwell: 'Miller must move away from Scotland'", "filename": "sport_articles_c70k6zz94zzo_1747813340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe45/live/d4519540-d8a3-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c70k6zz94zzo_1747813340.html", "title": "Motherwell: 'Miller must move away from Scotland'", "title_page": "Motherwell: 'Miller must move away from Scotland' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell fans, we asked for your views Lennon Miller's future at Fir Park.\nHere's what some of you had to say:\nFrazer: I think Miller is worth at least £5m but I would rather he move in summer.\nDave: Miller should get himself away as soon as possible before Stuart Kettlewell drags him down to the type of player he wants - at best, average. He has so much potential and is already so far ahead of the players at his age group in Scotland.\nEddie: I think he should go sooner rather than later, it's not doing his portfolio any good playing in a non-footballing and defensive team.\nLouise: Lennon Miller won't go, even if he did he'd make sure we get a good payout for him. He's 10 times better than David Turnbull and he went for £3.5m. So I'm expecting £4m+ at least for Lennon.\nJim: Lennon Miller has to be worth north of £5m, an incredible talent who is rated as seventh in the world for his age and stats. He is, in my opinion, the best player in Motherwell colours since the great Davie Cooper, yes that good! If Turnbull is sold for over £3m and Theo Bair for £1.6m then it's easy to arrive at a valuation of more than £5m for Lennon.\nAndrew: There is no doubt the lad will go, it's which window he will go in. Like everything else, if the price is right in any window, the club will not be able to refuse the financial gain. I suspect the realistic figure will be somewhere around £3.5m with add-ons.\nGerry: Motherwell are excellent at developing young players and reinvigorating experienced players. These players deliver points and keep us in the top league. But, we must sell at key times (Turnbull, Bair) to max out our income. The next six months is when Lennon Miller should deservedly step into the limelight elsewhere and reward 'Well with a payday.", "url": "https://www.bbc.com/sport/articles/c70k6zz94zzo"}