{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:53", "date_modify": "2025-05-21 07:46:53", "date_publish": "2024-12-23 16:35:12", "description": "Ireland and Munster scrum-half Craig Casey is set to miss the Six Nations after being ruled out for four months with a knee injury.", "filename": "sport_articles_c4glkndpexko_1747813613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f95/live/4bcb9ab0-c14a-11ef-bd92-5d9f17479cd0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4glkndpexko_1747813613.html", "title": "Craig Casey: Ireland scrum-half set to miss Six Nations with knee injury", "title_page": "Craig Casey: Ireland scrum-half set to miss Six Nations with knee injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland scrum-half Craig Casey looks set to miss the Six Nations after Munster confirmed he will miss \"approximately four months\" following knee surgery.\nCasey was forced off with the injury in Munster's Investec Champions Cup defeat by Castres earlier this month.\nThe 25-year-old has won 18 Ireland caps since making his debut in 2021 and featured in three of their four autumn Tests last month.\nIreland begin their Six Nations title defence on 1 February against England. The holders, who will be led by interim head coach Simon Easterby in Andy Farrell's Lions-enforced absence, also face Scotland and Wales away and host France before a final-weekend trip to Italy on 15 March.\nIn further bad news for Munster, Thaakir Abrahams and Jean Kleyn are also set to miss around four months after undergoing shoulder and thigh surgeries respectively.\nMunster are also without Alex Nankivell and Dave Kilcoyne for their United Rugby Championship interpro against Leinster on Friday.\nNankivell injured his hamstring whilst Kilcoyne picked up a thigh injury in Munster's 22-19 victory against Ulster last weekend.\nBoth will go for scans to determine the extent of the injuries and are unavailable for the Thomond Park game against Leinster.\nDian Bleuler is completing his return to play protocols and Munster said that \"his availability will be determined later in the week\".\nDiarmuid Barron, Peter O'Mahony and Conor Murray are all returning from injuries and are in contention to feature for interim head coach Ian Costello.", "url": "https://www.bbc.com/sport/articles/c4glkndpexko"}