{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:43:30", "date_modify": "2025-04-26 03:43:30", "date_publish": "2025-03-05 08:50:06", "description": "Celtic right-back Alistair Johnston has emerged as a shock transfer target for Serie A leaders Inter Milan.", "filename": "sport_football_articles_c4g08yl0nllo_1745639010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe3c/live/2a192f50-f99d-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g08yl0nllo_1745639010.html", "title": "Scottish gossip: Alistair Johnston, George Hirst, Rangers manager", "title_page": "Scottish gossip: Alistair Johnston, George Hirst, Rangers manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Celtic right-back Alistair Johnston has emerged as a shock transfer target for Serie A leaders Inter Milan. (InterLive via Scottish Sun), external\nThe San Francisco 49ers-backed consortium poised to take over Rangers is considering Rafael Benitez as the next permanent manager at Ibrox. (Daily Record), external\nKevin Muscat has also been linked with Rangers but he has reiterated his commitment to Shanghai Port with the club on the brink of exiting the Asian Champions League. (Daily Record), external\nSheffield-born striker George Hirst has been on Scotland's radar since July 2024. (Scottish Sun), external\nDirector Ian Gordon says Hibernian have had about 50 applications for the vacant chief executive role and that the board is focusing on someone who can get a handle on the business side of the club and end their financial losses. (Daily Record), external\nBen Doak's agent Jackie McNamara says the Scotland winger would have stayed at Celtic rather than move to Liverpool if ex-boss Ange Postecoglou had guaranteed him a place in his first team. (Scottish Sun), external\nFormer Celtic striker Kyogo Furuhashi has been tipped for a quick exit from Rennes this summer after again being overlooked by his new manager Habib Beye. (Daily Record), external", "url": "https://www.bbc.co.uk/sport/football/articles/c4g08yl0nllo"}