{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-20 14:11:05", "date_modify": "2025-05-20 14:11:05", "date_publish": "2023-07-30 07:10:40", "description": "The inaugural Bellator flyweight title fight between Kyoji Horiguchi and Makoto Takahashi ends a no contest while Patricky Freire stops Roberto de Souza in Japan.", "filename": "sport_mixed-martial-arts_66352445_1747750265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/101A6/production/_130585956_1t6a4442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_mixed-martial-arts_66352445_1747750265.html", "title": "Bellator v Rizin 2: Flyweight title fight ends in no-contest, Patricky Freire finishes Roberto de Souza", "title_page": "Bellator v Rizin 2: Flyweight title fight ends in no-contest, Patricky Freire finishes Roberto de Souza - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bellator's inaugural flyweight title remains vacant after Kyoji Horiguchi's bout with Makoto Takahashi ended after 25 seconds because of an eye poke.\nThe flyweight title was on the line for the first time in the co-main at Bellator v Rizin 2 in Japan.\nHoriguchi, 32, came out as the aggressor, landing a right high-kick.\nHowever his follow up left jab ultimately ended the fight as Takahashi, 23, immediately stepped back and held his hand to his eye.\nReferee Jason Herzog called a medical time out but Takahashi, who had won 10 fights in a row, was still struggling to see and the fight was deemed a no contest.\nThe main event on the cross-promotional card at Saitama Arena did not disappoint however, as Bellator's Patricky 'Pitbull' Freire, 37, earned a third-round TKO win against Roberto 'Satoshi' de Souza in a Bellator lightweight grand prix quarter-final.\nBrazil's Freire, who lost the lightweight title via unanimous decision against Usman Nurmagomedov at Bellator 288, will face Russian Alexandr Shabliy in the semi-finals of the competition.\nRizin lightweight champion De Souza, 33, took the fight on just six days' notice after Bellator's AJ McKee withdrew because of a bacteria infection.\nIt was a tentative start as Freire and De Souza sized one another up, but 'Pitbull' began to go on the attack in the final moments of the opening round, landing a flurry of punches and just missing with a flying knee.", "url": "https://www.bbc.com/sport/mixed-martial-arts/66352445"}