{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:54:51", "date_modify": "2025-05-20 13:54:51", "date_publish": "2023-07-31 11:20:45", "description": "Liverpool: 'A massive season' and Curtis Jones has 'Molby' potential", "filename": "sport_articles_c72wwlgzgn4o_1747749291.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c8a0/live/3a217670-2ef9-11ee-999b-b74dedc428d3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72wwlgzgn4o_1747749291.html", "title": "Liverpool: 'A massive season' and Curtis Jones has 'Molby' potential", "title_page": "Liverpool: 'A massive season' and Curtis Jones has 'Molby' potential - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked if you felt Curtis Jones could make a key impact at Liverpool this season.\nHere are some of your replies:\nGareth: Would love Curtis Jones to be first on Klopp’s team sheet this season. I think he’s a class act and could be as good as Jan Molby if he becomes a regular in the team. He needs to stay injury free but in my opinion he must be given a chance.\nPaul Webb: I think this is a massive season for Jones. So much so, I think it defines his future at the club. He'll be 23/24 come the end of next season and at an age where he should be pushing on and consolidating his position. I'm still struggling to find what his best position is and probably his versatility may well give him a longer future here.\nTony: There is no alternative here for Jones - if he doesn't step up, stay injury free and add consistency to his game he won't be here next season. A good player with a good engine but whether that is 'good enough' for Liverpool is for him to prove. Love the lad to succeed - so hard making that step up from academy to first team.\nGasman: Jones played a major role towards the rejuvenation of Klopp's midfield last season. For me he was England's best player at the Euro U21 tournament. This is Jones' season. He will be named Young Player of the Season if he stays fit. I could see him getting 10 goals and 10 assists.\"", "url": "https://www.bbc.com/sport/articles/c72wwlgzgn4o"}