{"authors": ["Tom Chappell", "www.facebook.com"], "date_download": "2025-05-21 06:25:34", "date_modify": "2025-05-21 06:25:34", "date_publish": "2025-03-31 11:55:38", "description": "Portsmouth fan writer Tom Chappell gives his thoughts on the Blues after a big win over Blackburn Rovers.", "filename": "sport_football_articles_c4g7dll2d21o_1747808734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d28a/live/9763f830-0e27-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g7dll2d21o_1747808734.html", "title": "Portsmouth fan view: Results over performances at this stage of season", "title_page": "Portsmouth fan view: Results over performances at this stage of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If it hadn't been already, Saturday confirmed it is very much results over performance territory at this stage of the season for Pompey.\nIt was almost as if everything a seething John Mousinho called out on the touchline a fortnight ago at Deepdale had an answer provided for it at Fratton.\nA well-executed press, numerous industrious challenges (which fitted the 'foul early' mould called for by Mousinho) and an immeasurably better managed closing stage to the game - Terry Devlin's run to the corner flag was a pleasing watch.\n'Winning ugly' has been far from a cornerstone of Pompey's season.\nIt doesn't fit the adage of either turning up slightly undercooked and being blown away by opposition as a consequence, or absolutely everything going our way on the day and being just about the better side.\nThis was a newfound form of victory for Pompey, a welcome sight with just a handful of games to go.\nIn the moment, the game felt tense - in large part perhaps due to the slim 1-0 lead afforded to us against a Blackburn side with an abundance of quality and speed on the break.\nIt's worth pointing out that Pompey's defending in transition has left little to the imagination at times this season, so that was always a concern.\nEveryone knew the importance of a return to winning ways pre-game, the Fratton atmosphere remained on suitably good form throughout, another example of the players getting a continuous 'Blue Army' to see them over the line from all four stands.\nNo surprise really then that the points tally is up to 22 now at Fratton in the calendar year of 2025.\nMan of the match Connor Ogilvie on fist pump duty was another one of the afternoon's highlights, ably complimented by a big-game Zak Swanson performance.\nAnd without having countless memorable opportunities in front of goal, in the moment it mattered, Colby Bishop and Josh Murphy combined superbly to win the game.\nThe competition is strong given that's goal number seven, but that was probably one of Murphy's better finishes in a Pompey shirt.\nSo, 45 points with seven games to go is not a bad position to be in at all in a campaign that was always going to be all about survival.\nA win and a draw will probably do it. Given where we've been at times this season, that will do nicely.", "url": "https://www.bbc.com/sport/football/articles/c4g7dll2d21o"}