{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 14:46:03", "date_modify": "2025-05-20 14:46:03", "date_publish": "2023-07-27 18:13:03", "description": "Glamorgan sight a victory chance as Derbyshire collapse to 318 all out despite Luis Reece's heroics, before reaching 78-0, 125 runs behind.", "filename": "sport_cricket_66319925_1747752363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1A18/production/_130408660_shutterstock_editorial_13423356ai.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66319925_1747752363.html", "title": "County Championship: Derbyshire collapse gives Glamorgan hope", "title_page": "County Championship: Derbyshire collapse gives Glamorgan hope - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan can press for their second win of the Championship season after forcing Derbyshire to follow on, 203 runs behind.\nLuis Reece scored 131 for Derbyshire, adding 165 for the first wicket first time round with Harry Came (65).\nBut a calamitous collapse saw them lose their last seven wickets for 44 to be dismissed for 318.\nReece led the way again with 53 not out as the home side battled to 78 without loss in their second innings.\nIn Derbyshire's first innings, Glamorgan wicketkeeper Chris Cooke claimed five catches while Timm van der Gugten (3-94) was the most successful of the persevering attack who did not claim a wicket until the 64th over.\nThe visitors took maximum bonus points, but need victory to be able to challenge for a promotion place.\nThe gentle tempo of day two continued for Derbyshire's batters on day three as Reece and Came batted cautiously against some accurate Glamorgan seam bowling.\nA spell of leg-spin from Mitch Swepson brought the first aggression of the day, but Van der Gugten returned to have Came caught behind after facing 192 balls.\nGlamorgan claimed a second straightaway as Brooke Guest was trapped lbw fourth ball.\nA passing shower close to the interval left Reece on 99 at the interval, but an edged four off Van der Gugten took him to three figures soon after for the first time this season, signalling an abrupt change of gear from the home side.\nThere was no hint of the batting woes in store as Derbyshire's departing captain Leus Du Plooy, on 981 first-class runs for the season, raced past the 1,000 landmark with some fluent off-drives.\nReece accelerated to match his captain's intent before top-edging a sweep at Swepson for David Lloyd to claim a diving slip catch.\nThe dangerous Du Plooy edged Jamie McIlroy behind on 42, and Haider Ali (20) gave Cooke and Van der Gugten their third victim each.\nAnuj Dal provided an incident-packed cameo as he was missed by two slip fielders, Colin Ingram and Sam Northeast, off the same ball as both appeared to get hands to it, before collecting a six thanks to overthrows.\nBut he was caught behind off McIlroy for 11 as Glamorgan claimed four wickets in the afternoon session, and the final four went in a rush after tea as Swepson took a second wicket, while the accurate medium pace of Andy Gorvin claimed two more and a direct-hit run-out.\nDespite the heavy schedule for Glamorgan's attack, Glamorgan chose to keep the bowlers at it rather than swing the bat in a second innings.\nThe decision did not pay off in the long evening session as Reece and Came repeated their earlier efforts, to frustrate Glamorgan in the final 33 overs and give Derbyshire hope of escaping with a draw.\nGlamorgan assistant coach David Harrison told BBC Sport Wales:\n\"When they were 165-0, to bowl them out for under 320 was an unbelievable effort and it shows what happens when you control the scoreboard. We kept really accurate and we got a magic hour and a half, it shows we're well ahead in the game.\n\"It would have been nice to get a couple of wickets tonight, but we'll refresh and come back strongly in the morning.\n\"There was a feeling on the pitch that we'd had a really good hour before and after tea, the ball was swinging a little bit and they were keen to (enforce the follow on and) get back out there.\n\"It would be lovely to get a win and go into those last three games (in September) in second place or close in third, to push in those games to get what we deserve and get into Division One.\"\nDerbyshire batter Harry Came told BBC Radio Derby:\n\"We're going to have to come back hard and bat really well, (the collapse) happened really quickly in that session after lunch and showed that if you dig in (bowling) as a team, there are wickets out there.\n\"We knew that being 200 behind, they didn't have much choice (in enforcing the follow-on), they had to bowl again.\n\"We're very pleased to have got through to the close and to come back with 10 wickets in the shed, Reesey played exceptionally well all day.\"", "url": "https://www.bbc.com/sport/cricket/66319925"}