{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:01", "date_modify": "2025-05-21 04:11:01", "date_publish": "2024-12-29 00:00:00", "description": "Marcelino Nunez's delightful 89th-minute strike rescues a point for Norwich and denies QPR a fourth Championship win in six matches.", "filename": "sport_football_live_cn8g2pqy363t_1747800661.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn8g2pqy363t_1747800661.html", "title": "Norwich City 1-1 QPR: Marcelino Nunez nets late to rescue Canaries draw", "title_page": "Norwich City 1-1 QPR: Marcelino Nunez nets late to rescue Canaries draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marcelino Nunez's delightful 89th-minute strike rescued a point for Norwich City and denied QPR a fourth Championship win in six matches.\nNunez swept home from the edge of the box to finally reward persistent home pressure at Carrow Road.\nQPR had looked like responding to their Boxing Day defeat at Swansea City with a tenacious victory despite not managing a single attempt on target.\nThe Londoners defended resolutely throughout but were limited in attack, going ahead in fortunate fashion courtesy of an Ante Crnac own goal from Kenneth Paal's dangerous in-swinging corner in first-half injury-time.\nNorwich, with Borja Sainz and Anis Ben Slimane posing constant problems, created several excellent chances, the former going close on three occasions and the latter forcing a wonderful save from Rangers keeper Paul Nardi.\nBut the hosts lacked conviction in front of goal and failed to make the most of their pressure and possession - much to the irritation of an increasingly restless home crowd.\nHowever, after Shane Duffy almost equalised with a header that came back off the bar and Sainz failed to punish a terrible pass by the otherwise exceptional Nardi, Nunez struck to salvage a draw.\nThe Canaries, worthy victors over Millwall last time out to end a four-game winless run, were not at their best but will wonder how they failed to take all three points, let alone have to be content with one, having dominated their stubborn opposition.\nQPR, so abject in their 3-0 loss in Wales three days earlier, wasted a glorious opportunity to go ahead when Lucas Andersen sliced a first-time effort wide after a swift break on the left and fine pull-back by Paal.\nThe hosts then seized control, but wasted a couple of excellent chances in an open first half that brought plenty of attacking threat but lacked quality in front of goal.\nTop scorer Sainz impressed on the left, showing good vision and awareness and setting up a couple of opportunities, notably a lovely cut-back that ended with Oscar Schwartau shooting wildly over from 12 yards.\nThe 23-year-old Spaniard was also involved in a fine move that led to a fierce Slimane strike being superbly held by the Rangers keeper, but he was wayward with his only attempt when he dragged an effort across goal.\nCrnac knew little about his own goal which gave Rangers the lead, the ball taking a deflection and bouncing off him into the net following a delicious near-post corner from Paal.\nBut the hosts recovered and soon started to regain control - and create more chances - after the interval. Ben Chrisene somehow headed well off target from eight yards, Sainz had a low shot saved following a divine reverse pass by Slimane and Duffy's header beat Nardi but not the bar.\nAt the other end, Paul Smyth did go close for Rangers with a rasping strike from distance, but Norwich's patience and dominance paid off when Nunez struck.\nNorwich head coach Johannes Hoff Thorup:\n\"Since the last international break about 40 per cent of the goals we have conceded have come from set-pieces and we have to be better at that.\n\"It is something we are working very hard to improve because it is just not good enough. We can be doing well in a game and then one free-kick, one corner and everything changes.\n\"That was the case today because we should never have gone in at half-time behind – we did well in the first half, created some good chances, but then that goal changes the game completely.\n\"In the end the guys did all I could ask of them to push for an equaliser and fortunately we got one in the end. To have lost a game like that would have been a disaster.\"\nQPR coach Marti Cifuentes:\n\"I cannot say it was unfair on us but obviously the fact that the goal came so late, and we were so close to taking all three points, is very frustrating.\n\"We switched off a bit and it was very costly. But overall I was pleased with the way we played – it was a pleasing response to the way we performed at Swansea when we were below our normal standards.\n\"I thought the first half was as well as we have played for a little while and in the second we had to deal with a lot of pressure from a good team and defended well.\n\"It was a good effort from the team and I am pleased with the attitude they showed.\"", "url": "https://www.bbc.com/sport/football/live/cn8g2pqy363t"}