{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:46:19", "date_modify": "2025-05-20 12:46:19", "date_publish": "2023-08-03 08:32:50", "description": "New Ballymena United manager Jim Ervin says he and his squad are \"looking forward to getting the league up and running\" against Coleraine on Friday night.", "filename": "sport_football_66374861_1747745179.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/149F6/production/_130607448_ervinindex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66374861_1747745179.html", "title": "Irish Premiership: Ballymena United manager Jim Ervin looking forward to getting league 'up and running'", "title_page": "Irish Premiership: Ballymena United manager Jim Ervin looking forward to getting league 'up and running' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ballymena United manager Jim Ervin says he and his squad are \"looking forward to getting the league up and running\" against Coleraine on Friday night.\nThe Irish Premiership season opener, which will be live on BBC iPlayer and the BBC Sport website, will be Ervin's first competitive match in charge.\nThe former United captain has succeeded David Jeffrey as the Sky Blues' boss.\n\"As a group, staff and players, we can't wait to get started. It'll be a long season but we look forward to it.\"\nThe 38-year-old's appointment is one of five managerial changes in the top flight ahead of the new campaign.\n\"It's completely new to me, something I've always wanted to get involved in,\" said the former Linfield defender of his new role after a distinguished playing career as a defender.\n\"The players are starting to understand what we are about. Pre-season has been about me getting to know the players more and the players getting to know me.\n\"It's been interesting and there's been a lot of hard work done.\n\"The squad has bought into our ideas, what we're looking to do and what we're looking to change around the football club, become tuned in to what we are trying to do.\"\nBallymena's opening fixture against their derby rivals at Ballycastle Road is followed by four other testing fixtures against other teams who finished in the top half of the division last term.\nMatches against Crusaders, Larne, Linfield and Glentoran complete a difficult looking August for the Braidmen but Ervin is philosophical about the challenge that lies ahead.\n\"You have to play them [the top six sides] at some stage. People have said how difficult it's going to be but every game in this league is difficult, it doesn't matter who you are playing.\n\"It's all about attitude and approaching games in the right manner. You only enjoy football when you're getting results and doing things the right way.\"\n\"You look at the product now in the Irish League, the full-time set-ups, it's brilliant, and the league's going from strength to strength.\n\"It's about the boys, the team on the pitch. We can help and guide them in the days running up to the game but once they cross the white line there's nothing I can do for them, it's over to them to deliver.\"\nMeanwhile Coleraine this week added two defenders to their squad prior to the Friday night encounter.\nThe Bannsiders have snapped up ex-Rangers, Derry City and Glentoran centre-back Darren Cole and Portstewart teenager Jake Wallace, who was most recently at League One side Fleetwood Town.\nThey join another defender, Graham Kelly, and striker David McDaid, as close season recruits by manager Oran Kearney.", "url": "https://www.bbc.com/sport/football/66374861"}