{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 08:15:26", "date_modify": "2025-04-26 08:15:26", "date_publish": "2025-02-26 10:50:37", "description": "Manchester United are set to play two post-season games in Malaysia and Hong Kong immediately after the Premier League finishes in May.", "filename": "sport_football_articles_cn89yp78w93o_1745655326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7128/live/40d70430-f432-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn89yp78w93o_1745655326.html", "title": "Manchester United planning post Premier League season matches in Asia", "title_page": "Manchester United planning post Premier League season matches in Asia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United are set to play two post-season games in Malaysia and Hong Kong immediately after the Premier League finishes in May.\nLast season, Tottenham and Newcastle flew to Australia for an end-of-season friendly - described as \"madness\" by BBC pundit Alan Shearer.\nThe increased workload on elite players has been widely discussed this season with Fifa's expanded Club World Cup and Uefa's bigger Champions League format resulting in FA Cup replays being scrapped to try and ease the football calendar congestion.\nThis week United confirmed a second round of redundancies that will lead to up to 200 staff members losing their jobs.\nDespite bringing in huge revenues from commercial, matchday and broadcasting income, United have lost more than £300m in the past five years.\nOn Tuesday, head coach Ruben Amorim accepted the first-team group bear responsibility for driving up revenues, as the \"engine\" of the club.\nOne way of doing that is playing overseas matches. The club is set to return to the United States next summer as part of the Premier League's pre-season tournament, beginning in late July, after the Club World Cup has concluded.\nWhile nothing is signed off yet, it is almost certain United will head to the Far East for two fixtures against opposition yet to be agreed.\nThere is a window of a week between the last match against Aston Villa on 25 May and the Champions League final on 31 May, after which players have to be released for international duty.\nUnited have a massive fan base in Malaysia and Malaysia Airlines is the club's official commercial airline partner. However, they last played in the country in 2009, while they last went to Hong Kong in 2013.", "url": "https://www.bbc.co.uk/sport/football/articles/cn89yp78w93o"}