{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:20", "date_modify": "2025-05-20 12:33:20", "date_publish": "2023-08-04 10:30:48", "description": "Norwich boss David Wagner believes experienced summer signings means they are among 10 to 12 teams capable of promotion.", "filename": "sport_football_66404683_1747744400.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BE22/production/_130647684_gettyimages-1544653328.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404683_1747744400.html", "title": "David Wagner: Experienced signings 'can make difference' for Norwich", "title_page": "David Wagner: Experienced signings 'can make difference' for Norwich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich boss David Wagner expects his summer signings to make up for some of the shortcomings which saw them fall short of the play-offs last season.\nThe Canaries have brought in experienced players like Ashley Barnes, Shane Duffy and Swiss international Christian Fassnacht.\nAnd Wagner believes they will be among \"10 to 12 teams\" pushing for promotion.\n\"I have a good feeling about this group in terms of the spirit, the atmosphere and the togetherness,\" he said.\nThe German, who guided Huddersfield into the Premier League in 2017, took over at Carrow Road in January but seven wins between then and the end of the season was only good enough for 13th place.\nSince then, they have lost striker Teemu Pukki, who scored 88 goals for the club, with former Burnley forward Barnes signed to fill the gap.\n\"After last season we said we need more leadership and experience in our group, we need more aerial threat, and we need more options in the wide areas,\" Wagner told BBC Radio Norfolk.\n\"I think every one of the signings at least ticked one of the boxes. This is why I'm quite happy with what we've done so far. We will see what happens to the end of the window if this will be the squad when the window is closed I'm a happy manager.\"\nNorwich were unbeaten in their pre-season games and start the new Championship campaign at home to Hull City on Saturday before travelling to Southampton, who were relegated from the Premier League last term, seven days later.\n\"I know we are one of 10 to 12 teams who like to chase for promotion,\" said Wagner. \"I will not hide away from saying it but I can't promise it. What I can promise is that this group of players will work very hard every single day and we have to see what we can get out of the season.\"\nHe added: \"What happened last season doesn't count and now it's all about the new season.\n\"Let's make sure we all come together, that we all stick together from the first second that we create an atmosphere with the energy in the stands and the same energy on the grass, this is exactly what we should aim for.\"", "url": "https://www.bbc.com/sport/football/66404683"}