{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:59", "date_modify": "2025-05-19 14:41:59", "date_publish": "2017-08-13 19:15:57", "description": "Jose Mourinho says he never thought Manchester United would be able to sign Nemanja Matic before \"something special happened\" for a £40m move from Chelsea.", "filename": "sport_football_40918007_1747665719.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15CC1/production/_97318298_matic.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40918007_1747665719.html", "title": "Manchester United: Nemanja Matic leaving Chelsea surprised Jose Mourinho", "title_page": "Manchester United: Nemanja Matic leaving Chelsea surprised Jose Mourinho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jose Mourinho says he never thought Manchester United would be able to sign Nemanja Matic before \"something special happened\" for a £40m move from Chelsea.\nMidfielder Matic, 29, was named man of the match in United's 4-0 home win against West Ham in their opening game of the new Premier League season.\n\"I didn't disturb him, I didn't disturb Chelsea,\" said ex-Blues boss Mourinho.\n\"It looked like something was happening because his agent told me we can have him, that we just had to pay.\"\nThe Serbia international became United's third summer buy after £31m defender Victor Lindelof from Benfica - who did not make the matchday squad against West Ham - and £75m striker Romelu Lukaku from Everton.\nIt reunited Mourinho with a player who he spent £21m on to bring back to Chelsea for a second spell in January 2014.\nMatic was a key figure in the Blues' Premier League triumph under the Portuguese boss in 2014-15 and helped them win the title again last season.\nHe impressed on his debut league appearance for the Red Devils as goals from Lukaku (2), Anthony Martial and Paul Pogba earned an easy win against the Hammers.\nAsked why Matic became available, Mourinho said: \"It depends on what is happening or what was happening behind doors and we don't know.\n\"The only thing I know is that I brought him to Stamford Bridge because I thought he was a player with special qualities and since I left I always thought he could be a perfect player for us.\n\"We have him and we are very happy because he is a player that our team needs.\"\nWhile Matic won the man of the match award, Lukaku also took plenty of plaudits as he announced his arrival at Old Trafford with the opening two goals on his home debut.\nThe Belgium international, 24, cracked in a rising drive off the post after 33 minutes, adding a glancing header from Henrikh Mkhitaryan's free-kick after the break.\nLukaku had already opened his Red Devils account by netting in Tuesday's 2-1 defeat by Real Madrid in the Uefa Super Cup.\n\"He likes the team and the team likes him,\" Mourinho said.\n\"For any striker, they can play phenomenally well but if they don't score goals they are not happy and the pressure is on them.\n\"Scoring on the first day is always oxygen. It is always happiness and confidence for them.\n\"He knows there is no pressure from me at all. But he knows today was good. He was very effective in the first goal especially.\"", "url": "https://www.bbc.com/sport/football/40918007"}