{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:34:15", "date_modify": "2025-05-21 06:34:15", "date_publish": "2025-03-31 06:04:30", "description": "Wrexham: 'We can't take any team for granted', says Ollie Rathbone", "filename": "sport_football_articles_cwyn392ny2go_1747809255.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1d9/live/a7be9ca0-0ce0-11f0-8981-f111be7f5317.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwyn392ny2go_1747809255.html", "title": "Wrexham: 'We can't take any team for granted', says Ollie Rathbone", "title_page": "Wrexham: 'We can't take any team for granted', says Ollie Rathbone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham goalscorer Ollie Rathbone says they will not take their winning run – or their opponents – for granted as they look to close in on league One promotion.\nRathbone opened the scoring for Phil Parkinson's side as they sealed a 2-0 success at Exeter, Jay Rodriguez adding a second from the spot in the north Wales side's third win in a row and fifth in six games.\nWrexham have also on an impressive away run, with the victory at St James Park their seventh from their last eight games on the road.\nHaving stayed in second spot, they now face a midweek trip to relegation-threatened Cambridge United on Tuesday.\nAfter drawing with Northampton, the U's are 11 points from safety with seven fixtures remaining, but Rathbone said: \"We can't take any team for granted. In this division, if you're not at 100% and you're not closing down, anyone can look a good player.\n\"We will prepare for it as if we were playing a team second in the table or if it was a cup final , we'll prepare the same to try and win.\n\"It's the club's first season back in League One and a lot of people would have taken top half, so to be where we are it's all down to the hard work we've put in. We want to keep it going, keep focusing on every game and see where it takes us.\"\nRathbone, 28, scored his sixth goal of the campaign in the win, with manager Parkinson hoping the former Rotherham man will be credited with the strike despite a deflection off a Grecians defender.\nIt is his career-best return in a single season, and he said: \"It's been a good run and something I've tried to improve on. I'm getting chances; today was a bit fortunate but I am still getting chances and I'm confident I'll get goals.\"", "url": "https://www.bbc.com/sport/football/articles/cwyn392ny2go"}