{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:56:09", "date_modify": "2025-05-20 11:56:09", "date_publish": "2023-08-06 00:00:00", "description": "Listen to radio commentary as Southern Brave host Northern Superchargers in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306986_1747742169.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306986_1747742169.html", "title": "The Hundred 2023 LIVE: Southern Brave vs Northern Superchargers in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Southern Brave vs Northern Superchargers in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWe're going to leave it there for the afternoon double-header.\nWelsh Fire maintained their unbeaten start with a three-wicket win over Oval Invincibles in the women's competition.\nNorthern Superchargers have thrashed Southern Brave by 60 runs in the men's competition.\nSome of the best clips from both matches are below for you to enjoy too.\nWe'll be back at 17:45 BST for the men's match between Oval Invincibles and Welsh Fire. See you then.\nPost\nSouthern Brave were culpable of making it more difficult for themselves too.\nOut of all the batters in world cricket at the moment Harry Brook is someone you probably don't want to drop.\nThis from Craig Overton cost Brave 51 runs.\nDavid dropped on 38\nOh no, Adam Hose.\nTim David picks out Hose on the mid-wicket boundary and it should be a very easy catch but it drops out.\nIt basically goes through his hands and hits his knee.\nBrave 116-3\nNeed 86 more\nSouthern Brave are probably not going to win this game but Tim David is going to try and get them as close as possible.\nHe clubs a six over long-on before he picks up a one-bounce four straight down the ground.\nHe's up to 29 off 11 balls.\nPost\nMarizanne Kapp deserves a call out too for her 4-18.\nShe just keeps on delivering, especially with the ball.\nThe Hundred has suffered plenty of big-name drop outs this season but in Kapp and Shabnim Ismail the competition has two of the best players in the world involved.\nBrave 61-1\n141 runs needed\nDevon Conway has to get on with it but that obviously brings risk - and it costs him his wicket.\nThe New Zealander attempts to heave Wayne Parnell over the rope but only picks out Adam Hose on the square leg boundary.\nThe wily David Wiese then concedes just two runs from his first set.\nSouthern Brave need something very special from here.\n'Welsh Fire have been great to me'\nMatch Hero Shabnim Ismail: \"I am 100% thrilled. I summed up the wicket very well this morning. I knew there would be shape and I just wanted to do well for the team.\n\"We spoke about going straighter compared to the Southern Brave game and we knew the ball would move here and that's what we tried to do as a team.\n\"Welsh Fire have been great to me. I am so chuffed they got me in the team.\n\"I was stressing at the end because I had my pads on so I'm glad we got over the line!\n\"I had a month to prepare for this and I still wanted to be professional and win games for Welsh Fire.\"", "url": "https://www.bbc.com/sport/live/cricket/66306986"}