{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:15", "date_modify": "2025-05-21 05:34:15", "date_publish": "2025-02-09 00:02:02", "description": "Paris Olympic Games 1500m bronze medallist Georgia Bell wins the mile race at the prestigious Millrose Games meeting in New York.", "filename": "sport_athletics_articles_cj91gyly7e7o_1747805655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b764/live/e53463c0-e676-11ef-b7cf-dfdfcf878bb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_cj91gyly7e7o_1747805655.html", "title": "Britain's Georgia Bell wins Millrose Games mile race as Yared Nuguse and Grant Fisher set records", "title_page": "Britain's Georgia Bell wins Millrose Games mile race as Yared Nuguse and Grant Fisher set records - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Georgia Bell ran a personal best to win the mile race at the prestigious Millrose Games in New York.\nBell, Olympic 1500m bronze medallist at last year's Paris Games, finished in four minutes 23.35 seconds at what is regarded as the world's premier indoor athletics meeting.\nShe gave a dominant performance and finished strongly to hold off the challenge from American pair Heather MacLean and Nikki Hiltz.\nCompatriot Josh Kerr, the 1500m world champion and Olympic silver medallist in Paris, was unable to run in the night's final event, the men's mile, after falling ill.\nHowever, America's Yared Nuguse ensured there was a fitting end to the 117th edition of the meeting by winning with a new world indoor record time of 3:46.63.\nEarlier, Grant Fisher also set a new world record when beating Olympic 1500m champion Cole Hocker in the 3,000m.\nThe US pair duelled throughout the race before Fisher, the 5,000m and 10,000m bronze medallist in Paris, passed compatriot Hocker on the final turn.\nHe won with a time of seven minutes 22.91 seconds - beating a record set by Ethiopia's Lamecha Girma in 2023.\nHocker crossed the line in 7:23.14 - also beating Girma's previous record of 7:23.81.\n\"That was a battle for the ages right there,\" said Fisher.\nElsewhere, Olympic 100m hurdles champion Masai Russell won the 60m hurdles in a world-leading 7.76secs before Dylan Beard also set a world-leading time of 7.38secs in the men's 60m hurdles.\nThe men's 60m was won by Marcellus Moore in 6.56secs, with Jacious Sears' world-leading time of 7.02secs landing her victory in the women's 60m.", "url": "https://www.bbc.com/sport/athletics/articles/cj91gyly7e7o"}