{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:03:41", "date_modify": "2025-05-20 12:03:41", "date_publish": "2023-08-05 13:47:13", "description": "In Karen Bardsley's latest column, the former England goalkeeper discusses why the Women's World Cup is the most competitive it's ever been.", "filename": "sport_football_66391961_1747742621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C942/production/_130622515_bbc-sport-project-chameleon-columnist-banner--b1833022-f778-4f79-b2e5-5173f6dff937.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66391961_1747742621.html", "title": "Karen Bardsley: Why this Women's World Cup is more open than ever", "title_page": "Karen Bardsley: Why this Women's World Cup is more open than ever - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This has definitely been the most competitive and exciting Women's World Cup I've ever seen.\nThe gap has closed from the bottom to the top. Something special is happening in this tournament. Will we see a first-time champion crowned?\nHigher-ranked nations like the USA have found it difficult to impose themselves on the lower-ranked teams but still squeaked through the group stages. They had to grind out results but in previous years we know they have turned up the heat in the knockout stages.\nBut if footballing giants Germany can get knocked out in a group with Colombia, Morocco and South Korea, it proves it's the most competitive World Cup ever.\nSo how did we get to this point?\nFirstly, some federations are starting to understand that by investing in women's football they can see a huge improvement really quickly. Increased visibility helps and you just have to look at the investment being made in the Women's Super League with the free-to-air broadcast deals.\nI also think the perception of women's football is becoming more popular globally. By challenging conventions, female footballers are feeling more empowered than ever before.\nGenerally, the quality of football has improved so much at this World Cup too. There's been a tactical and technical evolution. Coaches are making interesting decisions and the level of defending, goalkeeping and transitional play has been better. Games are more intense and we've seen these unexpected results.\nTeams who are more adaptable are starting to get a competitive advantage so coaches need to be more creative.\nWe are no longer seeing a Thailand team getting thrashed by the USA like we did in 2019.\nColombia and Jamaica both said they were not just here to make up the numbers and a few teams have echoed that sentiment.\nSometimes you hear that line and don't really believe it. But it felt different this time when they said it. They knew they had really talented players and could do something special.\nI'll be honest, I wasn't expecting Jamaica to do as well as they did - keeping out Brazil to qualify for the last 16 for the first time - but they showed belief.\nThe speed of the game has been improving for a few years but now it has gone through the roof. Colombia, for example, have massively impressed me with their intensity.\nI covered their 2-0 win over South Korea and thought it would be tight. Colombia played South Korea off the park! Their number nine Mayra Ramirez was so effective. I knew 18-year-old Linda Caicedo was good - but I didn't realise she was that good...\nI find it so fascinating to learn how these nations have prepared for the World Cup. Morocco realised a few years ago they could potentially qualify so went and found players that had Moroccan heritage and would represent the nation proudly despite not playing in their domestic league. They were clever with how they built their squad and they invested.\nCoaches elsewhere now have more experience at the higher level and we are starting to see them work out ways to stop the main threats of the bigger nations.\nDefending has become more stable too. Teams realise they might not score loads of goals so have become resolute and structured. That's what brings success in a tournament.\nThe USA were heads and shoulders above everyone else in the physical side of the game. But tactically, they haven't been up there.\nIt has taken time, but the physicality of the European game has caught up and we have seen that it has with the Asian and Central American teams too.\nI grew up playing in the USA and there has always been this culture of unquestionable and unshakeable belief in their abilities.\nThey have improved technically but I don't see how this USA team are working together now. When England beat China 6-1 on Tuesday, you could see the consciousness in players' decisions. They thought about where their team-mates might go next. It's less predictable to play against.\nThe USA are getting left behind tactically now and maybe they didn't realise just how good everyone else is.\nGermany were knocked out after they had a very shaky start against South Korea, who capitalised on poor defending. They tried to force passes and when Plan A failed, there wasn't much of a Plan B.\nTheir exit has started debates about different tactics and has opened up unexpected paths in the draw with other top teams now avoiding each other until later on.\nIt also generates momentum and belief in those lower-ranked nations. They can compete and beat the top teams. There's a real opportunity for them to win the World Cup and inspire people back home.\nOverall, there have been plenty of warning signs and other top teams should respond. But it shows the quality of football across the world has increased significantly in a very short space of time.\nJust imagine if everyone had the same resources…\nWith the USA struggling and Germany out, Japan are one of the teams who have really stood out for me so far.\nI didn't expect them to go out and beat Spain 4-0 in the manner they did. Spain's 3-0 win over Costa Rica got everyone talking early on but they also missed loads of chances.\nHowever, Japan have been so, so impressive. They look absolutely rapid in wide areas, have confidence in their game plan and were able to switch formations against Spain.\nWe've not really seen Spain struggle with being overloaded before because a lot of teams are not able to possess the ball as efficiently as Japan did. They had 23% possession against Spain and scored four goals from five shots on target!\nTo do it on that stage against Spain was a huge shock and sent waves around the women's football community. It goes to show that just because you keep possession, you don't always control the game.\nFormer England goalkeeper Karen Bardsley was talking to BBC Sport's Emma Sanders.", "url": "https://www.bbc.com/sport/football/66391961"}