{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 03:50:17", "date_modify": "2025-05-21 03:50:17", "date_publish": "2025-04-07 11:24:16", "description": "Captain Virgil van Dijk says there has been \"progress\" in talks over a new deal with Liverpool.", "filename": "sport_football_articles_cjwv20lq77do_1747799417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b929/live/9ea43770-13a1-11f0-8c3e-ab5924cb0c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjwv20lq77do_1747799417.html", "title": "Liverpool captain Virgil van Dijk says progress made over deal", "title_page": "Liverpool captain Virgil van Dijk says progress made over deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Virgil van Dijk says there has been \"progress\" in negotiations with Liverpool over a new contract.\nThe 33-year-old is out of contract at the end of the season and the centre-back said in March he had \"no idea\" if he would remain at Anfield.\nThe defender is one of three high-profile Liverpool players to be nearing the end of their deals, with Mohamed Salah and Trent Alexander-Arnold also yet to sign extensions.\nBut, speaking to reporters following the 3-2 defeat at Fulham on Sunday, Van Dijk was more positive about the prospect of staying at the club.\n\"There is progress, yeah,\" said the Netherlands captain.\n\"I don't know [if I'll stay], we'll see. Listen, these are internal discussions and we'll see.\n\"I love the club, I love the fans and they were there for us again and we wanted to reward them.\n\"But I want them to be there on Sunday again [at home to West Ham United] and make the stadium an amazing venue like always for us.\"\nLiverpool have an 11-point lead at the top of the Premier League despite their defeat in west London.\nThe Craven Cottage loss was only Liverpool's second league defeat of the season and their first in 26 matches.\n\"It was a poor day at the office for all of us,\" Van Dijk added.\n\"There were individual moments that should have been dealt with better. It was not acceptable as a team.\"\nVan Dijk joined Liverpool in a £75m deal from Southampton in 2018.\nHe has scored 26 goals in 323 appearances for the Reds and was the key defender as Jurgen Klopp's side won the Premier League, the Champions League, the FA Cup and the EFL Cup twice.", "url": "https://www.bbc.com/sport/football/articles/cjwv20lq77do"}