{"authors": ["Ben Marvell", "www.facebook.com"], "date_download": "2025-05-21 04:30:41", "date_modify": "2025-05-21 04:30:41", "date_publish": "2025-01-05 17:15:56", "description": "Defending Premiership champions Northampton Saints beat current leaders Bath 35-34 in a scintillating match at Franklin's Gardens, with Fin Smith settling the outcome with the last kick.", "filename": "sport_rugby-union_articles_cn4xn872kkgo_1747801841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/feaf/live/0333ac00-cb8d-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn4xn872kkgo_1747801841.html", "title": "Northampton 35-34 Bath: Saints beat leaders Bath with last kick of the game", "title_page": "Northampton 35-34 Bath: Saints beat leaders Bath with last kick of the game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reigning Premiership champions Northampton Saints edged current leaders Bath with the final kick of a sensational match at Franklin's Gardens.\nIn a repeat of last season's Premiership final, Saints piled on the pressure in a breathless first half with early tries from Josh Kemeny, captain Fraser Dingwall and James Ramm.\nJoe Cokanasiga and Orlando Bailey responded for Bath before George Hendy got Saints' fourth score.\nThe visitors came back into the match with tries from Will Stuart, Max Ojomoh and a second from Cokanasiga before a last-minute penalty from Fin Smith sealed a dramatic win for the hosts.\nBath remain top, six points ahead of Bristol, while Northampton stay eighth, 15 points clear of next-to-bottom Exeter.\nIt took the home side less than two minutes to get on the scoreboard, as full-back Hendy exploited space down the touchline before the ball made its way to Kemeny, who escaped the final Bath tackler to touch down beyond the posts.\nWith the wind in their sails, Saints struck again almost immediately.\nSmith recovered his own kick into the Bath 22, and with the defence stretched, scrum-half Alex Mitchell fed Dingwall to go over untouched.\nBath were shocked as Ramm powered through a gap between defenders and arced away from the covering Bailey to score the home side's third try in fewer than 15 minutes.\nBut, the visitors regained their composure and responded quickly.\nAfter patient work from fly-half Finn Russell and Bailey, Cokanasiga found just enough space to touch down in the corner.\nAs the penalty count rose for the home side, Bath scored again.\nRussell played a perfect pass to fix the Saints' defence, allowing Bailey to power his way through to the line.\nBut, Phil Dowson's men proved relentless in attack and scored a deserved fourth try before the break as Hendy followed up a kick through by the inspired Smith.\nLooking to close the gap, Bath rang the changes early in the second half, and it soon paid dividends.\nStuart crashed over from the short range following a period of sustained pressure on the Saints' line for the away side's third try.\nFollowing further sustained pressure in the host's 22, Ojomoh fought his way over following a brilliant offload from Sam Underhill before Bath got their noses in front for the first time through Cokanasiga.\nRory Hutchinson's kick was charged down by Miles Reid, who fed the flying winger to run in from the halfway line.\nSmith and Russell traded penalties as the lead changed hands three times in the final 10 minutes. At 34-32 ahead, Bath looked set a remarkable comeback success, only for Smith to give Saints the final say and extend the visitors' long wait for a victory at the Gardens.\nBath head coach Johann van Graan told BBC Radio Bristol:\n\"That was some game. It's always gutting to lose with the last play of the game.\n\"The game is 80 minutes long, they started very well, we came back, they came back, we dominated the second half, they got in front with two mins to go with a decision at the back end of the game. If that call goes the other way, we're victorious.\n\"There's not too much to comment on in terms of the decision, that's the call the referee makes, from my side, we'll take the two points and move on.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cn4xn872kkgo"}