{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 11:57:43", "date_modify": "2025-05-20 11:57:43", "date_publish": "2023-08-06 11:00:12", "description": "England captain Millie Bright promises to ensure she is \"always showing up\" during matches to encourage her team-mates to \"express themselves\".", "filename": "sport_football_66420385_1747742263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F2F4/production/_130669126_gettyimages-1593302946.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66420385_1747742263.html", "title": "Women's World Cup 2023: Millie Bright - England captain promises to lead by example", "title_page": "Women's World Cup 2023: Millie Bright - England captain promises to lead by example - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England captain Millie Bright says she wants to lead by example to give her team-mates confidence to \"express themselves\" at the Women's World Cup.\nBright, 29, took over the armband from injured defender Leah Williamson, who led the team to Euro 2022 glory.\nThe Chelsea centre-back had captained England on several occasions before arriving in Australia and New Zealand.\n\"It's part of my pride that first and foremost I [show up] and everyone can follow,\" said Bright.\n\"It's always showing up, making sure everyone's got the confidence and the mentality to step out and play their game, express themselves, show who we are and who they are on the pitch.\n\"When the going gets tough, [you] keep the belief, keep the calmness, and always find a way to win.\"\nBright led the team out for their 1-0 opening victory over Haiti on 22 July, having not played a competitive match since March because of a knee injury.\nShe has since led England to three wins from three group games and is set to wear the armband again for their last-16 tie with Nigeria in Brisbane on Monday.\nOn being the captain, Bright said: \"I think it will hit me after the tournament. I'm really in the moment. After previous tournaments, it's not until afterwards that I feel the emotions.\n\"I'm obviously unbelievably proud to lead the girls out each time but I think I will take some time to reflect just after.\"\nBright added that she takes inspiration from John Terry, the former England captain who led Chelsea to significant success but also encountered controversy.\nTerry, Chelsea's most successful captain in terms of trophies, won five Premier League titles, five FA Cups, three League Cups, the Champions League and the Europa League during his 19 years at Stamford Bridge.\nIn 2012, he was found guilty by the Football Association of racially abusing QPR defender Anton Ferdinand, receiving a £220,000 fine and a four-match ban. Three months earlier, he had been cleared in a criminal case of a similar charge.\n\"JT was a big one for me - the way he carried himself and always stepped out on the pitch fearless,\" said Bright.\n\"Every team he's played in, I think he's done that and he's led by example. His actions have spoken louder than his words. Off the pitch, I think he's a great human, he's very caring.\"\nIn the build-up to the tournament, there was speculation surrounding Bright's fitness after she was injured in the Women's Champions League semi-final defeat by Barcelona.\nShe missed April's friendly draw with Australia - England's final warm-up match - and says she had to go through \"brutal\" rehabilitation to make sure she was fit for the World Cup.\n\"The running was brutal... When you have a short space of time, it's just about making sure you get up to speed,\" said Bright.\n\"I've got an unbelievable medical team behind me that had put me through all the tests that I needed to step out on to the pitch safely and in the right shape to compete.\n\"There was a lot of hype around [my injury], which I tried to keep quiet. I knew I'd put myself in a position where I could compete and play 90-minute games back-to-back.\n\"That's my mentality and character but my rehab was brutal and I was put through my paces to make sure I could withstand it.\"\nBright was understandably rusty in the victory over Haiti, her first game in four months, but earned plaudits for her display in the 6-1 thrashing of China that completed England's group-stage programme.\nShe says she had blocked out any criticism from earlier in the tournament.\n\"I'm not on social media for that exact reason,\" Bright said. \"It's football, everyone's going to have an opinion, but the only ones that are going to matter are the ones that are within our team and our staff.\n\"We have 'controllables' which are our training and our mindsets when we step out on that pitch. We give absolutely everything for that badge and all you can do is give your best.\n\"We're not perfect humans. We all make mistakes. It's going to happen.\"\nHowever, Bright welcomes criticism in the women's game, acknowledging it's a chance to \"grow and develop\".\n\"I think you have to have it. It's like any sport or anything in life - you [in the media] probably get criticism as well,\" she added.\n\"It's about what you do with that criticism. You can either let it get you down, disrupt you and damage you or you can take little bits from it and think 'maybe I can use that'. You need it and it's part of the game.\"", "url": "https://www.bbc.com/sport/football/66420385"}