{"authors": ["Calum Macdonald", "www.facebook.com"], "date_download": "2025-04-26 03:51:26", "date_modify": "2025-04-26 03:51:26", "date_publish": "2025-03-05 11:55:43", "description": "ahksjhg", "filename": "sport_articles_cjd3244mr3go_1745639486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6e8/live/8cfd1670-f9b8-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cjd3244mr3go_1745639486.html", "title": "ahksjhg", "title_page": "ahksjhg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In reference to the recent controversy following his side's match against Galatasaray, Mourinho says: \"On the pitch there have been difficult moments. We always respect our opponents, so yes we've had problems on the pitch. Outside of the pitch, I don't think we have had a difficult moment.\"\nMourinho refused to answer when asked about sacked Rangers manager Philippe Clement's criticism of his \"defensive\" style of play.\nHe believes it will be \"much more difficult\" against a Rangers side led by \"pragmatic\" Barry Ferguson rather than Clement because the Belgian was \"much more worried about philosophy rather than results\".\nOn interim boss Ferguson, he adds: \"I don't know a lot about his career as a coach, but I respect the emotional connection between him and his club. I think that's a very important thing, the connection.\"\nHis time in Scotland doing his coaching badges was fantastic for him both professionally and personally, but Mourinho says his visit wasn't great for the Largs pubs as he only drank sparkling water.\n\"Why not\" was his response when asked if he'd like to manage in Scotland, but he pointed out that he has a job which excites him and his focus is only on that.\nAsked if he still gets Rangers fans thanking him for beating Celtic in the 2003 Uefa Cup final with Porto, Mourinho said: \"Not in Turkey as I've not seen a Scottish person. Maybe tonight or tomorrow. But yes, in London and in the south of Portugal some Rangers fans come up to me. That was my first big European final but I have respect for both big clubs.\"", "url": "https://www.bbc.co.uk/sport/articles/cjd3244mr3go"}