{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:31:06", "date_modify": "2025-05-20 14:31:06", "date_publish": "2023-07-28 21:48:32", "description": "Bayern open talks with Brentford for David Raya, Spurs want Bayern's Mathys Tel in Harry Kane talks, Chelsea want Michael Olise, plus more.", "filename": "sport_66341030_1747751466.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/257D/production/_130579590_-36baee14-2867-4cf6-8137-fd43f3779b95.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_66341030_1747751466.html", "title": "Saturday's gossip: Raya, Mane, Kane, Lukaku, Olise, Amrabat, Van de Beek, Dembele", "title_page": "Saturday's gossip: Raya, Mane, Kane, Lukaku, Olise, Amrabat, Van de Beek, Dembele - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bayern Munich have opened talks with Brentford over a deal for their 27-year-old Spain goalkeeper David Raya, with the German champions' Switzerland keeper Yann Sommer, 34, discussing a move to Inter Milan. (Sky Sports), external\nTottenham have rescheduled a meeting with Bayern officials for Monday to discuss the potential sale of England forward Harry Kane, 30, after planned talks for Friday were cancelled. (Mail), external\nSpurs are going to use their talks with Bayern over Kane to discuss their interest in the German club's 18-year-old French forward Mathys Tel. (Telegraph - subscription required), external\nChelsea have rejected Juventus' loan approach for Belgium striker Romelu Lukaku, 30, because they want to sell him permanently. (Tuttosport - in Italian), external\nChelsea are interested in three attacking midfielders - Crystal Palace's France Under-21 international Michael Olise, 21, Lyon's French 19-year-old Rayan Cherki and Ajax's 22-year-old Ghana international Mohammed Kudus. (Football London), external\nManchester United may move for Fiorentina and Morocco's Sofyan Amrabat, 26, or another defensive midfielder towards the end of the transfer window should the club raise enough finance from player sales. (Guardian), external\nReal Sociedad are in talks over signing Donny van de Beek on loan from Manchester United with an option to buy the Netherlands midfielder, 26. (Marca - in Spanish), external", "url": "https://www.bbc.com/sport/66341030"}