{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:13:33", "date_modify": "2025-04-26 08:13:33", "date_publish": "2025-02-26 11:23:23", "description": "Liverpool vs Newcastle predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cm2y7zl8ve0o_1745655213.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2y7zl8ve0o_1745655213.html", "title": "Liverpool vs Newcastle predictions: Chris Sutton on Premier League game", "title_page": "Liverpool vs Newcastle predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This fixture has plenty of history behind it - Liverpool's 4-3 win at Anfield in 1996 will always be remembered as a Premier League classic.\nNewcastle come into it in good shape after a good win over Nottingham Forest, but the way Liverpool beat Manchester City was extremely impressive.\nIt was such a mature performance by Arne Slot's side to soak up City's possession and be so clinical in front of goal.\nWe know by now that Slot's side will be hard to beat, while Newcastle are still quite up and down - they were very poor when they went to Etihad Stadium last week.\nThey are capable of giving Liverpool a good game but I am going to say that the leaders will take the points and carry on their title charge.\nAlong with Forest striker Chris 'The Wood Chopper' Wood, Newcastle's Alexander Isak has been one of the best players in the Premier League this season, but there is only one candidate to be crowned player of the year.\nLiverpool's Mohamed Salah's numbers are extraordinary and he looks as hungry as ever. He has been relentless, and he is not done yet.\nSutton's prediction: 2-1", "url": "https://www.bbc.co.uk/sport/football/articles/cm2y7zl8ve0o"}