{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:40:32", "date_modify": "2025-04-26 07:40:32", "date_publish": "2025-02-27 12:08:23", "description": "TKO Group Holdings, which owns the UFC and WWE, says it is \"close to an agreement\" to form a new boxing league funded by Saudi Arabia.", "filename": "sport_boxing_articles_clyzzn36zepo_1745653232.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/72f9/live/4c3a7490-f4fc-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_clyzzn36zepo_1745653232.html", "title": "UFC & WWE owners 'close' to Saudi deal for boxing league", "title_page": "Boxing: UFC & WWE owners 'close' to Saudi deal for boxing league - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "TKO Group Holdings, which owns the UFC and WWE, says it is \"close to an agreement\" to form a new boxing league funded by Saudi Arabia.\nIt has been reported Saudi Arabian investors are keen to form a league after investing significantly to regularly host heavyweight fights including Tyson Fury, Anthony Joshua and Oleksandr Usyk in the kingdom.\nThe UFC and WWE hold events in Saudi, as do boxing promoters Matchroom and Queensberry, and TKO president and chief operating officer Mark Shapiro told investors on Wednesday about the possible boxing deal.\n\"We are close to an agreement with the Saudis on a creation of a boxing league where TKO would be the producer, the promoter and responsible for all day-to-day operations of the venture, whereby we would receive a fee of $10m (£7.8m) plus,\" Shapiro said.\n\"We're not putting any money in, we're not putting any capital in, we're not on the hook for any [costs].\"\nIt is unclear what the league would look like and who would compete in it, with most of boxing's biggest stars under contract with key promoters such as Eddie Hearn's Matchroom, Bob Arum's Top Rank and Frank Warren's Queensberry.\nShapiro also said TKO would be responsible for overseeing \"four large scale super-fights\" across 2025 and 2026.\n\"Those may or may not fall into the boxing league itself, they may just be one-offs, but we would be paid a fee to act as the promoter, the producer and the event operator,\" he said.\nTurki Alalshikh, chairman of Saudi Arabia's general entertainment authority, has been the face of Saudi involvement in boxing in recent years.\nSaudi influence over the sport has increased significantly, with many of boxing's biggest events taking place in the kingdom including Fury's two bouts against Usyk in 2024.\nEvents have also taken place outside Saudi under the 'Riyadh Season' banner, one in Los Angeles headlined by Terence Crawford and one at Wembley Stadium headlined by Daniel Dubois.\nSaudi Arabia has spent about £5bn in sport since 2021 - saying the investment is being used to diversify the economy away from a dependency on oil.\nCritics suggest Saudi's investment in sport is to gain legitimacy and deflect attention from controversy over its human rights record, a practice known as 'sportswashing'.\nCreation of a boxing league would further increase the involvement in boxing of Saudi Arabia, which through the Public Investment Fund - the kingdom's sovereign wealth fund - has created its own golf circuit, the LIV Golf League.\nMatchroom and Queensberry refrained from making any comment on TKO when asked about the possibility of the new league and BBC Sport has also contacted Riyadh Season.", "url": "https://www.bbc.co.uk/sport/boxing/articles/clyzzn36zepo"}