{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:43:56", "date_modify": "2025-05-20 12:43:56", "date_publish": "2023-08-03 13:47:58", "description": "Arsenal goalkeeper Aaron Ramsdale says he wants football to be \"welcoming for everyone\", allowing his brother, who is gay, to attend matches without fear of abuse.", "filename": "sport_football_66394989_1747745036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7605/production/_130631203_gettyimages-1494088701.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66394989_1747745036.html", "title": "Aaron Ramsdale: Arsenal and England goalkeeper pledges to call out homophobia in football", "title_page": "Aaron Ramsdale: Arsenal and England goalkeeper pledges to call out homophobia in football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal goalkeeper Aaron Ramsdale says he will no longer stay quiet when he encounters homophobic comments in dressing rooms and on social media.\nThe 25-year-old said he wants football to be \"welcoming for everyone\" so his brother, who is gay, can attend matches without fear of abuse.\nWriting for The Players' Tribune, external, he added he \"felt bad\" for the Tottenham fan who assaulted him in January.\nRamsdale revealed his wife had suffered a miscarriage three days earlier.\nThe England international signed a new long-term contract with Arsenal in May, following a season in which he played all 38 Premier League games during runners-up Arsenal's title challenge.\nHe said that while he had never openly discussed his brother's sexuality before, he felt it was the right time to do so \"with everything going on in football right now\".\nIn July, a Fulham fan was banned from football for three years after admitting a public order offence relating to homophobic chanting, the same reason that Wolves were recently fined £100,000, with \"a large number of supporters\" involved.\n\"I want this game I love to be a safe and welcoming place for everyone,\" said Ramsdale.\n\"I want my brother, Ollie - or anyone of any sexuality, race or religion - to come to games without having to fear abuse.\n\"Over the years, I've probably bit my tongue a few too many times whenever I hear homophobic comments or stupid things being said.\n\"I think maybe my brother has done the same, thinking it would make my life easier. All that ends today.\"\nA man was banned from football matches for four years after he kicked Ramsdale in the back at the north London derby at Tottenham Hotspur Stadium earlier this year.\nReflecting on that incident, Ramsdale said he felt bad for the individual, whom he believes would not have behaved that way had he been aware of what he was going through at the time.\nDuring a six-hour flight back to London from a post-World Cup holiday a few days before the match, Ramsdale's wife suffered a miscarriage.\n\"There's really no way that I can describe the pain of that six-hour flight back to London, even now,\" he said.\n\"I just want people out there to know that they're not alone if they're going through it themselves.\"\nHe added: \"The last few years especially, you see so much negativity and toxicity in football. Whether it's on social media or at the grounds, it feels like a lot of people have lost all perspective.\"\nRamsdale praised Arsenal manager Mikel Arteta for the support he offered.\n\"Even in the middle of the title race, with so much pressure on the club, he asked me if I needed some time off to deal with everything,\" he said.\n\"Mikel went above and beyond to make sure me and my family were OK. For me, that's a manager.\"", "url": "https://www.bbc.com/sport/football/66394989"}