{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:49:58", "date_modify": "2025-05-21 06:49:58", "date_publish": "2025-04-02 00:00:00", "description": "Southampton are denied just a third Premier League win of the season as Crystal Palace score in injury time to snatch a draw.", "filename": "sport_football_live_c70w0117e1jt_1747810198.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed9b/live/063eea00-1006-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c70w0117e1jt_1747810198.html", "title": "Southampton 1-1 Crystal Palace: Saints denied rare Premier League win by late goal", "title_page": "Southampton 1-1 Crystal Palace: Saints denied rare Premier League win by late goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton were denied just a third win of the season as Crystal Palace scored at the death to snatch a draw at St Mary's.\nPaul Onuachu looked to have earned the home side a first Premier League win in two months, but substitute Matheus Franca headed a stoppage-time equaliser to add to Southampton's woes.\nSaints head coach Ivan Juric and goalkeeper Aaron Ramsdale both spoke this week of the importance of beating Derby County's points tally of 11 from the 2007-08 season, which remains the lowest since the Premier League's inception.\nThey remain one point shy of that total after this 30th game of their dismal campaign.\nSouthampton were fortunate that Palace forward Jean-Philippe Mateta's second-minute effort hit the bar and not the back of the net, but the hosts were the better side in the first half and played like a team eager to avoid making unwanted history.\nKamaldeen Sulemana and Kyle Walker-Peters made Palace aware of Southampton's intentions with positive early runs, while Mateus Fernandes knitted play together in the final third.\nOnuachu was brought into the starting XI after scoring from the bench in a defeat by Wolves before the international break, and he repaid Juric in the 20th minute by giving the home side the lead.\nThe Nigerian striker met Fernandes' deep cross with a powerful header that Dean Henderson could only palm into the bottom corner, when the England goalkeeper might have done better.\nRamsdale preserved the lead 15 minutes later with a superb low stop following a swivel and shot from Mateta, before Onuachu dragged wide at the other end after running on to a wayward pass from Marc Guehi.\nThe 30-year-old Southampton frontman could have had a hat-trick before the break. From another chance, he could not quite reach Walker-Peters' teasing cross at the far post.\nPalace improved in the second half and should have equalised through Eberechi Eze, but the England winger hit the side-netting following Ismaila Sarr's driving run.\nJan Bednarek almost undid Southampton's good work with a short pass back to Ramsdale, but the goalkeeper managed to reach it before Palace substitute Eddie Nketiah.\nPalace have enjoyed a strong campaign since failing to win in their opening eight games, and their persistence paid off when Franca beat Ramsdale in the second added minute with a near-post header.\nThe draw at least ended Southampton's nine-game losing streak at home in the league, while Juric avoided becoming only the third boss to lose their opening seven home games in the Premier League.\nSouthampton remain bottom of the table, now with 10 points, and are 19 points adrift of safety with eight games left.\nPalace sit 12th, three points above Manchester United.\nPalace endured a miserable start to the season, drawing three and losing five of their opening eight games to leave them wedged in the relegation zone.\nSince October, however, Glasner has turned things around. That has been illustrated by his side's run to the FA Cup semi-finals and surge up the league ladder.\nPalace have now taken 37 points from their past 21 league games, a points-per-game return of 1.76. Such a record over a 38-game season would mean them collecting 67 points, which last year would have been good enough to finish fifth and secure a place in the Europa League.\nRemarkably this was the first time since 18 December that Palace had conceded away from home in any competition, a run of seven clean sheets.\nPalace were far from their best, but this disappointing night will soon be forgotten.", "url": "https://www.bbc.com/sport/football/live/c70w0117e1jt"}