{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:53", "date_modify": "2025-05-21 04:34:53", "date_publish": "2025-04-04 18:27:39", "description": "Glenavon manager Paddy McLaughlin says he expects the Lurgan Blues to be challenging for a place in the top six and in cup finals next season after securing their Premiership status.", "filename": "sport_articles_ce829rn5e69o_1747802093.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c96f/live/850c0630-10b8-11f0-a687-87f1851e5d51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce829rn5e69o_1747802093.html", "title": "'We don't want to be fighting for our lives next year' - McLaughlin", "title_page": "Irish Premiership: 'We don't want to be fighting for our lives next year' - McLaughlin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glenavon manager Paddy McLaughlin has emphasised that the club's ambitions for next season will be much higher than just Premiership survival after they banished any lingering relegation fears by picking up a point in Tuesday's 1-1 draw with mid Ulster derby rivals Portadown at Shamrock Park.\nMcLaughlin took over the reins at the Mourneview Park outfit in mid-November with the club languishing perilously close to the drop zone following Stephen McDonnell's departure from the club.\n\"I said to the players after Tuesday night, congratulated them on getting themselves out of trouble, on getting us out of the relegation zone and securing our status but it wasn't something to be celebrated.\n\"We patted them on the back for that but it's not a position we want to be in year on year. You want to climb the division, you want to compete against the top sides.\n\"There's no reason why not, the potential at Glenavon is incredible and it's up to us to deliver more on the pitch.\"\nMcLaughlin explained that top flight survival had been his primary objective when he took charge of the club but expectations would be raised for next term.\n\"We always aim high, we are ambitious as a club. But when we came to the club our first mission was to survive because Glenavon were in a bad place,\" reflected the former Cliftonville boss.\n\"They had three wins from 18 league games and were four points off the bottom of the league.\n\"We were definitely in a relegation fight and we have pulled away from that. From being four points ahead of them we're now 21 points ahead of Loughgall.\n\"Carrick were ahead of us on goal difference with a game in hand and we're now 13 points ahead of them. That swing is incredible and the players deserve all the credit in the world.\"\nMcLaughlin added that his side had shown themselves capable of competing with the top teams in the league in individual games but \"it was not good enough to be fighting for survival\".\n\"The club and the supporters deserve more and it's up to me and the players and the staff to improve that.\n\"Next year we don't want to be fighting for our lives come the run-in, we want to be in the top six, challenging for Europe and getting into cup finals.\n\"We're more than capable of doing it, it's maybe just that bit of belief.\"", "url": "https://www.bbc.com/sport/articles/ce829rn5e69o"}