{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:55:12", "date_modify": "2025-05-21 04:55:12", "date_publish": "2025-04-04 14:42:13", "description": "Oliver Glasner press conference: Crystal Palace vs Brighton preview", "filename": "sport_football_articles_cq5wl89jw1go_1747803312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8249/live/031e5ce0-6de3-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5wl89jw1go_1747803312.html", "title": "Oliver Glasner press conference: Crystal Palace vs Brighton preview", "title_page": "Oliver Glasner press conference: Crystal Palace vs Brighton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On if Chris Richards will feature at the weekend: \"No, unfortunately. It was very close. He was outside on the pitch today for a short session but he's not 100%. If it was the last game of the season he would have started, but we can't take the risk when you see our schedule. We took the decision not to take the risk.\"\nOn speculation linking him to the vacant manager's role at Bundesliga side RB Leipzig: \"I'm very happy, but I'm not happy with all the stories. I don't read all these stories, but my mum messaged me and she said: 'I don't know. I have to read so much. I don't know where to start and where to end, I can't sleep any more'. I said: 'Come on, you are in your 70s, and it's not worth reading all this stuff.' So nothing to tell from my side. The only guy I was talking to in the last week was [Palace chairman] Steve Parish. No-one else.\"\nOn the midweek draw with Southampton: \"Sometimes you maybe need this experience to learn from it. I'm pretty sure the players will be ready for a great derby game at Selhurst.\"\nOn fixture rearrangements: \"It's great, we play two teams in the quarter-finals of the Champions League so it feels like we are also in the quarter-finals. We face these teams within three days, and we will give our best in both games.\"\nOn if he believes the Arsenal game is too close to their FA Cup semi-final against Aston Villa: \"There was obviously no other date possible for the Arsenal game. It was a very busy January and February, a very relaxed March and we look forward to a busy April and May. We are playing in two competitions which is what we wanted.\"", "url": "https://www.bbc.com/sport/football/articles/cq5wl89jw1go"}