{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:39", "date_modify": "2025-05-21 04:53:39", "date_publish": "2025-04-04 15:25:36", "description": "Sheffield United midfielder Vini Souza returns to training and will be available for their upcoming match against Oxford on Saturday (15:00 BST).", "filename": "sport_football_articles_cly17vk4d1ro_1747803219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12b1/live/83e7be50-1164-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly17vk4d1ro_1747803219.html", "title": "Sheffield United: Vini Souza returns for Oxford United match", "title_page": "Sheffield United: Vini Souza returns for Oxford United match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United midfielder Vini Souza has been in \"training all week\" and will be available for their match against Oxford United on Saturday (15:00 BST).\nThe Brazilian has missed the past three league games for the Blades with a hamstring issue.\n\"To have Vini back in is a massive boost,\" boss Chris Wilder told BBC Radio Sheffield.\n\"We are in a good spot. Everybody wants their team to be fit and healthy.\"\nSouza returns alongside midfielder Jamie Shackleton, with both Tom Davies and right-back Harry Clarke due back within the next week.\nBut questions have begun to arise about the players out of contract at the end of the season - including striker Rhian Brewster.\nBrewster joined the Blades in 2020 but has spent much of his time in the recovery room.\nHowever, the 25-year-old has been impressive lately, scoring in both his past two league matches.\n\"You have to do what's right for the football club and Rhian has do what's right for himself,\" Wilder said.\n\"I'd like to think with his reaction and how he's been and how he's been around the place and his attitude towards everything, he wants to stay here.\n\"As far as I'm concerned, I don't see a player who doesn't see his immediate medium term future at Sheffield United but, as you know, contract situations and talks can become quite complicated.\"", "url": "https://www.bbc.com/sport/football/articles/cly17vk4d1ro"}