{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:46", "date_modify": "2025-05-21 05:45:46", "date_publish": "2025-01-14 12:42:14", "description": "Former Manchester City captain Tony Book dies at the age of 90.", "filename": "sport_football_articles_ckgr0ely6geo_1747806346.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22e5/live/c8f4a540-d28e-11ef-9b53-b56bc9bcdc17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgr0ely6geo_1747806346.html", "title": "Tony Book: Manchester City legend dies aged 90", "title_page": "Tony Book: Manchester City legend dies aged 90 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Manchester City captain Tony Book has died at the age of 90.\nOne of the most successful players in the club's golden era of the late 1960s and early 1970s, Book won domestic and European honours as a player and a manager.\nHe began wearing the armband in 1967 and led the club to the First Division title in 1968, the FA Cup in 1969 and the double success of the League Cup and European Cup Winners' Cup a year later.\nBook moved into management in 1974 and guided City to a further League Cup triumph in 1976. He was in charge until 1979.\nThe 'bricklayer from Bath' - a nod to his apprenticeship days - started his career at 1956 in non-league football with Bath City, where he made 387 appearances and captained the side to its first Southern League title.\nHe was 29 years old when he got his first move to Plymouth Argyle, followed by a switch to Maine Road two years later.\n\"For nearly 60 years, Tony helped to shape Manchester City, not just in what he contributed as a player, captain and manager, but in the way he conducted himself,\" City chairman Khaldoon Al Mubarak said.\n\"His hopes and ambitions for his club were matched only by his incredible humility regarding his own significant achievements.\n\"He will forever be remembered by our supporters as a man who helped to lay the foundations upon which unprecedented success could be built.\n\"A player and leader whose outstanding abilities not only helped return us to the peak of English football, but also delivered our first ever European honour.\n\"Tony's devotion to his club meant he was still fulfilling club duties earlier this season. I will miss seeing him at our games enormously, and witnessing first hand the regard in which he is held by every generation of the City family.\"\nAs a mark of respect, flags around Etihad Stadium and City Football Academy are flying at half-mast.", "url": "https://www.bbc.com/sport/football/articles/ckgr0ely6geo"}