{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:10", "date_modify": "2025-04-26 07:39:10", "date_publish": "2025-02-27 13:25:03", "description": "Nottingham Forest 0-0 Arsenal: Pundits react to pivotal result in title race", "filename": "sport_football_articles_cx288n6je3eo_1745653150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7f8/live/31b9ebe0-f494-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx288n6je3eo_1745653150.html", "title": "Nottingham Forest 0-0 Arsenal: Pundits react to pivotal result in title race", "title_page": "Nottingham Forest 0-0 Arsenal: Pundits react to pivotal result in title race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pundits on TNT Sport discussed the impact of Arsenal dropping another two points in Wednesday's goalless draw at the City Ground.\nMartin Keown, former Arsenal and England defender on TNT Sports:\n\"It didn't happen for Arsenal because they had Leandro Trossard, Mikel Merino and a teenager in Ethan Nwaneri playing as the front three. That has crippled the team.\n\"Throughout the team they looked solid, defended really well and it was a solid contest.\n\"They took the game to Nottingham Forest with 65% possession but they could not find the solutions at the top of the team. With the options that they have been left to pick from, that is no surprise.\n\"Just because you can't be champions doesn't mean that you throw it all away. If they don't score goals, there is a danger that they might slip out of the top four.\n\"When you come away with a point you think that is important because it means Forest don't get any closer to catching them.\n\"Rest, recover and then they are away to Manchester United. They must win.\"\nMartin O'Neill, former Celtic manager on TNT Sports:\n\"I cannot see Arsenal catching Liverpool, not at all. First of all Arsenal have to win their games, and that is not a given by any stretch of the imagination.\n\"Also then you are talking about Liverpool dropping points, which they will do because they are involved in a few other competitions.\n\"I think this is the result that finished [the title race].\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx288n6je3eo"}