{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:27:08", "date_modify": "2025-05-21 04:27:08", "date_publish": "2025-01-18 00:00:00", "description": "West Bromwich Albion, watched by new boss Tony Mowbray, come from behind to earn a draw with Stoke, after Nathan Lowe's early strike.", "filename": "sport_football_live_c334e67denlt_1747801628.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c334e67denlt_1747801628.html", "title": "West Bromwich Albion 1-1 Stoke City: Tony Mowbray sees Baggies rescue point", "title_page": "West Bromwich Albion 1-1 Stoke City: Tony Mowbray sees Baggies rescue point - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New West Bromwich Albion boss Tony Mowbray watched his Baggies side rescue a point - their 14th Championship draw of the season - to share the Midlands derby spoils with Stoke City.\nTeenage striker Nathan Lowe scored for Stoke after just nine minutes on his first start since being recalled from loan at League Two leaders Walsall.\nBut Albion, under caretaker boss Chris Brunt for the last time, battled hard to level, finally earning a draw when Grady Diangana finished off Mikey Johnston's cross.\nWhile Brunt exits the hot seat with the Baggies back up to sixth, Stoke have now gone five games without defeat in all competitions - three of them under new boss Mark Robins.\nSuitably enlivened by a lovely on-field pre-match reception for new boss Mowbray, Albion looked bright early on, going closest when winger Tom Fellows darted in from the right and had a well-struck left-foot shot deflected just wide.\nBut Stoke led on nine minutes with a classic poacher's strike.\nJunior Tchamadeu's attempted shot would have gone well wide but, unfortunately for Albion, it flew straight to Lowe on the corner of the six-yard box and he stuck out an instinctive right boot to propel the ball powerfully past Alex Palmer.\nThe Baggies, missing injured top scorer Josh Maja, did have one great chance to level before the break - but the chance fell to midfielder Jayson Molumby, unmarked eight yards out, and he screwed his right-foot shot wide.\nAlbion continued to create after the break as Torbjorn Heggem headed Johnston's cross just over, before Fellows shot too high.\nBut it was not until the 71st minute when they were finally level - and it was no surprise that the supply line was Johnston.\nThe former Celtic winger crossed from the left and Diangana simply wanted it more at the near post, getting there first to steer home from eight yards - only his second goal of the season, to add to Brunt's first game in charge at Derby on Boxing Day.\nAlmost instantly Albion were close to a second when Molumby was denied by Stoke keeper Viktor Johansson, who then saved another low shot from the Baggies midfielder.\nWest Bromwich Albion interim boss Chris Brunt told BBC Radio WM:\n\"We did more than enough to win but, if you can't win, then you just make sure you don't lose. But, looking back we could have won this one and the Swansea game too.\n\"Obviously losing Josh Maja was a blow but, if you want to win games, you have to score goals and we've missed too many chances.\n\"We haven't lost many games but we've had far too many draws. And that's something Tony Mowbray and his staff now have to work on.\n\"There's things he can take from this game. But he's a great manager and the club can only benefit from having him back here.\"\nStoke City boss Mark Robins told BBC Radio Stoke:\n\"I've got to be happy coming here and getting a point. You can tell what a good side they are and why they are up there at this end of the league.\n\"Going a goal up gave us a chance to build some momentum and we were good value for it. Nathan Lowe took his chance really well. I'm so pleased for him.\n\"He's come back full of confidence from scoring goals for Walsall – and they've obviously done a good job with him. He's only 19 and he has so much potential.\n\"When we didn't score a second goal, you're always in danger of conceding and they were doing more attacking than us second half.\"", "url": "https://www.bbc.com/sport/football/live/c334e67denlt"}