{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:33:20", "date_modify": "2025-05-20 13:33:20", "date_publish": "2023-07-26 09:03:25", "description": "MacLean ‘disappointed’ with Saints cup exit", "filename": "sport_articles_cd1424rg4kvo_1747748000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a91e/live/b1a17410-2b8f-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1424rg4kvo_1747748000.html", "title": "MacLean ‘disappointed’ with Saints cup exit", "title_page": " MacLean ‘disappointed’ with Saints cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone manager Steven MacLean says \"we need to bring two or three more signings in at least\" after being left disappointed by Tuesday's 2-1 home defeat by Ayr United - a result that means his side cannot progress from the group stage of the Viaplay Cup.\nHe believes his team needs “to be better in the final third” and insists that will be a key area of focus looking forward to the start of the Scottish Premiership campaign.\n“I think, performance-wise, we dominated the game,\" MacLean told BBC Scotland. \"We should have been 2-0 up before they scored, we gave away a silly free-kick and we didn’t defend the set play well enough then we’re 1-0 down, but we show a good reaction, we score and we come back into the game in the second-half.\n“We created numerous opportunities but didn’t score and we got done with the deflection, but that’s football sometimes - you don’t get what you deserve - but we have to bounce back from it.\n“Effort-wise, endeavour and work-rate, it was all there, but we just need to be better in the final third. We will look to win on Saturday and then build for the league.\n“We’re disappointed. We need to be better in both boxes because that’s where games are won and lost. But we’ll get better. We’ve got four or five injuries and we need to get them back as well and we will improve.\n“We will go back to the training pitch and work hard and we will be better, the injured players coming back will help us and the new signings will add to that.”", "url": "https://www.bbc.com/sport/articles/cd1424rg4kvo"}