{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-04-26 04:21:20", "date_modify": "2025-04-26 04:21:20", "date_publish": "2025-03-03 14:52:45", "description": "Andy Murray will reprise his coaching role with Novak Djokovic at Indian Wells and stay with the 24-time major champion for the Miami Open.", "filename": "sport_tennis_articles_cx2ge1z5gv2o_1745641280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9b6/live/c1f3ba00-f837-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_cx2ge1z5gv2o_1745641280.html", "title": "Novak Djokovic and Andy Murray to resume coaching partnership in Indian Wells and Miami", "title_page": "Novak Djokovic and Andy Murray to resume coaching partnership in Indian Wells and Miami - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Andy Murray will reprise his coaching role with Novak Djokovic at the upcoming Indian Wells tournament and stay with the 24-time major champion for the Miami Open.\nDjokovic, 37, plans to compete at both ATP Masters events - played back-to-back and known as the 'Sunshine Double' - for the first time since 2019.\nMurray's team said the 37-year-old Scot flew out to the United States on Monday.\nThe Indian Wells main draw starts later this week, with the Miami Open following on 19 March.\nDjokovic's last competitive outing was a first-round defeat by Italy's Matteo Berrettini at the Qatar Open on 18 February, when Murray was not present.\nDjokovic began working with his long-time rival, who retired from playing in August, on a trial basis at January's Australian Open.\nDjokovic reached the Melbourne semi-finals but was forced to retire from his match against Germany's Alexander Zverev with a hamstring injury.\nImmediately after his exit, Djokovic said the pair would need to \"cool off\" before discussing the future. Three-time major champion Murray also refused to be drawn.\nBut, speaking in Qatar last month, Djokovic said Murray had agreed to continue working with him and suggested they would team up in the US without confirming his plans.\n\"It's indefinite in terms of how long we are going to work together but we agreed we are going to work most likely in the States and then some clay-court tournaments and see how it goes after that,\" Djokovic said.", "url": "https://www.bbc.co.uk/sport/tennis/articles/cx2ge1z5gv2o"}