{"authors": ["Paul Higham", "www.facebook.com"], "date_download": "2025-05-21 06:17:02", "date_modify": "2025-05-21 06:17:02", "date_publish": "2025-01-31 14:04:10", "description": "BBC Sport has a first-hand account of the infamous Super Bowl blackout that happened the last time the big game was held in New Orleans.", "filename": "sport_american-football_articles_c93ldqll33jo_1747808222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed34/live/651b5130-dfd2-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_c93ldqll33jo_1747808222.html", "title": "Super Bowl: The night the Superdome lights went out in New Orleans", "title_page": "Super Bowl: The night the Superdome lights went out in New Orleans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Superdome in New Orleans was rocking after the Baltimore Ravens had just scored the longest touchdown in Super Bowl history.\nBut just moments after Jacoby Jones had lit up Super Bowl 47, the lights went out.\nAnd those 34 extraordinary minutes of darkness are largely what the last Super Bowl held in New Orleans on 3 February 2013 is known for.\nNot John and Jim Harbaugh making history as brothers and head coaches contesting the Super Bowl, not the final game of NFL legend Ray Lewis and not the emergence of San Francisco 49ers quarterback Colin Kaepernick.\nNot even Beyonce and a Destiny's Child reunion during the half-time show could pinch the lead headline away from the night the lights went out at the Super Bowl.\nOn 9 February, the big game returns to the Big Easy for the first time since, as the Kansas City Chiefs aim to become the first team to win it three times in a row against the Philadelphia Eagles.\nAll steps have been taken to ensure there's no repeat of the incident - which almost changed the outcome of America's biggest sporting spectacle.\n\"Is it getting a little warm in here?\" asked a fellow journalist sat next to me perched high up in the rafters in the press box at the Superdome.\nIn hindsight now we know why, but at the time we were trying to make sense of the chaos on the pitch after the Ravens had just taken a commanding lead.\nThe Superdome is loud, seriously loud. Even with the crowd split between the two teams, the roars and cheers were still reverberating from below, ricocheting off the roof and hammering our ear drums.\nThen it happened. Our monitors went off, the scoreboard disappeared, the stadium announcer's booming voice was silenced and the majority of the stadium's lights went out.\nApart from some emergency lighting, darkness engulfed the Superdome. And silence. Such an eerie experience in such a huge building.\nA riotous cauldron of noise was turned into a shadowy cavern of worried murmurings and disbelief - with nobody having a clue what was happening.\nPlayers searched for their families in the stands, some stretched and some just sat down, bemused, as NFL officials ran about looking to find what the problem was, and the solution.\nThere was precious little communication, as we tried to call, email, get in contact with someone, somewhere, with some knowledge of the situation.\nOnce the spectre of something more threatening was ruled out, a power outage was given as the reason, and after the most famous half an hour of darkness in American sports history, we were ready to get back under way.\nThe silence heard around the world was broken, the blackout watched by hundreds of millions was over - but the story was very much not.\nWhen the lights came back on, it was like the two sides had switched shirts, as a Baltimore team that had dominated to lead 28-6 had lost all their momentum.\nJones' incredible 108-yard touchdown to start the second half was long forgotten, and Kaepernick engineered a run of 17 points scored in just over four minutes.\nEven after a late Ravens field goal, the 49ers had one last chance to score and win the game, before a discombobulated Ravens defence finally stopped them to win 34-31.\nA one-sided beatdown had become a nail-biting thriller, but plenty of Ravens were not happy with lots of conspiracy theories about whether somebody had actually pulled the plug.\n\"I'm not gonna accuse nobody of nothing - because I don't know facts,\" said a chuckling Lewis in the NFL's America's Game series released shortly after the incident.\n\"But you're a zillion-dollar company, and your lights go out? No. No way.\"\nThe blackout undoubtedly changed the game - it took the wind out of Baltimore's sails and gave San Francisco time to regroup - but it ultimately did not change the outcome.\nNow if the 49ers had completed their comeback and lifted the Lombardi Trophy instead of Lewis and his Ravens, that would be a different story.\nAn investigation traced the problem to a relay device - ironically something to protect the stadium from power problems - and something not even inside the Superdome.\nUsually a more regular Super Bowl host city, New Orleans has had to wait 12 years to put the 'Blackout Bowl' right - and the host committee and local power company are taking no chances.\nEntergy has replaced all of the systems used 12 years ago and the Superdome has had a sizeable makeover, including new LED lights that take far less time to switch back on.\nA reason for the blackout lasting 34 minutes was the reboot time of the old lighting system.\n\"We're very confident in terms of the three feeds we have there,\" Entergy's Shelton Hudson told media, external before Super Bowl week.\nAll systems have been given thorough checks during big Superdome events such as concerts by Beyonce and, ironically enough, the world's biggest Kansas City Chiefs fan, Taylor Swift.\nThe Super Bowl is another level though, and the Superdome will be under scrutiny to make sure there are no problems this time around.\nTwelve years is a long time to change a few lightbulbs, and with the world watching again, the Superdome and NFL officials will be keeping their fingers crossed.\nHopefully the NFL's leading lights on the field will be making all the headlines this time around.", "url": "https://www.bbc.com/sport/american-football/articles/c93ldqll33jo"}