{"authors": ["Alex Pewter", "www.facebook.com"], "date_download": "2025-05-21 06:06:26", "date_modify": "2025-05-21 06:06:26", "date_publish": "2024-12-24 15:36:55", "description": "Crystal Palace news: Opinion - My moment of the year", "filename": "sport_football_articles_ce32zq4nl15o_1747807586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6b0/live/3752ed40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce32zq4nl15o_1747807586.html", "title": "My moment of the year", "title_page": "Crystal Palace news: Opinion - My moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If there has been any significant change in 2024, it has been the arrival of Oliver Glasner and his coaching staff.\nLike many other clubs, Crystal Palace have the habit of drifting from one existential crisis to another - real or imagined. Yet, while Glasner opened his account with a routine 3-0 victory over a soon-to-be relegated Burnley, it took seven weeks and a mid-season training camp for his true impact to be felt.\nThis brings us to Anfield, the classic underdogs against a daunting Jurgen Klopp and his team, then only three points off the top of the league table.\nInto the 13th minute, starting with a throw-in on the right-hand side in the Liverpool half, Glasner's team unfurled a 17-pass move that shifted the ball from right to left, back via defence, and a combination of one-touch passes back down the left flank.\nEventually, the team released Tyrick Mitchell into the area, who cut it back, giving Eberechi Eze a casual goal to score from the edge of the six-yard box. About 40 seconds of pure footballing brilliance.\nThe Liverpool team were mere spectators for the entire process, and the 1-0 result at full-time was seismic for both title challengers and Palace's new manager.\nThis moment and result started a run of six wins and a draw to end the 2023-24 season. In many ways, this is the level of performance the team has been seeking ever since, hampered by a questionable summer of recruitment and injury issues.\nFor Glasner, it clearly established him as a Premier League-worthy manager in the minds of any lingering doubters left frustrated by previous results.\nEven now, that hope remains that if you get the right pieces in place, this team could reach the heights the fans desire.", "url": "https://www.bbc.com/sport/football/articles/ce32zq4nl15o"}