{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 05:00:52", "date_modify": "2025-05-21 05:00:52", "date_publish": "2025-04-04 10:46:51", "description": "David Moyes press conference: Everton vs Arsenal preview", "filename": "sport_football_articles_c62zwz2wx70o_1747803652.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a963/live/8e719b70-d19f-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62zwz2wx70o_1747803652.html", "title": "David Moyes press conference: Everton vs Arsenal preview", "title_page": "David Moyes press conference: Everton vs Arsenal preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moyes confirmed Iliman Ndiaye is \"in the frame\" to start after returning from injury off the bench against Liverpool on Wednesday but is \"lacking proper match fitness\".\nOn Dwight McNeil, who has been absent since December with a knee injury: \"Dwight is back in training - he's had about three or four days on the grass. He's getting closer and if we can get him involved we will do.\"\nJesper Lindstrom is not available and will be seeing a specialist about a groin problem. Moyes said medical staff are \"half looking to see if it's a hernia\".\nWhen asked if Armando Broja and Youssef Chermiti were pushing to start, Moyes said: \"Yeah they are knocking at the door. It's great news that we're talking about us getting chances to score. Beto was a little bit unlucky the other night. You look at the points we've got and quite a lot are to do with his goals. We've just missed that last bit but certainly Broja and Chermiti are getting closer to match fitness than they have been.\"\nMoyes commented on the club statement condemning social media abuse aimed at James Tarkowski: \"It's not acceptable for anybody, in any walk of life. I believe it could have been a sending off but that doesn't mean you should be abused online.\"\nOn the decision to allow Diogo Jota's goal on Wednesday: \"You can always hide behind words. Anybody who's followed football would see that as offside. I find it really incredible. We're about to go into the semi-automated - it would be interesting to see what they would do about the decision.\"\nOn the final four games at Goodison Park: \"It feels as if we're getting to the end of a long season. For everybody who follows Everton, there's not many days left at Goodison. People will be pretty sad it's going but really excited about the prospect of moving to a new stadium.\"\nOn Arsenal boss Mikel Arteta, who played under Moyes at Everton: \"I'm thrilled for Mikel because he is one of our ex-players. Mikel has done unbelievably well. He's worked under arguably the best manager in the world since Sir Alex [Ferguson] in Pep [Guardiola]. Culturally, he's from Spain but he's played most of his football here, so he's got a really good balance.\"", "url": "https://www.bbc.com/sport/football/articles/c62zwz2wx70o"}