{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:46:39", "date_modify": "2025-05-19 14:46:39", "date_publish": "2015-02-05 21:11:02", "description": "Shaun Edwards says England risk being penalised if they use 'league' tactics in Friday's Six Nations opener in Cardiff.", "filename": "sport_rugby-union_31154214_1747665999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80820000/jpg/_80820328_shaun.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31154214_1747665999.html", "title": "Six Nations: England use illegal rugby league tactics - Edwards", "title_page": "Six Nations: England use illegal rugby league tactics - Edwards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales defence coach Shaun Edwards says England risk being penalised if they use their 'league' tactics in Friday's Six Nations opener in Cardiff.\nFormer Great Britain rugby league captain Edwards claims England use illegal rugby league-style plays.\nHe says Stuart Lancaster's side employ blocking runners ahead of the ball carrier.\n\"It is a risk doing a lot of those league plays because of the obstruction rule,\" said Edwards.\nEdwards made 467 appearances for Wigan, scoring 226 tries for them between 1983 and 1997 and winning 36 caps for Great Britain in league.\nHe says the Welsh defence must be aware of such tactics going in to the opening game of the tournament.\n\"It is important we get our structure right on that,\" said Edwards.\n\"It is also important there is no obstruction of our defensive plays up ahead of the ball.\n\"When you watch rugby league games, there are a lot of tries disallowed when they go to the TMO [television match official] if there has been any obstruction ahead of the ball.\n\"I am sure the TMO and the referee will be well aware of that.\"\nFrench referee Jerome Garces will be in charge of Friday's contest at the Millennium Stadium.\nEngland attacking skills coach Mike Catt responded to Edwards' claim that the visitors use \"league plays\" by pointing out that Garces will have the final say.\n\"It's not something we've discussed here much. I believe it's going to be a dry night so hopefully it's a good game of rugby.\n\"In any Wales v England game there's going to be a lot of atmosphere - obviously it does resound a little bit more when the roof's closed - but it's still going to be a tremendous atmosphere.\"", "url": "https://www.bbc.com/sport/rugby-union/31154214"}