{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:19:12", "date_modify": "2025-05-20 13:19:12", "date_publish": "2023-08-02 10:45:05", "description": "Ireland forwards coach Paul O'Connell says he is confident Johnny Sexton's fly-half understudies can shine if called upon in the Rugby World Cup.", "filename": "sport_rugby-union_66363536_1747747152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BCD5/production/_130614384_bbc-sport-index-imagery-3-split-images-gradient-af6e78e9-d949-4720-abd2-06d84148aaba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66363536_1747747152.html", "title": "Johnny Sexton: Paul O'Connell 'confident' Ireland captain's understudies can shine at highest level", "title_page": "Johnny Sexton: Paul O'Connell 'confident' Ireland captain's understudies can shine at highest level - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland forwards coach Paul O'Connell says he is confident Johnny Sexton's fly-half understudies can shine if called upon in the Rugby World Cup.\nSexton's suspension for this month's warm-up matches has given Ross Byrne, Jack Crowley and Ciaran Frawley the opportunity to prove their worth.\nThe trio have just 22 caps between them but O'Connell insists they are ready to take on the biggest stage.\n\"I'd be confident in all of them,\" said O'Connell.\n\"One of the strengths we have is that we've good clarity on how we're trying to play the game and the players have to take ownership of that clarity quite a lot.\n\"You do figure out a guy that's unsure very, very quickly. But all of our guys know how we want to play.\"\nWhile Leinster's Byrne, 28, has deputised capably for Sexton in the past, 23-year-old Munster out-half Crowley has just three Ireland caps with Byrne's provincial team-mate Frawley yet to line out at this level.\nAnd while Sexton will return from his three-match ban in time for Ireland's World Cup opener against Romania on 9 September, he has not played since March.\nThe 38-year-old's absence leaves his back-up trio with a golden chance to impress head coach Andy Farrell before the tournament in France in the tune-up games against Italy, England and Samoa.\n\"They don't have as much practice at it or as much experience as Johnny has of taking ownership of it but that's why these few weeks will be great for them,\" added O'Connell.\n\"We play differently to Munster and to Leinster and the guys that are there but there is a lot of similarities as well so it's nothing massively new to them.\n\"They've all driven the ship for their provinces in big, big games and done really well. There's a little bit of a tweak to how we do things and they've got to pick that up.\"\nSexton has continued to train as part of Farrell's 42-man preliminary squad, which will be trimmed to a final 33 on 28 August.\nWhile disappointment lies ahead for nine players, O'Connell - who represented Ireland at four World Cups between 2003 and 2015 - has urged those who miss out on selection not to be too disappointed.\n\"It's not all or nothing,\" said the 43-year-old.\n\"You hope that by being in here, training with us, training with good players, that players are improving and they're looking at their opportunity to get a chance, to try to get picked for the World Cup and, if they don't, that they break in in the future.\n\"They all want to go to the World Cup for sure, but selection for the World Cup is not an all-or-nothing thing.\n\"I'm sure plenty of guys are going to be disappointed.\n\"They've their sights set on getting their chances and taking it but I think they're all going to be better on the back of this pre-season.\"", "url": "https://www.bbc.com/sport/rugby-union/66363536"}