{"authors": ["Grant Young", "www.facebook.com"], "date_download": "2025-05-21 05:57:46", "date_modify": "2025-05-21 05:57:46", "date_publish": "2024-12-24 14:37:51", "description": "'Glasgow sparkle in Hampden win but tie isn't over yet'", "filename": "sport_articles_cn546qdrpq4o_1747807066.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c4e9/live/d6d5be70-c202-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn546qdrpq4o_1747807066.html", "title": "'Glasgow sparkle in Hampden win but tie isn't over yet'", "title_page": "'Glasgow sparkle in Hampden win but tie isn't over yet' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Clinical. Professional. Entertaining. Glasgow put on a show in front of a club record home crowd at Hampden Park in the 1872 Cup.\nFor 72 minutes the X factor was fully on show as the attack whipped the ball side to side and left the Edinburgh defence in their wake.\nOn paper you just have to look at the depth of Edinburgh's squad to believe they should be performing better.\nBut let's not detract from Glasgow's first-leg win. Franco Smith has brought a mentality to the Warriors and made them a proper joy to watch.\nThe injuries may have mounted up but whoever is called upon has produced the highest quality. Gregor Brown, who started the season magnificently, was thrown back in while in the back row, Jack Mann has been tremendous. And after three weeks out, skipper Kyle Steyn showed his class.\nIt gets more difficult to describe the impact Sione Tuipulotu has, it is a struggle to remember the last time he struggled to put his influence on the game.\nThe club have done a brilliant job to keep him long term at Glasgow. Sione was simply incredible.\nThe tie, though, isn't over. The slimmer of hope is there for Edinburgh with those two late tries as Glasgow looked to have switched down a gear in the last 10 minutes.\nIt has usually been those moments where we see Glasgow's effort come to the fore, so no doubt that leaves something for the coaches to stew over for the next few days.\nThe festive cheer as a Glasgow fan remains and a superb 2024 has been had by the club. Fingers crossed we sign off with another derby win on Saturday.", "url": "https://www.bbc.com/sport/articles/cn546qdrpq4o"}