{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-20 12:10:09", "date_modify": "2025-05-20 12:10:09", "date_publish": "2023-08-05 10:28:13", "description": "New-look Rangers' hopes of wrestling the Scottish Premiership title off rivals Celtic get off to a losing start as they are shocked by a reinvigorated Kilmarnock.", "filename": "sport_football_66194509_1747743009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FDD0/production/_130667946_20812345.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194509_1747743009.html", "title": "Kilmarnock 1-0 Rangers: Brad Lyons winner stuns new-look visitors in opening defeat", "title_page": "Kilmarnock 1-0 Rangers: Brad Lyons winner stuns new-look visitors in opening defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New-look Rangers' hopes of wrestling the Scottish Premiership title off rivals Celtic got off to the worst possible start as they were shocked by a reinvigorated Kilmarnock.\nMichael Beale's blunt side, which included five debutants from the off, failed to truly trouble the organised and resolute hosts, who secured a well-deserved victory as Brad Lyons capitalised on poor defending to sweep in a 65th-minute winner.\nAside from first-half efforts from Cyriel Dessers and John Lundstram, and a John Souttar header after the break, the visitors' attacking play was limited in a disjointed display.\nEven this early in the campaign, the result is a damaging one for Beale, who knows there is little room for error with his side already behind their Old Firm rivals.\nThat should take nothing away from a sensational showing from Kilmarnock, who came close to extending their lead with drives from Kyle Magennis and Danny Armstrong.\nThe victory is the Ayrshire side's first over Rangers since April 2020 and ends the Ibrox club's 20-game unbeaten run in opening top-flight fixtures.\nEyebrows were raised about Todd Cantwell's exclusion from the Rangers starting line-up, but his introduction - along with new Brazilian striker Danilo - failed to inspire an away side that just could not get going.\nIt was instead the entrance of Kilmarnock captain Kyle Vassell that arguably proved to be the turning point as the striker gave the hosts a focal point to go on and take the game away from Rangers.\nFingers will be pointed at a fresh Rangers attack that failed to create clear chances, but the pivotal moment that changed this result from a draw to defeat came from sloppy defending by Souttar as the centre-back could not clear his lines from a long throw.\nIt is clear that this side will need time to gel, but the issue with Glasgow is you simply do not get that time. With the domination both Old Firm clubs hold over the other 10, the margin for error is so, so slim now. Beale needs this side to click quickly.\nMcInnes, who had seven fresh faces of his own in his XI, spoke pre-match about wanting to \"demonstrate that there's been an improvement\" in his side after a big summer rebuild.\nBoy, did they do that. New recruit Robbie Deas in particular was a colossus in defence. The Ayrshire side should now be embracing what looks like a tough trip to Tynecastle next Sunday before a Viaplay Cup last-16 tie at home to Celtic the following weekend.", "url": "https://www.bbc.com/sport/football/66194509"}