{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:45", "date_modify": "2025-05-19 15:13:45", "date_publish": "2015-03-02 10:27:22", "description": "Olympic champion Dani King admits it was \"scary\" to cycle on the road three months after a training accident.", "filename": "sport_cycling_31691733_1747667625.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81331000/jpg/_81331447_dani_kingindex_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_31691733_1747667625.html", "title": "Dani King: Olympic champion says it was scary to go back on the road", "title_page": "Dani King: Olympic champion says it was scary to go back on the road - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Olympic champion Dani King says it was \"scary\" to ride on roads again after suffering five broken ribs and a collapsed lung in a training crash.\nKing, 24, has completed a training camp in Belgium with her team Wiggle-Honda, just three months after her accident.\n\"I was cycling on the cobbles in the rain so it doesn't get much worse than that,\" said King, who won gold in the team pursuit at London 2012.\n\"I am in good shape, I just need to get my confidence back.\"\nShe added: \"It was scary but I am getting there.\n\"Everyone in the team was so nice and encouraged me to get back on the road.\nShe was in hospital for 10 days - at one point fearing the crash might end her career - and admitted her preparations for next year's Rio Olympics have been affected.\n\"It has made quite a big dent because I had a plan of doing a full winter's training,\" King said.\n\"It has put things back a bit but it could have been a lot worse.\"\nKing intends to start competitive road racing again in April and her next track competition is at the British Cycling National Track Championships, likely to take place in September.\nHowever, she knows she will have to impress to get back in the team ahead of the 2016 Olympics.\n\"All the girls are incredible athletes and it is going to be really hard for me to get back in,\" she added.\n\"We have to fight every day to make the team but I hope to be firing on all cylinders and to get myself back in for Rio.\"", "url": "https://www.bbc.com/sport/cycling/31691733"}