{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:45", "date_modify": "2025-05-20 13:47:45", "date_publish": "2023-07-31 13:25:58", "description": "Women's Super League side Liverpool complete the signing of Austria midfielder Marie Hobinger.", "filename": "sport_football_66361776_1747748865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16DDB/production/_130595639_gettyimages-1242045831.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66361776_1747748865.html", "title": "Marie Hobinger: Liverpool sign Austria midfielder from FC Zurich", "title_page": "Marie Hobinger: Liverpool sign Austria midfielder from FC Zurich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Women's Super League side Liverpool have completed the signing of Austria midfielder Marie Hobinger.\nThe 22-year-old joins from Swiss side FC Zurich, where she won the double in 2021-22 and was nominated for the league's player of the season award.\nHobinger has made 28 international appearances and featured at Euro 2022.\n\"I'm so happy to be here. I love English football - men's and women's - so I always wanted to play in the WSL,\" she said.\n\"Football in this country is huge. The Euros were amazing and the crowd at every stadium was amazing.\"\nHobinger moved to Germany at the age of 13 to pursue a football career and spent three seasons playing for Turbine Potsdam before joining Zurich, initially on loan.\nShe scored nine goals from 15 games last season as Zurich defended their league title and also played in the Women's Champions League.\nLiverpool coach Matt Beard said: \"She's a box-to-box midfield player - she's aggressive, she's quick, she's athletic and we're really excited by her potential.\"\nThe Reds finished seventh on their return to England's top flight last season and Hobinger is their sixth summer signing after Natasha Flint, Jenna Clark, Mia Enderby, Teagan Micah and Grace Fisk.\n\"I really like the vision of the club and I am also a really ambitious player so I'm really excited for what's to come,\" Hobinger said.", "url": "https://www.bbc.com/sport/football/66361776"}