{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:00", "date_modify": "2025-04-26 06:17:00", "date_publish": "2025-03-01 18:45:03", "description": "Saracens reach the Premiership Women's Rugby final by defeating Harlequins 32-24 in a thrilling semi-final at StoneX Stadium.", "filename": "sport_rugby-union_articles_ceqjrvgrd58o_1745648220.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0dd2/live/d6bcbc40-f6c8-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ceqjrvgrd58o_1745648220.html", "title": "Premiership Women's Rugby: Saracens defeat Harlequins 32-24 to reach final", "title_page": "Premiership Women's Rugby: Saracens defeat Harlequins 32-24 to reach final  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Saracens have reached the Premiership Women's Rugby final by defeating Harlequins 32-24 in a thrilling semi-final at StoneX Stadium.\nEngland wing Jess Breach, who returned to the Saracens side last week after sustaining a hip injury in November, was the standout player.\nThe 27-year-old's try, alongside two from Alysha Corrigan and tries from Marlie Packer and May Campbell, were enough to put the home side into the final on 16 March.\nGloucester-Hartpury face Bristol Bears in the other semi-final on Sunday, live on the BBC Red Button, BBC iPlayer and BBC Sport website from 15:00 GMT.\nBreach told TNT Sports after the match: \"Last year was really horrible to lose in the semi-final [against Bristol Bears].\n\"To come out here, on our home turf, and win - we really fought for the win.\n\"It's been a long season for me to get back on the pitch; I feel like I really performed back to the best of my ability today and I'm just so glad it was in a semi-final that helped the team get to a final.\"\nSaracens finished second in the PWR table, while Harlequins were one place behind in third.\nQuins opened the scoring inside two minutes through Spain full-back Claudia Pena, but were 20-12 down by half-time.\nA smart set-play by the visitors in the second half led to a try for Lauren Torley, cutting the gap to three points with 20 minutes to go.\nBut tries from Corrigan and Campbell, plus a conversion from Zoe Harrison, put Saracens back in control, before Babalwa Latsha grabbed a late try for Quins.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ceqjrvgrd58o"}