{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:13:08", "date_modify": "2025-04-26 04:13:08", "date_publish": "2025-03-04 11:54:04", "description": "Bath scrum-half Tom Carr-Smith signs a two-year contract extension until the end of the 2026-27 season.", "filename": "sport_rugby-union_articles_cn04z4088r3o_1745640788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2617/live/06bc9870-f8ef-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cn04z4088r3o_1745640788.html", "title": "Tom Carr-Smith: Bath scrum-half signs two-year contract extension", "title_page": "Tom Carr-Smith: Bath scrum-half signs two-year contract extension - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bath scrum-half Tom Carr-Smith has signed a two-year contract extension keeping him at the Recreation Ground through to the end of the 2026-27 season.\nThe 23-year-old has scored six tries in 12 appearances for the Blue, Black and Whites this season, including in Friday's 39-28 victory over Harlequins in the Premiership Rugby Cup.\nCarr-Smith joined Bath's academy at the age of 13 and made his league debut against Northampton Saints in October 2022.\n\"Tom has developed really well over the last two-and-a-half seasons into a running nine, who plays at speed and can control the game,\" said Bath head of rugby Johann van Graan.\n\"He is homegrown and has helped to shape our unique culture with purpose.\"\nCarr-Smith joins a list of players including Ethan Staddon, Ewan Richards and Tom Dunn who have extended their stay at the Premiership leaders in recent weeks.\n\"I'm so happy to be continuing my journey with my boyhood club,\" Carr-Smith added.\n\"I just want to get better and work with great people which is why I am super excited to see where this group can go.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cn04z4088r3o"}