{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 04:33:46", "date_modify": "2025-05-21 04:33:46", "date_publish": "2025-02-01 09:51:17", "description": "England suffer a humiliating innings defeat in the one-off Ashes Test match as Australia take a 16-0 clean sweep.", "filename": "sport_cricket_articles_cwyw819ylz4o_1747802026.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1770/live/1b171160-e08a-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cwyw819ylz4o_1747802026.html", "title": "Women's Ashes 2025: England suffer humiliating innings defeat and lose series 16-0", "title_page": "Women's Ashes 2025: England suffer humiliating innings defeat and lose series 16-0 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England slumped to an embarrassing defeat by an innings and 122 runs in the one-off Test in Melbourne, handing Australia a 16-0 clean sweep in the Women's Ashes.\nAustralia were bowled out for 440 in their first innings after England impressed to take the last five wickets for nine runs in the first session, but still faced a deficit of 270.\nLeg-spinner Alana King then ripped through England's batting once more with 5-53 as the visitors were skittled for 148, helping Australia wrap up yet another dominant win with a day to spare.\nIt is the first time any team has won the multi-format Ashes 16-0 and has placed enormous pressure upon captain Heather Knight and coach Jon Lewis.\nAfter a tortuous day two spent entirely in the field, with seven catches dropped, England responded positively as Sophie Ecclestone finished with 5-143 after Beth Mooney converted her overnight 98 to become the first Australian woman to score a century in all three formats.\nOpener Maia Bouchier's dismal tour continued as she was bowled by Darcie Brown for one in the first over of England's reply, but Knight and Tammy Beaumont's gritty stand of 73 showed much-needed signs of fight.\nThe introduction of spin - England's constant nemesis throughout the series - triggered a woeful collapse of eight wickets for 48 runs to end any hopes of them finishing the series with pride.\nKnight was caught at short leg for 32 off Ash Gardner, King pinned Nat Sciver-Brunt lbw for 18 before bowling Sophia Dunkley with a sensational fizzing leg-break, and Danni Wyatt-Hodge fell softly by sweeping Gardner straight to short fine leg for two.\nEcclestone withstood 50 balls for her 18 until she was bounced out by Gardner, and after a tantalising passage of play of 11 overs with both spinners on four wickets and one wicket remaining, King had Lauren Filer caught for 14 to complete a memorable five-wicket haul.\nEngland started the day impressively by wrapping up Australia's innings within the first hour, with Ecclestone completing her five-wicket haul and becoming the first English woman to have her name on the MCG honours board.\nTahlia McGrath was the first to fall, caught by Lauren Bell at mid-on for 12, but the lower order offered very little resistance - even with Ellyse Perry coming out to bat at number 10 because of a hip injury.\nPerry was clearly in discomfort and chipped a catch back to Ecclestone for two, but despite the underwhelming session, Australia's lead was still imposing.\nMooney etched her own name in history within the first over before she was bowled by Filer for 106 from 173 balls to become the series' leading run-scorer with 409 runs in seven innings.\nThe fight and energy shown by England came all too late as they paid the ultimate price for soft dismissals on day one and the array of dropped catches on day two.\nA victory was certainly out of the equation considering the amount of time left in the game and Australia quickly snuffed out any thoughts of a draw, proving far too strong for the seventh match in succession.\nThere was a sense of anticipation the moment King came on to bowl after Knight and Beaumont batted quite comfortably against Australia's seamers, with a buzz rippling around the crowd after her four-wicket haul in the first innings.\nAgain, with the Shane Warne Stand behind her, King had the ball ripping past the outside edge regularly with fascinating guile and control to which England had no answers.\nPhoebe Litchfield's sharp catch at short leg removed Knight for 32 as Gardner opened the door which allowed herself and King to burst through it.\nSciver-Brunt missed an innocuous straight delivery, Beaumont chopped on for 47 but the highlight came with the ball to Dunkley pitching on leg stump before turning sharply to hit the top of off.\nGardner and King bowled 48.4 overs and ruthlessly exposed England's spin weaknesses to take nine of the 10 wickets between them.\nKing matched Gardner's 2023 tally of 23 wickets for a multi-format series record, and England are in dire need of a solution to how they play slower bowling as they have lost 40 wickets to spin at an average of just 12.3.\nDespite lower order resistance from Ecclestone, Ryana Macdonald-Gay, Filer and Bell, they were simply delaying the inevitable surge from the Australian juggernaut, fully deserving of the 16-0 scoreline.\nEngland captain Heather Knight to ABC Radio: \"We'll be judged on the scoreline.\n\"We haven't played our best cricket and we've got some brilliant players. We haven't been able to compete for long enough.\n\"When they had the advantage, they really hammered it down and I think we can learn from that as players and see how we can come back from this.\"\nAustralia batter Beth Mooney to ABC Radio: \"It's pretty amazing. England are a quality side and they put us under the pump.\n\"We knew it wasn't going to be easy but the way we played, the brand of cricket we played, everyone knowing their role, it turned out amazing for us.\n\"I don't think we'll see anything like it soon.\"\nFormer England coach Mark Robinson on TNT Sports: \"England are better than that, we know they are but there is a gap between the teams and anybody would be silly not to say there is.\n\"It is not a 16-0 gap, but we got on the wrong type of run and confidence and momentum drained from us.\"", "url": "https://www.bbc.com/sport/cricket/articles/cwyw819ylz4o"}