{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 04:00:54", "date_modify": "2025-05-21 04:00:54", "date_publish": "2025-04-07 06:21:40", "description": "Ulster want to be 'shooting for the top' - O'Connor", "filename": "sport_articles_c62xqjxe321o_1747800054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d87/live/bd5d3430-130d-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62xqjxe321o_1747800054.html", "title": "Ulster want to be 'shooting for the top' - O'Connor", "title_page": "Ulster want to be 'shooting for the top' - O'Connor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster lock Alan O'Connor says the province still want to \"compete with the best\" after exiting the Investec Champions Cup at the last-16 stage with a 43-31 defeat by Bordeaux-Begles.\nRichie Murphy's side went into the knock-out phase of the tournament as the 16th seed and with just one win in the pool stages.\nSome had speculated that the 1999 champions would have been better served dropping down a tier and making a run at the European Challenge Cup but the experienced O'Connor believes the side should be encouraged by the entertaining 11-try encounter against one of the competition's favourites.\n\"We all want to compete against the best,\" said the man who filled in as Ulster captain in the absence of Iain Henderson.\n\"For me as a rugby player, it's a no-brainer. I want to play in the top tier and challenge ourselves as individuals and as a unit.\n\"I can see maybe where they're coming from but as we've shown on days like this, we can stand up and we can score plenty of points.\n\"There's things we need to work on obviously but that game was maybe there for us in the last 10 minutes if another couple of things had gone our way.\"\nUlster were late arriving to the Stade Chaban Delmas after their bus got caught in traffic then could not get down one of the streets near the stadium.\nLeft to walk the rest of the way, O'Connor, who said the situation did not factor into their slow start, enjoyed soaking up the atmosphere.\n\"These are the places that you want to come play, any French ground is always special,\" he added.\n\"We had a bit of a mishap with our busses, but we ended up walking through a lot of the crowd and it was a great atmosphere, something different.\n\"As a player you relish playing in these grounds. We want to be shooting for the top.\"", "url": "https://www.bbc.com/sport/articles/c62xqjxe321o"}