{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:01", "date_modify": "2025-05-19 15:24:01", "date_publish": "2015-02-09 10:46:26", "description": "Launceston captain Kieron Lewitt says his side \"got out of jail\" to get their first win in four games, beating Lydney 20-18.", "filename": "sport_rugby-union_31299255_1747668241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80879000/jpg/_80879247_dsc_0179.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31299255_1747668241.html", "title": "Launceston 'get out of jail' to beat Lydney 20-18", "title_page": "Launceston 'get out of jail' to beat Lydney 20-18 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Launceston captain Kieron Lewitt says his side \"got out of jail\" to get their first win in four games by beating Lydney 20-18 at Polson Bridge.\nA last-minute converted penalty try saw the Cornish All Blacks move up to ninth place in National Two South.\n\"We missed a lot of opportunities through our mistakes and that's the really frustrating bit, because it made it a tough day,\" he told BBC Cornwall.\n\"I think we got out of jail really right at the end.\"\nLewitt kicked three penalties and converted the late score to secure four points against a Lydney team fighting relegation.\nDuring the game in Cornwall, Lydney had three players sin-binned, while Launceston saw two yellow carded.\n\"Our scrum was positive,\" added director of rugby Neil Bayliss.\n\"We had a lot of changes in that front row over the past couple of weeks and the young guys that have come in have done exceptionally well.\n\"We really dominated the scrum, our lineout wasn't at its best this week, which was a little disappointing as we do pride ourselves on our scrum and lineout.\n\"But for me a big positive was the scrum, we were excellent there.\"", "url": "https://www.bbc.com/sport/rugby-union/31299255"}