{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:36", "date_modify": "2025-05-21 05:24:36", "date_publish": "2025-01-05 09:46:32", "description": "Australia's series against India lived up to the weighty expectations, says home captain Pat Cummins after his side won 3-1 to regain the Border-Gavaskar Trophy.", "filename": "sport_cricket_articles_cr56yv4dpm2o_1747805076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/abcf/live/2cf55d20-cb4e-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cr56yv4dpm2o_1747805076.html", "title": "Australia v India: Pat Cummins says series deserved the hype", "title_page": "Australia v India: Pat Cummins says series deserved the hype - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia's series against India lived up to the weighty expectations, said home captain Pat Cummins after his side sealed a 3-1 win to regain the Border-Gavaskar Trophy.\nCummins led Australia to a six-wicket victory on the third day of the fifth Test in Sydney, with the home side having bounced back following a 295-run defeat in the series opener in Perth.\nThey responded with a 10-wicket win in Adelaide, and after the third Test in Brisbane ended in a rain-affected draw, a dramatic win on the fifth day of the fourth Test in Melbourne put Australia 2-1 up.\n\"It has been an amazing series,\" said Cummins, 31. \"It has been in the calendar for a while and is one you've had your eye on it for a year or two. It has lived up to all the hype.\"\nVictory in Sydney, helped by fast bowler Scott Boland's 10-wicket haul, also ensured Australia will contest the World Test Championship final against South Africa at Lord's in June.\n\"The extra layer is now securing a spot in the World Test Championship final, which was always a huge goal for us in this cycle and we've done it,\" Cummins said. \"So we are really satisfied.\"\nAustralia began the series with Nathan McSweeney opening the batting, but he was replaced by 19-year-old Sam Konstas for the final two Tests.\nKonstas caught the eye with a rapid innings of 60 on his first day in international cricket, while all-rounder Beau Webster made 57 and 39 not out on his Test debut in Sydney.\nBoland took 21 wickets in just three appearances in the series, while the experience of Travis Head and Steve Smith, with 448 and 314 runs in the series respectively, also proved vital.\n\"We talked about needing a squad, as especially in these five-match series you rarely play the same XI,\" explained Cummins.\n\"Three debutants came in and contributed at different times - it feels like we are building something nice.\"\nThe Australia captain said he is likely to miss the forthcoming series in Sri Lanka because his wife is due to give birth in the next few weeks. His team look to be in good shape.\n\"There were some key moments from some of our mainstays who really stood up,\" Cummins added. \"You need that to beat a side like India and in those key moments those guys put their hands up.\"", "url": "https://www.bbc.com/sport/cricket/articles/cr56yv4dpm2o"}