{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:45:41", "date_modify": "2025-05-20 12:45:41", "date_publish": "2023-07-25 08:48:14", "description": "Liverpool: 'Defence like a sieve' but 'enough firepower' - your views on Greuther Furth friendly", "filename": "sport_articles_cgr8nl55ye5o_1747745141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d3ae/live/ea0dd800-2abf-11ee-b1d7-8fdc93c2782e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cgr8nl55ye5o_1747745141.html", "title": "Liverpool: 'Defence like a sieve' but 'enough firepower'", "title_page": "Liverpool: 'Defence like a sieve' but 'enough firepower' - your views on Greuther Furth friendly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts on Liverpool's 4-4 draw against second-tier German side Greuther Furth on Monday.\nHere's a flavour of your responses:\nSimeon: Some good performances from key players looking to shine next season such as Diogo Jota, Darwin Nunez and Luis Diaz. The new players have been fitting in well with the team and have looked really promising on the ball, but we have to work on our defence, which should not be conceding four goals against a team like this.\nMatt: Nice run out again but slightly perturbed over the defensive organisation. Last season was similar. I'm sure Jurgen Klopp is aware and on the ball with it. The midfield and attack are looking comfortable.\nHarry: Defence is leaking like a sieve as per all last season. When are we getting a couple of tough yet agile defenders? Aren't we cutting it close as first game away to Chelsea is around the corner? Buck up, management and owners.\nRob: Defensively really not great. I definitely think we have enough firepower at the other end to blow teams away and hopefully Nunez can maintain his confident start throughout the season. Really think we need to spend some money at the other end. I think we are one light in midfield and we need a starting centre-back. Ibrahima Konate, Joe Gomez and Joel Matip not good enough.", "url": "https://www.bbc.com/sport/articles/cgr8nl55ye5o"}