{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 07:28:48", "date_modify": "2025-05-21 07:28:48", "date_publish": "2025-05-20 17:31:10", "description": "Novak Djokovic says he \"couldn't get more\" out of his partnership with Andy Murray but is in no rush to find a new coach as the French Open approaches.", "filename": "sport_tennis_articles_ckgnnn3z05eo_1747812528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f841/live/4d7054a0-35b7-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_ckgnnn3z05eo_1747812528.html", "title": "Novak Djokovic says he 'couldn't get more' out of Andy Murray coaching partnership", "title_page": "Novak Djokovic says he 'couldn't get more' out of Andy Murray coaching partnership - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Novak Djokovic says he \"couldn't get more\" out of his partnership with Andy Murray but is in no rush to find a new coach.\nThe Serb, who turns 38 on Thursday, parted company with former rival Murray earlier in May after six months working together.\nDjokovic has taken a wildcard into the Geneva Open - one of the final tournaments before the French Open - as he looks to find more rhythm on the court.\nThe French Open starts on Sunday, with Djokovic seeking a standalone record 25th Grand Slam title.\nOn his time working with Murray, Djokovic said: \"We felt like we couldn't get more out of that partnership on the court, and that's all there is to it.\n\"My respect towards Andy remains the same, even more actually, I got to know him as a person.\n\"I think he has a brilliant tennis IQ, he has a very rare mind of a champion that obviously has achieved what he has achieved, and he sees the game incredibly well.\"\nDjokovic has yet to win a match on clay this year, having suffered early exits in Monte Carlo and Madrid before skipping the Italian Open.\nLifting the title in Geneva would make Djokovic just the third man in the Open era to win 100 ATP singles titles - as well as be a welcome boost before Roland Garros.\nDjokovic is joined in Geneva by Dusan Vemic, who was previously part of his team, and assistant coach and analyst Boris Bosnjakovic.\n\"At the moment, I'm not in need of a coach,\" Djokovic said.\n\"I don't need to rush in any context. I feel comfortable with the people around me.\n\"In the next few tournaments, we'll see what happens.\"\nDjokovic reached the semi-finals of the Australian Open in his first tournament working with Britain's former world number one Murray, before he was forced to retire through injury.\nHe has had a difficult start to the 2025 season, losing his first match in four of his past five tournaments and being beaten in the Miami Open final by Czech 19-year-old Jakub Mensik.\nDjokovic will face 134th-ranked Hungarian Marton Fucsovics on Wednesday.", "url": "https://www.bbc.com/sport/tennis/articles/ckgnnn3z05eo"}