{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:44:07", "date_modify": "2025-04-26 07:44:07", "date_publish": "2025-02-26 18:01:01", "description": "John Higgins beats Zhou Yuelong 5-4 at the World Open in China to equal Ronnie O'Sullivan's record of reaching 146 ranking event quarter-finals.", "filename": "sport_snooker_articles_cx28pd3wz82o_1745653447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94b6/live/4555bb70-f467-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_snooker_articles_cx28pd3wz82o_1745653447.html", "title": "John Higgins equals Ronnie O'Sullivan record by reaching World Open quarter-finals", "title_page": "John Higgins equals Ronnie O'Sullivan record by reaching World Open quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "John Higgins beat Zhou Yuelong 5-4 at the World Open in China to equal Ronnie O'Sullivan's record of reaching 146 ranking event quarter-finals.\nHiggins was 4-2 down and battling illness in Yushan before he made breaks of 60 and 74 to level the match and then knocked in a 72 in the decider to claim victory.\nScotland's four-time world champion, who turns 50 in May, said with a smile: \"One more [quarter-final] to go to 147 would be nice.\n\"I've had a good career and a long career and maybe that's why I've managed to rack up some of those numbers.\n\"I'm proud to still be going. I still love competing out there and I'd dearly love to win a big event. That's what I'm trying my hardest to do.\"\nHiggins will play Pang Junxu, who beat Chinese compatriot Xu Si 5-2, in the last eight on Thursday.\nEngland's Zak Surety secured a 5-2 win against China's Liu Hongyu to reach his first ranking event quarter-final and will play Tom Ford, who beat Jimmy Robertson 5-3 in an all-English tussle.\nEngland's recent Masters champion Shaun Murphy beat China's Ding Junhui 5-2 and will play Joe O'Connor, who followed up his victory over Judd Trump with a 5-3 win against fellow English cueman Michael Holt.\nBarry Hawkins was a 5-3 winner against Welshman Ryan Day. Hawkins, enjoying a strong season, will next play fellow experienced Englishman Ali Carter who saw off fellow countryman David Lilley 5-1.", "url": "https://www.bbc.co.uk/sport/snooker/articles/cx28pd3wz82o"}