{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:56", "date_modify": "2025-05-21 07:44:56", "date_publish": "2025-03-28 00:00:00", "description": "All the latest football news and FA Cup build-up as Pep Guardiola, Oliver Glasner, Andoni Iraola and others speak to the media before this weekend's quarter-finals.", "filename": "sport_football_live_c93kr2494r6t_1747813496.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/712f/live/486422e0-0bdf-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c93kr2494r6t_1747813496.html", "title": "FA Cup quarter-finals build up, team news and manager news conferences", "title_page": "FA Cup quarter-finals build up, team news and manager news conferences - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See ya!\nAnd that is your lot on this fine sunny Friday.\nThank you as always for joining us today.\nAll the big talking points from today's FA Cup quarter-final news conferences, along with anything else you've missed, can be found by clicking on the summary points at the top of this page.\nWe'll be back with you on Monday to dissect this weekend's action as the final eight become the final four.\nUntil then though, have a good one.\n'I enjoy watching him, he's a throwback'\nJermaine Beckford\nFormer Leeds, Leicester and Everton striker on BBC Football News Show\nJermaine Beckford waxed lyrical about Crystal Palace forward Jean-Philippe Mateta and how crucial he is to Palace:\n\"What a player. What I love about watching Mateta is that he is a good old fashioned number nine.\n\"He is physical, he bullies defenders, he is great in the air, he gets the ball down, he finds himself getting in behind the defenders, he isn't afraid in a foot race either, he is no slouch and we are s seeing the leadership skills and qualities that he is starting to possess coming to fruition.\n\"I enjoying watching him, he's a throwback.\"\n'What have we got to lose?'\nPreston North End v Aston Villa (Sun, 13:30 BST)\nPreston North End\nPreston North End boss Paul Heckingbottom: \"The preparation is the same, you try and get the same outcome which is a win. I also know we have a game two days later so we have to prepare for them too. You're just constantly on that Saturday Tuesday grind.\n\"This is the third Premier League team coming to Deepdale this season so it's not new. I think the occasion is different and the intensity Villa will bring is different simply because of the stage of the competition.\n\"We're saying we're excited to be a game away from Wembley, the clubs not been at this stage for many, many years and that's our prize.\n\"Villa are probably looking at it as a realistic chance of silverware. We're playing against a highly-motivated team that are in the quarter-finals of the Champions League. But what have we got to lose? We just have to play our best game.\"\n'They are a world class team'\nPreston v Aston Villa (Sun, 13:30BST)\nThe Football News Show\nPreston midfielder Stefan Thordarson about his side's preparations before the quarter-final fixture against Aston Villa:\n\"It'll be a test of the highest levels. Every single one of us will have to have one of the best games of the season to have a chance against a team like Aston Villa. They are a world class team with internationals in every position so we'll have to do everything in our power to stop what they do.\n\"We have to be very clinical, we have to take our chances when we get them and we have to hold them to lower chances and hopefully we will get some good free-kicks and some good corners and take our free-kicks very well. We will be well prepared.\"\nA quarter-final of firsts\nTwo of this year's FA Cup quarter-final games are complete firsts.\nIncredibly, Bournemouth and Manchester City, as well as Brighton and Nottingham Forest have never faced each other in the FA Cup's entire history.\nIt's only the second time ever that the Cherries have faced City in any cup competition, having lost their only other match 2-1 in the 2020 League Cup.\nBrighton have also faced Forest in the League Cup previously, in the 1977-78 and 1986-87 seasons.\nAnd, while it may not be the first time Fulham and Crystal Palace have faced in the FA Cup, it will be for any current fan of the two sides.\nThe last time those two met in the FA Cup was back in 1907, with Palace winning a second-round replay 1-0.\nCrystal Palace team news\nFulham v Crystal Palace (Sat, 12:15 GMT)\nCrystal Palace\nOliver Glasner confirmed that Jean-Phillipe Mateta is 'ready' to return for FA Cup action this weekend.\nOn the rest of his squad's fitness, he said: “The positive thing is all players are fit and available – just Will Hughes is questionable.\n“He’s a bit sick, so let’s see how the afternoon and the night will be.\n“But all others arrived back from the national teams in very good shape, and all the players who are here are fit.\n“It’s just Chadi Riad and Cheick Doucouré who are out for the rest of the season. All others are ready.”\nFrom Aston Villa & Preston to Everest base camp\nPreston v Aston Villa (Sun,13:30 BST)\nAs two of his former clubs aim to scale new heights in the FA Cup this weekend, Simon Grayson is getting ready to conquer his fears 4,500 miles away in Nepal.\n\"The scariest thing they've mentioned is going to Everest base camp, which is a two-hour helicopter ride away,\" the former Preston North End manager and Aston Villa player tells BBC Sport from Kathmandu.\n\"I'm not one for seeking thrills or anything like that.\"\nGrayson is a four-time promotion-winning boss closing in on 800 games as a manager.\nHis latest challenge has taken the Yorkshireman to South Asia where he is in charge of Lalitpur City for the 2025 Nepal Super League season, which starts on Saturday.\nThe following day Preston battle with Villa for a place at Wembley in the semi-finals of the FA Cup.\nRead here for the full story.\nSutton predicts: Preston North End v Aston Villa\nChris Sutton\nBBC Sport football expert\nPreston are hard to beat at home and have not lost at Deepdale since 2 November, a run of 15 games.\nI've seen quite a bit of Paul Heckingbottom's team this season and they will defend deep, set up in a 3-5-2 shape and make themselves hard to break down.\nIt's an old football cliche, but in this case it is very true that the first goal will be extremely important.\nAston Villa have got some brilliant attacking players, but I also always feel like teams can score against them.\nIf they go behind, they could have problems but I do feel their quality should see them through - depending on Unai Emery's team selection of course, with a big league game coming up at Brighton on Wednesday.\nVilla have got their eyes on numerous prizes and there probably hasn't been excitement levels like this at the club since Martin O'Neill signed me in 2006.\nI'm still backing them here, but it is going to be a cagey game, and they might have to wait to make the breakthrough before a couple of late goals get the job done.\nI'm going for Emi Martinez to keep a clean sheet, too. His keepie-uppie antics to wind up Brazil while playing for Argentina this week were another reminder of why he is the best goalkeeper in the world. Anyone who can produce moments like that in a game of that magnitude deserves all the accolades you can get.\nSutton's prediction: 0-2", "url": "https://www.bbc.com/sport/football/live/c93kr2494r6t"}