{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:46", "date_modify": "2025-04-26 03:40:46", "date_publish": "2025-03-05 09:37:38", "description": "Cardiff City boss Omer Riza says striker Yousef Salech is repaying the faith he showed in him with the big impact he is having for the Bluebirds.", "filename": "sport_football_articles_c0q18vz7jgyo_1745638846.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3493/live/f6af3e00-f9a3-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0q18vz7jgyo_1745638846.html", "title": "Cardiff City: Omer Riza delighted by Yousef Salech impact", "title_page": "Cardiff City: Omer Riza delighted by Yousef Salech impact - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City boss Omer Riza says striker Yousef Salech is repaying the faith he showed in him with the big impact he is having for the Bluebirds.\nSalech became the first player to score in 13 league games against Burnley on Tuesday night as the Clarets conceded for the first time since December with Salech also hitting the post and crossbar in Cardiff's 2-1 defeat.\nRiza revealed that the choice to sign Salech was his, with the Cardiff board telling him \"the decision is on you\".\nThe 23-year old has now scored six goals for the Bluebirds in 12 games and looks their best forward signing in a number of years with Riza delighted by his impact.\n\"When I wanted to sign him, the message was, 'This is on you. Is he at the level to step up to the Championship? Is he going to be able to do this? Or do that?'\" Riza said.\n\"I said, 'Look, I'm telling you what he's going to do' and so far, touch wood, he is doing that. I always say, live by the sword, die by the sword, let's hope it continues. I don't want to put too much pressure on him.\n\"He was good today, Yousef, he was strong, won his headers and first and second balls, he tried to bring the ball in. He created opportunities and scored an opportunity. I'm really happy with him.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c0q18vz7jgyo"}