{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:18:00", "date_modify": "2025-05-20 14:18:00", "date_publish": "2023-07-29 15:47:24", "description": "Norway face the Philippines, Switzerland play New Zealand, South Korea take on Morocco and Germany are up against Colombia on day 11 of the Fifa Women's World Cup.", "filename": "sport_football_66347031_1747750680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17460/production/_130582359_gettyimages-1568948228.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347031_1747750680.html", "title": "Fifa Women's World Cup day 11: Norway, New Zealand and Germany all in action", "title_page": "Fifa Women's World Cup day 11: Norway, New Zealand and Germany all in action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Co-hosts New Zealand could book their place in the last 16 on day 11 of the Fifa Women's World Cup.\nThey play Group A leaders Switzerland in a battle for top spot (08:00 BST) - live on the BBC - while the Philippines could cause an upset against former world champions Norway to progress (08:00 BST).\nThe conclusion of the second round of group games will also feature Germany taking on Colombia (10:30 BST) and South Korea facing Morocco (05:30 BST).\nHere is what to look out for.\nGroup H | Adelaide | 05:30 BST | BBC\nMorocco were given a brutal welcome to their first Women's World Cup with a 6-0 defeat by two-time champions Germany, while South Korea struggled to make a mark in their 2-0 loss to Colombia.\nIt means both teams are chasing victory to keep alive their hopes of progressing to the knockout stages.\nSouth Korea boss Colin Bell is not taking Morocco lightly.\n\"There are a lot of teams that could lose heavily against Germany. It is anybody's game at the moment,\" he said.\n\"We were punished for the mistakes that we made [against Colombia]. That's football. You cannot be disappointed for three or four days.\"\nMeanwhile, Morocco manager Reynald Pedros hopes to see a response from his players following their loss to Germany, saying they need to \"de-dramatise\" the result.\nBBC Sport football expert Rachel Brown-Finnis' prediction: Morocco had a few decent moments against Germany but they were never going to get anything out of them - they were outclassed in every department.\nIt might not be one-way traffic this time, but it's going to be just as hard for them against South Korea too. 2-0\nKey stat: South Korea have lost their past five games at the Women's World Cup, their longest losing run in the competition, scoring only one goal across those games.\nGroup A | Dunedin | 08:00 BST | BBC\nNorway could become the first big nation to be eliminated from the competition after a disappointing group stage - losing to New Zealand in their opening match before drawing with Switzerland.\nIt means Norway must beat the Philippines - who defeated co-hosts New Zealand 1-0 in their last game - and then, depending on the result in the other group game, hope it is enough to overtake either New Zealand, currently two points and one goal better off, or Switzerland, three points and three goals better off.\nHege Riise's side have so far competed under a cloud of controversy with Barcelona winger Caroline Graham Hansen, one of the stars of the team, saying she felt she had \"not been shown respect\".\nAnd former Ballon d'Or winner Ada Hegerberg will be missing for Norway, having pulled out of the goalless draw against Switzerland after the warm-up with a groin strain.\n\"The rest of us have prepared as best we can for what we have to do and the group has handled it very well,\" said Riise.\nMeanwhile, World Cup debutants the Philippines are hoping to capitalise on their shock 1-0 win over New Zealand to upset Norway.\nManager Alen Stajcic said: \"We are still alive. No one thought we will be alive. We are everyone's underdog. We are going to the last match against the superpower of women's football, historically.\"\nBBC Sport football expert Rachel Brown-Finnis' prediction: I was expecting Norway to be in a much better position in Group A after two games - and their situation reflects how much the squad environment is reflected in results.\nA collection of talented individual players who are fragmented and disjointed lost to New Zealand and then drew with Switzerland, who both have less quality and no real superstars but are more unified as teams.\nI think they will do their bit and beat the Philippines, who are still in the mix themselves. 2-0.\nKey stat: Norway are now without a win in four successive games at the Women's World Cup (drawn two, lost two), their longest such run, while the 2023 tournament is the first time they are without a win in their opening two group games (drawn one, lost one).\nGroup A | Auckland | 08:00 BST | BBC\nSwitzerland are in the driving seat and will qualify for the last 16 if they avoid defeat against co-hosts New Zealand, while a win will guarantee they progress as Group A winners.\nThey saw off the Philippines 2-0 in their opening match before holding former champions Norway to a goalless draw to put themselves in a strong position.\n\"We have it in our own hands and are convinced that we can do it on our own,\" said Switzerland manager Inka Grings.\nNew Zealand stunned Norway in their first group game to win their first-ever Women's World Cup match and opened the tournament in style - but they lost to the Philippines to cast doubts over their last-16 hopes.\nThe co-hosts know they can qualify with victory, or if they draw and Norway's match against Philippines also ends level.\nBut defeat means New Zealand would become the first Women's World Cup hosts to be eliminated at the group stage.\n\"We are excited to have another opportunity to play in front of our fans. It's a great challenge for us,\" said manager Jitka Klimkova.\n\"Switzerland are a very strong team. I feel we are prepared and we know them after studying them.\"\nBBC Sport football expert Rachel Brown-Finnis' prediction: This one is going to be very close but I am backing New Zealand to edge it and top the group.\nThe Ferns have got team spirit and togetherness in abundance and that can make the difference for them - they have a real desire to get through and a collective approach to making it happen.\nSwitzerland have been very solid in their opening matches and are yet to concede a goal, but I am going for the co-hosts to get through. 0-1.\nKey stat: After failing to keep a clean sheet in any of their four games at the Women's World Cup in 2015, their debut at the tournament, Switzerland have now done so in each of their opening two games in 2023 (won one, drawn one).\nGroup H | Melbourne | 10:30 BST | ITV\nThere were concerns this week when Colombia's star forward, 18-year-old Linda Caicedo, appeared to collapse in training.\nBut Colombia manager Nelson Abadia said \"there is no problem\" with Caicedo, who scored in their opening 2-0 victory over South Korea.\n\"She has totally overcome the problem. We have 24 hours to make a decision [on whether she will face Germany], but Linda is fine,\" he added.\nGermany, meanwhile, got the ball rolling with a 6-0 win over Morocco and remain heavy favourites to top the group.\nHowever, injuries in defence contributed to several sloppy moments and manager Martina Voss-Tecklenberg confirmed they will now be without Wolfsburg's Felicitas Rauch against Colombia.\nBayern Munich midfielder Lina Magull said the squad can still take \"a lot of confidence\" from prolific striker Alexandra Popp, who scored two against Morocco, and they are prepared for Colombia's physicality. \"They have a certain strength, that is their way to play. It is not something that is surprising to us,\" said Magull.\n\"It speaks for the Colombian team that they play with passion. We are not afraid, it is just something to be prepared for. Football is not just one way of playing, that's why it is beautiful.\"\nBBC Sport football expert Rachel Brown-Finnis' prediction: I worry for Colombia here. They play in quite an open style and Germany are capable of destroying them the same way they thrashed Morocco. 3-0.\nKey stat: Germany are unbeaten in their past 20 group matches at the Women's World Cup (W16 D4), the longest ever run without defeat at this stage by any nation.", "url": "https://www.bbc.com/sport/football/66347031"}