{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:31", "date_modify": "2025-05-20 11:41:31", "date_publish": "2023-08-06 17:56:00", "description": "Leicestershire beat holders Kent by 264 runs in the One-Day Cup and there are also wins for Somerset, Glamorgan and Northants.", "filename": "sport_cricket_66421309_1747741291.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/478D/production/_130671381_shutterstock_editorial_14042082aj.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66421309_1747741291.html", "title": "One-Day Cup: Leicestershire thrash Kent as James Rew hits another ton for Somerset", "title_page": "One-Day Cup: Leicestershire thrash Kent as James Rew hits another ton for Somerset - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicestershire made a new club record limited-overs score against first-class opponents as they crushed holders Kent by 264 runs in the One-Day Cup.\nFive players passed 50 as they piled up 380-5 and Roman Walker then took 6-43 as Kent were bowled out for only 116.\nElsewhere, in-form James Rew made 101 off 93 balls as Somerset defeated Worcestershire by 36 runs at Taunton.\nGlamorgan's Colin Ingram hit 115 not out as they beat Derbyshire and Northamptonshire overcame Sussex.\nCheteshwar Pujara scored an unbeaten 106 for the visitors but it was not enough as Northants reached their revised target of 243 with eight balls to spare.\nSunday's only Group A game took place at Beckenham where Kent opted to put Leicestershire in, perhaps mindful of the away side chasing down a target of 326 to beat Surrey three days earlier.\nThe visitors, though, made a flying start with Rishi Patel (50) and Sol Budinger (67 off 47 balls) putting on 116 in 17 overs for the first wicket.\nSpinner Matt Parkinson got rid of Budinger and Lewis Hill in successive overs, but there was no loss of momentum as Peter Handscomb and Colin Ackermann shared a stand of 125 before the former was caught off James Bazley for 87 off 67 balls.\nThe punishment continued as Wiaan Mulder hit two sixes and eight fours in his 67 off 35 and Ackermann finished on 78 not out as Leicestershire passed their 377-4 against Worcestershire at Grace Road in 2019.\nHowever, their record one-day total in any game remains 406-5 against Berkshire in 1996.\nKent's hopes of chasing such a big target never really got going as they slumped from 45-1 to 67-6 in the space of six overs.\nSkipper Jack Leaning top-scored with 25 and Alex Blake was left unbeaten on 24 as they were all out in the 24th over, with seam bowler Walker recording his best figures in a List A game as last man Parkinson edged a lifting ball to Ackermann at first slip to give Leicestershire their biggest one-day win.\nTeenager James Rew added a List A century to the five he has scored in this summer's County Championship as Somerset totalled 287-9 against Worcestershire, who were looking to make it three wins out of three in Group B.\nAndy Umeed (34) and Lewis Goldsworthy (47) put on 65 for the second wicket before debutant Cameron Jones had Umeed caught behind down the leg side, but Rew and skipper Sean Dickson (37) then took over to add 96 for the fourth.\nRew played two perfectly timed reverse sweeps for six before reaching his 100 with a lofted four down the ground, but he then fell to Ben Gibbon (3-58) as Somerset lost their way from 241-3 in the 42nd over.\nWorcestershire were in with a great chance with 56 needed from the final 10 overs of their chase, with five wickets standing, but Ben Cox skied to square leg on 58 and Josh Baker followed in the same Curtis Campher over.\nFrom 232-5, they were all out for 251 and Ireland's Campher dismissed Jones first ball to finish with 3-51.\nSussex were pinned down by some good Northamptonshire bowling at Wantage Road - especially from Jack White, who took 3-29 from nine overs - but Pujara's excellent 119-ball innings saw them to 240-7 from 45 overs following a rain interruption.\nNorthants' target was revised to 243 using the DLS method but they suffered a setback when Prithvi Shaw played on to Brad Currie in the fourth over, having made 26 off 17 balls.\nRicardo Vasconcelos (37) and Sam Whiteman (30) both fell to spinner Jack Carson and the home side were left needing 84 from their final 10 overs.\nThat came down to 33 from four with Tom Taylor - who hit 112 off 88 balls against Gloucestershire in their opening match - still at the crease.\nTaylor hit three sixes in his 42 not out off 23 balls before Justin Broad slammed Ari Karvelas over mid-wicket for a maximum to end the game.\nLuis Reece (69) and Harry Came (73) shared an opening stand of 134 for the home side at Derby and Haider Ali struck three sixes in his 63 off 50 balls before being caught off Ben Kellaway, whose 3-41 were his first senior wickets for Glamorgan.\nDerbyshire reached 298-8 in their 50 overs and seemed to be on top when openers Tom Bevan (44) and Eddie Byrom (30) went in successive overs in reply.\nBut Ingram and Kiran Carlson (65 off 52 balls) put on 135 and the South African hit three sixes and 11 fours in his 108-ball knock as he and Billy Root (34 not out) saw the 2021 winners home on 299-3 at the start of the 48th over.", "url": "https://www.bbc.com/sport/cricket/66421309"}