{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-04-26 07:28:16", "date_modify": "2025-04-26 07:28:16", "date_publish": "2025-02-27 19:18:36", "description": "Three things to watch for on SWPL return", "filename": "sport_articles_c2417je7dllo_1745652496.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45fd/live/097ab520-f45c-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c2417je7dllo_1745652496.html", "title": "Three things to watch for on SWPL return", "title_page": "Three things to watch for on SWPL return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The SWPL is back with a bang after the international break as the final round of pre-split fixtures take place.\nThe post-split spots are sealed, but there's still plenty to keep an eye on come Sunday...\nTwo of the top four tussle\nWith the top quartet all locked together on 51 points, game of the weekend is in Edinburgh as fourth-placed Hibernian face third-placed Celtic.\nFresh off the back of signing a new two-year deal with the Edinburgh club, Grant Scott's mightily impressive - and somewhat surprising - side welcome Elena Sadiku's reigning champions in the later kick-off, live on BBC Alba and the BBC Sport website and app.\nWith 20 league goals and counting, Hibs striker Eilidh Adams made her Scotland debut in Austria last week and her first start at Hampden on Tuesday night against the Dutch.\nBouncing and beaming, the 20-year-old will look to pick up where she left off in what promises to be a superb game.\nMcDonald-Nguah to make a difference at United?\nDuring the international break, rock-bottom Dundee United secured the services of long-time SWPL striker Kaela McDonald-Nguah.\nThe former Spartans and Motherwell forward has joined Suzy Shepherd's side with, no doubt, only one intention - to put the ball in the back of the net.\nIt's something United have struggled with this term, having only scored 13 goals in 21 games.\nMcDonald-Nguah is a no-nonsense, hard to handle, centre-forward who has shown her ability to drive in a delicious strike or two.\nAberdeen to go five unbeaten at the Balmoral?\nAfter a bit of a sticky start, Scott Booth has fair steadied the ship at Aberdeen, particularly at home.\nCup wins against Gartcairn and Hamilton Accies were sandwiched by a crucial league victory against Queen's Park. And in their last game at the Balmoral, they drew with last season's sixth-best side Partick Thistle.\nThe Dons have a fine opportunity to make it five games without defeat on their own turf as they welcome Spartans on Sunday.\nBooth's side are one point ahead of the Edinburgh club, and a win on Sunday would set them up nicely at the top end of the bottom six heading into the split.", "url": "https://www.bbc.co.uk/sport/articles/c2417je7dllo"}