{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-05-21 06:33:16", "date_modify": "2025-05-21 06:33:16", "date_publish": "2025-01-14 04:23:29", "description": "The Los Angeles Rams pay tribute to the city's firefighters and first responders as they clinch the last spot in week two of the NFL play-offs.", "filename": "sport_american-football_articles_cd0jg4zp104o_1747809196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbbb/live/112fb1a0-d236-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_cd0jg4zp104o_1747809196.html", "title": "NFL play-offs: Los Angeles Rams beat Minnesota Vikings after fires force game to be relocated", "title_page": "NFL play-offs: Los Angeles Rams beat Minnesota Vikings after fires force game to be relocated  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Los Angeles Rams paid tribute to the city's firefighters and first responders as they beat the Minnesota Vikings to clinch the last spot in week two of the NFL play-offs.\nThe Rams earned home advantage for the final game of Wildcard Weekend but Monday's game had to be relocated to State Farm Stadium, home of the Arizona Cardinals, because of wildfires around LA that have killed at least 24 people.\nYet it still felt like a home game as the Rams romped to a 27-9 win against a Vikings team that failed to recover after being denied the number one seed in the NFC Conference last week.\nThe Rams sold more than 52,000 tickets for the 63,000-capacity venue in Phoenix, which is a six-hour, 375-mile drive from SoFi Stadium.\nA Rams contingent of more than 400 - including players, family, coaches, staff and even pets – travelled on Friday and the team had use of the Cardinals' training facility.\nHaving secured the NFC West title, the Rams were able to rest their key starters on the final day of the regular season while the Vikings suffered a demoralising loss at the Detroit Lions.\nAnd it showed as the Rams charged into a 24-3 lead by half-time, with Vikings quarterback Sam Darnold being sacked six times and giving up two turnovers.\n\"We knew what we were playing for,\" said Rams quarterback Matthew Stafford. \"That was for the people of Los Angeles who are struggling right now.\n\"We're living it every day. It was a tough week for us, a bunch of moving parts. It's been a whirlwind, but to come out here and play like we did, in all phases, I'm really proud of this group.\"\nMinnesota's trip to divisional rivals Detroit last week was the first game in NFL history between two 14-win teams, and it wasn't just the NFC North title on the line.\nThe winner clinched the NFC's number one seed, plus a bye for the first round of the play-offs and home-field advantage in the Divisional Round.\nThe loser had to settle for the fifth seed, no week off and a road trip on Wildcard Weekend.\nThat proved too much for the Vikings to overcome so, despite finishing the regular season with a 14-3 record, they have fallen at the first play-off hurdle for the second time in three years.\nThe Rams got off to a flying start, with Stafford finding Kyren Williams for a touchdown on the opening drive before LA added a field goal.\nThe Vikings replied with a field goal and had a touchdown chalked off after returning what they thought was a fumble by Stafford.\nBut just as it looked like they were getting a foothold in the game, Darnold turned the ball over on successive drives.\nHe was intercepted by Cobie Durant before Ahkello Witherspoon sacked the Vikings quarterback to force a fumble, with Jared Verse scooping up the loose ball to run in a 57-yard touchdown.\nStafford hit a wide-open Davis Allen for his second touchdown pass right before the half and, although Darnold found TJ Hockenson for a 26-yard score in the third quarter, the Vikings then accepted their fate after a season that promised so much.", "url": "https://www.bbc.com/sport/american-football/articles/cd0jg4zp104o"}