{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 11:53:06", "date_modify": "2025-05-20 11:53:06", "date_publish": "2023-08-05 20:48:11", "description": "Maisie Summers-Newton and Ellie Challis both add to their gold medal haul at the Para Swimming World Championships.", "filename": "sport_disability-sport_66416781_1747741986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1173E/production/_130668417_bbc-sport-index-imagery-2-split-images-gradient-73a4329b-203f-4dbb-a627-44556e7c90a6.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66416781_1747741986.html", "title": "Para Swimming World Championships: Maisie Summers-Newton and Ellie Challis win golds", "title_page": "Para Swimming World Championships: Maisie Summers-Newton and Ellie Challis win golds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Maisie Summers-Newton improved her own European record as she won her second gold on the penultimate day of the Para Swimming World Championships.\nThe European, World, Paralympic and Commonwealth champion claimed SB6 100m breaststroke honours to add to her medley gold and freestyle silver.\n\"I definitely wanted to win that one and come away with two gold medals,\" she told BBC Sport.\nElsewhere, Ellie Challis won S3 200m freestyle gold for her third title.\nSummers-Newton, 21, who combines swimming with teacher training at the University of Northampton, has been a mainstay of the British team since making her debut at the 2018 Europeans in Dublin.\nBreaststroke is her main event and she finished in a time of one minute 31.34 seconds to beat her previous best of 1:32.16 set last year and move closer to the world record of 1:29.87.\n\"I adore the breaststroke. It is my favourite event and it means a lot to win,\" she added.\n\"That world record is definitely something to aim for to keep spurring me on - maybe it will come in Paris next year.\n\"Coming away with personal bests and season's bests - you can't ask for much more a year out from a Paralympics - and I think that is because I have a good support network around me.\"\nChallis made it five medals from five races to continue her superb week in her home pool.\nWith American rival Leanne Smith, who won seven golds at last year's World Championships in Madeira, struggling for form this year, the 19-year-old ended up a comfortable winner of the S3 200m freestyle.\nChallis finished in 3:35.20 with Brazil's Susana Schnardorf second (4:18.18) and Smith third (4:21.95)\n\"When I turned for the last length I saw the clock and what time it was and it gave me that push that I needed,\" she said.\n\"I know Leanne has been ill all year so for her to come here and win a medal is special. We have raced each other since 2019 and we are good friends.\n\"I am massively looking forward to Paris next year and having a big crowd supporting me again.\"\nGB's other medal of the night came in the S14 4x100m medley relay where the quartet of Poppy Maskill, Scott Quin, William Ellard and Jessica-Jane Applegate finished second behind a strong Australia team.\nWith one day of competition to go, GB are fifth in the medal table with 34 medals, including 14 golds.", "url": "https://www.bbc.com/sport/disability-sport/66416781"}