{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-04-26 04:39:32", "date_modify": "2025-04-26 04:39:32", "date_publish": "2025-02-28 09:22:24", "description": "The Hibernian-Heart of Midlothian derby, Hearts striker Elton Kabangu and Dundee United manager Jim Goodwin are in focus on Sunday in the Scottish Premiership.", "filename": "sport_football_articles_c0mww9k0m9xo_1745642372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1edd/live/ee90cbc0-f6f2-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0mww9k0m9xo_1745642372.html", "title": "Jim Goodwin, Elton Kabangu and Edinburgh derby in focus", "title_page": "Jim Goodwin, Elton Kabangu and Edinburgh derby in focus - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The big games keep on coming in the Scottish Premiership, but the main interest lies away from the top two on Sunday after Celtic extended their lead after beating St Mirren on Saturday while Rangers stumbled again at home to Motherwell.\nOn Sunday, it is the turn of the four other sides in the top six to meet as Hibernian host the Edinburgh derby with Heart of Midlothian and Dundee United visit Aberdeen.\nHere are some key points to watch out for.\nAfter horrendous starts to the league season, Hibs stuck by their head coach while city rivals Hearts changed theirs. Both strategies appear to have worked.\nWhen the sides drew 1-1 at Easter Road in October, three games after Neil Critchley succeeded the sacked Steven Naismith, they remained tied on points at the foot of the table, with Hibs rock bottom on goal difference.\nFew at the time would have fancied the chances of either finishing the season in third place.\nAfter Hibs won 2-1 at Tynecastle on Boxing Day, Hearts were still stuck in second bottom, while the visitors' win merely lifted them five points clear of the relegation play-off spot, albeit up to seventh.\nHowever, Sunday's derby has switched from being a relegation dogfight into a race to secure a place in the top half, with Hibs having moved up to fourth and Hearts to sixth - for the first time since August - after both enjoyed 3-1 wins in midweek.\nIndeed, both will have their sights set firmly on catching an Aberdeen side who have regained third spot after ending a dismal spell of their own but suffered a 5-1 thumping away to leaders Celtic on Tuesday.\nHearts, though, cannot afford to slip up this time as they head to the other side of Edinburgh Castle, considering they are four points behind Hibs and Dundee United - and a further point adrift of the Dons.\nCritchley's side have suffered just one defeat - to second-top Rangers - in 12 outings and are seven unbeaten on the road.\nHowever, David Gray's hosts are on an even more impressive unbeaten run of 14, winning 10 of them, eight of those at Easter Road.\nA derby cracker would appear assured after Hibs and Hearts displayed their new-found resilience by coming back from a goal down to beat United and St Mirren, respectively, on Wednesday.\nHibs have home advantage, but Hearts have only lost one of their latest 10 visits to Easter Road, have not lost successive games to their city rvials since 2009 and were the side to end Hibs' run the last time they went 12 league games unbeaten in 2018.\nIt is not long since Jim Goodwin was being hailed for the job he has done in lifting United out of the Championship and into the Premiership's top six.\nEverything looked rosey when they overtook Aberdeen into third spot, but after one win in seven, including four straight defeats, they find themselves in fifth, a point behind the Dons again as they visit Pittodrie on Sunday.\nHibs' 3-1 win at Tannadice on Wednesday also lifted the resurgent Edinburgh side above United on goal difference and the battle for third is suddenly a three-team race - and maybe a fourth with Hearts only four points further back.\nGoodwin and his team were left smarting from a Sam Dalby's disallowed goal when the score was 1-1, with the club requesting an explanation from the Scottish FA - and publication of the VAR conversation - about the decision.\nHaving had an unhappy experience as Aberdeen boss, Goodwin will also be particularly keen to get his side back on track at Pittodrie, where they have lost three of their latest four visits, drawing the other, since a 3-0 Scottish Cup win in April 2021.\nThe latest was a 1-0 defeat in October, but United reversed that scoreline at Tannadice in final game of 2024 and, since then, no side has lost more top-flight games or scored fewer goals than Aberdeen.\nShould United head down the A90 with three points, they will have enjoyed back-to-back league victories over the Dons for the first time since November 2008 under Craig Levein and Goodwin's side will have re-emphasised their European qualification credentials.", "url": "https://www.bbc.co.uk/sport/football/articles/c0mww9k0m9xo"}