{"authors": ["Mike Whalley", "www.facebook.com"], "date_download": "2025-04-26 06:33:52", "date_modify": "2025-04-26 06:33:52", "date_publish": "2025-02-27 06:31:57", "description": "When England's women face Australia in Las Vegas on Saturday night, they can thank the Great Britain trailblazers who overcame remarkable odds just to get a Test series on - and then won it.", "filename": "sport_rugby-league_articles_c4g0d4n728qo_1745649232.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0235/live/d8ef7c00-eecb-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_c4g0d4n728qo_1745649232.html", "title": "England v Australia in Las Vegas: Great Britain Lionesses remember 1996 tour", "title_page": "England v Australia in Las Vegas: Great Britain Lionesses remember 1996 tour - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lisa McIntosh is up-front with her thoughts on England's women facing world champions Australia in Las Vegas.\n\"Do you know? It makes me feel really proud,\" says the former Great Britain captain. \"But I'm not going to lie - I'm a bit envious.\n\"I'd have loved to have just turned up with my kitbag and got on the plane and played in Vegas. But I'm made up for them.\"\nWhen England's players step out at Allegiant Stadium in Vegas on Saturday night, McIntosh is part of the trailblazing group of women they can thank.\nTwenty-nine years ago, with minimal help, that group organised and self-funded a Great Britain tour to Australia - and beat the hosts. They remain the last British rugby league team to win an Ashes series.\nSo they know what it takes to defeat the Jillaroos.\n\"I think what England need to do is not fear them,\" McIntosh says. \"Australia are so good, that straight away people start to worry.\n\"But you go out there and you be confident. If you match them player for player, there's no reason why you can't beat them.\"\nBack in 1996, Great Britain's travelling party overcame the odds to defeat Australia.\nA series that was on a knife edge until its final seconds featured funding battles, scrambles for flights and accommodation, a tour manager carrying £29,000 in a briefcase, disappearing kit and emotional phone calls home.\nThen came the forging of lifelong friendships, belated Hall of Fame recognition - and a victory shield that vanished.\nBut first came the fight just to get on to the pitch.\n\"It was basically about two weeks before we were due to go that we actually knew we were going,\" says Jackie Sheldon, Great Britain's assistant coach in 1996.\nSheldon was secretary of the Women's Amateur Rugby League Association (Warla), which then oversaw the British women's game, when it received an invitation in 1995 to tour Australia.\nAccepting the offer was the easy part. Then came the trickier aspects. For a start, there wasn't a Great Britain women's team.\nSo with Warla chair Anne Thompson, Sheldon set up a committee to hire a head coach, find players and form a backroom team. With no budget, everyone had to be persuaded to take on the roles unpaid.\n\"These people who got involved were professional people,\" Sheldon says. \"And they were all giving their time for free.\n\"I would go: 'This is what I want, and I haven't got any money. Will you come on board?' And they'd say: 'Yeah.' Because they believed in what we were trying to do.\"\nIan Harris, a coach who worked in local authority sports development, took charge of the team, with Sheldon and Thompson as his assistants, and a squad of 26 was put together. Now they had to find £70,000 to pay for the tour.\nSheldon, herself then a council sports development officer, got to work. \"We were not funded by anywhere,\" she says, \"so I wrote a grant application to the Foundation for Sport and the Arts, and we got something like £34,000 from them. And each of the players were given a target of about £1,000 to raise.\"\nAs the summer of 1996 approached, the plans were coming together.\nThen with just weeks to go, the team's tour manager dropped out - and chaos loomed.\nSheldon and Thompson knew Nikki Carter, a Hull Vixens player who had management experience from working at a care home. They asked if she would step in as tour manager.\n\"I was asked: 'Do you think you could help them out?'\" Carter says.\n\"I was like: 'What do you mean?' They said: 'Go to Australia with them.' I was like: 'Hmm, I'd love to. Best go and ask my boss, really.'\n\"But it suddenly started to unravel. Lots of things that should have been organised 12 weeks out from going to Australia weren't actually organised.\"\nThe touring party had no flights, no accommodation, no kit.\nSheldon says: \"The previous manager, prior to Nikki, had been tasked with securing the flights, and he didn't secure them and didn't tell us, so it was only about three weeks beforehand that it all came out that we had no flights.\n\"My manager allowed me time in work to phone all the airlines to try to get, I think, 32 flights at three weeks' notice.\"\nAs Sheldon sorted flights, Carter sourced kit, chased hotels and helped to complete the fundraising. \"Most of the money was raised in the final eight weeks,\" she says. They needed to set up a bank account quickly for the tour. And in 1996, that was a problem.\n\"There was no bank account set up in Australia,\" Carter says, \"and it wasn't like now, where you could ring the bank and say: 'I'm going to put this money in there and I'm going to spend it from my bank account.'\n\"One of the girls on the tour, who played for Wakefield, was a bank manager. And she said: 'It's not possible to set the bank account up. It took too long.'\n\"So I ended up going to Australia with a briefcase with £29,000 in cash and travellers' cheques, because there just was no other way. I carried that briefcase through the whole tour - everywhere I went, that went.\"\nThe Great Britain party made it to Australia, but there were more obstacles. Arriving at Sydney Airport, they were hit with an immediate transport problem. Their coach was only big enough to fit either all the players, or all the kit - but not both. Carter, meanwhile, was organising team meals on the fly.\n\"I think there was a lot of bartering,\" captain McIntosh says, \"trying to get good deals, where we'd get breakfast and tea included.\"\nThe team faced seven matches in 19 days: a Sydney Select side were thumped 86-0, before an Australian Capital Territory side were defeated 36-0 in Canberra, where the first Test against Australia was also held.\nGreat Britain lost that match 16-14, to a late penalty - amid controversy.\n\"We got a penalty in the last few minutes,\" McIntosh says. \"Karen Burrows converted it, but the officials disallowed it - they said it didn't go over.\"\nNext was a trip north to Brisbane, with the team booked in for an exhausting 12-hour, 700-mile-plus coach journey. Tour manager Carter intervened.\n\"We'd gone on the coach from Sydney to Canberra, but we needed to fly to Brisbane,\" Carter says.\n\"So we went to the airport and I said: 'Would you be able to get us 32 flight tickets from Canberra to Brisbane tomorrow?' And the guy at the desk looked at me a bit strange. He tapped away and he said: 'Oh, yeah, yeah, we could do that.' Then I had to negotiate on all the luggage.\n\"And then I said to him: 'OK. How would I pay: Cash or travellers' cheques?' And this guy's face was a picture. So I paid for 32 flights with some travellers' cheques.\"\nIn Brisbane, the Great Britain and Australia players stayed in the same accommodation. \"They were like student dorms,\" McIntosh says.\nHere, there was another challenge for the tourists - keeping track of their kit.\n\"We were given each two shirts, so at the end of the tour, we had one to swap and one to keep so we could frame,\" McIntosh says. \"But the kit was laundered and a couple of shirts from our bag went missing, including my spare number 13 shirt.\n\"We never found out what happened to it, but we had our suspicions.\"\nBritain beat a Queensland XIII 22-8 to warm up for the second Test against Australia, and they won that key match 18-12 to level the series. Now it was back to Sydney for the decider.\nBut for some members of the squad with young children, being far away from home was proving tough.\n\"I rang home at certain times of the day because I knew the kids wouldn't be there,\" Carter says. \"My eldest daughter was six when I went. If I rang home, she would be crying down the phone, saying: 'I'm missing you, Mummy.' And it would then take days to recover from that phone call.\n\"There was that pang of guilt because I'm out here and I'm having a great time. At the same time, I've left my children at home - and as a mother, is that the right thing?\n\"It was hard and anybody in that position who says it wasn't, I think will be telling you porky pies.\"\nAfter a 30-0 victory over a Presidents XIII in Sydney, Great Britain faced the deciding Test against Australia. It was a nail-biter.\nThe tourists built up a healthy lead, with McIntosh running half the length of the pitch for a fine individual try - but had to withstand a battering as Australia fought back. As the clock ticked down, Britain held a slender 20-18 lead.\n\"We were defending on our line for our lives for the last 10 minutes,\" McIntosh says. \"It just never seemed to end.\"\nThe captain has little memory of watching those closing minutes, having been concussed in a clattering tackle.\n\"When the final whistle went,\" McIntosh says, \"I said to Paula Clark, the team physio: Have we won?\n\"We didn't realise how significant it would be in time - winning the Ashes in Australia. It was just like: 'We beat the Aussies on their own turf and it was great.'\"\nBelatedly, Great Britain's 1996 team have been recognised. Former referee Julia Lee, who officiated during the tour, began driving the Women in Rugby League project, a celebration of the sport's female pioneers.\nIn 2022, McIntosh joined team-mates Brenda Dobek and Sally Milburn as they became the first women inducted into the Rugby League Hall of Fame.\nLast October, Jane Banks and Michelle Land followed, while the 1996 side became the first team to be inducted.\n\"I think it's sad that it took so long, but I think it's fantastic that we're in a different place now,\" Carter says.\nOctober's ceremony in Wigan brought virtually the entire squad back together.\n\"There was a camaraderie that was built in '96,\" Carter says. \"We all met up for the Hall of Fame inauguration, and it was like we'd never been away from each other.\"\nGreat Britain's players made long-lasting friendships with the Australians too - which finally reunited McIntosh with one of her shirts.\n\"I never found the shirt that was taken during the tour, but I did get back the one that I swapped,\" McIntosh says. \"Their captain, who I swapped my shirt with, returned it to me.\"\nBut there's one major memento from 1996 that no-one can find.\nBritain's players, wearing the Australia shirts they had just swapped, posed for a team picture after winning the series.\nIn that special moment, they showed off their prize - a large shield.\nThree years ago, before an exhibition to celebrate their achievements, an appeal was put out to locate the shield. It hasn't turned up.\n\"We thought we'd brought it back, and that it was at the RFL,\" McIntosh says. \"But it's not.\"\nThe mystery remains unresolved. \"Lisa always said she reckoned I had it in my attic,\" Sheldon says. \"I've got just about everything else in my attic but not that shield.\"\nIf anyone does have it, they're sitting on a piece of history.\n\"It's in somebody's attic, because I can't see where else it would have gone,\" Carter says. \"So maybe everyone needs to look in their attic!\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/c4g0d4n728qo"}