{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:31:36", "date_modify": "2025-05-21 04:31:36", "date_publish": "2025-01-18 00:00:00", "description": "Follow live text commentary, score updates and match stats from Port Vale vs Newport County in the League Two", "filename": "sport_football_live_c391ndvn9grt_1747801896.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c391ndvn9grt_1747801896.html", "title": "Headley earns Port Vale comeback win over Newport County", "title_page": "Headley earns Port Vale comeback win over Newport County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Port Vale returned to the League Two automatic promotion places as they came from 2-1 down at half-time to beat Newport County.\nBobby Kamwa had given the Exiles an early lead, but Ben Garrity drew Vale level on the half-hour mark.\nThe hosts were level just three minutes, however, as Cameron Evans' back-post header restored Newport's lead.\nJayden Stockley drew the hosts level for a second time after 62 minutes to set up a grandstand finish.\nAnd it was debutant Jaheim Headley, who set up Garrity for the first goal, who scored the winner, cutting inside from the right before beating Jacob Carney.\nCarney clawed a Nathan Smith header off the line with a remarkable save to keep the score at 3-2, but the visitors could not find a late leveller.\nPort Vale climb back to third in League Two, having dropped to fourth earlier on Saturday due to Doncaster's lunchtime win over Gillingham.\nNewport meanwhile drop to 20th, six points above the relegation zone.\nNewport County head coach Nelson Jardim told BBC Radio Wales:\n\"When you come away to a place like this, if you do score two goals you have to make sure you win the game.\n\"We didn't control the game as well as we normally do. Overall it's disappointing, but there were positives that these boys are showing.\n\"It's small things, they are things that if we had tidied up then the game would have been different.\"", "url": "https://www.bbc.com/sport/football/live/c391ndvn9grt"}