{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:00:05", "date_modify": "2025-05-20 14:00:05", "date_publish": "2023-07-31 07:33:07", "description": "Cornwall dramatically beat North Wales Crusaders 40-38 - having led 40-4 at half-time - for a third win in four games in League One.", "filename": "sport_rugby-league_66358648_1747749605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6B8F/production/_129953572_mediaitem129953571.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66358648_1747749605.html", "title": "Cornwall hang on to beat North Wales Crusaders 40-38 in League One", "title_page": "Cornwall hang on to beat North Wales Crusaders 40-38 in League One - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornwall held on to dramatically beat North Wales Crusaders 40-38 for a third win in four games in League One.\nThe Choughs led 40-4 at half-time before their hosts staged an impressive fightback that almost cost the Cornish side their fourth win of the season.\nSixth-placed Crusaders are the highest-ranked opponents Cornwall have beaten in their history.\nThe victory for Mike Abbott's side moves them up to eighth in the League One table with three games to go.\nCornwall raced to a club-record 34-0 lead after 27 minutes as Harry Boots opened the scoring before Cameron Brown twice went over either side of scores for Nathan Cullen, debutant Mackenzie Scurr and Adam Rusling.\nRob Massam scored in the corner for North Wales 12 minutes before the break, but Jaden Barraclough's try just before the interval ended up proving decisive.\nThe hosts came out flying after the break as Alex Eckley and Leon Hayes crossed in the opening five minutes.\nEckley was sin-binned soon after as the scoring was subdued, but as his time on the sidelines came to an end North Wales cranked up the pressure as Connor Wrench's try made it 40-22.\nJack Holmes' unconverted try in the corner three minutes later further reduced the gap before Wrench scored again to make it 40-32 with 13 minutes left.\nAs a nervous Cornwall tried to see the game out, Holmes crossed for his second try with five minutes to go to bring the Welsh side within two points, but Cornwall held on for a memorable win.", "url": "https://www.bbc.com/sport/rugby-league/66358648"}