{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-21 07:30:02", "date_modify": "2025-05-21 07:30:02", "date_publish": "2025-05-20 16:34:51", "description": "Everton condemn the \"threatening, racist, and misogynistic\" abuse aimed towards the wife of Dominic Calvert-Lewin.", "filename": "sport_football_articles_cr4zzn412gyo_1747812602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09c3/live/065dea30-3596-11f0-b0ff-f7093bacd9ad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4zzn412gyo_1747812602.html", "title": "Dominic Calvert-Lewin: Everton condemn \"threatening, racist, and misogynistic\" abuse of striker's wife Sandra", "title_page": "Dominic Calvert-Lewin: Everton condemn \"threatening, racist, and misogynistic\" abuse of striker's wife Sandra - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton have condemned \"threatening, racist, and misogynistic\" abuse aimed towards the wife of Dominic Calvert-Lewin.\nSandra Calvert-Lewin received online abuse after posting a message in support of her husband, who played his final game at Goodison Park in Sunday's 2-0 win over Southampton.\nThe 28-year-old forward has scored 30 Premier League goals for the Toffees at their home ground - a record bettered only by Duncan Ferguson and Romelu Lukaku.\nFollowing Everton's finale at Goodison Park before relocating to their new Hill Dickinson Stadium at Bramley-Moore Dock next season, Sandra Calvert-Lewin posted on Instagram: \"30 goals at Goodison. Top 3 ever. They might not shout it - but we're proud every single day.\"\nThe English forward has endured a dismal campaign, scoring just twice at Goodison Park this season, and her post was criticised by some Toffees supporters.\nThe club said: \"Everton Football Club strongly condemns the threatening, racist, and misogynistic abuse directed towards the wife of Dominic Calvert-Lewin on social media.\n\"This sinister and intimidating behaviour is not only deeply hurtful and distressing, it is also criminal - and does not represent the values of Everton or the overwhelming majority of our supporters.\n\"The club has a zero-tolerance policy towards all forms of discriminatory and abusive behaviour. We are working closely with Merseyside Police and the Premier League to ensure the individuals responsible are identified and held accountable for their actions.\n\"Threats or abuse of any kind - whether online or in person - are completely unacceptable and have no place in our game or in society. The club urges anyone who sees or experiences such behaviour to report it to the authorities and relevant social media platforms immediately.\n\"We will continue to offer our full support to Dominic and his family.\"\nIn response, Merseyside Police said: \"We are aware of racist and threatening social media comments directed towards the wife of Dominic Calvert-Lewin.\n\"To send such abhorrent messages to anyone online is utterly appalling and we are working with Everton Football Club as part of our initial enquiries.\n\"We take these reports extremely seriously and would like to remind social media users that any belief that they can maintain anonymity online to commit offences is misplaced.\n\"Offences committed online, which includes making threats and racist abuse, can be investigated.\"", "url": "https://www.bbc.com/sport/football/articles/cr4zzn412gyo"}