{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:29:22", "date_modify": "2025-04-26 06:29:22", "date_publish": "2025-02-27 11:05:43", "description": "Two-time continental champions Equatorial Guinea and Tunisia suffer upsets in qualifying for the 2026 Women's Africa Cup of Nations.", "filename": "sport_football_articles_cdjydgn3700o_1745648962.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e323/live/5ac647c0-f4fa-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdjydgn3700o_1745648962.html", "title": "Wafcon 2026 qualifiers: Equatorial Guinea and Tunisia suffer upsets", "title_page": "Wafcon 2026 qualifiers: Equatorial Guinea and Tunisia suffer upsets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former champions Equatorial Guinea will miss the 2026 Women's Africa Cup of Nations (Wafcon) after falling to an upset in the first round of qualifying on Wednesday.\nThe Equatoguineans trailed 3-1 heading into the second leg of their tie against Tanzania, who are 63 places below them in the world rankings, and could only manage a 1-1 draw at home.\nWinners in 2008 and 2012, Equatorial Guinea have failed to reach a Wafcon since 2018, when they finished bottom of their group.\nElsewhere, Kenya goalkeeper Lilian Awuor saved two penalties as the East Africans pulled off a major shock by eliminating Tunisia.\nAfter an early goal from Tereza Engesha the Harambee Starlets, ranked 71 places beneath their opponents, saw out a 1-0 win in North Africa to go through.\nMeanwhile, Botswana have been eliminated before even taking part in the 2024 edition of the tournament, which will be held in Morocco in July.\nThe southern Africans drew 0-0 away against DR Congo, who have also reached this year's finals, and ultimately exited 2-0 on aggregate.\nTogo and Mali were the most convincing winners, triumphing respectively 10-0 on aggregate against Djibouti and 10-1 overall against Gabon.\nThe second round of qualifiers will be held in October and will decide which 11 teams will join Morocco, who will host again, at the 2026 tournament.\nReigning champions South Africa, Zambia and Nigeria were among the six highest-ranked sides given a bye to the second round.\nThe dates of the 2026 Wafcon finals are yet to be announced by the Confederation of African Football.", "url": "https://www.bbc.co.uk/sport/football/articles/cdjydgn3700o"}