{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:17:24", "date_modify": "2025-05-21 06:17:24", "date_publish": "2025-03-31 08:01:58", "description": "Fifa is considering a play-off game between LAFC and Club America to replace Club Leon at this summer's Club World Cup.", "filename": "sport_football_articles_czrvgdd4xjro_1747808244.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/749e/live/d8a9f7b0-0dfd-11f0-8255-450fbdd8b6d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czrvgdd4xjro_1747808244.html", "title": "Club World Cup: LAFC and Club America could meet in play-off to qualify", "title_page": "Club World Cup: LAFC and Club America could meet in play-off to qualify - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Major League Soccer side LAFC and Mexican team Club America could play a one-off play-off game for the final spot in this summer's Club World Cup.\nThe winner of the play-off game would replace Club Leon, who were removed from the tournament for failing to meet Fifa's multi-club ownership rules because of dual ownership issues with fellow qualifiers Pachuca.\nLAFC were beaten by Club Leon in the 2023 Concacaf Champions League final, while Club America are the highest-ranked team behind Club Leon in confederation ranking that did not qualify for the competition.\n\"Fifa can confirm it is considering one play-off match between LAFC and Club America for the right to participate in the Fifa Club World Cup 2025,\" a Fifa statement read.\nClub Leon were drawn in Group D alongside Chelsea, Flamengo and Esperance Sportive de Tunisie.\nClub Leon have taken their case to the Court of Arbitration for Sport (Cas).\nCosta Rican side Alajuelense, who brought a complaint against Leon in the first place, also have an outstanding appeal. Both will be heard by Cas on 23 April.\nLAFC, who are eighth in the MLS Western Conference, boast former Arsenal striker Olivier Giroud in attack and ex-France captain Hugo Lloris in goal.\nThe 32-team tournament, which is being held across the United States, starts on 15 June and runs until the final on 13 July.", "url": "https://www.bbc.com/sport/football/articles/czrvgdd4xjro"}