{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:39:01", "date_modify": "2025-05-21 07:39:01", "date_publish": "2025-01-13 16:05:38", "description": "Former Manchester United manager Casey Stoney is appointed head coach of the Canada women's national team.", "filename": "sport_football_articles_c5y7mx74425o_1747813141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6a0/live/62beb690-d1bb-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y7mx74425o_1747813141.html", "title": "Casey Stoney: Canada women job for former Man Utd boss and England captain", "title_page": "Casey Stoney: Canada women job for former Man Utd boss and England captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Manchester United manager Casey Stoney has been appointed head coach of the Canada women's national team.\nThe 42-year-old former England captain will start her role with immediate effect and will oversee a three-match series in February at the Pinatar Cup in Spain.\nCanada had been looking for a replacement since another English coach - Bev Priestman - lost her job following the 2024 Olympic Games drone scandal.\nStoney, who was sacked by National Women's Soccer League side San Diego Wave in June, previously led Manchester United to Women's Super League promotion and two successive fourth-place finishes in England's top tier.\n\"I am honoured to join Canada Soccer,\" said Stoney.\n\"Canada has a proud tradition in women's football and I am excited to work with such a talented group of players.\n\"Together with the federation's new leadership, we will strive to build on past successes and continue to grow the sport in Canada on and off the field.\n\"I look forward to the journey ahead and to engaging with the incredible passion of Canadian soccer fans.\"\nDuring the Paris Olympics, in which Canada reached the quarter-finals, two members of the team's coaching staff were sent home for flying a drone over a training session held by New Zealand, their opponents in a group game.\nPriestman was given a year-long ban by world governing body Fifa and Canada - who had won Olympic gold at the delayed Tokyo 2020 Games - were docked six points.\nAs a player, Stoney lifted 12 major trophies during her time at Chelsea, Arsenal, Charlton Athletic, Lincoln Ladies and Liverpool.\nShe won 130 England caps and skippered her country, appearing in three World Cups. She also captained Great Britain in the 2012 London Olympics.\nAfter retiring from playing at the age of 35 in February 2018, Stoney joined the Lionesses' coaching team under Phil Neville's leadership before moving to Manchester United four months later.", "url": "https://www.bbc.com/sport/football/articles/c5y7mx74425o"}