{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:05", "date_modify": "2025-05-19 14:41:05", "date_publish": "2017-08-15 21:39:12", "description": "Sunderland maintain their unbeaten start to the Championship season with a draw at Sheffield Wednesday.", "filename": "sport_football_40871608_1747665665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8107/production/_97413033_rexfeatures_8999837aw.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40871608_1747665665.html", "title": "Sheffield Wednesday 1-1 Sunderland", "title_page": "Sheffield Wednesday 1-1 Sunderland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland maintained their unbeaten start to the Championship season with a draw at Sheffield Wednesday.\nGeorge Honeyman put the visitors ahead after four minutes, blasting in Aiden McGeady's cross from close range.\nBlack Cats strikers Lewis Grabban and James Vaughan went close to making it 2-0, but David Jones' powerful 25-yard strike brought Wednesday level.\nBoth goalkeepers were forced into saves before Owls striker Gary Hooper struck the bar and fired wide late on.\nSimon Grayson's men had the better of the first half, with McGeady's delivery setting up Honeyman to score his second goal for the club after goalkeeper Keiren Westwood flew off his line.\nGrabban headed a McGeady free-kick narrowly wide, Brendan Galloway was denied by Westwood and Vaughan blazed over a rebound as the relegated Premier League side looked to add to their advantage.\nWednesday had their chances however, with Jason Steele having to be alert to keep out Sam Winnall's effort before Hooper smashed a half-volley against the bar.\nBut despite finishing strongly Wednesday could not find a second goal and are without a win from their opening three Championship matches.\nSheffield Wednesday boss Carlos Carvalhal:\n\"We started with a loss of concentration but after this we started to impose our football, we started to create chances.\n\"We had more chances than Sunderland. We played a very high level of football in the second half.\n\"We absolutely deserved to win this game with the level of football we played in the second half. We played against a strong team, the way we are playing we will be very strong.\"\nSunderland boss Simon Grayson:\n\"It was two types of different performances from us. If we had taken the chances we would have won the game.\n\"We were comfortable up until they scored the goal, and that got their tails up and we found it difficult.\n\"It's probably a fair result, if we had got the second goal when we had the chances we would have won it.\n\"You come to a difficult place and get a point you will probably take it.\"", "url": "https://www.bbc.com/sport/football/40871608"}