{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:11:48", "date_modify": "2025-04-26 04:11:48", "date_publish": "2025-03-04 12:44:31", "description": "Wales wing Josh Adams has not recovered in time for this weekend's trip to Edinburgh but fly-half Gareth Anscombe and hooker Dewi Lake are in contention to face Scotland.", "filename": "sport_rugby-union_articles_cwygepxlelvo_1745640708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7952/live/f7a26090-f8f3-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cwygepxlelvo_1745640708.html", "title": "Six Nations 2025: Wales wing Josh Adams ruled out of Scotland trip", "title_page": "Six Nations 2025:  Wales wing Josh Adams ruled out of Scotland trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wales wing Josh Adams has been ruled out of the Six Nations trip to face Scotland in Murrayfield on Saturday.\nCardiff wing Adams, 29, missed the 27-18 loss to Ireland in Cardiff with a hamstring problem and has not recovered in time for this weekend.\nGloucester fly-half Gareth Anscombe has recovered from a head knock suffered against Ireland and is available for selection.\n\"Gareth is fine and good to go,\" said Wales scrum coach Adam Jones.\n\"It's good to have the voice. He came in as if he hadn't been away. It's been good to have him leading it.\"\nWales have lost a record 15 Test matches in a row with interim head coach Matt Sherratt taking over from Warren Gatland before the Ireland defeat.\nOspreys hooker Dewi Lake is also in contention for a return after missing the first three Six Nations defeats because of an arm injury.\nLake, 25, has not played in the tournament since 2022 because of a series of injuries but impressed when captaining Wales on the summer tour of Australia and during the autumn internationals in Cardiff.\nElliot Dee and Evan Lloyd have been the hookers used by Wales during this tournament.\n\"Dewi has been excellent and it is good to have him back,\" said Jones.\n\"He's a former captain and has been a big player for Wales in the last few years.\nWales scrum coach Jones believes a couple of impressive performances from Lake could help him force his way into the British and Irish Lions trip to face Australia in the summer.\n\"He's been mentioned in certain [Lions] squads. He's got a point to prove, that's the beauty of this year.\n\"Anyone who plays well in the Six Nations has a chance to tour in the summer.\n\"There are a few boys in our squad who are in the mix and he's one of them.\"\nJones came in as a scrum consultant for the tournament after being given permission by his Harlequins club.\nThe Wales scrum impressed against Ireland with props Nicky Smith and WillGriff John given starts.\nJones says he was shocked Smith, who joined Leicester from Ospreys for the 2024-25 season, had not regularly been selected previously by Wales with Gareth Thomas consistently starting.\nSmith has made just five starts in the previous 50 Tests for Wales.\n\"I don't know why he wasn't picked, because I wasn't here, but I'm glad to have him here,\" said Jones.\n\"He's been good for us. He made his Ospreys debut with me in 2014 and been around for a while.\n\"I always remember him as a young fella. He's always been strong, like gym-strong and I've always thought he was a really good player.\n\"Going to Leicester and seeing him again, if you're a Leicester prop, you have to have that scrummaging mentality and he's got it.\n\"He's been excellent. Gareth Thomas is a massive leader off the pitch for us and around the defence and they actually balance out pretty well.\"\nSale tight-head prop John, 32, was making his first Six Nations appearance and playing his first international for more than three years.\n\"He was excellent,\" said Jones.\n\"Will is someone I was aware about years ago, coming through and he did a good job with Sale.\n\"He came back to Wales to further his chances. It didn't work out but he's a big, strong boy, probably the strongest in the squad.\n\"So I'm pleased for him. He's a lovely kid. He's been around a bit now to find his mojo.\n\"We're in a good place scrum-wise. We're still getting relationships with them, which is a big thing in coaching. Hopefully we'll do a good job on the weekend.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cwygepxlelvo"}