{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:46:10", "date_modify": "2025-05-20 14:46:10", "date_publish": "2023-07-27 18:36:37", "description": "Sunderland sign former Blackburn attacking midfielder Bradley Dack on a one-year deal.", "filename": "sport_football_66331240_1747752370.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EBB9/production/_130554306_gettyimages-1460277075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66331240_1747752370.html", "title": "Bradley Dack: Sunderland sign ex-Blackburn Rovers midfielder on a one-year deal", "title_page": "Bradley Dack: Sunderland sign ex-Blackburn Rovers midfielder on a one-year deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland have signed former Blackburn attacking-midfielder Bradley Dack on a one-year deal.\nThe 29-year-old reunites with Black Cats manager Tony Mowbray, who he played under during his time at Rovers.\nDack scored 57 goals in 173 appearances in a six-year spell with Rovers despite missing a large chunk of games through separate cruciate ligament injuries.\n\"To play in front of 40,000 every week at the Stadium of Light was a huge pull for me,\" Dack told the club website, external.\n\"I hope my experience and style of play can add something different to the group, and I can't wait to pull on the shirt for the first time.\"\nThe deal includes a club option for an additional year.\nGreenwich-born Dack had spells at Wimbledon and Charlton before joining Gillingham where he played 185 games, scoring 38 goals.\nHis form with the Gills attracted Rovers' attention, prompting a move to the north-west in June 2017 that brought promotion to the Championship in his first season.\nHe scored 18 goals in that triumph, followed that with 15 in the second-tier, and had nine goals before his first knee injury in 2019.\nLast season he netted seven goals in 33 appearances before ending his six-season stay at Rovers this summer.", "url": "https://www.bbc.com/sport/football/66331240"}