{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:16:41", "date_modify": "2025-05-20 14:16:41", "date_publish": "2023-07-29 14:54:54", "description": "Jurgen Klopp wanted Jordan Henderson to remain at Liverpool but couldn't stand in the way of his move to Saudi Arabia.", "filename": "sport_football_66349997_1747750601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DAE6/production/_130583065_gettyimages-1543797527.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66349997_1747750601.html", "title": "Jurgen Klopp: Liverpool wanted Henderson to stay but couldn't block Al-Ettifaq transfer", "title_page": "Jurgen Klopp: Liverpool wanted Henderson to stay but couldn't block Al-Ettifaq transfer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jurgen Klopp wanted Jordan Henderson to remain at Liverpool but would not block his exit once the midfielder's heart was set on Saudi Arabia.\nFormer Reds skipper Henderson joined Saudi Arabian club Al-Ettifaq in a deal worth £12m plus add-ons on Thursday.\nKlopp answered questions on Henderson in a press conference during the club's pre-season tour of Singapore.\n\"If he wants to leave, there's no reason why we should throw any rocks or stones in the way,\" Klopp said.\n\"Hendo knew exactly the situation - that we wanted to keep him. It was full of respect and full of everything you need in a situation like that.\"\nHenderson, 33, was made Liverpool captain after the departure of Steven Gerrard by former manager Brendan Rodgers in 2015, and led the side to a Champions League triumph in 2019 going on to lift the Uefa Super Cup and Fifa Club World Cup later that year.\nHe was also the Reds' skipper when they won the 2019-20 Premier League to end a 30-year wait for the English top-flight title.\nHenderson's other honours at Liverpool include winning the FA Cup in 2022 and League Cup in 2012 and 2022.\nHenderson has been criticised by some fans and LGBTQ+rights campaigners over the transfer, as same-sex sexual activity is illegal in Saudi Arabia. The player has publicly supported the LGBTQ+ community in the past, but new club Al-Ettifaq edited the rainbow-coloured armbands he wore during his time with Liverpool into monochrome, external in a video announcing his signing earlier this week.\n\"It was not about me convincing him, it was about me reacting to what was happening. That's how I understood the role in that moment,\" Klopp added.\n\"He's not here anymore. He will miss us, we will miss him. But we have to go on and we will - that's clear. That's pretty much everything.\"\nKlopp plans to give the captain's armband to Virgil van Dijk for his side's friendly against Leicester City at the Singapore National Stadium on Sunday.\nThe Netherlands international is believed to be a strong contender to take on the role for the 2023-24 campaign, although Klopp still wants time to consider who will replace Henderson as skipper on a permanent basis.\nHe said: \"I know already my decision but I have to tell it first to the players before I speak in public about it.\n\"I didn't expect to have that situation a few weeks ago that I have to think about it.\"", "url": "https://www.bbc.com/sport/football/66349997"}