{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:00", "date_modify": "2025-04-26 04:35:00", "date_publish": "2025-03-01 00:00:00", "description": "Live text commentary of Lewis Crocker versus Paddy Donovan in a IBF title eliminator at the SSE Arena, Belfast", "filename": "sport_boxing_live_cn527vkdr4gt_1745642100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9306/live/065376f0-f6ed-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_live_cn527vkdr4gt_1745642100.html", "title": "'The ref took my dreams away' - reaction as Crocker beats Donovan via disqualification", "title_page": "'The ref took my dreams away' - reaction as Crocker beats Donovan via disqualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodnight!\nCrocker beats Donovan by DQ\nA night of high drama in Belfast as Lewis Crocker beats Paddy Donovan in the IBF welterweight title eliminator via disqualification.\nDonovan was disqualified after landing a shot following the bell at the end of the eighth round. The Limerick fighter had earlier twice been deducted points for using his head and elbow.\nIt was an engrossing fight up to that point and one which Donovan was certainly winning, it's just a shame how it ended.\nCrocker is now the mandatory challenger for the IBF belt, but will we see a rematch? We're certainly likely hear more about this one over the next week or two, but for now it's goodnight, thanks for joining us!\nPost\nCrocker beats Donovan by DQ\nMore from Eddie Hearn on DAZN:\n\"We know what controversy does. It builds into massive fights, massive rematches. The rematch of this fight is huge.\n\"But will Crocker want it? Whjat will the IBF say? We'll have to see what happens over the next couple of weeks.\n\"Honestly, as a promoter for both, I want to see the fight again and I want to see it play out.\"\n'Crocker doesn't have to do anything' - Hearn\nCrocker beats Donovan by DQ\nMatchroom boss Eddie Hearn, speaking on DAZN:\n\"You don't want the fight to finish like that. It was a good fight. Paddy Donovan was controlling the fight. The points were making it interesting, you feel like Crocker had to force the fight for the last few rounds and Paddy was sensational.\n\"The shot was after the bell. Did it warrant an instant disqualification? Are you tallying up the headbutts during the fight as well? For me, I want to see it again. I think Lewis Crocker's in a position now, he's mandatory for the world title. I'm sure those guys will appeal to the IBF.\n\"Lewis Crocker doesn't have to do anything. He can sit there for a shot at the world title. The reality is there's going to be a lot of people wanting to see this fight again.\"\n'The ref took my dreams away tonight'\nCrocker beats Donovan by DQ\nPaddy Donovan, speaking on DAZN:\n\"Listen to the crowd, the crowd can tell you, I won the fight, I was winning every single round. I dropped him, I was beating him up and I was getting the knockout.\n\"The crowd is ferocious in here. They say I hit him after the bell but I thought I hit him on the bell. You can see Lewis was a beaten man and I won the fight fair and square.\n\"The ref took my dreams away tonight.\n\"We're going to appeal the decision and I want an automatic rematch right on the spot.\"\n'That's not how I want to win'\nCrocker beats Donovan by DQ\nLewis Crocker, speaking on DAZN:\n\"That's not how I would want to win a fight. I heard the bell and I can't see because I've been getting hit with the head, I dropped my hands and that's what caused the knockdown.\n\"Our plan was to work in the second half of the fight. I was continually hit with the head, got hit with the elbow at one stage but that's not how I want to win. I heard the bell, dropped my hands, couldn't see because of the previous headbutts and the punch came out of nowhere after the bell.\"", "url": "https://www.bbc.co.uk/sport/boxing/live/cn527vkdr4gt"}