{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:41:01", "date_modify": "2025-05-21 06:41:01", "date_publish": "2025-01-17 00:00:00", "description": "Watch Sportscene and follow live text commentary, score updates and match report from Brechin City vs Hearts in the Scottish Cup.", "filename": "sport_football_live_cx2p5ll9n65t_1747809661.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx2p5ll9n65t_1747809661.html", "title": "Brechin City vs Hearts: Scottish Cup stats & head-to-head", "title_page": "Brechin City vs Hearts: Scottish Cup stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you tomorrow!\nFT: Brechin City 1-4 Hearts\nThat's all from us folks.\nPremiership outfit Hearts had too much quality in the end for fifth-tier Brechin City.\nBut hey, at least there will always be that Scott Bright goal.\nGoodnight!\nPost\nFT: Brechin City 1-4 Hearts\nMore from Hearts boss Neil Critchley: \"We weren't good enough against Hibs that day [during Boxing Day defeat] but there had been signs before and after that that we're improving.\n\"We've got a lot to do, we're not where we want to be. We want to breed that winning habit, a cup run would help.\n\"A couple of singings have helped, refreshed the group and that'll be important for the second half of the season.\"\n'We needed a moment of quality' - Critchley\nFT: Brechin City 1-4 Hearts\nHearts manager Neil Critchley tells BBC Scotland: \"It's job done. It was a good goal from Yan, that settled us down.\n\"Scoring soon into the second half settled us down, we played some nice football. We've done the job and we're into the next round.\n\"It was a great strike [from Scott Bright] but up until that we'd been doing OK in the game. The longer it goes at 1-0 the nerves and anxiety grows, we needed that moment of quality to get us back in the game.\n\"You have to stay calm and composed, the players need you. They need my support, you look to the staff around you and make sure you're giving appropriate advice to the players.\n\"It takes a little bit of time, that extra bit of physicality, to wear them down. That's not going to look the same in the first 20 minutes, you have to work for that. You're playing a little bit tighter, that inhibits you a little bit. Once we settled down, remembered how to play good football we started to make things more comfortable for ourselves.\"\n'Stuff of dreams' - Bright\nFT: Brechin City 1-4 Hearts\nBrechin defender Scott Bright tells BBC Scotland: \"Everyone shouts shoot and you just have to hit it. Most of the time that'll go flying over the fence and you never see the ball again, this time I nailed it.\n\"I haven't seen the goal back, I can hardly remember it. I just remember the strike and then everyone was on top of me. It's the stuff you dream of.\"\nDhanda admits Brechin 'started better'\nFT: Brechin City 1-4 Hearts\nHearts midfielder Yan Dhanda tells BBC Scotland: \"We had a job to do and had to get it done. It was a good performance.\n\"It was tough, they went 1-0 up and probably started better than us.\n\"We knew we'd get chances so when the first came we knew we'd get more.\"\n'I like to be important' - Kabangu\nFT: Brechin City 1-4 Hearts\nHearts striker Elton Kabangu tells BBC Scotland: \"It is a typical Scottish game, I would say. I knew from the beginning it would be a game like this. We handled it well.\n\"I am happy to score, of course. I am here to score goals. I am just happy. I don't want to score on two goals. I want more. I will work for it.\n\"I will try to score every game. I am a striker. I like to score, I like to assist, I like to be important. I will do more.", "url": "https://www.bbc.com/sport/football/live/cx2p5ll9n65t"}