{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:20", "date_modify": "2025-04-26 06:31:20", "date_publish": "2025-02-27 09:16:14", "description": "Teenager Kascie Weir says her whirlwind week, in which she made her Northern Ireland debut and first start, was a \"dream\" after a surprise call-up.", "filename": "sport_football_articles_cdx2nqzg9xgo_1745649080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69d9/live/37b475f0-f3d2-11ef-82c8-6bb00a0b2116.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdx2nqzg9xgo_1745649080.html", "title": "Kascie Weir: Teenager on 'dream' Northern Ireland debut after whirlwind week", "title_page": "Kascie Weir: Teenager on 'dream' Northern Ireland debut after whirlwind week - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Wow, where do you start?\"\nTeenager Kascie Weir was struggling to sum up her week, and nobody could blame her.\nShe headed into the international window expecting to be lining out for Northern Ireland's Under-19s in Albania.\nHowever, she would be in Tirana for less than a day as she got a call to link up with the senior team.\nThat itself was a whirlwind, but later that week she made her international debut off the bench in Poland.\nHer lively cameo in Gdansk earned her a first start at home to Bosnia-Herzegovina, when she again impressed and was unfortunate not to score.\n\"I didn't have any clue I was going to come in with the senior team. I was in Albania for less than 24 hours,\" said the 18-year-old Glentoran striker.\n\"This week has just been mad, everything has been happening. I've been in Albania, Poland, England and Northern Ireland. There's just been so much happening.\n\"When it sinks in I'd say it will be like, 'wow, what a week I've had'.\n\"A senior debut, a senior start - it's been unreal for me.\"\nWeir only found out the morning of the match at Inver Park that she would be starting, something she says did not give her \"too much time to think\".\n\"We were going through set plays and I was like 'oh my gosh', my name was on the starting team,\" she said.\n\"I was straight onto the phone to tell my dad, I was buzzing. It's a dream come true.\n\"If I had known about it last night (Monday, the night before the game) I think I would have been overthinking it a bit more.\n\"I had to get stuck in and play my game.\"\nNow, Weir's focus is back on her A-Levels and the new season with her club Glentoran.\nBut after Weir put in another strong showing against Bosnia-Herzegovina, there's no doubt that it won't be her last start at this level.\nShe was unfortunate not to grab a goal on her first start, with two efforts well saved by goalkeeper Almina Hodzic and a third went wide.\nBut the fact she was getting into positions to score shows a natural instinct, while her link-up play was impressive despite only stepping into the senior camp the previous week.\n\"I came off and I was gutted because I had a good three shots and their keeper saved a couple,\" she added.\n\"I'll have to put them away next time but I'm buzzing with my performance.\"\nAfter putting her faith in youth, Northern Ireland manager Tanya Oxtoby said Weir was \"superb\" on her first start and was unfortunate not to get her name on the scoresheet.\n\"I think people are learning with me now that if you're good enough, you're old enough,\" added Oxtoby.\n\"She has impressed since she has been in with us and she earned her start tonight.\"\nThe Australian hinted at young players following the lead of Weir and midfielder Keri Halliday and stepping into the senior team from the under-19s in the future.\n\"You'll see a few more, for sure. We're in a really good place.\n\"There are a few who are transitioning out (of the under-19s) and probably ready to start to be integrated into the squad.\n\"We're definitely in a really good space in terms of the squad.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cdx2nqzg9xgo"}