{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-04-26 07:51:26", "date_modify": "2025-04-26 07:51:26", "date_publish": "2025-02-25 15:13:59", "description": "Ferguson on surprise return, being judged & seeking a 'different Rangers'", "filename": "sport_articles_cvg141l20pyo_1745653886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9657/live/074cc160-f387-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvg141l20pyo_1745653886.html", "title": "Ferguson on surprise return, being judged & seeking a 'different Rangers'", "title_page": "Ferguson on surprise return, being judged & seeking a 'different Rangers' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ferguson was \"surprised\" to get the call but says it \"only took five minutes\" for him to agree to take charge.\nDespite his lack of top-level managerial experience, Ferguson \"wouldn't be sitting here\" if he didn't think he could do the job.\nHe adds: \"Did I want to get back into coaching and management? If I'm being brutally honest, I wasn't thinking about it, but when that phone call comes, there was no way I was going to turn it down.\"\nThe former skipper wants to be judged at the end of the season but says: \"I know I will be judged game by game. This is the nature of the beast here at Glasgow Rangers.\"\nHe insists he has \"not even thought\" about the prospect of keeping the job long term and his full concentration is on beating Kilmarnock in his first game in charge on Wednesday.\nOn what success would be between now and the end of the season, Ferguson says: \"We have to try to be positive and win every single game. That's a big ask but I'm positive. We need positivity about the place. This needs to be a different Rangers team that turns up tomorrow night.\"\nHe will demand \"energy and desire\" from the team and adds: \"I was straightforward with the players. This is a brilliant place to be. You're lucky to be here. Look at the facilities, look at the stadium. I feel like it's going to be a good place to be.\"\nOn bringing in former team-mates Neil McCann, Billy Dodds and Allan McGregor to assist him, Ferguson says: \"They're bubbly about the place. They're big characters, they like to get in among the boys. I think that's important because obviously the last couple of weeks has been difficult for this group of players.\"", "url": "https://www.bbc.co.uk/sport/articles/cvg141l20pyo"}