{"authors": ["Tom Brown", "www.facebook.com"], "date_download": "2025-05-21 03:37:52", "date_modify": "2025-05-21 03:37:52", "date_publish": "2025-01-14 04:56:49", "description": "BBC Sport Wales' Legends of Welsh Sport documentary 'Colin Jackson: Resilience' hears from the man himself, as well as his family, friends, former coach and fellow athletes.", "filename": "sport_athletics_articles_cpqldle33z9o_1747798672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04bc/live/d21a5ef0-d1c9-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_cpqldle33z9o_1747798672.html", "title": "Colin Jackson: From 'skinny wimp' to world's best and Olympic heartache", "title_page": "Colin Jackson: From 'skinny wimp' to world's best and Olympic heartache - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For many, you can only be considered a true great of athletics if you have an Olympic gold medal.\nColin Jackson is arguably one of the exceptions to that rule.\nThe 110m hurdler achieved everything else in his sport.\nHe won an Olympic silver. He also won two world titles, was undefeated at the European Championships, was a two-time Commonwealth Games champion and held the world record for more than a decade.\nIn a new BBC Cymru Wales documentary, Jackson recalls how skipping a warm-up cost him that elusive Olympic title.\nThe programme Colin Jackson: Resilience hears from the man himself, as well as his family, friends, former coach and fellow athletes.\nThe 57-year-old looks back on a stellar career and concludes he feels \"complete\", despite suffering heartache in three successive Olympic finals.\n\"I met Colin as a 14-year-old,\" says his former coach, Malcolm Arnold.\n\"He said he was going to make it as a professional athlete, which was quite a bold statement for a young lad.\n\"At that time he was a bit of a skinny wimp and the thought of him becoming a top-class professional athlete wasn't on really.\n\"But he said 'I'm going to make it' - and he was world class at the age of 18.\"\nHard work and resilience are key themes of the documentary.\nHis technique is praised too. Former Olympic champion hurdler Sally Gunnell described how Jackson would \"clip, but not clip\" the tops of the hurdles in a style that was \"as smooth as possible\".\nJackson was a multi-talented athlete, who had also impressed in the decathlon as he started out in athletics.\nHe was also a keen cricketer. He captained his school team as a youngster and once dreamed of representing his country.\nBut his mother, Angela, always felt athletics was his calling.\n\"Everybody has a talent,\" she says.\n\"Racing was his talent.\"\nJackson made his first Commonwealth Games for Wales as a teenager.\nAs a near-complete unknown in Edinburgh in 1986, Jackson took the silver medal behind Canadian reigning champion Mark McKoy.\nHe went on to win silver at his first Olympic Games in Seoul in 1988, before adding the world indoor, Commonwealth and European titles over the next two years.\nBy the Barcelona Olympics in 1992 he was many people's favourite for gold.\nThree rounds of racing stood between him and Olympic glory. He began in imperious fashion, winning his heat with a jog in 13.10 seconds - the fastest time in the world that year.\n\"It was jaw-dropping,\" admits his great rival, McKoy.\n\"We just looked at each other [while waiting for the next heat] and said 'OK, we know who's going to win. Who's going to get silver?'\"\nBut Jackson admits doing \"no preparation at all\" for the second round.\n\"It was just the second round,\" Jackson says. \"They've all seen what I can do so I can't be bothered. Let me do a bit of stretching and just race.\"\nHis coach Arnold warned him of the consequences.\nJackson finished second in a messy race but, after hitting the fifth hurdle, ripped his oblique muscle down his left side - a crucial muscle in lifting your leg to hurdle.\nIt proved costly and he could only finish seventh in the final.\n\"You accept it if somebody's better than you,\" says Jackson. \"But I was the best.\n\"You cannot fathom the depth of depression you go into.\n\"It's everything in your life - everything. You realise you will never have this time again. You go from hero to zero in the blink of an eye.\n\"It took a whole year for that to vanish.\"\nHe faced accusations he was a 'choker' and there was even an advert that showed a bottle on a set of hurdles, suggesting Jackson couldn't cope in the big moments.\nA year after the Barcelona Games, Jackson went to the World Championships.\nA stunning race saw him win his first world title in a new world record of 12.91 seconds - a record that would stand for 13 years.\nHe went on to win another world title, three more European golds and another Commonwealth title for Wales.\nBut Olympic glory evaded him once again at Atlanta in 1996 and Sydney 2000.\nYet ultimately he says he feels his career was \"complete\" and he remains widely regarded as the finest in Welsh track and field history.\nLegends of Welsh Sport: Colin Jackson is available to watch on BBC iPlayer and BBC One Wales from Tuesday, 14 January at 22:40 GMT and later on demand.", "url": "https://www.bbc.com/sport/athletics/articles/cpqldle33z9o"}