{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:39", "date_modify": "2025-05-20 14:34:39", "date_publish": "2023-07-24 11:25:36", "description": "Arsenal fans on pre-season defeat by Manchester United", "filename": "sport_articles_cd1ejywkkp1o_1747751679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/980f/live/5d003ef0-2a0e-11ee-b1d7-8fdc93c2782e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1ejywkkp1o_1747751679.html", "title": "Arsenal fans on pre-season defeat by Manchester United", "title_page": "Arsenal fans on pre-season defeat by Manchester United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked what you made of Arsenal's recent 2-0 defeat by Manchester United in New Jersey.\nIt seems you were not too impressed by the performance.\nHere are some of your thoughts:\nBazza: Disappointed. I thought the midfield trio of Declan Rice, Martin Odegaard and Kai Havertz was really going to cook. Unfortunately, the result was a culinary disaster! Last season started with so much hope and promise, and it feels a bad omen - doesn’t make the defeat any better with Arsenal playing in that kit.\nPayney: Pre-season games never used to bother me, until we lost to Man Utd. If I felt Man U were the better team, then it wouldn’t hurt so much, but we made silly mistakes that they pounced on. All eyes will be on how we handle the rest of preseason, but Arsenal need better quality in the final third before our first game real game in few weeks.\nOkoth: Although just a friendly, it shows that the League is going to be more competitive than last year. Manchester City are still favourites, but I expect United and Chelsea to be challenging, alongside us.\nOllie: It’s not looking good. This time last year we were battering Chelsea, now we’re being, quite frankly, bullied by United and it’s a concern. People will look at it and say that it’s only a pre-season friendly, but it’s also important to remember that pre-season is meant to get fans excited about what’s to come, not nervous.\nRichard: I fear that Arsenal have peaked and will struggle to be top four this season, after falling short to City. Rice is a good signing but was overpriced and will not provide the added value that the Gunners need. Granit Xhaka’s contribution will be sorely missed.", "url": "https://www.bbc.com/sport/articles/cd1ejywkkp1o"}