{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:55:20", "date_modify": "2025-05-21 07:55:20", "date_publish": "2025-03-27 14:49:13", "description": "Plymouth Argyle boss Miron Muslic praises the commitment of central defender Julio Pleguezuelo after his return from broken ribs.", "filename": "sport_football_articles_cpv493jkm14o_1747814120.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f676/live/99b55090-0b19-11f0-88df-cbea984e02db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpv493jkm14o_1747814120.html", "title": "Julio Pleguezuelo: Plymouth Argyle defender hailed after return from injury", "title_page": "Julio Pleguezuelo: Plymouth Argyle defender hailed after return from injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle boss Miron Muslic has praised the commitment of central defender Julio Pleguezuelo after his return from broken ribs.\nThe Spaniard, 28, was hurt in the 2-1 win at Portsmouth two weeks ago but returned to full contact training earlier this week and could feature at Watford on Saturday.\nIt is a timely boost for Muslic after fellow centre-back Maksym Talovierov was ruled out for the rest of the season with a knee injury.\n\"He's a fighter, it was a serious injury,\" Muslic said.\n\"He did everything together with the medical department to make himself available and actually two days ago he reported fully fit.\n\"He had his first full contact training two days ago so we have a green light on Pleggy and that's something which is very positive.\"\nThe former Arsenal youngster became the first-ever Spanish player to join Argyle when he signed in the summer of 2023 from FC Twente.\nHe has gone on to play 57 games for the Pilgrims and signed a new contract last month to keep him at Home Park until 2027.\nMuslic says Pleguezuelo's commitment to the club has impressed him since he took over from Wayne Rooney as head coach in January.\n\"That's why I tried to push to get a new deal for Pleggy because I realised how important Julio is on the pitch and how massively important he is off the pitch in terms of his energy, behaviour, being a role model,\" he said.\n\"It shows exactly why we chose to give him a new contract because we believe in him and he's just 100% Argyle, and in those challenging moments some players will just simply disappear, and stay out for a couple of weeks longer.\n\"He just kept on pushing, pushing, pushing to support us and to help us to go all in in the last eight games, so big, big credit to Julio.\"", "url": "https://www.bbc.com/sport/football/articles/cpv493jkm14o"}