{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:18:00", "date_modify": "2025-04-26 04:18:00", "date_publish": "2025-03-04 06:59:29", "description": "Welcome to Uefa Champions League Squares - the new BBC Sport game which you can play alongside the live match action.", "filename": "sport_football_articles_c36w005w9g7o_1745641080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0316/live/d4c08f40-f856-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c36w005w9g7o_1745641080.html", "title": "Uefa Champions League Squares: Play BBC Sport's new interactive game", "title_page": "Uefa Champions League Squares: Play BBC Sport's new interactive game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Welcome to Uefa Champions League Squares - the BBC Sport game which you can play alongside the live match action.\nHow to play:\nGameplay begins from 07:00 every Champions League matchday\nAnswer four trivia questions for the chance to edit your randomly generated bingo-style gamecard\nSee how many squares you are able to mark off on your card when those events happen in real time during that evening's Champions League fixtures.\nWe are still waiting for the first full-house card. Will that be you?\nGameplay is limited to UK users only.\nYes, we are still waiting for our first ever full-house card!\nHowever, we did see 1,941 players score with an X and 5,685 players scored by completing all of their corners, which are the highest figures so far for both of those scoring methods.\nOnly 29% of you scored nothing at all. At the other end of the scale, there were 14 people who scored between 150-199 points.\nThere were 1,411 players who scored 100-149, 666 got 70-99 and 1,683 scored 50-69.\nWe saw 7,168 players score 30-49 and everyone else who scored (45%) received between 10-29 points.\nCome back on 29 April to play again.\nEach gameday will begin at 07:00 on the morning of every Champions League matchday this season.\nYou will have the chance to answer four trivia questions to earn up to four edit tokens before your Squares gamecard is generated, and you can use those tokens to make changes to your gamecard until 17:00 that day.\nEach edit token allows you to make one change to your card:\nBonus Mark-Off: Mark any square as correct before kick-off.\nFlip Team: Swap the team for a different team (only available on team tiles).\nRandom Change: Swap a chosen square for another randomly selected tile.\nAfter 17:00, your gamecard is locked down and you will take that card into that evening's games. For new users looking to start playing after the cut-off, you can still receive a gamecard, but will not have the chance to edit it.\nFor the knockout stages of the competition, extra time will be taken into account on your card, but not penalty shootouts.\nThere are a number of ways you can score points, but for further game instructions, read the How to Play section within the game itself.\nYou will need to be signed into a BBC account to play Uefa Champions League Squares. If you are not signed in, you will be prompted to do so, or you can set yourself up with a BBC account, which will only take a couple of minutes.\nOnce you begin to play a game, you will need to continue playing that particular game on the same device, as gameplay cannot be synced across devices, although you can start a separate game on another device.\nPlease note, when you click the play button, a session cookie not listed in our cookie list will be dropped (Cookie name: low6; Token Purpose: to remember game progress; Cookie classification: Strictly Necessary).\nFor further information on cookies and how BBC Sport handles your personal data, read the Privacy Policy. You can also view the BBC's full Terms of Use for our digital services.\nAs this is a brand new game for BBC Sport, we'd be keen to get your views on it.\nDid you like playing it? What could be improved? Would you tell your friends and family about it?\nWe welcome you to fill out this feedback form to give us your views:", "url": "https://www.bbc.co.uk/sport/football/articles/c36w005w9g7o"}