{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:30", "date_modify": "2025-05-19 15:24:30", "date_publish": "2015-02-14 17:01:09", "description": "Linfield remain three points behind Premiership leaders Crusaders after three second-half goals help them beat Dungannon.", "filename": "sport_football_31472195_1747668270.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81010000/jpg/_81010204_feeneydavidarmstrong.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31472195_1747668270.html", "title": "Irish Premiership: Dungannon Swifts 0-3 Linfield", "title_page": "Irish Premiership: Dungannon Swifts 0-3 Linfield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Linfield stay three points behind Premiership leaders Crusaders after three second-half goals helped them beat Dungannon at Stangmore Park.\nDungannon had their moments in the first half although the Blues looked the more dangerous with Swifts keeper Andy Coleman denying Stephen Lowry.\nHowever, a Coleman mistake gifted Aaron Burns Linfield's opening goal on 52.\nJimmy Callacher nodded the second goal on 70 with Andrew Waterworth completing the scoring with a 79th-minute header.\nBlues player-boss Warren Feeney opted to start himself and went on to produce a typically energetic display.\nThe Blues bossed possession for the most part in the first half but Dungannon did produce a couple of dangerous breaks with Ross Glendinning having to reach to stop a curling Conor Mullan shot in the 18th minute.\nLinfield produced intense pressure in the 10 minutes before half-time with Fra Brennan's block denying Waterworth and Coleman then superbly parrying Lowry's shot after great work by Blues full-back Glenn Belezika.\nHowever, the opening goal did arrive on 52 minutes as Burns scrambled the ball over the line after Coleman had failed to gather a cross.\nJamie Douglas missed a glorious chance to level within two minutes as he lobbed over after keeper Glendinning had made a poor job of an attempted clearance.\nMullan had another half-chance for the Swifts on 68 only to delay his shot and the game was up for the home side two minutes later as Callacher glanced a Grant McCann cross past Coleman.\nAs Linfield continued to dominate, Waterworth headed a Niall Quinn cross to the net 11 minutes from time.", "url": "https://www.bbc.com/sport/football/31472195"}