{"authors": ["Laura Kirk-Francis", "www.facebook.com"], "date_download": "2025-04-26 04:22:59", "date_modify": "2025-04-26 04:22:59", "date_publish": "2025-03-03 13:25:24", "description": "Arsenal news: Opinion - Fan on whether questioning Mikel Arteta is right", "filename": "sport_football_articles_cvg1700yng7o_1745641379.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbf6/live/712e8270-b626-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg1700yng7o_1745641379.html", "title": "Opinion - Fan on whether questioning Mikel Arteta is right - BBC Sport", "title_page": "Arsenal news: Opinion - Fan on whether questioning Mikel Arteta is right - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "With Arsenal currently on course to finish second for the third season in a row, fans are divided on what this will mean for Mikel Arteta's legacy at the club.\nThere is no doubt that the club's trajectory has been firmly upwards since Arteta took over in 2019. A graphic showing Arsenal's record during the 2020-2021 season of one win in 10 games has been widely shared on social media, serving as proof of the improvement under the Spaniard.\nLast season, Arsenal amassed an enormous 89 points, scoring 91 goals. With stats like that, it seems absurd to be questioning a manager who also persuaded Declan Rice to choose Arsenal over Manchester City, and restored Arsenal to the Champions League after a six-year absence.\nMoreover, rival fans' glee at Arsenal's failure often ignores the trajectory of their own clubs. Tottenham Hotspur are in 13th, with Manchester United behind them in 14th. By comparison, Arsenal's navigation of the post-Wenger years may have been rocky to start, but within three seasons of his arrival, Arteta had Arsenal challenging for a title. His ability to raise Arsenal's standards and hold them consistently, is to be commended.\nBut there is no trophy for consistency.\nThere is no trophy for not sinking to the bottom half of the table like your rivals. There is certainly no trophy for coming second. Therefore, fans are right to start questioning whether this squad, this team, and this manager have reached their potential and can go no further.\nArsenal may need to consider a rebuild, which would mean taking a step backwards first, to ultimately go one step further.\nFor those who still believe in this squad though, history is on Arsenal's side. Three times the Gunners finished runners-up between 1998 and 2001, before finally winning the title in 2002.\nFans will be praying history can repeat itself next season.", "url": "https://www.bbc.co.uk/sport/football/articles/cvg1700yng7o"}