{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:24", "date_modify": "2025-05-21 05:55:24", "date_publish": "2025-01-31 15:33:20", "description": "Luton Town's manager plays down suggestions that new boys Millenic Ali and Thelo Aasgaard are 'Matt Bloomfield signings' because of his in-depth knowledge of League One.", "filename": "sport_football_articles_cly5drvel78o_1747806924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c06e/live/0fc6e5a0-dfe6-11ef-9db5-61a9bc752e71.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly5drvel78o_1747806924.html", "title": "Matt Bloomfield: Alli & Aasgaard signings not just result of League One knowledge", "title_page": "Matt Bloomfield: Alli & Aasgaard signings not just result of League One knowledge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town's manager has played down suggestions that new boys Millenic Ali and Thelo Aasgaard are 'Matt Bloomfield signings' because of his in-depth knowledge of League One.\nThe pair have been brought in from Exeter City and Wigan Athletic respectively to add freshness to the Luton squad as they look to pull themselves out of relegation trouble.\n\"It's important in January, there's not a huge amount of time before the end of the season, so the players you bring in need to be ready to go,\" Bloomfield told BBC Three Counties Radio.\n\"Obviously I'm aware of those boys and understand their games, but they were on the club's radar before I got here as well. It's absolutely a (recruitment) team effort.\"\nBloomfield said it was possible that more signings could be made before the transfer window closes, adding: \"This is my third January transfer window and all kinds of names come up and you have to be ready to react.\n\"We have to make sure we do the right business and we're really pleased with what we've done so far.\"\nBut he refused to be drawn on reports suggesting Luton were willing to pay £6m to his former club Wycombe for top scorer Richard Kone.\nAsked about the situation regarding Kone, he replied: \"I'm smiling because I knew it was coming. Richard is a great boy but I'm not going to sit here and talk about transfers of players at other clubs, it just doesn't feel right.\n\"I won't be commenting on speculation, I'm here to do the best job I possibly can and our interactions and discussions so far as a recruitment team have been fantastic, we'll do the best we can and do what's right for us for the rest of the season.\"\nWycombe's joint-interim boss Sam Grace said in midweek that Kone \"wants to get promoted with Wycombe\".", "url": "https://www.bbc.com/sport/football/articles/cly5drvel78o"}