{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:42:59", "date_modify": "2025-05-21 04:42:59", "date_publish": "2025-04-03 07:50:46", "description": "Man City 2-0 Leicester: Analysis", "filename": "sport_football_articles_cr4nl1drrxro_1747802579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee7c/live/3af4c530-1060-11f0-a838-a720bcf3cdb5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4nl1drrxro_1747802579.html", "title": "Man City 2-0 Leicester: Analysis", "title_page": "Man City 2-0 Leicester: Analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After starting the game at Manchester City as the Leicester captain, Jamie Vardy looked less than impressed as he took his seat at the back of the dugout after being replaced at half-time by midfielder Oliver Skipp.\nAnd the response from Foxes fans on social media to the removal of a striker in favour of a defensive midfielder at 2-0 down was predictably negative.\nYet, like many decisions Ruud van Nistelrooy has made since replacing Steve Cooper as manager part way through the season, it was akin to shuffling deckchairs on the Titanic.\nDeep in the second half, it seemed a moral victory when the visitors got numbers into the home side's box and the ball bounced in the six-yard area, but it was easily dealt with.\nThe nearest Leicester came to ending their wait for a goal came early in the opening period, when they were already behind, as Bilal El Khannouss attempted a curling effort from just outside the penalty area. For a brief moment it looked as though it might go in, but it did not bend enough and drifted wide.\nManchester City have now recorded seven straight league wins against Leicester, so the Foxes do not need to be as bad as they were here for Pep Guardiola's side to beat them.\nBut while there is over a fifth of the campaign to go and, mathematically, nothing is certain, it is impossible to see how this miserable season can end in anything other than relegation, which could easily be confirmed before April is at an end.", "url": "https://www.bbc.com/sport/football/articles/cr4nl1drrxro"}