{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:11:54", "date_modify": "2025-04-26 04:11:54", "date_publish": "2025-03-04 12:41:49", "description": "The Six Nations publish the report for Ireland centre Garry Ringrose's disciplinary hearing, including why Leinster's game against Cardiff was included in his ban.", "filename": "sport_rugby-union_articles_c80yp7lzeljo_1745640714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00c1/live/f87891c0-f8f2-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c80yp7lzeljo_1745640714.html", "title": "Six Nations 2025: Why Ireland's Garry Ringrose's ban included Leinster's URC game against Cardiff", "title_page": "Six Nations 2025: Why Ireland's Garry Ringrose's ban included Leinster's URC game against Cardiff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On Monday, the Six Nations published the written reasons for Ireland centre Garry Ringrose's three-match suspension.\nRingrose was handed a three-game ban following his red card against Wales for a high tackle on Ben Thomas.\nRingrose's ban came after the mid-range entry point of a six week/match suspension was reduced by 50% taking into account his guilty plea and previous disciplinary record.\nHe will miss Saturday's Six Nations match against France. A further game will be taken off should Ringrose complete World Rugby's Coaching Intervention Programme.\nSignificantly, Ringrose's suspension included Leinster's United Rugby Championship win over Cardiff on Saturday, so if he completes the coaching intervention programme, he will be available for Ireland's final Six Nations game against Italy on 15 March.\nThe Leinster game being included in the ban has caused some confusion. Earlier in the tournament, France fly-half Romain Ntamack was handed a two-game ban following his red card against Wales.\nNtamack's suspension, however, covered France's Six Nations fixtures against England and Italy, but not Toulouse's Top 14 encounter with Clermont, which took place during a Six Nations fallow week (like Leinster's game with Cardiff).\nOver the weekend, French Rugby Federation (FFR) vice-president Jean-Marc Lhermet said they are seeking an explanation around the differences between Ringrose and Ntamack's cases.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c80yp7lzeljo"}