{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:33", "date_modify": "2025-05-21 06:51:33", "date_publish": "2025-03-29 21:18:09", "description": "Bangor manager Lee Feeney says everyone in the Seasiders' dressing room was left with a feeling of what could have been after their 2-0 Irish Cup semi-final defeat by Dungannon Swifts.", "filename": "sport_articles_cn4j9ypdgwvo_1747810293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/048e/live/fb61fad0-0ce2-11f0-ae5b-bf3834356f20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn4j9ypdgwvo_1747810293.html", "title": "'Regret the primary emotion' - Bangor boss Feeney", "title_page": "Irish Cup: 'Regret the primary emotion' - Bangor boss Feeney - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bangor manager Lee Feeney said everyone in the Seasiders' dressing room had been left with the same feeling of a missed opportunity after they lost 2-0 to Dungannon Swifts in Saturday's Irish Cup semi-final.\nKyle Owens' first-half own goal and Dean Curry's headed goal 10 minutes from time condemned the Championship leaders to defeat against Rodney McAree's charges, who sit fourth in the Premiership table.\n\"The one word is regret. We felt going in at half-time that because of the conditions, we had the wind for us in the second half, and we felt we were going to do a bit better,\" Feeney told BBC Sport NI.\n\"Everyone in the changing room comes away with the same feeling of regret because we feel like we could have made something happen there.\n\"We should have done a wee bit better with qualities and deliveries and intelligence in the final third but if we had got a wee bit of luck and had got the second goal with a bit of time left they would have felt the pressure and their mentality would have changed and so would ours, for the better.\n\"It wasn't to be and they defended really, really well at times, so congratulations to them. We weren't consistent enough, we played in wee periods here and there.\"", "url": "https://www.bbc.com/sport/articles/cn4j9ypdgwvo"}