{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:38:59", "date_modify": "2025-05-21 08:38:59", "date_publish": "2025-03-26 12:40:23", "description": "Carlisle United head coach Mark Hughes is 'encouraged' about his side's survival prospects after their 2-2 draw with MK Dons.", "filename": "sport_football_articles_c2015n710v0o_1747816739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3bf2/live/c5e25210-0a3a-11f0-80d5-ff7a1f4f7e48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2015n710v0o_1747816739.html", "title": "Carlisle United: Mark Hughes 'encouraged' by survival hopes despite MK Dons draw", "title_page": "Carlisle United: Mark Hughes 'encouraged' by survival hopes despite MK Dons draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlisle United Mark Hughes says he is 'encouraged' about his side's hopes of avoiding relegation from League Two despite being six points from safety.\nThey only managed a 2-2 draw at home to MK Dons on Tuesday in their game in hand, as they missed the chance to reduce the gap on Tranmere Rovers to four points.\nBut Hughes was pleased with the spirit his team showed to twice fight back from a goal down to salvage a draw.\n\"In my view, the manner of the performance encourages me,\" Hughes told BBC Radio Cumbria.\n\"We have just to keep replicating the last two performances, which have been a step up from recent weeks.\"\nThey missed the chance to record successive victories for the first time March 2023 but the point at least moves the Brunton Park club above Morecambe and off the bottom for the first time since January.\nAnd the gap to Tranmere has been cut from nine points to six in the space of three days. But Carlisle now have away trips to Doncaster Rovers and Chesterfield as they attempt to further cut the deficit.\nSurvival remains a tall order, but Hughes remains bullish.\n\"We're off the bottom and we haven't been able to say that for a long time,\" he added.\n\"Everyone in the league knows we're fighting for our lives and it won't be easy for them.\n\"But we'll go there (to Doncaster and Chesterfield) with a lot of confidence because we're playing well.\"", "url": "https://www.bbc.com/sport/football/articles/c2015n710v0o"}