{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:07:15", "date_modify": "2025-05-19 15:07:15", "date_publish": "2015-01-30 12:32:21", "description": "Aston Villa sign Manchester City winger Scott Sinclair on loan until the end of the season, with a view to a permanent transfer.", "filename": "sport_football_31058844_1747667235.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80677000/jpg/_80677405_scottsinclair_ap.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31058844_1747667235.html", "title": "Manchester City's Scott Sinclair joins Aston Villa on loan", "title_page": "Manchester City's Scott Sinclair joins Aston Villa on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa have signed Manchester City winger Scott Sinclair on loan until the end of the season - with a view to a permanent transfer.\nThe former Chelsea and Swansea City player, 25, has struggled to break into Manuel Pellegrini's side.\n\"I believe I have my best years ahead of me,\" Sinclair said.\nVilla manager Paul Lambert said: \"He got a great move to Manchester City, where it didn't work out as well as he probably would have wanted.\"\nLambert said it showed the club is moving in the right direction following the signing of Carles Gil earlier in the window and midfielder Fabian Delph signing a new four-and-a-half year deal.\n\"This club is moving in a really good direction at the minute,\" he said.\n\"Fabian re-signing, Carles coming in and the way he is playing, Sinclair coming in is a breath of fresh air as well. So there are a lot of good things going on at the minute.\"\nSinclair joined City on a four-year deal from Swansea in 2012 but made just three starts and 19 appearances in total.\nHe has played just 25 minutes this season and has not featured for City since coming on late in the 2-2 draw with Burnley in December.\nLast season was spent on loan at West Brom, but he played just eight times in the Premier League.", "url": "https://www.bbc.com/sport/football/31058844"}