{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:01:56", "date_modify": "2025-05-20 12:01:56", "date_publish": "2023-08-05 15:00:46", "description": "Brazilian forward Matheus Franca joins Crystal Palace from Flamengo on five-year deal.", "filename": "sport_football_66358636_1747742516.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2F57/production/_130591121_gettyimages-1250806248.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66358636_1747742516.html", "title": "Matheus Franca: Crystal Palace sign Brazilian teenage forward from Flamengo", "title_page": "Matheus Franca: Crystal Palace sign Brazilian teenage forward from Flamengo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace have signed Brazilian forward Matheus Franca from Flamengo on a five-year contract.\nThe 19-year-old is a Brazil Under-20 international and has scored nine goals in 27 first-team games since making his Flamengo debut in December 2021.\nThe deal is reported to be worth about £26m, external - £17m plus £9m in add-ons.\nFranca told the club's website, external: \"I hope I can bring good results for our supporters, for the other players and everybody else in the team.\"\nPalace manager Roy Hodgson has been looking to bolster his attack after Ivory Coast forward Wilfried Zaha left at the end of his contract to join Galatasaray in July.\n\"I'm very excited for my first game here at my new home, giving my best for my new team,\" added Franca.\n\"I hope all the supporters are happy with me coming here. I bet it is going to be good for all of us.\"\nFranca is Palace's second signing in the transfer window, after midfielder Jefferson Lerma joined from Bournemouth on a free transfer.\nChairman Steve Parish said: \"Matheus is a young and exciting player whose impressive early progress we have followed with keen interest, and we are delighted to welcome him to the club.\n\"Palace have a long history of attacking players with skill, pace and tenacity. I am sure Matheus will be another popular addition to the nucleus of this young and entertaining squad, packed full of international talent and potential, that we are building here in south London.\"\nThe Eagles, who finished 11th last season, begin their Premier League campaign with a trip to Sheffield United on 12 August.", "url": "https://www.bbc.com/sport/football/66358636"}