{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:16:39", "date_modify": "2025-04-26 04:16:39", "date_publish": "2025-03-04 08:29:34", "description": "Nottingham Forest beat Ipswich on penalties: Fan views", "filename": "sport_football_articles_c9degp9e6e6o_1745640999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9degp9e6e6o_1745640999.html", "title": "Nottingham Forest beat Ipswich on penalties: Fan views", "title_page": "Nottingham Forest beat Ipswich on penalties: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the FA Cup fifth-round tie between Nottingham Forest and Ipswich.\nHere are some of your comments:\nNottingham Forest fans:\nRob: It is all about progressing to the next round, doesn't matter how you get there! Ryan Yates epitomised everything about Forest - grit and determination. Suspect he may have impressed a watching England manager...\nNathan: Ipswich made it hard for us and were tough to break down, but we did well to get the equaliser and thought we looked most likely as the game went on. Solid all round and the result is all that matters. Wary of Brighton's reaction after the 7-0.\nAdam: I'm glad that we're through to the quarter-finals but we sure made it harder than it needed to be. We were the better team throughout the game but just could not finish our chances. It was a decent game of football but just frustrating as a Forest fan to watch.\nFosi: We have not played well for six matches now, defence not quite as solid and attack lacks penetration. Think we need better quality back up players, and slightly bigger squad to cope with all the games. Overall good fighting display.\nIpswich fans:\nRobert: Scrappy game, but what I don't understand is why clubs (not just Ipswich but Forest and Manchester United) field weakened teams from the start. Surely the prospect of taking your loyal fans to Wembley in a final is worth playing the best XI?\nJames: Small margins again. We took a good side in Forest to 120 minutes. It is a shame to lose but the bigger focus was always the league. Full effort and attention now needed for a crucial part of the season.", "url": "https://www.bbc.co.uk/sport/football/articles/c9degp9e6e6o"}