{"authors": ["Chris Bevan", "www.facebook.com"], "date_download": "2025-05-19 14:41:08", "date_modify": "2025-05-19 14:41:08", "date_publish": "2017-08-11 10:28:17", "description": "Premier League title favourites Manchester City have to wait to break down promoted Brighton before two late goals give them victory.", "filename": "sport_football_40835422_1747665668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34C7/production/_97311531_city_huddle_pa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40835422_1747665668.html", "title": "Brighton & Hove Albion 0-2 Manchester City", "title_page": "Brighton & Hove Albion 0-2 Manchester City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City manager Pep Guardiola was relieved to see his side overcome promoted Brighton after their Premier League rivals slipped up earlier in the day.\nTitle favourites City had to wait to break down the Seagulls before two late goals gave them victory on the south coast.\nBut they never looked in serious danger of suffering an opening weekend upset in the manner of Chelsea, who lost at home to Burnley, or Liverpool, who were held by Watford.\n\"The first game is always complicated, in my experience, even with Barcelona - especially against a promoted side when they have the passion and are under no pressure at all,\" said the former Barca and Bayern Munich boss.\n\"We saw what happened to Liverpool and Chelsea and we spoke about it. It was unexpected but this is the Premier League - I learned this last season.\n\"Here every game is a battle, but we controlled the game and it was always in our hands.\"\nThe Seagulls, back in the top flight after a 34-year absence, had showed impressive organisation and resolve to keep City at bay until David Silva played in Sergio Aguero to fire home after 70 minutes.\nLewis Dunk headed Fernandinho's cross into his own net five minutes later to make sure of the points for Guardiola's new-look side.\nBrighton, who had 22% possession, spent most of the game defending in their own half but had chances with the score at 0-0.\nShane Duffy had a shot deflected just wide and, after City's new £35m goalkeeper Ederson flapped at the resulting corner, Dunk had two shots blocked in quick succession.\nBut that was the only time City's defence was under pressure and the day was more of a test of whether Guardiola's rebooted team could break down a massed defence.\nThey did not do it enough in his first season at City but at the Amex Stadium, eventually, they found a way through.\nNew personnel meant a change to a 3-1-4-2 formation for Guardiola, something he tried during his side's recent tour of the United States.\nIt was hard to gauge an accurate impression of City's new shape because Brighton sat so deep in their own half and saw so little of the ball.\nEven so, the signs are that City are still adjusting to it themselves.\nKyle Walker and Danilo, signed for a combined £68m over the summer, did exactly what they were supposed to do as wing-backs - constantly getting forward and overlapping down the outside.\nAll too often, though, their runs were ignored and City played the ball inside, where space was limited, before attacks broke down.\nWidth was the way forward for City, however, and moves along the right flank provided both their goals.\nDale Stephens' mistake allowed Walker to start the attack that led to Aguero scoring, while Fernandinho provided the cross that Dunk put into his own net.\nBrighton manager Chris Hughton: \"It is disappointing but that is the quality Manchester City have got and we know that.\n\"We can take a lot of positives from the game. When you are playing Champions League-quality teams, you know that they can hurt you. It was always going to be difficult for us to score.\n\"We have to make sure that come the end of the window, we have a squad that can do well enough in this division. We have to win the games that we can do.\n\"The fans have been absolutely brilliant in my time here and I think they are realistic. They will certainly be behind us. It is a wonderful place to be and a wonderful place to play.\"", "url": "https://www.bbc.com/sport/football/40835422"}