{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:56", "date_modify": "2025-05-21 05:34:56", "date_publish": "2025-04-02 15:15:34", "description": "Keaton Jennings is out to deliver as Lancashire captain as they begin life in Division Two in 2025.", "filename": "sport_cricket_articles_cg41lk00pdvo_1747805696.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/977e/live/c58dbfd0-0fd4-11f0-94e9-65dc0da473ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cg41lk00pdvo_1747805696.html", "title": "Lancashire: 'It's my job' to win silverware says captain Keaton Jennings", "title_page": "Lancashire: 'It's my job' to win silverware says captain Keaton Jennings  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Keaton Jennings knows he must bring silverware back to Lancashire after committing his long-term future to the county.\nThe Lancashire captain signed a five-year contract, external lasting until the end of the 2029 season during the winter.\nHe has been skipper for the last two years but oversaw the club's relegation from Division One of the Championship last summer.\n\"I've loved the last seven years and hope I can make the next five more successful,\" Jennings, 32, told BBC Radio Lancashire.\n\"That would be my dream and objective. To add as much value as I can and add some silverware.\n\"I know that's really cliched but it's what I'm going to be judged on and it's what my job is.\"\nLancashire are in Division Two for the first time since 2019 and the fifth time since two divisions were introduced.\nEach time they were relegated previously, the Red Rose bounced back straight away, three times as winners of the second tier, most recently six years ago.\nBut it is now 10 years since their last major trophy, when they won the T20 Blast.\nJennings joined Lancashire from Durham ahead of the 2018 season and was a part of that promotion season the year after. He has scored over 5,000 first-class runs for the county.\nHe took over from Dane Vilas as captain two years ago but after a very difficult 2024, a youthful team was unable to avoid relegation.\nNow the skipper hopes some of the squad can use any scars as motivation to come back stronger.\n\"Guys were kicked in the teeth last year and they've got to find a way to come again, put yourself back together, learn and try to be better,\" he said.\n\"We do have a young squad but the earlier we can get that development into these guys and get them to a point where they know what they're doing, the better.\n\"They will be better off for last year. It will have toughened them up early in their careers, which is awesome.\"", "url": "https://www.bbc.com/sport/cricket/articles/cg41lk00pdvo"}