{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 06:14:19", "date_modify": "2025-05-21 06:14:19", "date_publish": "2025-04-01 10:59:53", "description": "James Anderson will miss the first month of the County Championship with injury but says he could play another three years at Lancashire.", "filename": "sport_cricket_articles_cpq7zydlz0wo_1747808059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f31/live/a9d40d90-0eed-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cpq7zydlz0wo_1747808059.html", "title": "James Anderson: England record-holder not ruling out three more years at Lancashire", "title_page": "James Anderson: England record-holder not ruling out three more years at Lancashire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "James Anderson will miss the first month of the County Championship season through injury but says he is not ruling out playing for up to three more years at Lancashire.\nThe 42-year-old, England's all-time leading wicket-taker, retired from international cricket last year but has signed to continue with his county in 2025.\nHe picked up a right calf injury in pre-season training, ruling him out of Lancashire's first block of matches in April, but is not putting a timescale on how long he will extend a professional career that began in 2002.\n\"I really want to focus on this year and do as well as I can,\" Anderson told BBC Sport.\n\"I am not ruling out playing for another one, two or three years. I don't think you should limit yourself with that.\"\nAnderson referenced the career of his friend and former team-mate Glen Chapple, who played at Lancashire until he was 41. Kent all-rounder Darren Stevens was 46 when he played his last first-class match in 2022.\n\"I know my body can take quite a lot when it comes to bowling in four-day cricket,\" Anderson said. \"I feel fortunate I'm in this position, I want to give as much as I can.\"\nAnderson's decision to retire from international duty came after England coach Brendon McCullum and captain Ben Stokes decided they want to build an attack for the future.\nHe was given an emotional farewell in the first Test against West Indies at Lord's last July.\nSpeaking on Tuesday, he said proving England wrong was not part of his motivation for continuing and said he is doing so because of his \"love\" for the sport.\n\"The best part of playing a team sport is winning as a team, and if your focus drifts away from that it's not as enjoyable and you don't perform as well,\" he said.\nAnderson, who missed most of the 2019 Ashes with a right calf injury, has not played any cricket since the West Indies Test, although he has had a full pre-season with Lancashire and been bowling in the nets while working as England's bowling coach.\nHe does not have a formal role with England and could still work with the squad during the summer, but said playing for Lancashire will be his priority.\n\"I want to give playing a good go, so that's what I've told them,\" Anderson said.\n\"I want to prioritise playing cricket for Lancs.\n\"If there's opportunities throughout the summer where they want me to come in and do stuff, we'll have to cross that bridge.\"\nAnderson's deal at Lancashire, where he has played his entire county career, covers T20 cricket, meaning he could make a first appearance in the format since 2014.\nHe signed up for this year's Hundred draft but was not selected.\nIn his only outing for Lancashire in the County Championship last summer he took 7-35 against Nottinghamshire at Southport.", "url": "https://www.bbc.com/sport/cricket/articles/cpq7zydlz0wo"}