{"authors": ["Ben Ramsdale", "www.facebook.com"], "date_download": "2025-04-26 04:06:31", "date_modify": "2025-04-26 04:06:31", "date_publish": "2025-03-03 16:35:00", "description": "From this summer goalkeepers will be allowed eight seconds from catching the ball to releasing it, in the latest attempt to cut down on time-wasting.", "filename": "sport_football_articles_cwyg7jyp82do_1745640391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a1b/live/e2b487b0-f832-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyg7jyp82do_1745640391.html", "title": "What is the new eight second goalkeeper rule in football?", "title_page": "What is the new eight second goalkeeper rule in football? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former England and West Ham goalkeeper Rob Green:\nBack in the day there was the six-second rule and that has slowly faded away – I don't know why – I think that was enough of a deterrent. Maybe they are thinking the punishment being a bit more lenient may get things going. It seems a strange one to reintroduce, but if we can get more football in the 90 minutes then I'm all for it.\nAs a percentage there's only around a 4% chance of scoring from a corner so it isn't that much of a threat but at the end of the game, the last thing your team-mates want to do is defend a set-piece if you're winning.\nI think we see it every year, they will implement it right from the start but in a couple of years' time we may be having this same conversation.\nFormer England and Tottenham goalkeeper Paul Robinson:\nThese rules are being made by people that have clearly never played the game. They are giving corners?\nGoalkeepers used to have six seconds – then that went out the game so goalkeepers have started game management and timewasting. Now they are giving an extra two and it's eight.\nShamoon Hafez:\nIt feels like a rule that may be strictly enforced when first implemented, before it gets forgotten about.\nJust think back to how much injury time was being played when officials decided to clamp down on time-wasting and how much is added on now.\nIt also feels like there could be a pantomime scenario during matches, with players and the crowd counting the seconds when the keeper has ball in hand.\nBurnley striker Ashley Barnes was signalling seconds on his fingers in Saturday's FA Cup game against Preston as Freddie Woodman held on to the ball. How many other players will we see attempting to pressure the referee into enforcing the new rule?\nAlex Howell:\nIt will be interesting to see what impact the eight-second rule has on the way teams think about their build-up play.\nIt could also then have a knock-on effect on the way teams press. The trend with a lot of teams is to press high to keep the opposition under pressure, but maybe now knowing the ball has to be released in eight seconds could push sides even further forward and impact the speed of games everywhere.\nConor McNamara:\nI have quite a bit of sympathy for the referees who are going to have to implement this.\nIn essence, the law was to be a deterrent to stop excessive holding on to the ball for 20 seconds and more. But in this highly-analytical world we now live in, any new 'measurable initiatives' will be given the full 'offside by a toe-nail' treatment.\nThe conspiracy theorists will love it all.\nAlso, to implement this to the letter of the law, the poor referees will have to start shouting five-second countdowns each and every time a goalkeeper has had the ball in their hands for three seconds.\nSemi-automated offsides may divert some of the personal insults away from the officials, but implementing this new law will see the individual referees catch plenty of slack again.\nAlistair Bruce-Ball:\nOne thing's for certain - goalkeepers would be wise not to hang on to the ball against Arsenal next season given their prowess from corners.\nAnything that prevents players from time-wasting is obviously to be applauded but I can already foresee arguments about the consistency in the application of this law.\nI also wonder if it's something the referees will be very hot on in the first couple of weeks before it gets forgotten, not deliberately but subconsciously, and the time allowed starts slipping.\nNick Mashiter:\nNottingham Forest's Matz Sels will be on red alert with the new eight-second rule.\nThe goalkeeper has been booked twice for time-wasting this season, while Jose Sa at Wolves has also been known to slow the game down to his side's advantage.\nThe Premier League is already played at a frantic pace and this will only help maintain that speed, but the focus could be better served improving the video assistant referee and avoiding prolonged delays - including the eight-minute wait to rule out Milos Kerkez's goal for Bournemouth against Wolves on Saturday - which only frustrate fans and slow the game down further.\nJohn Murray:\nAn interesting move but how often we will see it implemented, I wonder?\nI suspect it is simply another tool to try and increase the amount of playing time, which the authorities have been working on for some while.\nAnd the likelihood is it will be used only very much as a last resort and more as a warning to make it clear to goalkeepers that they need to get on with it.", "url": "https://www.bbc.co.uk/sport/football/articles/cwyg7jyp82do"}