{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:37:09", "date_modify": "2025-05-20 12:37:09", "date_publish": "2023-08-04 00:00:00", "description": "Follow text and radio commentary as Southern Brave host Welsh Fire in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306516_1747744629.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8B8E/production/_130662753_7979d6b194db47dc8180b60e34c04e0a8a209e20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306516_1747744629.html", "title": "The Hundred 2023 LIVE: Southern Brave vs Welsh Fire in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Southern Brave vs Welsh Fire in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Good night\nWe'll leave you there.\nSouthern Brave and Welsh Fire have two points each in the early competition table.\nTake a read of Timothy Abraham's report and we'll see you tomorrow for four more games from The Hundred.\nManchester Originals host London Spirit from 11, while Birmingham Phoenix entertain Trent Rockets later in the day.\nWe'll have text and radio commentary of every match, plus the men's match between Phoenix and Rockets will be on BBC Two and iPlayer from 17:45 BST.\nWhat a treat.\n'There's trust that someone will stand up'\nMatch Hero Chris Jordan, speaking to Sky Sports: \"I tweaked the calf on one of the twos I was trying to run quickly, that is just part and parcel of life, but I'm glad the boys got the job done.\n\"I just tried to take it as deep as possible. When I came in a run-a-ball would have got us up to about 110 and you hope for some boundaries to get up to 130. We just got on a roll and kept it going.\n\"It was just about commitment. The wicket wasn't as easy out there, our top five struggled. It was just commitment to going really.\n\"The crowd here is always amazing. They always show us good support. We just try and entertain them.\n\"I would definitely have rather been out there. I thought the boys bowled really well. Everyone stood up. Guys are having to perform different roles and, although it's just been two games, there's a lot of trust in the changing room that somebody will step up and get the job done.\"", "url": "https://www.bbc.com/sport/live/cricket/66306516"}