{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:37", "date_modify": "2025-05-21 06:46:37", "date_publish": "2025-02-08 10:02:29", "description": "Swansea City: Lewis O'Brien aims to reignite career and reveals Alan Tate message", "filename": "sport_football_articles_cdrypegedxko_1747809997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/295f/live/0e33aef0-e52a-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdrypegedxko_1747809997.html", "title": "Swansea City: Lewis O'Brien aims to reignite career and reveals Alan Tate message", "title_page": "Swansea City: Lewis O'Brien aims to reignite career and reveals Alan Tate message  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis O'Brien says he is determined to get his career back on track during his loan spell with Swansea City.\nThe central midfielder - who was on loan at Los Angeles FC in the latter half of the 2024 Major League Soccer campaign - joined the Swans from Nottingham Forest on transfer deadline day.\nHe has not featured under Nuno Espirito Santo this season and says the opportunity to play regular football in the Championship was one he could not turn down.\n\"I looked on the map first and realised how far away it (Swansea) was,\" joked the 26-year-old.\n\"I wanted to play football. I spoke to the manager before coming down and he gave his ideas across to me and he thought I could fit into the system pretty well and help the team.\n\"My wife is heavily pregnant at the moment so it was a tough decision to come this far, but football-wise it's hopefully a step in the right direction for my career.\n\"The decision to go to LA was a tough one as well. I'm not sure which beaches are better looking at the moment, there or here! I'm just trying to get my career back on the pathway that I want it to be.\"\nO'Brien moved to the City Ground in the summer of 2022, just two months after Steve Cooper's Forest side defeated Huddersfield at Wembley in the Championship play-off final.\nAnd O'Brien revealed Cooper's former assistant and Swans legend Alan Tate sent him a message as he pondered a switch to the Swansea.com Stadium.\n\"Tatey messaged me the other day and said 'I need to come down to God's country'. I just gave him a little laugh to be fair,\" O'Brien said.\nO'Brien's arrival comes as a real boost to Swansea head coach Luke Williams following Matt Grimes' move to Coventry City.\nBut Williams says O'Brien has not been brought in to replace former club captain Grimes.\n\"We should just respect Lewis for the player that he is. He is a top performer who has been in some excellent Championship teams,\" said Williams.\n\"Grimesy was a very niche player, an incredible player. In a different way, Lewis is that as well.\n\"You can speak to a dozen coaches who are going to talk about Lewis in the same way that over the years we have spoken about Matt Grimes, because he has been a top performer.\n\"Brilliant managers who know what they are looking at say this guy is the real deal.\"", "url": "https://www.bbc.com/sport/football/articles/cdrypegedxko"}