{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:25", "date_modify": "2025-05-21 05:51:25", "date_publish": "2025-01-31 16:02:19", "description": "Burton Albion sign Wrexham's James Jones and Bring in Fabio Tavares from Coventry on loan as Bareik Hareide resigns from the club's board.", "filename": "sport_football_articles_c99y75gepp5o_1747806685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c35/live/399dc9a0-dfed-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99y75gepp5o_1747806685.html", "title": "James Jones & Fabio Tavares: Burton Albion make double signing", "title_page": "James Jones & Fabio Tavares: Burton Albion make double signing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burton Albion have signed Wrexham midfielder James Jones in a permanent deal and forward Fabio Tavares on loan from Coventry City.\nJones has agreed an 18-month contract at the Pirelli Stadium after scoring 16 goals in 138 appearances for the Red Dragons.\n\"The team has great momentum at the minute so hopefully we can carry that on to keep us safe, then we can push on together next year,\" he said.\nTavares has played 30 games for Coventry but only two this season, and has only made five starts.\nBurton are still in the League One relegation places ahead of Saturday's game at Barnsley but have been in excellent form of late under Gary Bowyer, winning their last three and scoring nine goals in the process.\nOn the signing of 28-year-old Jones, Bowyer said: \"When I spoke to him he was excited and wanted to come and join us, (and) he also brings a winning mentality into the group having had back-to-back promotions with Wrexham.\"\nThe arrival of Jones and Tavares follows the signings of full-back Owen Dodgson, midfielder JJ McKiernan and forward Jon Dadi Bodvarsson earlier this month.", "url": "https://www.bbc.com/sport/football/articles/c99y75gepp5o"}