{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:56:27", "date_modify": "2025-04-26 03:56:27", "date_publish": "2025-03-04 15:09:41", "description": "Club Brugge v Aston Villa preview: 'Stay in the tie' - Pat Nevin", "filename": "sport_football_articles_c05m6ldn8zzo_1745639787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76d3/live/9191ff60-f8dd-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c05m6ldn8zzo_1745639787.html", "title": "Club Brugge v Aston Villa preview: 'Stay in the tie'", "title_page": "Club Brugge v Aston Villa preview: 'Stay in the tie' - Pat Nevin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Chelsea winger Pat Nevin says Aston Villa must use their Champions League round of 16 first leg against Club Brugge is Belgium this evening to \"stay in the tie\".\nVilla last played in the last 16 of the European Cup in 1982 and lost 1-0 to Brugge during the League Phase in November, but still qualified for the knockout stages in the top eight after a strong campaign, including a win over Bayern Munich.\n\"It's going to be difficult for Aston Villa to put down a marker because have a look at their away record, it's not been absolutely brilliant,\" Nevin told Radio 5 Live Breakfast.\n\"I was at the Monaco game - they were not a great team and Villa just didn't do that well.\n\"At home they've been really good and some of the additions and players coming back from injury gives them a right good chance. But, away from home you've got to hard to beat and belligerent.\n\"People don't think Brugge is one of the major teams in European football but they've had some really good results here - including the 1-0 earlier against Villa.\n\"People did not expect them to come through the Atalanta game, that was a real shock.\n\"It goes back to the old one - be in the game for the second leg, stay in the tie and get back to Villa Park. If they can get a win it's party time and they can really enjoy it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c05m6ldn8zzo"}