{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:34", "date_modify": "2025-05-21 04:38:34", "date_publish": "2025-01-18 00:00:00", "description": "Salford's six-game winning run in League Two comes to an abrupt end as a resolute Fleetwood secure a 2-0 win at the Peninsula Stadium.", "filename": "sport_football_live_c23n8p4v4yet_1747802314.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c23n8p4v4yet_1747802314.html", "title": "Salford City 0-2 Fleetwood Town", "title_page": "League Two: Salford City 0-2 Fleetwood Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Promotion-hopefuls Salford City's six-game winning run in League Two came to an end as they were beaten by Fleetwood Town.\nSalford had not conceded a single goal in that time, but it took Fleetwood just 11 minutes to put two past Matty Young, allowing them to leave the Peninsula Stadium with all three points.\nIt was a wonderous start for Fleetwood, who after winning a free-kick in the first minute, went in front after Salford did not deal with a floated ball in, allowing Ronan Coughlan to force the ball into the bottom right corner.\nThe visitors' second goal came less than 10 minutes later, when a Phoenix Patterson corner was headed into the top corner by captain Brendan Wiredu.\nPete Wild's men were much the better team in the first half, with Patterson continually putting pressure on Salford down the left wing.\nSalford started the second 45 with a greater intensity, but rarely challenged the Fleetwood goalkeeper other than with a Conor McAleny header from the centre of the box, which was saved in the top left corner.\nAmidst a fiery end to the game, Salford finished with 10 men after a clash in the middle of the pitch led to Kylian Kouassi being shown a second yellow card.\nThis result sees Karl Robinson's Salford fall to seventh in the table, while Fleetwood climb up to 14th after Wild's third game in charge.\nSalford City manager Karl Robinson said:\n\"I don't think we were at our best. I think obviously losing Ossama [Ashley] yesterday was a big blow to us.\nWith nine players not available, you can't replace that many players.\n\"You've got multiple things in the last seven days that have gone against us that you wouldn't believe.\n\"I don't think our performance levels were so far off it. The result was just miles off it.\n\"It's obviously brought our great run to an end in the league. Now we've got to roll our sleeves up and go again next week.\n\"You can't lose nine players and compete against a team that was in the league above last season. But I thought we did for large parts of it. I thought we just switched off in set-plays.\"\nFleetwood manager Pete Wild said:\n\"I'm really pleased. I'm really pleased with how we went about our business.\n\"We've got some really good footballers here and we just needed to add maybe a little bit of grit and determination and maybe put on sessions in the training ground that bring out grit and determination, and that's what we've done for the last 18 days while we've had no games.\n\"I think you saw a different type of Fleetwood Town team than what you maybe saw, or showed glimpses of, at Doncaster but wasn't the finished article. I don't think we are the finished article now. I don't think we've cracked it, but I certainly feel like you've seen a different side to some players that maybe you hadn't seen before.\n\"I think there's loads that came out of today. First-half how we took the game to Salford and we matched them. I'd talked about intensity and wanting it. We know Salford have got massive intensity, a massive drive and we needed to match that. I thought we matched that today.\n\"I saw a team that wanted to win. And that is Pete Wild teams. Teams that want to win football matches and whatever it takes to win football matches, and that is what we want from them.\"", "url": "https://www.bbc.com/sport/football/live/c23n8p4v4yet"}