{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:21:34", "date_modify": "2025-05-21 06:21:34", "date_publish": "2025-03-31 15:04:16", "description": "Newcastle United podcast: Where does Eddie Howe rank in Newcastle's greatest managers?", "filename": "sport_football_articles_cj9el9p0xdpo_1747808494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69c7/live/778c01b0-0e1d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj9el9p0xdpo_1747808494.html", "title": "Newcastle United podcast: Where does Eddie Howe rank in Newcastle's greatest managers?", "title_page": "Newcastle United podcast: Where does Eddie Howe rank in Newcastle's greatest managers? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Veteran Newcastle United journalist John Gibson believes Eddie Howe ranks second in a list of the club's greatest managers of all time after winning the Carabao Cup earlier this month.\nSpeaking to BBC Radio Newcastle's Total Sport podcast, Gibson said: \"In one fell swoop, Eddie Howe has elbowed Sir Bobby Robson and Kevin Keegan, two of the greatest managers in Newcastle's history, out of the way.\n\"I adore them both for what they gave us, they played the right way, but if this is a results game, which football is, they won nothing and he has just won something.\n\"The only guy that stands in his way now is Joe Harvey, because he won a European trophy.\"\nNewcastle are sixth in the Premier League table, two points off the top four, and return to league action against Brentford on Wednesday.\nGibson added: \"Since the takeover, this has not been the most consistent season. We've been up and down, we've lost home games that we shouldn't lose and it has been a pogo stick, up and down.\n\"This guy [Howe] has made a massive step forward and the team has done that too. We must admire that.\"", "url": "https://www.bbc.com/sport/football/articles/cj9el9p0xdpo"}