{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:06:03", "date_modify": "2025-05-21 04:06:03", "date_publish": "2024-12-29 00:00:00", "description": "Pete Wild denied win in first game as Fleetwood boss after late penalty miss in League Two", "filename": "sport_football_live_crl3epwkpjpt_1747800363.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crl3epwkpjpt_1747800363.html", "title": "Pete Wild denied win in first game as Fleetwood boss after late penalty miss", "title_page": "Pete Wild denied win in first game as Fleetwood boss after late penalty miss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harrogate goalkeeper James Belshaw saved a last-minute penalty to secure a 1-1 draw and deny Pete Wild victory in his first game in charge of Fleetwood.\nBelshaw denied Phoenix Patterson from 12 yards at the death, after Josh March's goal had cancelled out James Bolton's early opener.\nFleetwood made the perfect start to Wild's tenure through Bolton, who found the net with just a minute on the clock. Patterson's corner was sent to the back post, where Bolton sneaked in to finish at close range.\nHarrogate hit back, however, cancelling out the hosts' lead after eight minutes. A curling free-kick from Stephen Duke-McKenna was met by the unmarked March and his glancing header went beyond the reach of Cod Army keeper Jay Lynch.\nFleetwood went close through Matty Virtue – his first-time drive forcing Belshaw into a sharp save – and Ronan Coughlan, whose fierce goalbound effort was deflected over.\nHarrogate then wasted a glaring opportunity. March slipped in Matty Daly who had found space in the box but he skewed his shot horribly wide with only Lynch to beat.\nIn the second half, Ryan Graydon had a terrific chance when Patterson's cross picked him out but he headed way over.\nAnd Duke-McKenna almost scored, but Lynch tipped his free-kick over at full stretch.\nPatterson had the chance to score a 90th-minute winner from the penalty spot after he had been sent tumbling in the box, but Belshaw guessed correctly and pulled off a vital save to secure Harrogate's first point of December.", "url": "https://www.bbc.com/sport/football/live/crl3epwkpjpt"}