{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:15", "date_modify": "2025-05-21 05:45:15", "date_publish": "2025-01-31 16:52:25", "description": "Loughgall boss Dean Smith is given a 15-game ban for his protests after Glentoran were awarded a late penalty in last weekend's Premiership game.", "filename": "sport_football_articles_crlkzy46eleo_1747806315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3150/live/67b9f060-dc2e-11ef-a1c5-afb06f3bb2c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crlkzy46eleo_1747806315.html", "title": "Dean Smith: Loughgall boss handed 15-game ban for penalty protests in Glens game", "title_page": "Dean Smith: Loughgall boss handed 15-game ban for penalty protests in Glens game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Loughgall boss Dean Smith has been handed a 15-game ban as punishment for his protests after Glentoran were awarded what proved to be a late match-winning penalty in last weekend's Irish Premiership contest at Lakeview Park.\nIn post-match interviews, Smith described the penalty decision as \"disgusting\" as referee Shane McGonigle adjudged that Ben Murdock had handled in the area with Loughgall insisting the ball had instead hit their player in the face.\nGlentoran's Joe Thomson scored the spot-kick which earned the east Belfast side a 2-1 success.\n\"I have to be careful what I say because if I tell the truth I'll probably get suspended,\" said Smith following the game.\nHowever, the Irish FA has now handed Smith his whopping ban after ruling that he breached two of its disciplinary articles.\nSmith has been given a 10-match ban for breaching article 23.1 which involves \"offending the dignity of a person or group of persons through contemptuous, discriminatory or denigratory words or actions concerning race, colour, language, religion, sectarianism\".\nA further five-game suspension has been imposed under article 14.1 which deals with players or officials \"reported for unsporting conduct towards a match official\".\nSmith has also been fined £600 for the rules breaches.", "url": "https://www.bbc.com/sport/football/articles/crlkzy46eleo"}