{"authors": ["Elizabeth Botcherby", "www.facebook.com"], "date_download": "2025-04-26 04:10:24", "date_modify": "2025-04-26 04:10:24", "date_publish": "2025-03-02 17:48:10", "description": "Mid-season signings shining for Everton", "filename": "sport_football_articles_cvgdvd43qy1o_1745640624.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7649/live/616d57e0-f78d-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgdvd43qy1o_1745640624.html", "title": "Mid-season signings shining for Everton", "title_page": "Mid-season signings shining for Everton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Everton endured a poor start to the 2024-25 WSL campaign, picking up just nine points (two wins, three draws) and scoring six goals in their opening 10 matches.\nHowever, since the New Year, they've won two and drawn one of their five matches and found the back of the net eight times.\nFollowing Sunday's 2-0 away win over Aston Villa, they've climbed up to eighth in the table and are 10 points clear of bottom-placed Crystal Palace. Though far from mathematically safe, with only seven matches remaining, their relegation fears have eased considerably.\nCentral to their upturn in form, particularly in front of goal, has been the impact of their January signings.\nEverton were the busiest side during the transfer window, signing Hayley Ladd from Manchester United, Kelly Gago from Nantes, and Maren Mjelde and bringing in three players (Martina Fernandez, Louna Ribadeira, and Emma Watson) on loan.\nGago has made the biggest impact, scoring three goals in five league matches since the WSL resumed in mid-January, and although she was kept off the scoresheet by Aston Villa, she remained a nuisance in attack, linking up well with forward Toni Payne on a number of occasions and bullying Aston Villa's defenders with her pace.\nLate in the second half, she breezed past Anna Patten and found the side-netting with a shot from an acute angle and had she been more selfish in the final third throughout the game, she would likely have added another goal to her tally.\nHighly experienced defender Mjelde, previously of Chelsea, poached the opening goal against Villa, reacting fastest to a bouncing ball in the box before dispatching a cool volley over goalkeeper Sabrina D'Angelo, while Ladd and Fernandez were in the starting XI for the fifth successive match since their respective arrivals.\nIt's early days but you suspect Everton will be satisfied with how their winter recruits have settled in.", "url": "https://www.bbc.co.uk/sport/football/articles/cvgdvd43qy1o"}