{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-05-20 14:39:23", "date_modify": "2025-05-20 14:39:23", "date_publish": "2023-07-28 17:17:46", "description": "Northamptonshire bat out the final day at Old Trafford to draw their Division One match with Lancashire.", "filename": "sport_cricket_66335943_1747751963.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8E87/production/_130578463_gettyimages-1558366583-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66335943_1747751963.html", "title": "County Championship: Northants bat out final day to draw with Lancashire", "title_page": "County Championship: Northants bat out final day to draw with Lancashire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Division One's bottom side Northamptonshire batted for 100 overs to secure a deserved final day draw with Lancashire.\nEmilio Gay top scored with 61 to add to his first-innings 144 as he laid the platform for his side's rearguard action.\nLancashire, who earlier added 46 in three overs to declare on 544-7, sent down more than 70 overs of spin as they drew a seventh game of the season.\nThe result sees them drop to seventh, while Northants are 25 points adrift of safety.\nLancashire started the day on 498-7 and George Balderson and Tom Hartley did not hang about before captain Keaton Jennings called them in.\nWhen Tom Bailey removed Ricardo Vasconcelos (2) for his 350th first-class wicket and left-arm spinner Jack Morley had Justin Broad (16) caught at slip, Northants were in trouble at 31-2.\nBut Gay found a determined partner in Sam Whiteman. Gay reached his half-century off 126 balls as he and Whiteman batted for 38.4 overs to put on 96.\nHowever, both batters fell to left-armer Hartley in quick succession to leave the game in the balance at 134-4.\nSaif Zaib was lbw to Luke Wells' leg-spin shortly after tea to make it 162-5 and still 40 runs behind Lancashire, but James Sales joined captain Luke Procter in dogged resistance.\nProcter, who was hit on the helmet by a ball that spat out of the rough, survived 125 balls for his 27, with Sales hitting 35 from 92 balls as they navigated 25.3 overs until both teams shook hands 30 minutes before the scheduled close.\nIf anything, the winner was the Old Trafford pitch. The same one used for the Ashes Test last week, it produced 2,222 runs across 594.1 overs across eight days.\nAlthough it now means that all three of Lancashire's Championship matches staged in Manchester this summer have ended in draws.", "url": "https://www.bbc.com/sport/cricket/66335943"}