{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-20 13:15:50", "date_modify": "2025-05-20 13:15:50", "date_publish": "2023-08-02 15:07:45", "description": "Michael Conlan says he is \"ready to go again\" and achieve his world title ambitions after considering retirement in the wake of his IBF featherweight title bout loss to Luis Alberto Lopez.", "filename": "sport_boxing_66386647_1747746950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/142D1/production/_130614628_gettyimages-1258238660.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66386647_1747746950.html", "title": "Michael Conlan: Belfast fighter still eyeing world title after considering retirement", "title_page": "Michael Conlan: Belfast fighter still eyeing world title after considering retirement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Conlan says he is \"ready to go again\" and achieve his world title dream, but admits he considered retiring after his IBF featherweight title bout loss to Luis Alberto Lopez.\nThe Belfast fighter suffered a fifth-round stoppage defeat in May when Lopez landed a venomous uppercut.\nConlan, 31, admits he doubted himself after the bout but decided to \"roll the dice again\" and continue his career.\n\"Yeah, to be honest, I was like 'I'm done',\" he told BBC Sport NI.\n\"It's not like 'this is it for me', it was more 'I don't know if I want to do this again or have to go through this again' because that feeling of losing is one of the worst feelings in the world.\n\"That was the second time I've felt that in my professional career and it was very tough to take. I thought 'do I really want to put myself through this again?' and started to question myself, but after a while I got my focus again and felt I couldn't end it like that.\"\nConlan, who has won 18 of his 20 professional fights after a glittering amateur career, added: \"What drew me back in was I looked at my goals and my goals have always been to become world champion. That's what pulled me back.\n\"In the immediate aftermath I didn't know if I had it in me to go again, but I realised soon after that I do so that's what got me back.\"", "url": "https://www.bbc.com/sport/boxing/66386647"}