{"authors": ["Russell Fuller", "www.facebook.com"], "date_download": "2025-04-26 03:38:16", "date_modify": "2025-04-26 03:38:16", "date_publish": "2025-03-05 00:26:47", "description": "Emma Raducanu says she \"couldn't see the ball through tears\" during her recent stalking incident and that the situation could have been dealt with better.", "filename": "sport_tennis_articles_cp3yk4w4z37o_1745638696.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/63bc/live/f27d4b90-f98c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_cp3yk4w4z37o_1745638696.html", "title": "Emma Raducanu says she 'couldn't see the ball through tears' in Dubai stalking incident and says it 'could have been dealt with better'", "title_page": "Emma Raducanu says she 'couldn't see the ball through tears' in Dubai stalking incident and says it 'could have been dealt with better' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Emma Raducanu says she \"couldn't see the ball through tears\" and could \"barely breathe\" after being targeted by a stalker during a match two weeks ago.\nThe Briton hid behind the umpire's chair two games into her second-round defeat at the Dubai Championships in February.\nA man who \"exhibited fixed behaviour\" was removed from the stands and subsequently given a restraining order by Dubai police.\nSpeaking for the first time since the incident, Raducanu told a small group of reporters: \"I saw him in the first game of the match and I was like, 'I don't know how I'm going to finish'.\n\"I literally couldn't see the ball through tears. I could barely breathe.\n\"I was like, 'I need to just take a breather'.\"\nRaducanu shot to worldwide fame when she won the US Open as an 18-year-old in 2021.\nShe told BBC Sport the incident \"could have been dealt with better\" but that lessons have been learned.\n\"Since that incident I have definitely got increased attention and greater security,\" the 22-year-old said.\n\"All we can do is look at what happened and react to it in a better way, in a more positive way, rather than looking back and blaming the situation.\n\"Now it is being dealt with better, so for me that's important.\n\"I'm always now very aware and not necessarily doing things on my own any more.\n\"I'm always with someone and always being watched.\"\nRaducanu was followed to four tournaments by the same man, who approached her near the player hotel in Dubai the day before her second-round match with Karolina Muchova.\nHe gave her a letter and took her photo, which understandably unnerved Raducanu, who had been aware of his presence at tournaments in Singapore, Abu Dhabi and Doha in preceding weeks.\nAlthough she reported it to a member of her team, the information was not passed on to the WTA or the tournament until the following day, leaving security staff with just a few hours to prepare.\nAfter taking a week off, Raducanu decided to return and play at Indian Wells.\n\"They were very emotional weeks, because it had carried on for a few weeks before,\" Raducanu said.\n\"It was quite tiring. I took a week break when I got home in England and I then decided to come here.\"\nHaving decided to make the journey to Indian Wells - one of the biggest events outside of the four majors - Raducanu has been surprised by how much happier she has been feeling since arriving in California.\nRaducanu will play Moyuka Uchijima of Japan in the first round on Thursday, with the winner to face American third seed Coco Gauff in round two.\n\"Since being here in this environment, which is one of my favourite tournaments, I have felt a lot better,\" Raducanu said.\n\"The allure of Indian Wells was a big part of me coming. I wasn't sure if I was going to come and compete so soon.\n\"I just wanted to make sure I was ready but since coming here I have surprised myself with how happy I feel here.\"\nRaducanu has previously been the victim of a stalker, with another man given a five-year restraining order in 2022 after he walked 23 miles to her home.\nBritish number one Katie Boulter has also spoken about her experiences of being targeted.\nThe worst incident was at the WTA event in Nottingham, where she received threatening messages from a man.\n\"I had a guy messaging me saying that he was outside and he was going to harm me and hurt me,\" Boulter told BBC Sport.\n\"I alerted the WTA and they actually found him on site. It's a moment that you realise it's not something you want to be a part of.\n\"That's where we are very lucky to have good security and people to help us as much as possible.\"\nBoulter, who has a first-round bye, said she messaged Raducanu to offer her support.\n\"She's such a great young woman, and to see her go through something like that isn't nice,\" Boulter said.\n\"She's a strong lady and she'll get through it, but it's a very uncomfortable feeling to go through something like that and it can make you feel quite insecure.\n\"It's not something I wish upon anyone.\"", "url": "https://www.bbc.co.uk/sport/tennis/articles/cp3yk4w4z37o"}