{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:47:58", "date_modify": "2025-05-20 12:47:58", "date_publish": "2023-08-03 07:05:09", "description": "Wolves: Solving midfield conundrum after Ruben Neves departure", "filename": "sport_articles_ckdn9wv0dg0o_1747745278.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d22a/live/a4111990-31c0-11ee-b56e-695d3e380bda.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ckdn9wv0dg0o_1747745278.html", "title": "Wolves: Solving midfield conundrum after Ruben Neves departure", "title_page": "Wolves: Solving midfield conundrum after Ruben Neves departure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Cartwright, BBC Sport at Molineux\nWolves' midfield will look very different this season following the departures of Portuguese duo Ruben Neves and Joao Moutinho, who for so long were mainstays in the centre of the pitch.\nAgainst Luton Town on Wednesday, Joao Gomes and Boubacar Traore got the nod in the heart of a four-man midfield.\nCombative and extremely tidy on the ball, Gomes showed enough following his January move from Flamengo that he can become a high-quality Premier League player.\nTraore is only 21, a year younger than the Brazilian, and possesses the attributes to be a success. But there is a rawness to his game, as demonstrated by the number of fouls he gave away against the Hatters. With experience, though, he too could flourish in the English top flight.\nMario Lemina's impact after his mid-season arrival at Molineux was massive and he will most likely be one of the starters in midfield if fit. Joe Hodge has been given plenty of minutes in pre-season after breaking into the first team last term and will also come into Julen Lopetegui's thinking.\nOne other name to mention is Matheus Nunes, who was drawing praise from all quarters for his performances in a more central role for Sporting Lisbon, yet was so rarely utilised there in his first season at Wolves. Will he get that chance this season, or will Lopetegui use him more often as a wide player?\nLopetegui is not short of options in the centre of midfield. The challenge for him is finding the right combination to help Wolves win matches.", "url": "https://www.bbc.com/sport/articles/ckdn9wv0dg0o"}