{"authors": ["Mark Mitchener", "www.facebook.com"], "date_download": "2025-05-21 08:39:03", "date_modify": "2025-05-21 08:39:03", "date_publish": "2025-03-26 12:28:54", "description": "Bournemouth news: Opinion - Time for Iraola's side to write history?", "filename": "sport_football_articles_c62kpg26wnvo_1747816743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f341/live/53a1e480-4835-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62kpg26wnvo_1747816743.html", "title": "Time for Iraola's side to write history?", "title_page": "Bournemouth news: Opinion - Time for Iraola's side to write history? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the international break draws towards its close, attention turns towards this weekend's FA Cup quarter-finals, with Bournemouth preparing for Sunday's tie with Manchester City.\nIt is only the third time the Cherries have reached the last eight – but the first time that several generations of fans can watch their heroes in the quarter-finals, as the 2021 defeat by Southampton was during the \"Covid season\" of 2020-21 when only a handful of journalists and officials attended.\nElderly supporters, however, still talk in glowing terms of the FA Cup run of 1956-57 which, for many decades, remained the club's high-water mark in football.\nBournemouth and Boscombe Athletic (as they were then), of the Third Division (South), began their Cup campaign by beating Burton Albion 8-0, Swindon Town 1-0 and Accrington Stanley 2-0.\nManager Freddie Cox then led the Cherries to a 1-0 giant-kill at the mighty Wolverhampton Wanderers, skippered by England captain Billy Wright, before another leading First Division side in Tottenham Hotspur were beaten 3-1 at Dean Court in round five.\nThat set up a home quarter-final against a third top-flight giant, the \"Busby Babes\" of Manchester United, whose manager Matt Busby had once turned out for Bournemouth as a guest player during World War II.\nFor those who remember the old Dean Court, it seems scarcely believable that a record 28,799 fans crammed into the ground that day. Even the local Boscombe Silver Band's numbers had suspiciously swelled, performing before kick-off at each cup tie.\nThen FA Cup regulations said that in the event of a colour clash, both teams must change - so Bournemouth wore all-white and United blue, but the fairytale run ended that day.\nWith no substitutes, an early collision between United defender Mark Jones and Cherries inside-right Ollie Norris left both players as passengers for the rest of the game.\n\"Gallant little Bournemouth,\" as the surviving Pathe newsreel footage , externalcalls them, took a shock first-half lead when Nelson Stiffle's corner was nodded in by Brian Bedford.\nBut United. with England star Duncan Edwards pulling the strings, hit back when the ball was played through to Johnny Berry and with Bournemouth appealing for offside, he slid the ball past keeper Tommy Godwin to equalise.\nReferee Frank Coultas waved away the Cherries protests, and later adjudged that Joe Brown had handled Dennis Viollet's shot, with the Bournemouth left-half claiming the ball had struck his shoulder.\n\"We wore all-white that day and the ball's impact could clearly be seen on Joe's chest,\" Bedford recalled. \"It was never a penalty and one or two of their players said as much afterwards.\"\nBerry hammered home the resulting spot-kick, and the dream was over for Cox's \"Pippins\", though they were awarded the Sunday Pictorial newspaper's \"Giant-Killers' Cup\".\nUnited made it all the way to the final, losing 2-1 to Aston Villa, and Busby later wrote in his book My Story that of all their Cup ties that season, \"our finest hour was seen on the Dean Court ground at Bournemouth\".\nEleven months later, six of the United XI who faced the Cherries - Edwards, Jones, Roger Byrne, Eddie Colman, Billy Whelan and David Pegg - were among those who lost their lives in the Munich air disaster, while Berry was so badly injured he never played again.\nTime for Andoni Iraola's side to write a new chapter in Bournemouth's history?", "url": "https://www.bbc.com/sport/football/articles/c62kpg26wnvo"}