{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:36", "date_modify": "2025-05-21 04:20:36", "date_publish": "2025-04-05 14:08:34", "description": "Man Utd news: Opinion - Can United capitalise on Man City's weaknesses?", "filename": "sport_football_articles_cr4nl14pgwpo_1747801236.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4nl14pgwpo_1747801236.html", "title": "Man Utd news: Opinion", "title_page": "Man Utd news: Opinion - Can United capitalise on Man City's weaknesses? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United possessed the ball well against Nottingham Forest but without any real purpose.\nForest are always tough to play against because they don't leave that much space behind but United just didn't look that exciting. They struggled to break down Forest's strong defence and Joshua Zirkzee being their outlet as a nine didn't help because he wasn't really occupying the box.\nBut derbies are different and they can go either way on the day.\nIt is easier to get up for a derby than probably any other game - other than a cup final. They are special and you are playing for pride and bragging rights so it motivates players a lot more.\nEven if you are having a bad season, it is the one game you can really get yourself up for.\nWhen I played for Everton and Liverpool, I had that feeling and in the week leading up to the match, it would be all you speak about. It is often the first fixture you look for.\nI expect the game against Manchester City to be completely different to what we saw against Forest.\nNeither team really come into this game in great form, or at their best in terms of consistency, and I think City will leave more gaps behind, rather than how Forest played on the transition and sat deeper.\nRuben Amorim's backline will have to defend brilliantly and perhaps also play in transition if they are to do the double over City this season. Rasmus Hojlund needs to start over Zirkzee if they are to play in the transition because it is not something that the Dutch forward is strong at.\nUnited struggle centrally in terms of personnel - defensively they can look disorganised and not having a focal point striker means they are finding it hard to put chances away.\nBruno Fernandes is trying to drag the team and you can see his frustration.\nBut anything can happen in a Manchester derby.", "url": "https://www.bbc.com/sport/football/articles/cr4nl14pgwpo"}