{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:37:33", "date_modify": "2025-05-21 04:37:33", "date_publish": "2025-01-23 15:46:05", "description": "Celtic 'learned lesson' to secure 'massive achievement' - Schmeichel", "filename": "sport_articles_cwyp6y8y8lvo_1747802253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5aa4/live/6b250370-d99f-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwyp6y8y8lvo_1747802253.html", "title": "Celtic 'learned lesson' to secure 'massive achievement' - Schmeichel", "title_page": "Celtic 'learned lesson' to secure 'massive achievement' - Schmeichel - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kasper Schmeichel believes the lessons learned from Celtic's hammering in Dortmund provided the springboard for their surge to the Champions League play-off round.\nBrendan Rodgers' side rebounded from that 7-1 drubbing by going five games unbeaten, culminating in Wednesday night's 1-0 win over Young Boys which sent the Scottish champions through with a game to spare.\nGoalkeeper Schmeichel, who made a crucial double save in the second half against the Swiss, said: \"I think we learned our lesson in Dortmund.\n\"We've bounced back and recovered really well from that and that's what you need to do. Sometimes, it's not about success, that's not when you really learn.\n\"You learn when you have a tough time and I think we've come out from that really well. We went to Atalanta, one of the highest scoring teams in Europe, and kept them from scoring, which I think is an impressive thing. We've kept learning.\n\"I think that's the mark of the squad. We're never getting carried away. We stay humble and we keep learning.\"\nSchmeichel, who signed a new contract on Wednesday to summer 2026, hailed Celtic's \"massive achievement\" in reaching the Champions League knockout rounds for the first time since 2013.\n\"For a club of this size, that's where we should be,\" the Dane said. \"That was the goal, that was the aim from the start of the season. It's a huge achievement.\"", "url": "https://www.bbc.com/sport/articles/cwyp6y8y8lvo"}