{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:41:41", "date_modify": "2025-05-21 05:41:41", "date_publish": "2025-04-04 00:00:00", "description": "Follow live text commentary, score updates and match stats from Romania vs Northern Ireland in the UEFA Women's Nations League", "filename": "sport_football_live_cgjlvxy9zdjt_1747806101.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a43/live/0a5ffe20-117e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgjlvxy9zdjt_1747806101.html", "title": "Romania 1-1 Northern Ireland: Hosts hold NI to draw in Nations League", "title_page": "Romania 1-1 Northern Ireland: Hosts hold NI to draw in Nations League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland's mixed start to the Nations League continued as they were held to a 1-1 draw by Romania in Bucharest.\nDanielle Maxwell opened the scoring with a superb strike in the 33rd minute but Romania equalised when Mihaela Ciolacu capitalised on a defensive error.\nRomania, who had lost their five previous matches, almost won the game in stoppage time when Olga Iordachiusi cut the ball back to goalscorer Ciolacu, but her effort cannoned back off the crossbar and Northern Ireland survived.\nAfter losing to Poland and securing a late win over Bosnia-Herzegovina, Northern Ireland sit second in Group B1 after three matches.\nUnbeaten Poland defeated the Bosnians 5-1 in Gdansk to strengthen their grasp on the automatic promotion spot in the group.\nNorthern Ireland had early chances in Romania as captain Simone Magill fired over the top after a teasing cross by Maxwell.\nDefender Rebecca Holloway should have opened the scoring but fired over after a corner fell to her in the six-yard box, and Ellie Mason headed wide from Lauren Wade's delivery.\nRomania, ranked five places below NI in 49th, had a penalty appeal waved away after Sefania Vatafu fell in the area under a challenge from Rachel Dugdale, though replays showed there was minimal contact, if any, from the Blackburn Rovers defender.\nThe highlight of the game came courtesy of Maxwell, who fired home a superb opener.\nBrenna McPartlan showed good awareness to cut a ball out of the Romanian defence, and she found Megan Bell in space.\nBell raced forward and spotted Maxwell in space, and the Burnley winger took one touch and arrowed the ball into the far corner.\nWhile Maxwell's goal was a moment of magic, five minutes later the Northern Ireland defence had a moment to forget.\nA long ball was fired forward by Maria Ficzay which evaded both Mason and Dugdale, who had both left the clearance to each other.\nThat allowed Ciolacu all the time and space required to poke the ball past Jackie Burns to level the game.\nOxtoby's side had conceded two goals in quick succession in both their previous Nations League matches, and it nearly happened for the third game in a row when Burns passed the ball straight to Cristina Carp, who could only send her effort wide from 20 yards when she had the whole goal to aim at.\nNorthern Ireland looked to kick on after the restart but struggled to break down the home defence, which had shipped five goals in their opening two matches.\nMcPartlan curled straight into the arms of Andreea Paraluta, but there was a scare at the other end as McPartlan had to hook the ball off the line as Ana Maria Stanciu headed towards goal from a short corner.\nJoely Andrews was unfortunate not to get a shot away after rounding Paraluta from Maxwell's clever backheel, and the Romanian goalkeeper was involved again as Scofield played through Magill, but pulled off a good save.\nThe ball fell back to Scofield from the rebound but she could only fire the ball into the stranded body of Ficzay and the chance faded away.\nSheffield United midfielder Scofield then curled an effort into the arms of Paraluta from the edge of the area, and Mason had to be alert at the other end to throw herself in front of Vatafu's goalbound effort.\nRomania could have snatched all three points in stoppage time when Ciolacu struck the crossbar from inside the area, but NI survived to take a point back to Belfast.\nThe sides meet again at Windsor Park on Tuesday (19:00 BST) in another game that will be shown on the BBC iPlayer and BBC Sport website.", "url": "https://www.bbc.com/sport/football/live/cgjlvxy9zdjt"}