{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-04-26 07:04:57", "date_modify": "2025-04-26 07:04:57", "date_publish": "2025-02-28 06:32:49", "description": "English cricket has endured a miserable start to 2025 and the winter cannot end quickly enough, says Stephan Shemilt.", "filename": "sport_cricket_articles_cvgwwve9j38o_1745651097.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c2b1/live/10fa8e40-f51c-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cvgwwve9j38o_1745651097.html", "title": "Champions Trophy: 'England's winter cannot end quickly enough'", "title_page": "Champions Trophy: 'England's winter cannot end quickly enough'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "And so English cricket limps to its final stop of the winter.\nKarachi, where England will exit the Champions Trophy after Saturday's game against South Africa, is known as the City of Lights. Their last visit, the completion of a 3-0 Test series win in Pakistan in 2022, was Bazball's brightest moment. Now Brendon McCullum and his men cannot shake the dark clouds.\nAdele could write an album about how miserable England's 2025 has been so far.\nThe end of 2024 wasn't much better. The women dropped themselves out of the T20 World Cup and the men were spun out in Pakistan. Heather Knight's side at least won in South Africa and Ben Stokes' men claimed an impressive win in New Zealand, then soured it with a stag-do of a performance in the final Test in Hamilton.\nSince the turn of the year it has been a shambles: the women thrashed all over Australia, the men one win from 10 in McCullum's new white-ball era. Andrew Flintoff's Lions were hammered in South Africa and Australia, and the Under-19 women were well beaten in a World Cup semi-final by India. Thank goodness Archie Vaughan's Under-19 men won their Test series against South Africa.\nIt's probably good to get a few things straight before delving into this: all of us - fans, media and pundits - want England to do well. We care. It hurts when they lose.\nIt is also fair to say I have never met an England player that is not desperate to succeed. They may occasionally forget the England team exists for everyone, not just the individuals in the dressing room, but there is an understandable element of self-preservation at play. Dreams and careers are on the line. Professional sport is cut-throat.\nWe must also be careful to not rewrite history. McCullum was a breath of fresh air to English cricket, both in terms of results and the feeling towards the men's national team. It seemed a no-brainer to put him in charge of the white-ball side, largely because any other coach would have existed in the New Zealander's shadow.\nJon Lewis did similar with the women's team, even if Bazball-lite seemed too simplistic. The draw with Australia in the home Ashes of 2023 was creditable, and probably should have been better given Australia had lost Meg Lanning.\nAs 2024 wore into 2025 and results became indifferent for both teams, nagging doubts became worries and have now grown into genuine concerns.\nWill Ben Stokes be fully fit again? What has happened to Issy Wong? Why was Josh Hull picked? How did Flintoff go from TV presenter to some of the most high-profile coaching gigs in the country? Why did Dan Lawrence open the batting? Why did Kate Cross captain England in Ireland when it was a golden development opportunity for a youngster? Who signed off on one frontline spinner for a Champions Trophy in Pakistan? What is going on with Shoaib Bashir's bowling? Why do England women drop so many catches? We could go on and on.\nThere are recurring themes across the England national teams. The women have been accused of not being fit enough, the men of not training enough. Both charges are probably unfair, yet the players don't help their public image.\nWe're bored with hearing the men talk about golf and the women were downright daft to be pictured on a boat party during the T20 World Cup in Dubai. These England teams are not lazy, though they can be slapdash.\nThe rhetoric is maddening, too. Many legendary leaders have successfully paired public praise with private criticism, and listening to McCullum in particular can inspire even a jobbing journalist to take on the world. But some of the utterances of the men wind up fans and opposition, while the women were borderline delusional in Australia. Lewis' Bondi to Coogee walk will live in infamy, and the likes of Ben Duckett and Harry Brook are never far from a crass soundbite.\nNone of this matters if England teams are winning. They aren't, which means Rob Key and Clare Connor - directors of cricket of the men's and women's team respectively - have thinking to do.\nIt seems a decent bet that Connor will be looking for a new women's head coach. A review into the Ashes is still taking place and could run until the end of next month. It may be that Knight stays on as captain, partly because she remains an excellent leader and partly because England's succession planning has been awful. Whoever is in charge must get the best out of Sophie Ecclestone on and off the pitch, while a bigger question is whether England have the right structural set-up to consistently compete with the Australians.\nKey's decisions on personnel are probably more straightforward. Jos Buttler sounded like a man ready to make up his own mind on the white-ball captaincy, with Brook most likely to take over. Where it gets trickier for Key, McCullum and the new skipper is reviving the fortunes of the white-ball team in a defining year for the Test side.\nOn one hand, it is harsh to compare the current white-ball team to the class of 2019, England's greatest team led by their greatest captain Eoin Morgan.\nOn the other hand, it is undeniable that a white-ball empire has crumbled on Key's watch. It is not his fault domestic 50-over cricket has been marginalised, but the treatment of David Willey, dropping of Sam Curran and Reece Topley, overlooking of Liam Dawson, obsession with pace over skill, lack of death bowlers and left-handed batters all fall at his door. How did England take the field in the Champions Trophy with as many wicketkeepers as frontline bowlers?\nWhereas there was once separation between the Test and white-ball set-ups, greater alignment runs the risk of a malaise from one format bleeding into the other. There is at least a decent break before the one-off Test against Zimbabwe at Trent Bridge in May.\nUntil then, questions abound. Have England broken Mark Wood in a tournament he probably shouldn't have been playing in? What state is Stokes' hamstring in? Can Bashir become the spinner England need in Australia? Can Zak Crawley reach double figures? Is Test vice-captain Ollie Pope going to be dropped to make way for Jacob Bethell?\nNone of this gloom needs to be terminal. The women's game is about to get a huge boost from the new domestic structure and the men have every chance of winning their five-Test series against India. There is a wealth of young male and female talent coming through and the Ashes next winter has all the ingredients to be a classic.\nFor now, this winter cannot end quickly enough. Last rites and alarm bells will not be drowned out by good vibes.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cvgwwve9j38o"}