{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-20 11:55:39", "date_modify": "2025-05-20 11:55:39", "date_publish": "2023-08-05 16:21:47", "description": "Scotland mount a stunning fightback from 18 points down to beat France with 14 men in a World Cup warm-up at Murrayfield.", "filename": "sport_rugby-union_66417777_1747742139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ED4/production/_130667242_20811518.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66417777_1747742139.html", "title": "Scotland 25-21 France: Zander Fagerson red card shrugged off by hosts", "title_page": "Scotland 25-21 France: Zander Fagerson red card shrugged off by hosts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland mounted a stunning fightback from 18 points down to beat France despite Zander Fagerson's red card.\nFrance crossed at Murrayfield through Baptiste Couilloud, Louis Bielle-Biarrey and Cameron Woki to race into a 21-3 lead at the break.\nThe Scots roared back with tries from Darcy Graham and Pierre Schoeman - either side of Fagerson's dismissal - and substitute Dave Cherry.\nCaptain Finn Russell kicked 10 points as the hosts held on for a superb win.\nThe sides meet again in St Etienne next Saturday in the third of Scotland's four World Cup warm-up matches.\nAfter victory over Italy last weekend with a shadow side, Gregor Townsend elected to go as strong as possible for the visit of the World Cup hosts, with captain Jamie Ritchie the only notable absentee through injury.\nOn his 70th cap Russell was leading Scotland for the first time and got his side on the board with an early penalty.\nFrance were without their superstar scrum-half Antoine Dupont, but his stand-in Couilloud finished off a stunning counter-attack from deep inside French territory that sliced open the Scotland defence for the game's opening try.\nEven without a host of their star names, Les Bleus still carried threats all over the pitch. The Scots were struggling to stifle the speed of the French ball and Bielle-Biarrey came off his wing to make the extra man out wide and glide over in the corner.\nAt 14-3 it was already looking like an uphill task for the home side and on the half-hour mark came the worrying sight of Ben White limping off with an injury.\nHaving quickly become an integral part of the side this year, Townsend will be hoping White's World Cup hopes are not thrown into doubt.\nScotland were struggling to make any sort of impression in attack. The ball carriers were not making yardage and what little possession the Scots had was invariably slow. Throw in a couple of sloppy line-outs and you were left with a France defence enjoying a largely comfortable afternoon.\nThe visitors stretched their lead when Woki powered over from close range and while a warm-up is by its nature not the highest of stakes, there was a danger the Scots were heading for the psychological blow of a heavy home defeat.\nThey needed something quickly to stem the tide and to the surprise of nobody it came from their little try machine on the wing, Graham.\nRussell dinked a lovely kick over the defence into the dead-ball area and Graham did brilliantly to dive in ahead of Ethan Dumortier to get fingertips to the ball and touch down.\nScotland were making inroads for the first time and, while their momentum was checked somewhat when Fagerson was yellow carded for a dangerous clearout at a ruck, his front-row partner Schoeman used his considerable power to will himself over the line.\nThe joy around around Murrayfield was short-lived, however, as Fagerson's yellow card was upgraded to red after being reviewed by the television match official via the new 'Bunker' system.\nGiven the dearth of options at tighthead, the Scotland coaching staff will have some sleepless nights before Fagerson goes in front of the disciplinary panel.\nDespite being a man down, the Scots had wrestled the momentum from the French and looked to have taken the lead when Blair Kinghorn blasted his way past Brice Dulin to go over, but the try was ruled out for a knock-on by Graham earlier in the move.\nThe passivity of the first half was now replaced by a ferocity the French were struggling to deal with and a rolling maul powered over the line to allow Cherry to dot down and put Scotland in the lead for the first time since the opening minutes.\nRussell kicked beautifully off the tee all day and his penalty stretched Scotland's advantage to four. Sensing the match slipping away from them, the French mounted a late onslaught that Scotland repelled with everything they had until Rory Darge pounced for a brilliant turnover to seal the win.\nFrom staring a heavy defeat in the face, 22 unanswered points secured a victory that should be a huge confidence boost to the Scots going into their tough World Cup pool.\nReplicate the first-half performance at the tournament itself and the Scots will be going home early. Replicate the second and they will be a handful for any team.\nScotland: Kinghorn, Graham, Jones, Tuipulotu, Van der Merwe, Russell (captain), White; Schoeman, Ashman, Z Fagerson, Gray, Gilchrist, M Fagerson, Watson, Dempsey.\nReplacements: Cherry, Bhatti, Nel, Cummings, Darge, Horne, Redpath, Smith.", "url": "https://www.bbc.com/sport/rugby-union/66417777"}