{"authors": ["Exclusive Dan Roan", "www.facebook.com"], "date_download": "2025-05-19 15:27:38", "date_modify": "2025-05-19 15:27:38", "date_publish": "2017-07-27 17:00:41", "description": "British former Olympic bobsleigher Rebekah Wilson tells BBC Sport she self-harmed as she struggled to cope with the demands of elite sport.", "filename": "sport_winter-sports_40738768_1747668458.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14316/production/_97101728_gettyimad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_winter-sports_40738768_1747668458.html", "title": "Rebekah Wilson: Ex-GB Olympic bobsleigher says pressure led to self-harm", "title_page": "Rebekah Wilson: Ex-GB Olympic bobsleigher says pressure led to self-harm - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A British Winter Olympic athlete has told how she self-harmed as she struggled to cope with the demands of elite competition.\nRebekah Wilson, a member of Team GB's two-woman bobsleigh crew at the 2014 Sochi Winter Olympics, told BBC Sport she would secretly cut - and even try to concuss - herself as the \"intense pressure\" of training took its toll.\nSuch were the problems she faced, she quit the sport after Sochi aged just 23, and spent the next 18 months receiving treatment at a specialist mental health hospital.\nWilson says she has spoken out in order to raise awareness of the strain placed on athletes.\n\"It goes on a lot more than we allow ourselves to think,\" she said.\nThe British Bobsleigh and Skeleton Association (BBSA) said it was unable to comment about Wilson specifically because of patient confidentiality.\nBut it said it \"recognises that elite sport features both physical and mental demands\" and it provided access to specialist support in both areas.\nIn recent months, a third of UK Sport-funded governing bodies have had to confront athlete welfare issues or complaints, raising fears medal success has come at the expense of duty of care.\nSports minister Tracey Crouch told BBC Sport she would be meeting with governing bodies in a bid to tackle the issue.\nA promising junior sprinter, Wilson turned to bobsleigh as a teenager and won the World Junior Championship in 2011. She dreamed of becoming an Olympian.\nBut, having become a full-time professional, she says the demands of the GB squad's training regime in Bath, and life on the road competing, became too much.\nShe struggled with mental health issues and says athletes were \"treated as a piece of data, a statistic\" in the pursuit of medals and funding.\n\"Every move you made was analysed,\" she said. \"If you were not good enough, it was, 'you need to up it, have a look at this feedback, this analysis'.\n\"That's a difficult pressure when you're just trying to do your best. It's quite cold - not a friendly environment.\n\"You are scared almost. Scared to say, 'actually, I shouldn't be being treated like this', because your place is on the line, your whole self-worth and career is going down to tenths and hundredths of seconds.\n\"It was too much for a young girl at the age of 19 who was just trying to do the best she could do.\"\nWilson says the \"strong, muscular\" image of an athlete representing their country masked the vulnerability she was feeling.\nShe was self-harming in an attempt to relieve the pressure and deal with the lack of support, but hiding it from her team-mates and coaches.\n\"Because I knew I had a race at the end of the week, and I'd be putting on my British kit, I had to hold it together,\" she said.\n\"I would try and find anything I could to hurt myself. I would cut the top of my arms and my legs - anywhere where I could put a bit of tape and nobody would really notice.\n\"And I was banging my head against a wall trying to knock myself out, just to stop that pressure.\"\nWilson rejects the notion her actions were a cry for help, because the wounds were not obvious and she was not telling anyone about them.\nAsked to what extent the sport itself brought on her mental health issues, she said: \"I would say that I'm probably a little bit predisposed to finding things difficult.\n\"The extent of what I was doing… that was certainly the environment and the sport.\n\"It was because I felt like there was no other outlet. It was intense. You didn't feel like you were being listened to as an athlete.\"\nWilson took a year out in a bid to get herself well again, keeping her issues a secret from her coaches and telling them she would come back fitter and stronger.\nShe does not blame them or consider it their fault - either then or now - and says her coach was very supportive.\nWilson rejoined the Olympic squad a year later, gaining selection for Sochi, where she and partner Paula Walker finished 12th, missing their top-eight performance target set by UK Sport.\nStill suffering with her mental health, she decided she needed to walk away from the sport for good and seek specialist help.\nWilson spent 18 months going in and out of The Priory - a renowned mental health hospital - in what she called an attempt to \"build myself back up\".\nShe says it came to be recognised that the pressure of sport is what had made her so unwell.\n\"I'd attributed every ounce of self-worth I had to sport and to 0.01 of a second,\" Wilson said. \"It was a psychological battle that I wasn't good enough and I didn't get a medal.\n\"Funding was put in place so I could go to see a psychologist, so there was a support in place. But you're still in that environment, with the same people around you and the same issues.\n\"You're almost just putting bandages or plasters on to something that is ongoing so I realised I needed to just remove myself because I'd had enough and I wasn't well.\n\"My team-mate Paula was retiring - she and I had really held each other together that year - so without her there could I get that small amount of enjoyment from it any more? I didn't think so.\"\nWilson is now a programme manager with the Diane Modahl Foundation in Manchester, and plays rugby for Waterloo Ladies in the Women's Premiership.\nShe can still clock 11.77 seconds for the 100m but largely plays sport for fun now - although she says she is considering trying to break into the GB rugby sevens squad for the 2020 Olympics in Tokyo.\n\"Since coming out of bobsleigh, I've gone from strength to strength,\" she said.\n\"It was difficult because a lot of people would say, 'you've got two, three, four more Olympics in you', but spending that time away and rebuilding myself, I found that I'm more than sport.\n\"It's a part of you but its not the be all and end all - it doesn't define you.\"\nWilson wants her story to serve as an example to other young athletes - to show them \"it's very real and it's OK to speak up\".\nShe suspects there have been plenty before her and since who have been lost to sport because they are unwilling to talk about a taboo subject such as mental health.\n\"When you're strong and you're fast and chuck yourself down the ice at 95mph, it's hard to come to terms with that, actually, inside you feel very weak and vulnerable and unsafe,\" she said.\n\"It's great when there's a big championships on TV, but that's the front of it and you don't necessarily see the back.\n\"I think what's been coming out recently across sports shows there is an issue and there is something with wellbeing that we're not quite getting right.\"\nCrouch told BBC Sport stories such as Wilson's are \"incredibly important for us to make sure that we prevent that from happening in the future\".\nShe added: \"We always believe sport is good for people suffering from a mental health condition, but what we have perhaps forgotten, or not dealt with, is the mental health and wellbeing of professional sports people.\"\nUK Sport has promised a \"root-and-branch review\" of culture in high-performance programmes, and appointed a new head of integrity.\nThe organisation's new chair, former Olympic rower Dame Katherine Grainger, told BBC Sport last month she had \"huge concerns about athlete welfare\" and that things \"need to improve\".", "url": "https://www.bbc.com/sport/winter-sports/40738768"}