{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:37", "date_modify": "2025-05-21 07:19:37", "date_publish": "2025-03-30 00:00:00", "description": "Manchester City bounce back from being knocked out of the Women's Champions League with a win at Brighton in the WSL.", "filename": "sport_football_live_cgkmv5dxlg8t_1747811977.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7cd5/live/1706de70-0d7b-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgkmv5dxlg8t_1747811977.html", "title": "Brighton 1-2 Man City: City bounce back from Champions League exit", "title_page": "Brighton 1-2 Man City: City bounce back from Champions League exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City bounced back from being knocked out of the Women's Champions League with a win at Brighton in the Women's Super League.\nEuropean qualification looks out of reach for City given results elsewhere, but three points keeps faint hopes of a late push into the top three alive.\nInterim manager Nick Cushing said his side are going to \"fight until the end\" to try to achieve a top-three finish.\nIt seemed as if their injury-hit team may face a shock against the Seagulls as Brighton placed their defence under constant pressure and limited City's opportunities in the final third.\nHowever, Kerstin Casparij broke the deadlock in the 37th minute when she tapped home from close range after Mary Fowler found her with an expertly timed low cross.\nThe hosts had better opportunities but Vivianne Miedema put the result beyond doubt when the substitute powered home a late second from close range.\nCharlize Rule gave Brighton hope in stoppage time when she finally got a goal for her side by firing past Khiara Keating, but it came too late to salvage a point.\nWith four matches left, City remain fourth in the table and are seven points off third-placed Manchester United with a game against the Red Devils still yet to play. Brighton are fifth but 13 points behind City.\n\"Until mathematically we're out, we believe we can catch Manchester United, we can catch Arsenal,\" Cushing told BBC Radio 5 Live.\n\"We know we have to play Manchester United, we know Manchester United have to finish with Chelsea, us and Arsenal.\n\"It's about game-by-game now and today the objective was just three points to stay within touching distance.\"\nManchester City have had significant injury struggles recently and a run of four fixtures against Chelsea was not ideal for their freshness.\nWith defender Laia Aleixandri having to be replaced by Laura Wienroither at the last minute and Miedema, Kerolin and Jill Roord all being benched, the visitors were severely weakened.\nThere were multiple sloppy moments in their build-up play which allowed Brighton to counter, but the hosts lacked the quality needed in the final third to take advantage and City's superior end product ultimately made the difference.\nBrighton's defence continually held their shape and closed down spaces to prevent City producing much of note going forwards, while Fran Kirby and Nikita Parris were an ever-present threat up top for the hosts.\nKirby picked holes in the City defence with her good vision and quality passes, while Poppy Pattinson's overlapping runs often caught out Wienroither.\nManager Dario Vidosic was disappointed with the result but thought there were \"lots of positives\" in his side's performance.\nThat it took until they had conceded a second goal for Brighton to finally find a way to hit the back of the net will be frustrating for Vidosic given their ample opportunities.\n\"We forced a team like Man City who usually dominate the possession stats, dominate everything, we forced them back and turned them into a transitional team in the second half,\" Vidosic said.\n\"[There are] positives to take away but we are disappointed to not get something at least out of this game.\"\nThe Seagulls had 23 shots to City's 12 and managed to have marginally more possession, but they only hit the target four times.\nA moment of quality from Fowler - who worked hard to put pressure on Brighton up top - fashioned the opener as she rolled the ball past her markers before delivering her seventh league assist of the campaign.", "url": "https://www.bbc.com/sport/football/live/cgkmv5dxlg8t"}