{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:35:44", "date_modify": "2025-05-20 14:35:44", "date_publish": "2023-07-28 14:59:16", "description": "An unnamed Russian player is stopped by Czech police from entering the country as she arrives to compete in the WTA Prague Open.", "filename": "sport_tennis_66341189_1747751744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15BF/production/_130576550_gettyimages-153427707.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66341189_1747751744.html", "title": "WTA Prague Open: Czech police stop Russian tennis player arriving for tournament", "title_page": "WTA Prague Open: Czech police stop Russian tennis player arriving for tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An unnamed Russian player was stopped by Czech police from entering the country as she arrived to compete in the WTA Prague Open.\nA new government resolution has banned athletes from Russia or Belarus taking part in any events in the Czech Republic.\nSeveral Russian and Belarusian players had been expected to compete in Prague as neutrals.\nBut tournament organisers have now told them not to travel.\nTournament director Miroslav Maly said: \"She was the first participant to arrive to the Czech Republic with a Russian passport.\n\"The management of the tournament fully respect the current stance of state authorities. We do not expect any player with Russian or Belarusian citizenship to take part in the tournament in this situation.\"\nThe Women's Tennis Association (WTA) said it would \"continue to review the situation as we factor important considerations around these complex geopolitical issues\".\nIt added: \"WTA rules state that all players must be allowed to compete on the WTA based solely on merit, without discrimination.\"\nLast week, Russia's Vera Zvonareva was blocked from entering Poland for the Warsaw Open \"for reasons of state security and public safety\".\nThe decisions come as a result of Russia's continuing invasion of Ukraine.", "url": "https://www.bbc.com/sport/tennis/66341189"}