{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 03:43:35", "date_modify": "2025-05-21 03:43:35", "date_publish": "2025-01-11 21:43:33", "description": "Lightweight Caroline Dubois retains her WBC world title after her contest with Jessica Camara ends in a frustrating technical draw because of a clash of heads.", "filename": "sport_boxing_articles_cn8yjlv6y52o_1747799015.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/156c/live/cec4bde0-d061-11ef-9ba9-93db711acf2e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cn8yjlv6y52o_1747799015.html", "title": "Caroline Dubois: Lightweight world-title with Jessica Camara contest ends in draw after clash of heads", "title_page": "Caroline Dubois: Lightweight world-title with Jessica Camara contest ends in draw after clash of heads - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British lightweight Caroline Dubois retained her WBC world title after her contest with Jessica Camara ended in a frustrating technical draw because of a clash of heads.\nOn her 24th birthday, Dubois dropped the challenger with a smart, straight left hand in the first round in Sheffield.\nThe Londoner sensed an early finish and continued to pile on the pressure in the second as blood flowed down from Camara's left eye after the accidental coming together of heads.\nThe referee and ringside doctor waved off the contest before the third, ruling the 36-year-old Canadian – whose right eye was also heavily swollen - was not fit to continue.\n\"The blood wasn't coming in her face, she didn't want it,\" said Dubois, who won her first 10 pro fights.\n\"It was either getting stopped by a doctor or I'm stopping it. I wish her well and hope she has a safe flight home.\"\nDubois was upgraded from interim to full world champion after Katie Taylor vacated her belt. She has called for a unification fight with Doncaster's WBO champion Terri Harper next.\nBarnsley's Callum Simpson defended his British and Commonwealth super-middleweight title with a second-round stoppage of Steed Woodall in the main event.\nThe 29-year-old Simpson sent Woodall to the canvas with a barrage of shots, before the referee intervened after another attack moments later, despite the protests of Woodall, 30.\nIt was not the outcome Dubois wanted, but an otherwise impressive four minutes of boxing from the champion.\nHer entrance to a dance remix of Whitney Houston's 'I'm every woman' hyped up the sold-out 3,000 crowd, made up almost entirely of fans supporting Yorkshireman Simpson.\nDubois came out with real intent. She landed a crisp body shot early in round one, before flooring Camara with the southpaw left.\nFormer cruiserweight world champion Chris Billam-Smith cheered his stablemate on from ringside as Dubois landed hurtful, menacing power punches.\nCamara was on a four-fight winning streak, but the Montreal fighter was clearly out of her depth as she sighed on return to the corner.\nDubois continued to bulldoze her way through in the second, grunting with each punch thrown.\nShe looked set for a sixth stoppage win before the disappointing finish brought a premature end to proceedings. If the contest had gone past the fourth round, it would have been decided by the judges' scorecards.\n\"The cut was on the side and it [blood] wasn't dropping in the eye. I was surprised we didn't go past four rounds,\" added Dubois' trainer Shane McGuigan.", "url": "https://www.bbc.com/sport/boxing/articles/cn8yjlv6y52o"}