{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-04-26 03:53:06", "date_modify": "2025-04-26 03:53:06", "date_publish": "2025-03-03 09:20:10", "description": "The introduction of the World Handicapping System proved controversial but England Golf believes the system is working, writes Iain Carter.", "filename": "sport_golf_articles_cm2dyldznrdo_1745639586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c07/live/a9031ac0-f7bc-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cm2dyldznrdo_1745639586.html", "title": "World Handicapping System: An 'easy to abuse' system or helping to increase golf's popularity?", "title_page": "World Handicapping System: An 'easy to abuse' system or helping to increase golf's popularity? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Eavesdrop many a conversation in a golf clubhouse and one could be forgiven for believing that the recreational game is being ruined.\nAt the heart of the complaints is the handicapping system, the mechanism by which varying standards of players compete against each other on level terms.\nBy rating players' abilities, golf has always prided itself on providing a way for the humblest hacker to play against the most proficient of players; with both enjoying a decent contest.\nA little over four years ago a new global scheme, the World Handicapping System (WHS), was introduced. It has proved controversial and, anecdotally, the perception is that it has been a retrograde step.\nWhile the aim was to create an accurate reflection of a golfer's ability to take on any course in the world, many players believe the system is easy to abuse for those wanting to fuel their egos with a low handicap or for those desiring a higher one to be more competitive.\nBut is that a true reflection of how it is or a myth? Certainly, there is a different view among those who administer the WHS, compared with those grumbling over a post round pint.\nIt is an issue that affects millions of golfers across the world and England Golf, the UK's biggest federation, believes the system is working. Furthermore, this is being reflected by the recreational game's increasing popularity.\n\"The reality was, certainly up to the launch of WHS (in November 2020), that there was a decrease every year over a 10-year period with regards to people wanting to play - the numbers of people that played in competitions and then consequently, the number of people that were actually having handicaps,\" Jeremy Tomlinson, England Golf's chief executive told BBC Sport.\nUnder the old CONGU system that prevailed in Great Britain and Ireland, handicaps were effectively determined by performances predominantly in club competitions.\nNow it is easier for regular social golf to count. This includes shorter rounds over nine holes, performances in head-to-head matchplay and while playing with a partner.\nGolfers are able to submit 'general play' scores from rounds with their friends, provided they have specified before teeing off that they want their game to count for handicap purposes.\nThis means more rounds count towards determining a players ability. The best eight scores from your 20 most recent rounds are averaged to provide what is known as a handicap index.\nThis figure is then transportable to any golf course and is used to calculate how many shots you can deduct from your total score. The harder the course, the more shots you receive to reflect the level of difficulty.\nBut the system works on a level of trust. Some players want the lowest possible handicap to help make them eligible for elite amateur events while others desire a few extra shots to help them win swanky competition prizes.\nHandicaps can now be as high as 54 (previously 36) and the average in England is 19. \"The game's gone soft,\" is a regular moan among diehard members.\n\"I think we have a swathe of feeling that there are more people with an opportunity to do well in competitions than before,\" Tomlinson said.\n\"That's probably because the old system lent, we believe, a lot more to towards the lower handicapper.\n\"But of course, there are just more people who have come in.\n\"And more people are doing scores now because more people want a handicap, and then because of that, more people progress on the golfer journey and want to compete.\"\nThere are 722,000 golfers affiliated to England Golf through clubs and the number is continuing to rise. Since November 2020, 38m handicap scores have been submitted to the federation's central database, with 10m in the last year alone.\nPlayers do not have to be a member of a club to gain a handicap, and the Woodhall Spa based organisation offers it's iGolf app as a means for an ever growing number of more nomadic golfers.\n\"We've seen an increase in the number of competition scores, general play scores, 18 holes scores and nine hole scores, which is great and long may it continue,\" England Golf chief operating officer Richard Flint told BBC Sport.\nNevertheless grumbles abound and clubs are being encouraged to take action to maintain the integrity of their competitions. \"Griping is a big word, but I think that those complaining are frustrated that it is different,\" Tomlinson said.\n\"Golf has become a lot more inclusive in providing the opportunity for different people to win, and especially when their handicap is on the way down, while they're getting into golf and getting better and better.\"\nTomlinson added: \"The handicapping system is about integrity. It is more transparent than it's ever been because it is about the scores that you do. But there is a need for check and challenge.\"\nSitting next to the England Golf boss, Flint nodded agreement. He said: \"There is sometimes this thought that, oh, let's just ban the higher handicappers from competitions because they're always winning it.\n\"It's a myth. Clubs can use the terms of competition and have categories, so everyone can play the competition from an inclusivity point of view. Have a prize for the low handicaps as well as mid and high handicapper.\"\nSeveral county unions are now insisting that more scores from competitions, rather than general play, are used to calculate low handicaps when determining eligibility for elite tournaments and representative teams.\n\"We reserve the right to be able to review any handicap that has more than four general play scorecards,\" Tomlinson insisted. \"We have denied players entrance to some of our championships because they've had too many general play cards.\"\nTomlinson insists the authorities, including the R&A and United States Golf Association who brought in WHS, are keen to further the probity of the mechanism.\n\"The R&A are just about to bring out a specification within the system which will identify where they think manipulation's happening,\" he said.\n\"It's another tool that the club handicap committee can use to address that issue. It's not 100%, but it's something that will help.\n\"Ultimately, any system - if people want to manipulate it, they will. It's not the system that's at fault, it's the individuals.\"\nTomlinson believes he is presiding over a growing recreational sport that profited from the bounce golf received by being the first sport people could play after the 2020 Covid pandemic lockdown.\nAs the nation shut down, hundreds of clubs in the UK feared for their future. Tomlinson sat in emergency meetings across all British sports. \"We were inundated with clubs saying we're going to rack and ruin,\" he recalled.\n\"Amazing. From that point onwards, people were starting to think about their health. Golf clubs became inundated with people writing to them wanting membership, wanting to have playing rights.\n\"And I promise you that the back four weeks of that initial lockdown, I went to those meetings and I hardly said a word because I was watching in my sport compared to sports like swimming, athletics, even cricket that were suffering immeasurably because they weren't able to open up their facilities.\n\"We were building something, and by 13 May when we came out of that lockdown, we'd almost got to zero with regard to our concerns up and down the country because almost every golf club was reporting in that they were filling up.\n\"And of course, by the end of that year, they were pretty much full with waiting lists. That's what happened to golf from from the pandemic.\"\nTomlinson believes his sport, at a recreational level, has been left far healthier as a result. More people are playing at every level, whether on traditional courses or at driving ranges, in simulators or at crazy golf courses.\nHe wants to exploit this enthusiasm to grow the sport by creating pathways from these fringe versions to actual courses, club memberships and handicap competitions.\nDespite anecdotal grumblings, the figures stack up to suggest such movement is occurring. \"And that's brilliant,\" he said.\n\"And to those crusty old golfers; we still love them. We still want to take care of them, but we need them to be a bit more progressive in their thinking.\"", "url": "https://www.bbc.co.uk/sport/golf/articles/cm2dyldznrdo"}