{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:09:05", "date_modify": "2025-05-20 14:09:05", "date_publish": "2023-07-30 10:05:11", "description": "Clive Rowlands: Irrepressible scrum-half who captained and coached Wales, and managed his country and the Lions.", "filename": "sport_rugby-union_25741816_1747750145.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DA7E/production/_108043955_gettyimages-946619.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_25741816_1747750145.html", "title": "Obituary: Clive Rowlands - rugby captain, coach and administrator", "title_page": "Obituary: Clive Rowlands - rugby captain, coach and administrator - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Clive Rowlands, one of the most influential figures in the history of Welsh rugby, has died aged 85.\nHe was the only man to have captained, coached and managed Wales.\nRowlands also held the post of president of the Welsh Rugby Union in 1989 and managed the 1989 British and Irish Lions in Australia.\nHe overcame cancer in the early 1990s and in later life raised money for cancer charities.\nGregarious, talkative and an enthusiast in everything he did, scrum-half Rowlands was captain of Wales in every one of his 14 international appearances.\nHe made his debut against England in 1963 in the time before international rugby teams had coaches and the captain dictated the tactics.\nAnd Rowlands' kicking game proved controversial when Wales took on Scotland at Murrayfield in a match which saw 111 line-outs.\nWales won 6-0 - a vindication of the kicking strategy - but the match set in train a movement which culminated in the laws of the game being changed to stop players kicking direct to touch from outside their 22-metre zone.\nWales won the Triple Crown in 1965 with Rowlands at the helm, but missed out on a Grand Slam when they were beaten 22-13 by France in Stade Colombes - Rowlands' last international. In 1965 he also won BBC Wales Sports Personality of the year.\nFollowing his retirement as a player, Rowlands took over as Wales coach in 1968, guiding them to the Five Nations title the following year thanks to a crushing 30-9 win over England in Cardiff.", "url": "https://www.bbc.com/sport/rugby-union/25741816"}