{"authors": ["Tino", "www.facebook.com"], "date_download": "2025-04-26 07:57:30", "date_modify": "2025-04-26 07:57:30", "date_publish": "2025-02-25 12:20:18", "description": "Celtic fan voice: 'What an opportunity to build on Euro adventure'", "filename": "sport_articles_cz7veev229xo_1745654250.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a52a/live/83a35c30-f371-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cz7veev229xo_1745654250.html", "title": "'What an opportunity to build on Euro adventure'", "title_page": "Celtic fan voice: 'What an opportunity to build on Euro adventure' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "While some of us are still ruing the injury-time equaliser that sealed Celtic's Champions League exit in the cruellest fashion last week, Brendan Rodgers has already turned attention to ensuring we're back at the top table again next season.\nAnd that's the way it has to be at Celtic. Standing still, as they say, is one of the quickest ways to move backward, and what Celtic can't do at this juncture is sit back and simply admire what's been achieved.\nThis season's Euro adventure, which finally saw a more mature Celtic on the big stage, must now be viewed as a platform for the club to build on.\nAnd what an opportunity to do so.\nFinancially, Celtic have never had it so good. In our manager we have someone who fully understands the club, and who has developed since his own exit first time around.\nAnd on the pitch we have some bona fide talents who have proven themselves more than capable at this level. Nicolas Kuhn, Daizen Maeda and Alistair Johnston to name but a few.\nWe know too that we'll go into next season bolstered by the additions of Jota and Kieran Tierney from the start of the campaign. Two undoubted personalities that again will make us better on the big stage.\nThis season the manager has been brave, so too have his players, and should the Celtic board follow suit in the upcoming summer transfer window then there will be lots to look forward to in 2025-26.\nWith the acquisitions of Arne Engels, Adam Idah and Jota among others – for a combined total in the region of £28m - the club have shown already their belief in Rodgers in the clearest way possible.\nIf that pattern continues - and there's no reason to think it won't - this Celtic side can only get better, both at home and abroad, under Rodgers' guidance.\nTo return to the Champions League of course requires two things to happen. Firstly, we have to reclaim the Scottish Premiership title. And with a 13-point lead and just 11 games remaining we're firmly in the driving seat to do so.\nBeyond that we'll then have a two-legged qualifier to negotiate in early August, against opponents as yet unknown.\nBut to even get to that stage - as the manager so often reminds us - we can only take it one game at a time.\nThat puts Aberdeen firmly in the crosshairs at Celtic Park tonight as the Bhoys look for the win that will put the weekend's rare domestic loss to Hibs to bed.\nShould they secure all three points then the countdown is absolutely on for a fourth consecutive title, which would pave the path for our next European adventure. One where we'll all be looking to that elusive next step forward.", "url": "https://www.bbc.co.uk/sport/articles/cz7veev229xo"}