{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:26:52", "date_modify": "2025-04-26 06:26:52", "date_publish": "2025-02-28 19:23:26", "description": "Millwall boss Alex Neil says he is relishing the challenge of facing Premier League opposition when they take on Crystal Palace in the FA Cup.", "filename": "sport_football_articles_c80y7r92285o_1745648812.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4a11/live/1441d180-f602-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c80y7r92285o_1745648812.html", "title": "Millwall: Crystal Palace FA Cup tie a 'great challenge'", "title_page": "Millwall: Crystal Palace FA Cup tie a 'great challenge' - Alex Neil - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Millwall boss Alex Neil says he is relishing the challenge of facing Premier League opposition when they take on Crystal Palace in the FA Cup.\nThe Lions travel to Selhurst Park for their fifth-round London derby tie on Saturday (12:15 GMT), looking to reach the quarter-final for the first time since 2018-19.\nNeil knows it will be a difficult game but is hoping to draw on the experience from Millwall's impressive 2-0 win at Leeds United in the previous round.\n\"I'm not comparing the two teams, but we went to Leeds when they were favourites and I thought we performed really well,\" Neil told BBC Radio London.\n\"We went with a gameplan and we carried it out really well. This game will be of a similar ilk I think.\n\"It will be a high-quality game with good players on the pitch and hopefully we can do ourselves justice.\"\nThe 43-year-old Scot has been in charge of Millwall for two months since replacing Neil Harris and has guided them to within six points of the Championship play-off spots.\nNeil says it will be a \"great challenge\" to test themselves against a high-level opponent and that his side will \"try their best\" to cause an upset, even if it is a \"big ask\".\n\"It's a great game for us, we know they're a really good side,\" Neil said.\n\"We know we're going to have to put a really strong performance in if we want to try and get a result.\n\"There's nothing better if you're trying to get a yardstick on where you are as a group and I think this will be a good test for us.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c80y7r92285o"}