{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:14", "date_modify": "2025-05-20 12:23:14", "date_publish": "2023-08-04 00:00:00", "description": "Relive Southampton's Championship victory at Sheffield Wednesday in the first match of the new EFL season.", "filename": "sport_live_football_66023084_1747743794.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66023084_1747743794.html", "title": "Championship: Relive Southampton's win at Sheffield Wednesday in season-opener", "title_page": "Championship: Relive Southampton's win at Sheffield Wednesday in season-opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight\nSheff Wed 1-2 Southampton\nThank you everyone for following along tonight.\nWherever you are, whatever you are doing, have a good one.\nFootball is back!\nGoodnight.\nPost\n#bbcefl\nTonight's game between Sheffield Wednesday and Southampton was just the beginning.\nThere are eight more matches in the Championship on Saturday - all kicking off at 15:00 BST - and you can follow live text coverage of those games right here on the BBC Sport website and app.\nNorwich City v Hull City\nPlymouth Argyle v Huddersfield\nBristol City v Preston\nMiddlesbrough v Millwall\nStoke City v Rotherham\nSwansea v Birmingham\nBlackburn Rovers v West Brom\nWatford v QPR\nPlus, we will be bringing you the latest scores and updated from League One and League Two.\nget involved\nGet Involved\nUse #bbcefl, text 81111 (UK only - standard message rates apply) or WhatsApp on 03301231826\nNik: Can we just end the 2023-24 season here please?\nImagine if they did - what would we do with our lives?!\n'You can see what Saints are about'\nFT: Sheff Wed 1-2 Southampton\nJo Tessem\nEx-Southampton midfielder on BBC Radio Solent\nThat was controlled and you can see what this Southampton side is about in how they are passing the ball.\nIt would have been criminal to leave with only one point - they were so much better.\nI do think Southampton need to be better in terms of penetrating defences and creating chances, they need to punish teams.\nIt's one thing keeping the ball, it's another to be aggressive in front of goal.\nFULL-TIME\nSheff Wed 1-2 Southampton\nWhat a start to the new Championship season.\nSouthampton open with a 2-1 win over Sheffield Wednesday.\nAdam Armstrong put Saints ahead inside 10 minutes and Che Adams added the second in the 87th minute.\nIt's the first time Southampton have won on opening day in 10 years.\nINJURY TIME\nSheff Wed 1-2 Southampton\nThis has been a much more even second half from both sides.\nBut Southampton are still the jalapeno pepper and Wednesday the regular bell pepper.\nThat's the difference. The spice.\nJust the nine minutes of injury time.\nGOAL: Sheff Wed 1-2 Southampton\nChe Adams\nA beautiful assist from James Ward-Prowse on the far side edge of the six-yard-box.\nThe Saints captain with a first-time pullback pass, fizzes through the box low into the feet of substitute Che Adams, who with his right foot pumps the ball into the corner of the net.\nCalm as you like and Southampton are back ahead late on.\n'Saints need to find a way to kill games'\nSheff Wed 1-1 Southampton\nJo Tessem\nEx-Southampton midfielder on BBC Radio Solent\nIf you're Southampton you need to find a way to kill games off this season.\nI say that Man City play like this in the Premier League but they have players who can kill the game off. You can't do that when you are conceding goals.\nA lot of teams in the Championship will only score their goals from set pieces.\n'It's time for a change'\nSheff Wed 1-1 Southampton\nJo Tessem\nEx-Southampton midfielder on BBC Radio Solent\nI think the Southampton players have gotten tired and the pace has dropped. A few players have disappeared a little bit.\nIt's always going to happen in the first game, but I think it's time to change things - not the system, just players.\nI think Che Adams might change the pattern if he comes on.\nPost\nSheff Wed 1-1 Southampton\nThe substitute Anthony Musaba flies down the right wing with the ball at his feet and looks dangerous.\nBut a strong challenge from a Saints defender, who slid in like a heat-seeking missile, intercepts, and sends the Dutchman to the turf.\nA clean hard tackle.", "url": "https://www.bbc.com/sport/live/football/66023084"}