{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:11", "date_modify": "2025-05-21 06:16:11", "date_publish": "2025-01-30 12:44:07", "description": "Michael 'Venom' Page jumps up to middleweight at UFC Saudi to face unbeaten contender Sharabutdin Magomedov on Saturday.", "filename": "sport_mixed-martial-arts_articles_cr53qgjvd3zo_1747808171.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25a9/live/e0da5cc0-dd94-11ef-8e57-3d806936ced3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_cr53qgjvd3zo_1747808171.html", "title": "UFC: Michael 'Venom' Page wants to face Leon Edwards in London", "title_page": "UFC: Michael 'Venom' Page wants to face Leon Edwards in London - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The last time Michael 'Venom' Page contested an MMA fight at middleweight it was in Mumbai almost 12 years ago.\nPage, then 26, was appearing in just his fifth bout and was competing in India for the second time in five months.\nThe Englishman made short work of his opponent, securing a first-round submission.\nPage, who has fought most of his career as a welterweight, has good memories of the trip and remembers how naive he was to the professional world of MMA.\n\"I was still new to the sport. I didn't know what was good and bad. You can tell what's organised or not, but you didn't know if that was normal or not,\" Page said.\n\"When we were warming up for the fight, me and my opponent were basically warming up in the same room, which is weird.\"\nFast forward to 1 February 2025 and Page is facing unbeaten UFC middleweight sensation Sharabutdin Magomedov in Saudi Arabia.\nThey will not be expected to warm up in the same room before making their walks to the octagon.\n\"Shara has that [aura] around him but I can see in his ability something I can exploit,\" Page said.\n\"If I put the 'MVP' effect in front of him, it might ruin all of that. There is just something I saw there that made sense to me.\"\nAt 15-0, seven years his junior and on the hunt for a title shot at 185lb, Magomedov is a daunting prospect for any middleweight, let alone a fighter stepping up in weight.\nPage, 37, has a win and a loss since joining the UFC last year. He intends to return to welterweight and has his sights set on a title run.\nBut the opportunity to fight Magomedov, who has 12 knockouts in his 15 wins, was a challenge Page couldn't turn down. And it meant Page could still enjoy his Christmas dinner.\n\"I still had a good Christmas,\" he said.\n\"If there is exciting fights to be made at middleweight, I would happily take it. But the focus is a welterweight championship belt.\n\"I'm going to try and dedicate as much as my time at welterweight to get that belt and move up in the rankings.\"\nMagomedov, 30, won his last fight in incredible fashion against Armen Petrosyan, landing a right backfist before spinning round to land the same shot with his left hand.\nPage says no-one has been able to come up with the right gameplan to beat Magomedov, but feels his own \"unorthodox\" striking style will be perfect for his opponent's aggressive approach.\n\"Nobody's got it quite right yet. My time to show everyone,\" Page said.\n\"It's going to be an explosive fight and someone will walk on to something ugly.\n\"It's a great fight which is why I think so many people are excited for it because our styles looks like it'll create fireworks.\"\nMany fans expected Page to be included on the UFC London card, but the Briton said he agreed the Magomedov fight before the UFC confirmed the 22 March date.\nPage has fought several times in London when he was in Bellator and he \"100%\" wants to fight against British rival Leon Edwards in the near future.\nHe beat bitter rival Paul Daley in a huge all-British clash in 2019, but Bellator decided to do that fight in the United States.\n\"There is no way I am going to be in the UFC and not fight on a London card,\" Page said.\n\"Paul Daley, they did abroad, it was silly. It didn't need to happen the way it happened. I was annoyed at it back then, still annoyed at it now.\n\"It definitely should have happened in the UK. There's nowhere near as much malice between me and Leon, but it's equally an exciting fight to have.\n\"But it has to happen in the UK. I wouldn't let it happen anywhere else.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/cr53qgjvd3zo"}