{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-21 05:23:45", "date_modify": "2025-05-21 05:23:45", "date_publish": "2025-04-03 15:01:56", "description": "Constitution Hill falls for the second time in succession as star mare Lossiemouth lands the Aintree Hurdle", "filename": "sport_horse-racing_articles_cd6jv87jy3go_1747805025.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e897/live/63611f10-109b-11f0-acff-955625354c84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cd6jv87jy3go_1747805025.html", "title": "Aintree 2025: Lossiemouth triumphs after Constitution Hill falls again", "title_page": "Aintree 2025: Lossiemouth triumphs after Constitution Hill falls again - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Constitution Hill fell for the second time in succession as Lossiemouth landed the Aintree Hurdle to seal a Grade One four-timer for trainer Willie Mullins on the first day of the Grand National meeting.\nThe Nicky Henderson-trained favourite suffered a shock departure in the Champion Hurdle at Cheltenham last month.\nIt looked as though he was travelling well for Nico de Boinville on Thursday - turning for home this time, although he was trying to find racing room.\nBut as De Boinville switched out to launch his challenge, Constitution Hill once again got his jumping wrong and hit the turf, leaving Lossiemouth and Wodhooh at the head of the field.\nPaul Townend then seized the initiative on Lossiemouth and the pair won by two and three-quarter lengths.\n\"I was disappointed for Michael [Buckley, owner], Nicky and Nico and the connections of Constitution Hill - and for racing,\" said Mullins, whose charge had been beaten by Henderson's star at Kempton in December.\n\"We came here knowing our mare was in good shape and we thought the trip would suit us this time.\n\"When Paul made his move it has eventually paid off, but I was wondering had he done it too soon.\n\"Nico has a great habit of looking like he is under pressure and then finding another bit in the last furlong. A couple of times, we've thought we had Nico beat and he's actually got a little bit up his sleeve, so I did wonder if Paul had played his cards too early. But it was gifted to him so what could he do?\"\nHenderson was left trying to make sense of what he had seen.\n\"It is heartbreaking and to do it twice, you couldn't believe it really,\" he said.\n\"He is genuinely the best jumper you'll ever see. But in that vocabulary there is just what you would have called a 1% chance of doing what he's done, but he's done it twice, which does worry you, of course it does. But how can you iron it out?\n\"As Nico said, he'd been fantastic the whole way. At a couple of hurdles, he went in short and that's what we've been trying to get him to do. But when you're going to three out and racing like that, you can't afford to do that - you've got to go, and Nico said he just came up too soon.\n\"Nico said he was full of running and his words to me were that he actually had Lossiemouth where he wanted her. He was happy with her in front rather than behind.\"\nIt was the fourth win from the first four races on the day's card for trainer Willie Mullins with Townend taking the ride on three of the four winners.\nImpaire Et Passe (9-4), who skipped the Cheltenham Festival, started the run under Townend in the Manifesto Novices' Chase before Murcia (11-4) claimed an easy win in the Juvenile Hurdle for the pair.\nMullins' son Patrick then became the first amateur rider to win the Bowl with a well-timed ride on Gaelic Warrior (11-4) to overhaul Grey Dawning for owners Rich and Susannah Ricci, who also own Lossiemouth.\nIt was an emotional day for the Riccis as another of their horses, Willy De Houelle, earlier sustained a fatal injury when falling in the Juvenile Hurdle.\nJockey Rachael Blackmore, who escaped injury, told BBC Radio 5 Live :\"It's incredibly sad and hard when something like that happens. It's a sport and there's always going to be an element of risk to it and the vets were on hand straight away and did everything they could for him.\"\nFrank Keogh, BBC Sport\nJockey Nico de Boinville will have been downbeat after a second successive fall on board Constitution Hill.\nThe horse took off sooner than the rider wanted, and they came down again.\nIt was particularly disappointing as Constitution Hill had won all 10 of his previous races before Cheltenham in March.\nHe had been schooled intensively over jumps after the previous fall, but you cannot replicate the conditions of a race.\nNicky Henderson seemed non-plussed that it had happened again, but is prepared to take on Lossiemouth once more at Punchestown in four weeks' time.\nConstitution Hill will be on another recovery mission in a rollercoaster career – since his Champion Hurdle win in 2023, he missed one comeback because of infection, another through lameness and required hospital treatment in between for suspected colic.\nSans Bruit made it back-to-back wins in the Red Rum Handicap Chase for trainer Paul Nicholls.\nLast year, Bryony Frost was the winning jockey but this time around, it was Nicholls' stable jockey Harry Cobden in the saddle on the 5-1 chance.\nThe pair kicked for home two out and won by four-and-a-half lengths from Calico, a fourth second of the day for Dan Skelton.\n\"Winners at these big meetings do mean a lot,\" said Nicholls. \"We had a winner at Cheltenham and a winner here, the horses are running really well at the minute and we've got a lot to come yet over the next couple of days.\"\nAnd the 15-8 favourite Seo Linn, who was running for the first time since Cheltenham in November, gave top Flat jockey Billy Lee a win in the Mares' bumper.", "url": "https://www.bbc.com/sport/horse-racing/articles/cd6jv87jy3go"}