{"authors": ["Keir Murray", "www.facebook.com"], "date_download": "2025-05-19 15:37:20", "date_modify": "2025-05-19 15:37:20", "date_publish": "2017-07-08 22:09:03", "description": "Josh Taylor adds the WBC Silver belt to his Commonwealth title as he stops Ohara Davies in the seventh round of their thrilling light-welterweight contest in Glasgow.", "filename": "sport_boxing_40546477_1747669040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11978/production/_96865027_13696644.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_40546477_1747669040.html", "title": "Josh Taylor beats Ohara Davies in seventh round in Glasgow", "title_page": "Josh Taylor beats Ohara Davies in seventh round in Glasgow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh Taylor added the WBC Silver belt to his Commonwealth title as he stopped Ohara Davies in the seventh round of their thrilling light-welterweight contest at Glasgow's Braehead Arena.\nThe Scot, 26, had put the previously undefeated Londoner on the canvas with a sweet right to his chin in the third.\nBut Davies responded bravely and landed tellingly with his own shots.\nHowever, Taylor knocked Davies down twice in the seventh before referee Howard Foster stepped in to end it.\nIt means the Shane McGuigan-trained fighter takes his record to 10 wins in as many professional bouts, while for Davies, a year younger, it is his first loss in 16.\nThe pair had been trading insults on social media for weeks prior to the bout and this, no doubt, fuelled the torrent of abuse and boos that rained down on the Hackney fighter as he made his way to the ring amid funereal music, the walk-in music used by former WWE wrestler The Undertaker.\nTaylor's choice of entry music, the soul classic \"Nowhere to Run\", sent its own message. However, both boxers began the bout cagily.\nDavies' crouching stance exacerbated his height disadvantage but his long reach helped to keep Taylor at bay and the threat of an uppercut was never far away.\nThe Scot is blessed with speedy hands and feet and he had Davies in trouble in the third as he slammed into his opponent's midriff before putting him down with a right hand at the end of the round.\nDavies rose to take a standing count and resumed the contest just before the bell sounded.\nThe Essex-based fighter showed courage to recover in time to trade blows with Taylor in the fourth round but his shots were too often delivered when off balance. Taylor's punches were the cleaner.\nA low blow had the tartan-shorted Taylor wincing in the fifth before he rallied to deliver a powerful right to send Davies reeling. Yet Davies finished the round the stronger as Taylor seemed to take a breather.\nEarlier, on the undercard, Edinburgh's Jason Easton stopped Steve Jamoye of Liege at the end of the ninth round to secure the vacant IBO intercontinental super-lightweight title. It was unbeaten Easton's 10th consecutive win.\nGet all the latest boxing news sent straight to your device with notifications in the BBC Sport app. Find out more here.", "url": "https://www.bbc.com/sport/boxing/40546477"}