{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 07:54:19", "date_modify": "2025-04-26 07:54:19", "date_publish": "2025-02-25 13:25:03", "description": "Transfers, stadium, manager? BBC Sport looks into the areas Leeds will need to address if they get promoted into the Premier League.", "filename": "sport_football_articles_cewk51ezg09o_1745654059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0e5/live/5017dd50-f371-11ef-8402-45d3cf1c2dcb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cewk51ezg09o_1745654059.html", "title": "Leeds United: Premier League perils awaiting Whites as promotion edges closer", "title_page": "Leeds United: Premier League perils awaiting Whites as promotion edges closer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For the second time in two days, a set of jubilant away fans celebrated victory at the home of their rivals by belting out the chant \"we're gonna win the league\".\nLike Liverpool fans at Manchester City on Sunday, those Leeds United supporters celebrating a 3-1 comeback win at Bramall Lane over second-placed Sheffield United now believe they will be Championship title winners in May.\nThe symmetry is neat. In 2020, the season halted, delayed and then restarted in front of no supporters because of the Covid-19 pandemic, Liverpool won the Premier League and Leeds won the Championship, returning to the top flight after a 16-year absence.\nDaniel Farke's side are now five points ahead of Sheffield United, who are in the other automatic promotion place, and seven in front of third-placed Burnley. After Saturday's visit by West Brom to Elland Road, 10 out of Leeds' last 11 games will be against teams outside the top 10.\nIn all likelihood, work will be going on behind the scenes to try to make Leeds' next top-flight campaign far different to their last, which ended in relegation after three seasons.\nMaking an impact will not be easy.\nIn the past 15 years, 42% of all promoted teams have dropped back to the Championship in the first season. That rises to 50% in the past decade.\nFirstly, let's deal with the elephant in the room. Marcelo Bielsa.\nWhen Leeds were last promoted in 2020, they did so under the guidance of a man who has assumed legendary status in West Yorkshire.\nBielsa took a group of average players and turned them into a collective force.\nThey shrugged off the heartbreak of missing out on promotion in 2019 by going up the following season and then finishing ninth in the Premier League.\nThey played exhilarating, attractive football and were a joy to watch.\nBielsa's team eventually faded, shattered by the demands placed on it. Bielsa was sacked in February 2022, with the Leeds hierarchy fearing relegation.\nIt was an astute move as Bielsa's replacement, Jesse Marsch, kept them up. But the stay of execution lasted only a year and Bielsa's reputation among supporters remained high.\nFarke accepted the challenge. The former Norwich boss signed a four-year deal in July 2023. His first season ended with 90 points but defeat by Southampton in the play-off final at Wembley.\nMany fans wanted the German out. It was never going to happen.\n\"I always thought he had a two-year window, so I never felt he was in jeopardy,\" said BBC Radio Leeds commentator Adam Pope.\n\"They got 90 points and the basis from which he started was such a mess. Players were agitating to leave and I don't think he knew who was going to be available from match to match.\n\"It was an extraordinary effort to get as far as they did. But this was the year it has felt like it had to happen.\"\nFarke himself will have a point to prove, as well as big question marks over his own Premier League credentials.\nHis Norwich team bounced between Championship title winners in 2019, Premier League relegation in 2020 and promotion again in 2021, before he was sacked 11 games into his second Premier League campaign in November 2021. Farke's top-flight record is six wins from 49 games.\nOne source with knowledge of the inner workings of Leeds explained the issue the club had on their last three-year stay in the Premier League was that then-owner Andrea Radrizzani just didn't have the funds to kick on.\nRadrizzani's shares were bought by the 49ers Enterprises when they took over Leeds in the summer of 2023, The investment arm of the American football franchise San Francisco 49ers is also attempting to buy a significant stake in Glasgow Rangers.\nThey proved that they have the finance by methodically working through what has been described as the massive 'credit card bill' of instalment payments for transfers from a sizeable churn of players in and out of Elland Road.\nDoubtless they will have a plan for this summer and beyond.\nHowever, there are two issues that are inescapable.\nFirstly, Leeds are hamstrung by the knowledge two seasons in the EFL slices £44m off the maximum £105m three-year loss limit that applies to the rest of the Premier League.\nAnd beyond that, how much will survival actually cost?\nFor the second year running, the three teams that were promoted from the Championship are looking likely to go straight back down.\nTwo of them, Leicester and Southampton, have far more recent top-flight experience than Leeds. Their struggles prove jumping up from the Championship - even with the benefit of parachute payments - is one thing, but staying there is another matter entirely.\nLeeds clearly need at least one striker. They sold Georginio Rutter to Brighton for £40m in August, which sets a benchmark for a decent Premier League forward.\nWhen you start adding in creative midfielders, full-backs and a goalkeeper - Illan Meslier added another mistake to this season's 'crime sheet' by scoring an own goal to give Sheffield United the lead on Monday - the millions rack up.\nTwo of Farke's mainstays, Joe Rothwell and Manor Solomon, are on loan and will need to be bought or replaced, so the bill for a decent shot at survival is going to be astronomical.\nOne way of paying for this would be to generate greater revenue from Leeds' vast fanbase.\nPlans are already in place to expand the dated Elland Road stadium from its current 38,000 capacity by redeveloping the West Stand and the Revie Stand to eventually take the capacity to 55,000.\nThe aim is to use the same model as Liverpool, whose work on the Anfield Road stand was done by building over the top of the existing structure.\nBut this work will not be cheap. Leeds need to be in the Premier League before club chiefs press ahead.\nFor Leeds' financial executives, a delicate balance needs to be navigated between ploughing resource into infrastructure and Farke's squad. Ideally, it should be a twin track process and fans understand that.\nAfter Monday's match, I asked Farke if he felt an \"obligation\" to take Leeds back to the Premier League.\nHe said not. But the answer was revealing.\n\"In the last 25 years, we were promoted to the Premier League once and had three seasons in it, one outstanding season for Marcelo and two difficult ones, including a relegation,\" he said.\n\"At the moment, you are not allowed to label us as an established Premier League side. This is what I want to change.\n\"It is good for us to stay humble. At this club, after a win, everyone speaks about Europe, after a loss, people are saying we will probably go down to League Two. That is what these clubs are all about.\n\"It is a great honour to be in this chair at this amazing club. It is a great responsibility but it comes with pressure.\n\"Everyone expects us to win. That is what Leeds is all about.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cewk51ezg09o"}