{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:17:20", "date_modify": "2025-04-26 04:17:20", "date_publish": "2025-03-04 07:50:43", "description": "Britain's Emma Raducanu will play world number three Coco Gauff in the second round at Indian Wells - if she can beat Japan's Moyuka Uchijima.", "filename": "sport_tennis_articles_c0rzvn50rpqo_1745641040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/098f/live/92b0aad0-f956-11ef-8195-b726d74bd636.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_c0rzvn50rpqo_1745641040.html", "title": "Emma Raducanu could face world number three Coco Gauff at Indian Wells", "title_page": "Emma Raducanu could face world number three Coco Gauff at Indian Wells - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Britain's Emma Raducanu will play world number three Coco Gauff in the second round at Indian Wells - if she can beat Japan's Moyuka Uchijima in the first round.\nRaducanu is scheduled to play world number 52 Uchijima on Thursday.\nIt will be the British number two's first tournament since a stalking ordeal at the Dubai Tennis Championships last week.\nThe former US Open champion was shaken after a man \"exhibited fixated behaviour\" during her second-round match.\nThe man was later detained and given a restraining order, Dubai Police said.\nRaducanu was deliberating whether to travel to the United States for the hard-court event following the incident, but has decided to compete.\nIn the men's draw, Novak Djokovic's second-round opponent could be Australian Nick Kyrgios.\nThe 24-time Grand Slam champion is also projected to meet Carlos Alcaraz in the last eight, in a repeat of their Australian Open quarter-final.\nAndy Murray has flown to the United States to continue his coaching role with Djokovic, with the pair having worked together on a trial basis at January's Australian Open.", "url": "https://www.bbc.co.uk/sport/tennis/articles/c0rzvn50rpqo"}