{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:08", "date_modify": "2025-05-21 06:46:08", "date_publish": "2025-01-22 16:32:37", "description": "Swansea City: 'Right thing' to let Azeem Abdulai join Leyton Orient - Luke Williams", "filename": "sport_football_articles_ckg7r2775gvo_1747809968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b66/live/e34af580-d8dc-11ef-a289-b3809f04eef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg7r2775gvo_1747809968.html", "title": "Swansea City: 'Right thing' to let Azeem Abdulai join Leyton Orient", "title_page": "Swansea City: 'Right thing' to let Azeem Abdulai join Leyton Orient - Luke Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams believes Azeem Abdulai will get a chance to prove himself in a central midfield role following his move to Leyton Orient.\nAbdulai, 22, has joined the League One play-off hopefuls for an undisclosed fee, ending a three-and-a-half-year spell at Swansea.\nHe made 31 appearances for the Swans – though only two of those were league starts – and scored two goals.\nAbdulai was used primarily in a wide role rather than his favoured central position by Williams, who says it was wrong to stand in the Scotland Under-21 international's way after Orient came calling.\n\"I think he will play more probably as a box-to-box midfield player there,\" said the Swansea head coach.\n\"I am sure he will do really well. There were just too many obstacles in the way for him [in that position] here.\n\"He did a good job in the wide positions for us but he's not exactly the perfect fit. When a player has the urge to go and a club comes in and gives him that opportunity, it's difficult to keep the player in a good place, so it was the right thing to do.\"\nAbdulai's departure is unlikely to make a huge difference to Swansea's plans for incoming transfers during this window given that the fee involved is understood to be small and he was not one of the club's major earners.\n\"This is a great chance for him to further his career,\" Williams added.\n\"I think everyone is happy with that and we wish him really well.\"", "url": "https://www.bbc.com/sport/football/articles/ckg7r2775gvo"}