{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-20 14:15:31", "date_modify": "2025-05-20 14:15:31", "date_publish": "2023-07-29 17:23:21", "description": "Terence Crawford and Errol Spence Jr make weight for the undisputed fight in front of thousands of fans at the T-Mobile Arena in Las Vegas.", "filename": "sport_boxing_66333862_1747750531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9F5D/production/_130579704_gettyimages-1577206933.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66333862_1747750531.html", "title": "Errol Spence Jr v Terence Crawford: Rivals make weight for undisputed welterweight fight on Saturday", "title_page": "Errol Spence Jr v Terence Crawford: Rivals make weight for undisputed welterweight fight on Saturday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Terence Crawford and Errol Spence Jr made weight for their undisputed welterweight contest in front of a raucous crowd in Las Vegas on Friday.\nUnified champion Spence was 10st 7lbs while WBO belt holder Crawford was slightly lighter by 3oz.\nA final face-off passed without incident, with the rivals sharing a few words before a cordial handshake.\nThe winner will become the first undisputed welterweight champion in the four-belt era.\nCrawford, 35, is aiming to become a two-weight undisputed champion, the first male fighter to do so in the four-belt era.\nDespite temperatures soaring to 44C in the hours before the weigh-in, it didn't deter thousands of fans attending the ceremonial weigh-in at the T-Mobile Arena.\nBoxing legends Mike Tyson, Evander Holyfield and Roy Jones Jr were also in attendance.\nIt was difficult to tell which fighter attracted more fans, with each undefeated champion given a monster reception.\nCrawford was the first to emerge, looking at ease as he played up to the crowd and rapped along to his entrance music, Mr Carter by Lil Wayne.\nCrawford's allies tried to make themselves heard as Spence appeared, but 'The Truth' made much less of his entrance than his rival.\nDespite both men having already weighed in, it didn't stop officials pretending to read the scales before yelling out the weights to the host to announce.\nAfter a tension-filled news conference, there was no such fireworks during the final face-off.\nSpence did say afterwards he told Crawford he needed to \"thank him\" for making the fight happen, seemingly a reaction to his rival calling him \"kid\" all week.", "url": "https://www.bbc.com/sport/boxing/66333862"}