{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:14", "date_modify": "2025-05-20 13:47:14", "date_publish": "2023-08-01 00:00:00", "description": "Watch live coverage and follow text and radio commentary as Trent Rockets host Southern Brave in the opening game of the 2023 Women's Hundred.", "filename": "sport_live_cricket_66305872_1747748834.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4B50/production/_130608291_08ca1d4fdd490929beda52a27bebf2888b5da34f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66305872_1747748834.html", "title": "The Hundred 2023 LIVE: Watch Trent Rockets vs Southern Brave in women's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Watch Trent Rockets vs Southern Brave in women's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us for Brave v Rockets II\nYou'll be pleased to hear that's not the end of the live cricket action this evening. Not by a long way.\nBBC Two have live coverage of the men's match between Southern Brave and Trent Rockets right now at 18:00 BST.\nYou can follow live text commentary of that match here...\nTo recap...\nA quick reminder of what happened before we go then...\nSmriti Mandhana's 55 plus useful contributions from Danni Wyatt (27) and Maia Bouchier (27) crucial in helping Southern Brave reach 157-6.\nA comical run-out from the first ball did not exactly set the right tone for the Trent Rockets reply.\nNat Sciver-Brunt (49) and Harmanpreet Kaur (22) briefly threatened but when they were dismissed, it was effectively game over for the Rockets.\nMary Taylor, on her debut in The Hundred, was the pick of the Brave bowlers with an impressive 3-18.\nPost\nTrent Rockets captain Nat Sciver-Brunt speaking to BBC Sport: \"It was a tough start. They batted pretty well but we probably missed our line and length a little. They made it difficult when we were batting. I thought we had a little sniff when I was going but when Anya [Shrubsole] got me.\n\"We just didn't get going quickly enough with the bat. We faced too many dots. If we turn those into ones the target is more achievable. It also doesn't help when you get run out first ball! There is plenty to work on.\n\"We'll get used to playing with different people as the tournament goes on. We've spoke about those bonds before the tournament.\"\nPost\nAlex Hartley\nFormer England bowler on BBC Two\nToday showed that Southern Brave know how to win.\nThey've lost two finals but they have a winning formula and know how to win in any situation.\nI reckon they can do it.", "url": "https://www.bbc.com/sport/live/cricket/66305872"}