{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:55:38", "date_modify": "2025-04-26 06:55:38", "date_publish": "2025-02-28 15:16:20", "description": "Gethin Jenkins says the Wales head coach should be based permanently in the country and needs to formulate a long-term plan with the four professional sides.", "filename": "sport_rugby-union_articles_c0l116y1x1ro_1745650538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d4e/live/389ac050-f51c-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c0l116y1x1ro_1745650538.html", "title": "Gethin Jenkins: Former prop says Wales head coach to be based permanently 'in the country'", "title_page": "Gethin Jenkins: Former prop says Wales head coach to be based permanently 'in the country' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gethin Jenkins says the Wales head coach should be based permanently in the country and needs to formulate a long-term plan with the four professional sides.\nWarren Gatland left his head coach role after overseeing a record 14 consecutive Test defeats with Cardiff boss Matt Sherratt taking interim charge until the end of the Six Nations.\nSherratt's temporary tenure started with a much-improved performance in the 27-18 defeat against Ireland, despite only having four training sessions with his new squad.\nHe will be in charge for the trip to face Scotland on 8 February before the visit of England to Cardiff seven days later.\nSherratt says he does not want the job permanently with Michael Cheika, Simon Easterby and Franco Smith linked with the role.\nGatland divided his time between his native New Zealand and Wales and insisted he spent time at the four professional sides.\nFormer Welsh prop and current Cardiff defence coach Jenkins believes the long-term successor needs to be based in the country.\n\"The Welsh coach has to be in the country putting the hours in and going around the regions and actually putting together a plan,\" said Jenkins.\nGatland's second spell in charge resulted in 20 defeats in 26 games for a side that lost many seasoned internationals after the World Cup.\n\"The notion the group of players was not good enough is probably not something I agree with,\" said Jenkins.\n\"They're young but there's a lot of experience in there as well and it's how can you get the best out of them.\n\"I think far too often it was said publicly players had made bad decisions. As a coach sometimes you've got to take responsibility as well and own that.\n\"You can see even the difference in just two weeks of training what a bit of coaching has done to these players.\"\nJenkins was defence coach under previous Wales boss Wayne Pivac, who was replaced in December 2022 by Gatland.\nShortly after Gatland's reappointment, Jenkins and attack coach Stephen Jones were replaced by Mike Forshaw and Alex King.\nThe decision was made three days after Christmas with Jenkins and Jones told in person by WRU chief executive Steve Phillips and performance director Nigel Walker.\nWales rallied at the 2023 World Cup where they were knocked out by Argentina in the quarter-finals and the national side have since not won a Test match.\nGatland previously enjoyed a successful 12-year spell which included three Grand Slams, two World Cup semi-finals and a record run of 14 victories that led to Wales briefly topping the world rankings.\nFollowing his resignation in his second stint, Gatland says he was \"weighed down\" by public criticism, including from his former players, who he stated would not be in the media if they had not been successful and played for Wales and the British and Irish Lions.\n\"To say stuff like that, I don't think that sits well. You're either on one side of it or the other,\" said Jenkins.\n\"You are either coaching or you are out there giving opinions. The stuff with ex-players criticising, that's their job.\n\"The ex-players who chose to go into those roles do it to give an opinion.\n\"I see a lot of my former teammates who have gone into that world and that's what they're paid to do.\n\"Sometimes their opinions are right, sometimes they're not but that's the way of the world.\"\nGatland was himself a pundit during Jenkins' final campaign with Wales in the autumn of 2022.\n\"If you go back probably to when I was working in that job (Wales), the last campaign I was involved in, there were people on television giving their opinions then and doing exactly the same thing,\" said Jenkins.\n\"You can make what you want of who that was.\"\nGatland employed influential coaches in his backroom staff during his first spell in charge.\n\"For me personally, when I was playing, the biggest impact on me was Shaun Edwards [defence coach] and I wanted to play for him,\" said Jenkins.\n\"That was the main part of that team I wanted to play for.\n\"I got on very well with Rob Howley [attack coach]. He made me captain, so he showed a lot of faith in me, in terms of that leadership role.\"\nSherratt will not be in charge for Cardiff's United Rugby Championship (URC) match against table-topping Leinster in Dublin on Saturday with Jenkins and the rest of the Cardiff coaching staff holding the fort.\n\"It's been a bit busier than usual,\" said Jenkins.\n\"We're all doing bits to make it work as smoothly as possible and we're in a good place.\"\nSherratt has shown some interest in Cardiff's preparations but is not expected to be at the Aviva Stadium.\n\"He is not involved much, although he is a bit like David Brent, he can't stay away and was in the office on Wednesday,\" said Jenkins.\n\"He won't be with us this week. He's got enough on his plate at the moment. He is busy saving Welsh rugby!\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c0l116y1x1ro"}