{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:07:52", "date_modify": "2025-05-21 06:07:52", "date_publish": "2025-01-31 14:43:21", "description": "Manchester City boss Pep Guardiola says the Premier League's schedule disadvantages English clubs in Europe.", "filename": "sport_football_articles_c23nez9pdd3o_1747807672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04bd/live/6d8bf860-dfe1-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c23nez9pdd3o_1747807672.html", "title": "Manchester City: Pep Guardiola says Premier League schedule hinders English clubs in Europe", "title_page": "Manchester City: Pep Guardiola says Premier League schedule hinders English clubs in Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola says English teams are at a disadvantage in Europe because of Premier League scheduling.\nCity were drawn against Real Madrid in the Champions League knockout play-offs on Friday.\nThe two-legged tie against the Spanish club comes in the middle of a run in February where City will play seven times in 25 days, starting with Sunday's trip to Arsenal.\nThough Guardiola says he has no complaints, the Spaniard says the Premier League's scheduling gives foreign clubs an advantage in European competition.\n\"Always they put the toughest schedules for the European teams in the important stages,\" he said.\n\"I'm not complaining because we had incredible success dealing with this calendar.\n\"But I remember when I was at Barcelona, I followed the Premier League because it was the most attractive league in the world. Alex Ferguson, Jose Mourinho, Arsene Wenger made the same complaints.\n\"Do you think it's going to change? The broadcasters decide. There are leagues that play on the Friday before the Champions League. They don't ask me when it's better to play to have one more day. It has always been like that.\n\"It's no surprise when I see the calendar. It is what it is. Here, the Premier League is much more important than the other competitions.\"", "url": "https://www.bbc.com/sport/football/articles/c23nez9pdd3o"}