{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:08:57", "date_modify": "2025-05-19 15:08:57", "date_publish": "2015-01-31 12:08:53", "description": "Chris Sutton stands by his belief that Celtic could win Sunday's League Cup semi-final with Rangers \"blindfolded\".", "filename": "sport_football_31073260_1747667337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80694000/jpg/_80694746_sutton.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31073260_1747667337.html", "title": "Rangers: Chris Sutton defends 'Celtic will win blindfold' remark", "title_page": "Rangers: Chris Sutton defends 'Celtic will win blindfold' remark - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is standing by his belief that Celtic could win Sunday's Scottish League Cup semi-final against Rangers while blindfolded.\nAsked about comments criticised by Celtic's Stefan Johansen, the former Hoops striker said: \"The score can be anything. Rangers are in disarray.\n\"When you strip it all back and look at the 11 players starting, Rangers will not get anywhere near Celtic.\n\"Celtic will dominate possession, they will dominate territory.\"\nMidfielder Johansen said Sutton was \"completely wrong\" because cup competitions so often feature upsets while the traditional rivalry between the Glasgow clubs will ensure a close encounter.\n\"Stefan Johansen has to say that - he is a player,\" former Chelsea, Blackburn Rovers and Norwich City striker Sutton told BBC Sport.\n\"I would do exactly the same thing.\n\"But I was only telling the truth. Rangers are struggling in the league below Celtic.\n\"Hearts are going to win that league and Rangers will have to have a play-off to get up.\"\nSutton thinks the only possible problem for Celtic is that this season they have not been finishing the chances created.\nSince the 41-year-old left Glasgow for Birmingham City then Aston Villa, Rangers have suffered severe financial problems and this will be the first derby between the sides for nearly three years after two lower-league titles.\nWhile reigning champions Celtic top the Scottish Premiership and are preparing for a Europa League last-32 meeting with Inter Milan, Rangers are 13 points adrift of Championship leaders Hearts.\nEmergency loans have been required to keep Rangers in business amid a battle for power in the Ibrox boardroom and they go into the semi-final under a caretaker manager, Kenny McDowall, who has already handed in his notice.\n\"This game is going to be the most one-sided derby beforehand, but in my era, you could never tell which way it was going to go,\" said Sutton.\n\"Rangers had a strong team and we were vying every year for titles and cups and it was extremely exciting. This will be exciting in a different way.", "url": "https://www.bbc.com/sport/football/31073260"}