{"authors": ["Dan Roan", "Tom Mallows", "www.facebook.com"], "date_download": "2025-05-21 05:48:11", "date_modify": "2025-05-21 05:48:11", "date_publish": "2025-04-02 11:44:22", "description": "The British Basketball Federation says it has agreed a 15-year deal with a group to run the men's professional league from 2026.", "filename": "sport_basketball_articles_cvg8wwp896zo_1747806491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d14a/live/e66b5000-0f9d-11f0-b696-d3bfdfb825fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cvg8wwp896zo_1747806491.html", "title": "British Basketball Federation 'agrees 15-year deal' to run men's professional league", "title_page": "British Basketball Federation 'agrees 15-year deal' to run men's professional league - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The British Basketball Federation says it has agreed a 15-year deal with a group to run the men's professional league from the start of the 2026-27 season.\nIt described the agreement with GBB League Ltd (GBBL) as a \"defining moment\" for the sport, and said the new body would provide £15m funding in the first two years.\nHowever, the current operator Super League Basketball (SLB) said the new competition will have \"no clubs, fans, arenas or expertise\".\nIt said the tender process run by the governing body was \"illegal and unjust\", and that the SLB is \"united\" with the nine clubs to continue running the game.\nThe SLB said \"it does not legally require the BBF licence to continue to operate the professional basketball league in Britain\".\nSLB was awarded an interim three-year licence last July to replace the British Basketball League, which collapsed amid financial concerns.\nIn January the SLB said it was prepared to break away from the BBF after claiming it had been shut out from discussions over the future of the men's game.\nIt said it had withdrawn from the tender process after \"concerns were raised over the legality of the BBF's actions\".\nThe BBF told BBC Sport it disputed those claims, pointing to a letter addressed to the SLB in December explaining that interested parties would be \"welcome to put forward any variations to the key terms that align with their vision\".\nIt said the SLB chose not to enter the tender process \"despite the BBF's encouragement\", and that decision meant it \"would not be awarded a long-term licence\".\nThe BBF said the SLB had elected not to bid for a long-term licence, so it activated a clause to terminate the interim agreement at the end of the 2024-25 season.\nThe licence also allows for alignment with international competitions, including proposals by the NBA and world governing body Fiba to launch a new European league.\nThe BBF said it will \"seek to engage\" with Premier Basketball \"as well as conducting a process to evaluate opportunities in population centres currently without a presence at the highest level such as Liverpool, Leeds, Cardiff, Edinburgh and Birmingham\".\nBBF chair Chris Grant said: \"We're delighted to welcome GBBL to the British Basketball family.\n\"The award of this licence not only heralds the biggest ever level of financial investment into the league. It also brings the knowhow, connections and vision to excite those who already love the game and to attract new fans and participants.\n\"To have booming professional leagues which enable our top players to compete in front of British fans, week in and week out, is just what we need in order to fulfil British basketball's huge potential.\"\nGBBL managing director and CEO Marshall Glickman said: \"We are fully committed to uplifting the popularity of basketball in Great Britain.\n\"We are especially focused on making our league attractive to homegrown players, both in terms of economics and development. We want to see our players lead the GB national team to the 2028 LA Olympics.\"", "url": "https://www.bbc.com/sport/basketball/articles/cvg8wwp896zo"}