{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:46:17", "date_modify": "2025-05-21 03:46:17", "date_publish": "2025-01-23 16:50:59", "description": "Sheffield United boss Chris Wilder speaks to BBC Radio Sheffield about incoming prospects in January, before Friday's game against Hull City.", "filename": "sport_football_articles_cj3er5164jyo_1747799177.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8be1/live/ed1ab440-d9ab-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj3er5164jyo_1747799177.html", "title": "Sheffield United: Blades Heaven", "title_page": "Sheffield United: Blades Heaven - Wilder talks transfers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"We've put ourselves in a great position and we need to be as strong as possible.\"\nBefore Sheffield United host Hull City on Friday night (20:00 GMT), boss Chris Wilder has been speaking to BBC Radio Sheffield about incoming prospects in January.\nThe Blades have reportedly agreed personal terms with Hertha Berlin defender JonJoe Kenny, with the right-back having voiced his interest in joining the club.\n\"Position specific, it's an area we are looking to improve and obviously JonJoe is one of those players that has been on our radar,\" Wilder said.\nWilder has confirmed that he expects the signing of Leicester City striker Tom Cannon to be completed before the deadline for Friday's match, while he still has his eye on midfielder Shea Charles, who has been on loan at Sheffield Wednesday from Southampton, but knows they will face tough competition for his signature.\n\"He'll be on everybody else's radar as well,\" Wilder added.\n\"We are playing a left-back in there at the moment, with a player in his first season of Championship football. It's not ideal.\"\nThe United midfield has been especially hit recently.\nAlong with Ollie Arblaster, who is out long-term with an ACL injury, the Blades have also lost Gus Hamer through suspension as well as injuries to Tom Davies and Jamie Shackleton.\nBut Wilder expects Davies to be \"there or thereabout\" for the upcoming games against Derby and Portsmouth.", "url": "https://www.bbc.com/sport/football/articles/cj3er5164jyo"}