{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:32:05", "date_modify": "2025-04-26 07:32:05", "date_publish": "2025-02-27 16:46:38", "description": "Bournemouth vs Wolves: Antoine Semenyo wants 'revenge' in FA Cup tie", "filename": "sport_football_articles_cpv44l7223ko_1745652725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e18/live/fe907900-f529-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpv44l7223ko_1745652725.html", "title": "Bournemouth vs Wolves: Antoine Semenyo wants 'revenge' in FA Cup tie", "title_page": "Bournemouth vs Wolves: Antoine Semenyo wants 'revenge' in FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bournemouth forward Antoine Semenyo has called on the Cherries to get \"revenge\" against Wolves this weekend after losing to Vitor Pereira's side last Saturday.\nWolves return to Vitality Stadium in the FA Cup and Semenyo believes Bournemouth can get their own back on the relegation-threatened side.\n\"It's going to be like a revenge game for us,\" Semenyo said. \"I feel like when we played them we dominated when we had 11 men. So when we went down to 10, it was obviously a bit tougher, but I feel like it's revenge for us.\n\"We're going to work hard over these next couple of days and then, get a win.\"\nAsked if he believes there is a chance for Bournemouth to go far in the FA Cup this season he replied: \"100%, I feel like we're getting closer and closer.\n\"The manager said it's really important to him personally to get to the final. So I feel like for us we just want to do the best we can to to get there.\"\nWith a trip to Wembley only two wins away, the Ghanaian, who has previously had loans spell with Bath City and Newport County, says it would \"100%\" be a dream to play there.\n\"I feel like I've never really had that opportunity to get that far. I've actually said to a few of my friends and my brother recently that I would love to play at Wembley - I've been to watch a couple of friends, but I would love to play there myself.\n\"Let's just take it to Wolves, then next round hopefully do the same thing and then get to the semis.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cpv44l7223ko"}