{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-04-26 07:27:07", "date_modify": "2025-04-26 07:27:07", "date_publish": "2025-02-27 20:47:49", "description": "The president of the International Paralympic Committee says he is opposed to \"blanket solutions\" for transgender participation policies.", "filename": "sport_articles_cn044973g6jo_1745652427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb69/live/b672a880-f549-11ef-a9c6-c7f9594861df.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cn044973g6jo_1745652427.html", "title": "International Paralympic Committee president Andrew Parsons opposed to 'blanket' transgender bans", "title_page": "International Paralympic Committee president Andrew Parsons opposed to 'blanket' transgender bans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The president of the International Paralympic Committee says he is opposed to \"blanket solutions\" for transgender participation policies.\nAndrew Parsons was speaking after United States President Donald Trump signed an executive order that prevents transgender women from competing in female categories of sports.\nLast week, International Olympic Committee (IOC) presidential candidate Seb Coe backed the move, and has also suggested he would consider introducing a blanket ban if elected next month.\n\"One thing that is important to us of course is to protect the female category, this is the number one priority,\" Parsons told BBC Sport.\n\"But we also have to acknowledge that there is a growing population of transgender athletes, [and] that they would like to compete at the highest possible level.\n\"So how we can bring all of this together is a challenge, and I think science is the answer to that, but I don't think a blanket solution is possible because I do believe sports are different.\n\"At the moment you have 'mixed sports', like equestrian for example. So I don't believe in blanket solutions for such a complicated thing, especially because sports are so different in terms of what they demand from the athletes.\"\nThe IOC and IPC both currently allow individual sports to set their own rules regarding transgender athletes.\nUnder Coe's presidency, World Athletics has banned transgender women from competing in the female category at international events and toughened the rules over the participation of athletes with differences in sex development (DSD).\nHowever, under World Para Athletics' rules, a person who is legally recognised as a woman is eligible to compete in the category their impairment qualifies them for.\nLast year in Paris, Italian runner Valentina Petrillo became the first openly transgender athlete to compete at the Paralympics.\n\"When it comes to the IOC and IPC, we are different organisations with different governance models,\" said Parsons.\n\"We took different decisions on important decisions in the past and this will continue to be the case in terms of the autonomy.\"\nTrump has also said he will prevent transgender women from competing in female competitions at the LA 2028 Games by denying them visas to travel to the US.\nWhen asked for his response, Parsons said: \"Of course we have three years to go, but when it comes to transgender participation it's up to each international federation (IF) to make those decisions in terms of rules and regulations. We will work with the organising committee to make sure the rules of every IF could be respected.\n\"This is an operational matter when it comes to the Games and visas. We have to see facts and measures to see how we can then work with decisions that are going to be made.\n\"I understand at the moment there are many opinions, many statements, but we need to work with the facts. And this is something that every host agrees when it comes to visas - to guarantee the participation of all different countries and the athletes who are considered eligible by the IOC, IPC and the respective IFs.\"", "url": "https://www.bbc.co.uk/sport/articles/cn044973g6jo"}