{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:39:33", "date_modify": "2025-05-21 04:39:33", "date_publish": "2025-04-04 15:29:03", "description": "'Proud' Hibs want to continue 'changing history' - Gray", "filename": "sport_articles_c985lwz98gdo_1747802373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb7c/live/588e7250-1158-11f0-9c64-93da9e1b4cb6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c985lwz98gdo_1747802373.html", "title": "'Proud' Hibs want to continue 'changing history'", "title_page": "'Proud' Hibs want to continue 'changing history' - Gray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Gray his urged Hibs to continue \"changing history\" by earning their first win at Ibrox in seven years.\nThe Easter Road men, having risen from bottom of the table to third place with an incredible upturn, are aiming to make it 16 league games unbeaten when they visit Barry Ferguson's side.\nAnd Gray says victory at Ibrox would rank \"right up there, right at the very top\" of his achievements as head coach.\n\"It's a really tough game away to Rangers but it's one the players need to relish,\" he added.\n\"It's been a long time since a Hibs team has won there in the league, I think it was 2018, so that's the challenge for the players to go and do that.\n\"It's something [the unbeaten run] we're taking great pride in.\n\"Just changing history in a positive way is something I talk a lot about and I think it's something we've demonstrated a lot this season. It's something we can do again at the weekend.\"\nAcross all competitions, Rangers have lost four home games in a row for the first time in their history.\n\"The pressure will be on Rangers as well,\" Gray added.\n\"We can't go into the game in any better frame of mind, the players have been there already this season and we put in a good performance but didn't get the result [1-0 defeat in September], we've progressed as a team since then.\"", "url": "https://www.bbc.com/sport/articles/c985lwz98gdo"}