{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:34", "date_modify": "2025-05-21 05:53:34", "date_publish": "2025-04-02 08:02:27", "description": "Scottish gossip: Doak, Annan, Cerny, Kyogo, Olufunwa", "filename": "sport_football_articles_c5y5rlnwky7o_1747806814.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/74e2/live/b3cf5380-0f98-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y5rlnwky7o_1747806814.html", "title": "Scottish gossip: Doak, Annan, Cerny, Kyogo, Olufunwa", "title_page": "Scottish gossip: Doak, Annan, Cerny, Kyogo, Olufunwa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new winger is a priority for Everton in the summer and Scotland 19-year-old Ben Doak is on their radar, but Bournemouth and Crystal Palace are also interested and Liverpool have yet to decide whether to sell, loan or keep him at the end of the season. (TeamTalk), external\nRangers have been scouting left-sided Ghana defender Ebenezer Annan, but several other European clubs have been eyeing the 22-year-old who is under contract to Red Star Belgrade until the summer of 2027. (MaxBet Sport), external\nMontpellier centre-half Boubacar Kouyate, Liverpool left-back Owen Beck, Leeds United forward Joe Gelhardt and Ipswich Town striker Ali Al-Hamadi would be dream additions to Rangers' squad for next season along with an extended stay for winger Vaclav Cerny, according to AI tool Grok. (The Scotsman), external\nRangers will be in pole position to sign Vaclav Cerny permanently if and when their takeover by 49ers Enterprises is completed, but Wolfsburg could auction the 27-year-old Czech international if the Ibrox club do not take up their £5.5m option in time. (Football Insider), external\nAt £6.3m, fringe striker Danilo is the most valuable member of Rangers' squad, just ahead of new Belgium international midfielder Nicolas Raskin. (The Scotsman), external\nFormer Rennes head coach Jorge Sampaoli, who was sacked just days after Kyogo Furuhashi arrived from Celtic as winger Jota moved in the other direction, has revealed he had nothing to do with the Japan striker's January transfer. (The National), external\nHeart of Midlothian head coach Neil Critchley has reassured midfielder Yan Dhanda and winger Alan Forrest they still have a part to play at Tynecastle Park despite falling out of the starting line-up this year. (Edinburgh Evening News), external\nAberdeen manager Jimmy Thelin says summer transfer window targets must have the right character to play for the club and must also display they are rounded players by being potent in both defence and attack. (Press & Journal), external\nDare Olufunwa is set for a move to Finland after St Johnstone agreed to release the 23-year-old defender. (The Courier), external\nFormer Scotland utility man Callum Paterson admits his future situation is up in the air as he heads into the final months of his Sheffield Wednesday contract. (Edinburgh Evening News), external", "url": "https://www.bbc.com/sport/football/articles/c5y5rlnwky7o"}