{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:06:31", "date_modify": "2025-05-20 13:06:31", "date_publish": "2023-08-02 00:00:00", "description": "Follow text updates and radio commentary as Welsh Fire host Manchester Originals in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306052_1747746391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B5FF/production/_130619564_gettyimages-1587889151.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306052_1747746391.html", "title": "The Hundred 2023 LIVE: Welsh Fire vs Manchester Originals in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Welsh Fire vs Manchester Originals in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThat's it from Sophia Gardens - a dramatic 40-ball encounter in rainy Cardiff.\nWe didn't think we'd get a game for much of the afternoon, but Welsh Fire will be delighted that we did - last season's bottom side are on the board with their first win.\nIf you missed the action then take a look at Sam Drury's report. Meanwhile London Spirit v Oval Invincibles is just about to get underway at Lord's. You can follow Timothy Abraham's commentary here.\nHave a good evening.\nPost\nMatch Hero Luke Wells talking to Sky Sports: \"The decision came pretty last minute when we knew the match was going to be reduced. We were keen to have a left-right combination to take advantage of any short boundaries and thankfully it paid off.\n\"It probably helped not having too much time to think about it. I didn't have a clue what was going on half the time. I was getting used to the rules! It was good fun. I just went with it and it came off.\n\"I've played in a variety of roles with Lancashire now in the Blast. I pride myself on being adaptable.\n\"It is a very different group now. It has been a really relaxed atmosphere, we haven't had much time to get to know each other. I think that paid off today.\"", "url": "https://www.bbc.com/sport/live/cricket/66306052"}