{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:42:40", "date_modify": "2025-04-26 06:42:40", "date_publish": "2025-03-02 11:11:43", "description": "The National Hunt Chase at this month's Cheltenham Festival is renamed permanently in honour of the Princess Royal.", "filename": "sport_horse-racing_articles_cy5ney1v751o_1745649760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa74/live/abefd5b0-f754-11ef-b0ec-f990ca2ebe14.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_horse-racing_articles_cy5ney1v751o_1745649760.html", "title": "Cheltenham Festival race named in honour of Princess Royal", "title_page": "Cheltenham Festival race named in honour of Princess Royal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The National Hunt Chase at this month's Cheltenham Festival has been permanently named in honour of the Princess Royal.\nThe race, the oldest contest staged at the meeting, will now be known as The Princess Royal National Hunt Chase and will take place on the opening day of the four-day meeting on Tuesday, 11 March.\nRun over three miles and six furlongs, it has previously been limited to amateur riders but from this year onwards it will be open to professional jockeys and staged as a novices' handicap chase.\nThe race took place at a number of venues until becoming part of the new two-day National Hunt Festival at Cheltenham in 1911, having previously also been run at Cheltenham in 1904 and 1905.\nPrincess Anne is an accomplished horsewoman and a frequent visitor to Cheltenham Racecourse.\nShe won individual gold at the 1971 European Eventing Championships and competed at the 1976 Olympics in Montreal.\nIn the 1980s she rode as an amateur jockey, successfully partnering winners both on the Flat and over jumps, and is the president of the Riding for the Disabled Association.\n\"It is a tremendous privilege for us to announce that the National Hunt Chase will now honour HRH The Princess Royal in its title,\" said Cheltenham chief executive Guy Lavender.\n\"As an outstanding all-round equestrian, it is appropriate that the Princess Royal will be associated with such a historic contest.\"", "url": "https://www.bbc.co.uk/sport/horse-racing/articles/cy5ney1v751o"}