{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 07:32:57", "date_modify": "2025-05-21 07:32:57", "date_publish": "2025-05-20 15:01:37", "description": "Leicester City news: How did Foxes land in financial difficulty?", "filename": "sport_football_articles_c74nnkpmkgvo_1747812777.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b5b/live/8e443260-3582-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74nnkpmkgvo_1747812777.html", "title": "Leicester City news: How did Foxes land in financial difficulty?", "title_page": "Leicester City news: How did Foxes land in financial difficulty? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There are various reasons why Leicester have lost so much money in previous years, which still leaves them vulnerable now given the three-year assessment period.\nThey lost nearly £90m in 2022-23 as the club fell from eighth to 18th, resulting in relegation, but it was also a reduction of about £30-35m in prize money given finishing positions in the Premier League table are worth about £3m.\nThey budgeted for a higher finish, budgets which chief executive Susan Whelan said were \"entirely reasonable\" given previous top-five finishes.\nA lack of European football was another factor, with the club qualifying for the Europa League and going on to reach the Europa Conference League semi-final in 2022.\nSignificant changes in the management have also been costly with the departure of Brendan Rodgers, along with his backroom staff, in 2023 expensive.\nLeicester have handed out big contracts to players and have therefore been unable to move some on and, despite managing to make a £74.8m profit in player sales in 2022-23, they still lost a huge amount.\nThe knock-on effect is still restricting them, with current manager Ruud van Nistelrooy only able to spend around £3m on defender Woyo Coulibaly in January, leaving the Foxes short on the quality needed for a relegation fight.", "url": "https://www.bbc.com/sport/football/articles/c74nnkpmkgvo"}