{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-04-26 07:57:42", "date_modify": "2025-04-26 07:57:42", "date_publish": "2025-02-25 12:15:08", "description": "Trainer Nicky Henderson praises Constitution Hill's 'frightening' form in an impressive pre-Cheltenham Festival gallop at Kempton.", "filename": "sport_horse-racing_articles_c62z7n190vgo_1745654262.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6d1/live/024e5410-f2a8-11ef-b1bc-c7140a41b5a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_horse-racing_articles_c62z7n190vgo_1745654262.html", "title": "Constitution Hill 'perfect' in pre-Cheltenham Festival workout", "title_page": "Constitution Hill 'perfect' in pre-Cheltenham Festival workout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Trainer Nicky Henderson described Constitution Hill's performance as \"perfect\" as he impressed in a pre-Cheltenham Festival gallop at Kempton.\nThe unbeaten eight-year-old is odds-on favourite to regain the Champion Hurdle title he won in 2023 in the feature race on the opening day of the Festival on Tuesday, 11 March.\nTwelve months ago, a similar workout saw a disappointing performance which led to him being off the track for a full year.\nA respiratory infection ended his bid for a Cheltenham defence before a suspected bout of colic ended his season early.\nHe missed his seasonal comeback in November after he was found to be lame but returned to the track with an easy win in the Christmas Hurdle on Boxing Day at Kempton before a victory on Trials Day at Cheltenham last month.\nBut he shone in Tuesday's appearance at the Surrey track where he was ridden by regular pilot Nico de Boinville, who allowed him to pull clear of work partners That's Nice and Aston Martini while Henderson and owner Michael Buckley watched on.\n\"Nico's face, my face and Michael's face will probably tell you it's a different day [to last year],\" said Henderson.\n\"That's him and it's good to watch really isn't it - it's frightening to watch, actually.\n\"We've been so happy and you've just got to blank out last year. We knew before we actually came here last year that these horses weren't flying and it was going to be harder to get through, whereas today everything has gone perfect.\n\"It was great that you're [media] all here [to watch] and you can make your own minds up.\"", "url": "https://www.bbc.co.uk/sport/horse-racing/articles/c62z7n190vgo"}