{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:20:05", "date_modify": "2025-05-20 13:20:05", "date_publish": "2023-08-02 08:56:09", "description": "Jamaica qualify for the knockout stages of the Women's World Cup for the first time as Brazil go out early.", "filename": "sport_football_66380370_1747747205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0E43/production/_130615630_jamaicacelebrate.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66380370_1747747205.html", "title": "Women's World Cup: Jamaica savour last-16 thrill as giants Brazil fall early", "title_page": "Women's World Cup: Jamaica savour last-16 thrill as giants Brazil fall early - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamaica manager Lorne Donaldson said his team had \"never had this much fun\" after reaching the Women's World Cup last 16 for the first time, leaving Brazil devastated.\nThey battled out a cagey encounter in Melbourne and Jamaica put in a stubborn defensive display to ensure their impressive tournament still has another chapter.\nThe Reggae Girlz, ranked 43rd in the world, have kept three clean sheets in the group stages of their second World Cup, having conceded 12 goals in three defeats in 2019's competition.\n\"We were not expected to be in the World Cup in 2019,\" said Donaldson. \"The programme was fairly new and we said, 'Oh, we're in!'. It was like being deer in headlights.\n\"We were very young and happy to be there. This time around we said, 'Hey, we're not just going to show up. We're going to get out of the group.' Our mentality was that nothing is impossible.\"\nBrazil, who recalled striker Marta to the starting XI, could not find the goal they needed and failed to progress for the first time in 28 years.\nMarta, 37, is the all-time leading scorer in men's or women's World Cups with 17 goals but will not feature again on this stage, with her sixth tournament coming to an end having made three group-stage appearances.\nAfter this goalless stalemate, Jamaica could face Colombia or Germany in the last 16, while France go through as Group F winners following their victory over Panama in the other match.\nJamaica put themselves in a strong position when they held group favourites France to a goalless draw and followed it with a crucial 1-0 win over Panama without star striker Khadija Shaw, who was suspended after being sent off in their opening match.\nManchester City's Shaw returned to the side in Melbourne on Wednesday, adding much-needed threat for Jamaica on the counter-attack.\nFormer Arsenal centre-back Rafaelle Souza largely kept Shaw at bay, though the Jamaican's presence alone caused problems and she almost scored with 10 minutes remaining, firing over the bar on the break.\nThat was Jamaica's only real chance as Brazil built pressure and searched endlessly for the goal they needed to take them through to the knockout stage.\nMarta, who went off to huge cheers after 80 minutes, had a few glimpses at goal, while Debinha, Luana and Tamires all drew saves from Jamaica goalkeeper Becky Spencer.\nBut Brazil were predictable and lacklustre, struggling to break down Jamaica's well-organised defence and offering very little in a desperate fight to stay in Australia.\nThey almost found a golden touch in the third minute of second-half stoppage time when Andressa pounced on a scramble in the box, but Spencer was again equal to it and Brazil's substitutes fell to their knees in despair in the dugout.\nIt is a disappointing early exit for the South American champions who took their European counterparts England to a penalty shootout in the Women's Finalissima at Wembley in April and had high hopes coming into the World Cup.\n\"There's a lot of feelings of course,\" said Brazil manager Pia Sundhage. \"In the locker room there's many sad players and coaches.\n\"At the end of the day I'm responsible for the result. Of course I'm not alone, but the way we have worked and have prepared is something I need to look back on and see if we could have done things differently.\n\"We put in a lot of work, but at the end of the day it's Jamaica [who progress]. It's not a big distance between failure and success.\"\nJamaica have proven they are more than a match for some of the world's higher-ranked nations and there was an outpouring of emotion at full-time as the magnitude of their achievements became clear.\nCaptain Shaw fell to her knees and began crying, while players draped Jamaica flags across their shoulders and began dancing in the middle of a huddle on the pitch.\nJamaica's journey to Australia and New Zealand was marred by a battle with their own federation and the squad wrote an open letter calling for \"immediate and systematic change\".\nGoalkeeper Spencer said the team are \"showing what can be done\" and hopes their success will put further pressure on their federation to react.\n\"Obviously we fight a battle constantly. We put it to bed in the tournament because we have a point to prove,\" said Spencer.\n\"The better we do, the more pressure it creates. We hope they are taking notice and they should be now. We've had loads of outpouring of support for us. They are saying keep fighting.\n\"We're appreciative of all the support we have got from other teams and players. We need to keep spreading the word so we can get better.\"\nJamaica's success on the pitch comes four days before their country celebrates Independence Day and Donaldson said fans back home \"love a reason to celebrate\".\n\"I hope they have a national holiday back in Jamaica for our performance today,\" said Spencer, joking. \"I just hope everyone back home has enjoyed this.\"", "url": "https://www.bbc.com/sport/football/66380370"}