{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:37", "date_modify": "2025-05-21 07:59:37", "date_publish": "2024-12-23 10:42:42", "description": "Everton 0-0 Chelsea: Fan views on Premier League game", "filename": "sport_football_articles_clyj0k52mr8o_1747814377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyj0k52mr8o_1747814377.html", "title": "Everton 0-0 Chelsea: Fan views on Premier League game", "title_page": "Everton 0-0 Chelsea: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's Premier League game between Everton and Chelsea.\nHere are some of your comments:\nEverton fans\nNeil: Another good point against a top side. There was nothing too exciting at times but we also had chances to win it. The final third remains a big issue, although there are signs it is improving.\nRon: It's not a result that will live long in the memory, but we have managed to take a point from Arsenal and a point from Chelsea. If 0-0 draws keep us from an end of season relegation scrap, I'm happy with it.\nJeff: Some might say that it is a valuable point against a top team - just like last week against Arsenal - but don't forget we lost three very expensive points to Southampton. Points-wise, I would rather have lost against Arsenal and Chelsea and beaten Southampton. Football-wise, it is getting very boring. The fifth 0-0 of the season. Next time I'm bringing a book to the match.\nGed: Chuffed. Dyche-ball will keep us up. The manager has helped the club weather one of the worst periods in recent history. I don't care about possession stats, he deserves a medal. We need to get through the Manchester City game, who knows what will happen there, and then it's onwards and upwards.\nChelsea fans\nMathew: Good point on the road. Robert Sanchez and Tosin Adarabioyo played really well for us. I also thought Pedro Neto played well and was a threat for us when going forward. It was a shame to see Nicolas Jackson's chance hit the post. Overall, I'm happy with the clean sheet. Now on to our Boxing Day match against Fulham.\nKarl: This was the first time where there was some expectancy on us. We coped much better physically than we did last season in this fixture but, overall, we didn't do enough and could have lost it. So, for me, it's a point gained rather than two dropped.\nJeff: I'm very disappointed because of Chelsea's recent winning streak that they didn't win. I was expecting a lot more against this team - but well done, Everton. We could have tasted top spot.\nShaun: We have been getting carried away after a handful of good performances. This is a better reflection of where we are right now.", "url": "https://www.bbc.com/sport/football/articles/clyj0k52mr8o"}