{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 07:27:22", "date_modify": "2025-05-21 07:27:22", "date_publish": "2025-03-28 13:44:52", "description": "Head coach Nelson Jardim says Newport County \"haven't been fighting with the same weapons\" when battling League Two rivals this season.", "filename": "sport_football_articles_ckg1d8xr7qyo_1747812442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9397/live/0579aaf0-0b34-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg1d8xr7qyo_1747812442.html", "title": "Newport 'not fighting with same weapons' in League Two", "title_page": "Newport 'not fighting with same weapons' in League Two - Jardim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Nelson Jardim says Newport County \"haven't been fighting with the same weapons\" when battling League Two rivals this season.\nThe Exiles face play-off chasing Notts County on Saturday hoping to continue impressive home form that is only bettered by the division's top four sides.\nIt has helped move the club clear of any relegation battle, achieving the target of \"comfort\" set out as chairman Huw Jenkins oversaw a huge turnover of players over the summer.\nWith last season's takeover clearing historic debts, there had been a focus of finding financial stability off the field and signing of a number of untested players on it.\nAnd, with 18th-placed Newport 15 points clear of the bottom two but 13 points short of the play-offs, Jardim admitted: \"In this league there are teams with different approaches and we are not fighting with the same weapons.\n\"We probably need to be more creative and intelligent to compete.\"\nJardim says he wants his players – many of whom are playing their first full year of senior football – to use their final eight fixtures to show they can be confident going into next season.\nWith no side winning fewer points away from home, form on the road has proven costly to any higher ambitions this term.\nBut, given their impressive home record, Jardim said: \"There are good signs there – and it is backed up with evidence and data, not just me saying it.\n\"The challenge is to use the last eight games to show a clear future in terms of the team and the way we want to play.\n\"Because of injuries and suspensions we have had to adapt and we have been clever to find ways of winning games to give us that comfort.\n\"But we need to take these eight games to show what can be the beginning of the next season.\"\nA quieter summer of recruitment is planned at Newport, but the Portuguese former Swansea City coach says the foundations laid in this campaign will allow the club to be more targeted in their transfer dealings.\n\"We knew that some of the boys would need time to play more games,\" added Jardim.\n\"We have started that process and now when we look to improve the team we are able to be more precise in the type of player and what they will offer us.\n\"Now we know the players and what we need. There will be no messing about.\"", "url": "https://www.bbc.com/sport/football/articles/ckg1d8xr7qyo"}