{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 07:48:42", "date_modify": "2025-05-21 07:48:42", "date_publish": "2024-12-23 16:14:51", "description": "Thomas Frank press conference: Brighton vs Brentford preview", "filename": "sport_football_articles_ckgxkdv1zyro_1747813722.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1f7/live/1ea09b30-4909-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgxkdv1zyro_1747813722.html", "title": "Thomas Frank press conference: Brighton vs Brentford preview", "title_page": "Thomas Frank press conference: Brighton vs Brentford preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Frank confirmed that Ethan Pinnock will still be out for \"weeks\" with his hamstring injury, while Sepp van den Berg's issue is \"minor\" but the turnaround for Brighton is too short for both him and Mathias Jensen.\nHe also confirmed that Kristoffer Ajer will also be out for a number of weeks after picking up an ankle injury \"similar to Yoane Wissa's earlier this season\".\nOn if he is concerned by the growing number of injuries after struggling with them last season: \"What I will say is I have got a very strong starting XI on the sideline with players out. But it is part of football, we need to deal with it, we have no complaints about that.\"\nHe added: \"I think we have just been unlucky again. A pattern we would need to look into is if it is too many soft tissue injuries, then we would have to look into training and methods, but that is all good. We are now working on how to turn them around quickly.\"\nFrank joked that Mikkel Damsgaard is \"finally starting to listen to me\" when asked what has clicked for the midfielder this season, before continuing: \"I thought he was man of the match against Nottingham Forest. I thought he was the best player on the pitch. What I liked from that game was he said 'give me the ball, I will make things happen'. He was dangerous and very positive and creative. I'm really happy with that. Things do seem to have been clicking more.\"\nHe added: \"He has been built the past two years in the gym physically [after injuries] and he is in a good place, playing with confidence and we are now seeing the good player we hoped we had signed.\"\nThe Brentford boss said the defeat by Forest \"hurt a bit more\" after it ended their unbeaten run at home, but that it is \"a big credit to us that they changed formation because of us\".\nOn if they need to look to strengthen in January with Rico Henry and Aaron Hickey still out with long-term injuries: \"We are always looing into the transfer window where we can strengthen. It is a valid question on the full-backs. Of course we would like to have Rico and Hickey back as soon as possible but right now they are not. We showed last year we are not afraid to get loan payers in, so maybe we do that again. But, I'm not saying we definitely will do that, we will see in the next weeks.\"", "url": "https://www.bbc.com/sport/football/articles/ckgxkdv1zyro"}