{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:38:47", "date_modify": "2025-04-26 07:38:47", "date_publish": "2025-02-27 13:44:22", "description": "Dundee fan views on 2-1 defeat at Motherwell", "filename": "sport_articles_cz03lz1rvg3o_1745653127.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ab8/live/4ccac460-f451-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cz03lz1rvg3o_1745653127.html", "title": "Dundee fan views on 2-1 defeat at Motherwell", "title_page": "Dundee fan views on 2-1 defeat at Motherwell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked you for your thoughts on the 2-1 loss to Motherwell that leaves Dundee just three points off the bottom.\nHere's what some of you said:\nGary: We only change set-up after we've conceded a weak goal, again. Why not start that way when you know you need to protect your defence? That's the way we can be competitive but Tony Docherty doesn't seem to know how to pick the right team that can play that way. He continually gets his tactics wrong and has to react when we're already up against it.\nPageauds Tache: I don't even know where to start, I'm getting so frustrated. Tony, stop making the same old excuses. We are in serious trouble, and no amount of \"honest chats\" or \"home truths\" will fix it. Ship up or ship out. Any good credit you banked from last season is now bankrupt.\nBob: Dundee are going down. Docherty lives in cloud cuckoo land. \"If we perform like we did in the second half, we will be all right.\" Really?\nEven after being destroyed in the first half, 45 minutes is all you need? Dundee are the rehab team. Motherwell is the latest. Can't win? Need to get your season back on track? Play Dundee!\nGary: How long are we going to suffer this? We don't set up to protect an obviously porous defence? No team fears us now. Tactically unaware, reactive rather than proactive. Clueless and pointless. At this rate something surely has to change. Docherty is only dragging us down now.\nRaymond: The Dee are in freefall. I've sat through countless awful games with my grandson over the last couple of seasons and, when you hear Docherty's summary of these games, you wonder if you were at the same games that he refers to.", "url": "https://www.bbc.co.uk/sport/articles/cz03lz1rvg3o"}