{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:42:28", "date_modify": "2025-04-26 06:42:28", "date_publish": "2025-03-02 11:38:45", "description": "Wigan Athletic sack manager Shaun Maloney after defeat by Reading with the club 15th in League One.", "filename": "sport_football_articles_cq8y5xn9qyno_1745649748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2da6/live/5b25ab00-f759-11ef-b0ec-f990ca2ebe14.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8y5xn9qyno_1745649748.html", "title": "Shaun Maloney: Wigan Athletic sack manager after Reading defeat", "title_page": "Shaun Maloney: Wigan Athletic sack manager after Reading defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wigan Athletic have sacked manager Shaun Maloney after Saturday's 2-1 defeat by Reading.\nThat loss extended a run of just one win in seven games which has left the Latics 15th in League One, only six points above the relegation places.\nMaloney, a member of Wigan's FA Cup-winning team in 2013, was in charge for just over two years in a difficult spell for the club which included relegation from the Championship and a points deduction last season.\nBut this campaign has not gone as hoped, with the club citing \"disappointing\" home performances in a statement, external announcing the 42-year-old's departure, along with his assistant Max Rogers.\nFormer Republic of Ireland midfielder Glenn Whelan has been placed in interim charge, assisted by Graham Barrow and Frankie Bunn, for Tuesday's trip to Mansfield Town.\nMaloney will always have a special place in Wigan folklore for his part as a player in a famous escape from Premier League relegation in 2012 and, even more memorably, the year after, as the Latics won the FA Cup.\nIn fact, it was his corner which was headed in by Ben Watson as Wigan beat Manchester City at Wembley.\nSo it was a sentimental return to the club for the ex-Belgium assistant manager when he arrived in January 2023.\nBut with the club bottom of the Championship, he could not perform his own great escape act.\nHowever, in a very troubled period for the Latics in which players and staff were not paid on time and the team was deducted three points for that offence, Maloney received credit for how he handled the situation.\nThe club was taken over that summer by Mike Danson from the previous Bahraini ownership group, but Wigan began their League One campaign with an eight-point deduction.\nNonetheless, Maloney led them to a 12th-placed finish.\nBut with a clean slate this campaign, things have never really got going. Wigan are the lowest scorers in the division with only 31 goals from their 34 games.\nThose problems have been even more pronounced at the Brick Community Stadium with just five wins from 17 games and only 16 goals scored.\nAnd for a team with hopes of pushing for the play-offs, at no stage have they been in the top half all season, leading the Latics board to decide that \"it was time for a change\".\n\"It cannot be overlooked that the current League One campaign has clearly not progressed as anticipated,\" their statement said.\n\"Home results and performances, in particular, have been below the standard which our supporters expect.\"\nMaloney himself alluded to a lack of consistency all season in his final interview as Wigan boss after the defeat by Reading.\n\"There has not been much consistency within the squad and team selection,\" he told BBC Radio Manchester.\n\"We're definitely in a place where we could compete and beat anyone, but we're still in a place where anyone can beat us if we perform like we did in that first half.\"\nRobin Grey, BBC Radio Manchester\nThis news has come as a huge shock.\nTo some football fans, seeing Wigan in 15th in League One may seem as if they are underachieving.\nBut Shaun Maloney has been on the treadmill ever since he took over.\nHe came close to keeping them in the Championship after taking over from Kolo Toure when the club's existence was in serious jeopardy.\nLast season began with an eight-point deduction before a ball had been kicked but he still guided them to 12th place. Taking off the minus eight, they would have been in touching distance of the play-offs.\nThere's no doubt this season's disappointing home form and results have brought more scrutiny from some supporters.\nBut the majority had sympathy with Maloney after losing key players like Charlie Hughes and Thelo Aasgaard to Championship clubs, on top of some bigger earners also departing last summer.\nMaloney's success as a Wigan player and the difficult circumstances he's faced in much of his time in charge make this hugely surprising news.", "url": "https://www.bbc.co.uk/sport/football/articles/cq8y5xn9qyno"}