{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:28", "date_modify": "2025-05-21 06:32:28", "date_publish": "2025-03-31 16:58:49", "description": "Man Utd podcast. Nottingham Forest and Man City previews", "filename": "sport_football_articles_cj45dd7gw9lo_1747809148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1780/live/388273c0-0e3e-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj45dd7gw9lo_1747809148.html", "title": "Man Utd podcast. Nottingham Forest and Man City previews", "title_page": "Man Utd podcast. Nottingham Forest and Man City previews - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Manchester's Joe McGrath predicts Manchester United will draw with Nottingham Forest on Tuesday but beat rivals Manchester City in the derby on Sunday.\nThe Red Devils are unbeaten in four Premier League matches and are beginning to build some momentum under Ruben Amorim, with a Europa League quarter-final also upcoming against Lyon.\n\"It could be quite the season for Nottingham Forest with the FA Cup and Champions League qualification looking a real possibility, so it looks like we will just be in their way,\" he told the Devil's Advocate podcast.\n\"It's a huge month for Manchester United in April and I see it being a successful month. Forest might be one of those games in which we just draw.\n\"I say we beat City at the weekend and we would take a draw here.\n\"We're going up against a big side. Ruben Amorim has had time to hopefully work on a lot with a lot of his players not travelling so fingers crossed they come back with fire in their bellies and realise that April is huge.\n\"Forest played at the weekend and have got that momentum now. For a team to make a jump to the Champions League and go on an FA Cup run - there is that momentum which means more than a good training session.\n\"Or you could look at it as they might be knackered from Saturday and have their minds elsewhere and United can make the most of it and get the win.\n\"It will be interesting to see how much United have progressed because we lost to Forest at home earlier in the season.\"", "url": "https://www.bbc.com/sport/football/articles/cj45dd7gw9lo"}