{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:03:35", "date_modify": "2025-05-21 06:03:35", "date_publish": "2025-04-01 16:02:34", "description": "Everton news: David Moyes says team 'on a better trajectory'", "filename": "sport_football_articles_cx265jx1wg1o_1747807415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/24e1/live/422b6fa0-0f18-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx265jx1wg1o_1747807415.html", "title": "Everton news: David Moyes says team 'on a better trajectory'", "title_page": "Everton news: David Moyes says team 'on a better trajectory' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Moyes says the \"brilliant job\" his players have done since he rejoined Everton to replace Sean Dyche in January is behind the upturn in form.\nThe Toffees are on a nine-match unbeaten run - their longest sequence without defeat since February 2017 - with only five sides across Europe's big five leagues managing to also stay unbeaten during that period.\nMoyes has also transformed Everton's attacking output - scoring in nine successive league matches, having scored just one in the previous six.\n\"It [the stats] says that the club and certainly the team are on a better trajectory than we were before,\" he said.\n\"We've started really well. The players have done a brilliant job.\n\"There is a lot that can be said about a new manager coming in and I know it is our job to get them playing, but I have to say that the players have picked themselves right up, they have turned the whole place around - the crowd and the support - and they have gone on a run, which has been really good.\n\"Actually, we were a bit disappointed with a couple of the draws in there - that we didn't get victories.\n\"There might have been a couple of draws in there which we could have been a bit lucky with but, overall, I think the players have got everything they have deserved.\n\"They have got the results and we want to keep it going.\"", "url": "https://www.bbc.com/sport/football/articles/cx265jx1wg1o"}