{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 07:46:05", "date_modify": "2025-05-21 07:46:05", "date_publish": "2024-12-23 16:32:02", "description": "Sean Dyche press conference: Man City vs Everton preview", "filename": "sport_football_articles_c75wv2d25r3o_1747813565.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f68/live/40b1f600-490a-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75wv2d25r3o_1747813565.html", "title": "Sean Dyche press conference: Man City vs Everton preview", "title_page": "Sean Dyche press conference: Man City vs Everton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ashley Young's neck injury \"should settle down quite quickly\" but he is suspended for Saturday anyway and Dwight McNeil is still \"touch and go\" though Dyche thinks \"probably not for this one\".\nTim Iroegbunam and James Tarkowski are \"still a little bit away\" but are \"getting back on the grass\".\nDyche believes last week's takeover has already impacted the feel around the club: \"There was a good atmosphere before the game against Chelsea around the stadium. When things are uncertain people don't like that. The Friedkin Group have bought some stability. That is a start point.\"\nHe clarified his comments on Profit and Sustainability Rules in relation to the January transfer window: \"What I mean is there is still guidelines. It doesn't mean there is any trouble there. There are rules every club have to stay inside of. It is not specific, there is no trouble or anything like that. There just will not be endless money for every situation. There is no problem.\"\nDiscussing whether additions are expected, Dyche said: \"It is still going to be tough. The guidelines and what the club are suggesting - we will still have to be quite guarded. We can't throw money but I don't think this group will do that anyway. They want to build something. Their words are stability.\"\nOn opponents Manchester City and their recent difficult run: \"When the details are not right, things don't work even for the top teams. It's unlikely Pep [Guardiola] has had many spells like this and it happens even to the best and he is the best ever. For him to have a testing period shows how tough the game is and for the top sides to stay at the very top.\"", "url": "https://www.bbc.com/sport/football/articles/c75wv2d25r3o"}