{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:26:22", "date_modify": "2025-05-21 06:26:22", "date_publish": "2025-04-01 10:06:31", "description": "Before Nottingham Forest host Manchester United on Tuesday, BBC Sport speak to Serbia defender Nikola Milenkovic and his idol Nemanja Vidic.", "filename": "sport_football_articles_c9818e2187do_1747808782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c1f9/live/f27b4de0-0e13-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9818e2187do_1747808782.html", "title": "Nikola Milenkovic and Nemanja Vidic: Serbia defenders on comparisons and Nottingham Forest success", "title_page": "Nikola Milenkovic and Nemanja Vidic: Serbia defenders on comparisons and Nottingham Forest success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Serbian central defender starring at Old Trafford is bound to trigger comparisons with Manchester United legend Nemanja Vidic.\nIn December, Nikola Milenkovic scored in the second minute to help Nottingham Forest to a 3-2 win over United and record their first victory at Old Trafford in almost 30 years.\nOn Tuesday, third-placed Forest host United, who sit in 13th, in the return game and BBC Sport asked both players about the obvious similarities.\n\"It is natural,\" Vidic told BBC Sport. \"Maybe I set the bar higher for defenders. But the bar I put there is to be broken.\n\"The new generation from Serbia will look at the way I played, but their target is to do better than I did in my career.\"\nVidic won five Premier League titles, three FA Cups, a Champions League and a Club World Cup with United. Individually, he was twice named Premier League player of the year – only Kevin de Bruyne, Cristiano Ronaldo and Thierry Henry have also achieved that – and was named in the top flight's team of the year on four occasions.\nMilenkovic, who has previously described Vidic as his childhood \"idol\", knows he almost certainly won't achieve all that in his career.\nBut playing a starring role in taking Forest into the Champions League would be \"an incredible thing\", the 27-year-old told BBC Sport.\nOn the Vidic connection, he said: \"He set the standards for defenders in Serbia. He is our best player ever and I grew up watching the videos of his games.\n\"It was his leadership on the pitch and the way he played. He was willing to sacrifice for other players, to do everything not to concede a goal, to live for a clean sheet. This is what I took from him.\n\"Also, his reading of the game was very good. He was a very intelligent player and really aggressive on the pitch.\"\nVidic has never met Milenkovic but followed his fortunes, initially as a youngster with Partizan Belgrade and then seven seasons in Serie A with Fiorentina before he joined Forest in a £12m deal last summer.\nMilenkovic has been nominated for the Premier League's player of the month for March, alongside Forest's progression to the FA Cup semi-final.\n\"He is a great representative for Serbian football,\" said Vidic. \"He is a great example for how players should behave and work hard to try and succeed and maintain their careers.\n\"He likes to defend and has improved a lot in terms of the tactical side because he played in Italy.\n\"It is not fair to compare [with me]. He has his own abilities and has a good career. He is 27 and for a defender that is still young.\n\"It is good to say 'when I was young, Vidic was the target I wanted to aim for'. But players should push themselves to go even higher than their idols and the people they are being compared to.\n\"He is 27. I came to England when I was 24 or 25. He has much more to give.\"", "url": "https://www.bbc.com/sport/football/articles/c9818e2187do"}