{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 06:52:20", "date_modify": "2025-05-21 06:52:20", "date_publish": "2025-03-29 19:32:05", "description": "Dungannon Swifts beat Bangor 2-0 in their Irish Cup semi-final at Seaview to book a place in the May decider against Cliftonville.", "filename": "sport_articles_cm2n2dgz9vwo_1747810340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1f83/live/7a66ab60-0cdd-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cm2n2dgz9vwo_1747810340.html", "title": "Irish Cup: Dungannon beat Bangor to book place against Cliftonville in final", "title_page": "Irish Cup: Dungannon beat Bangor to book place against Cliftonville in final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dungannon Swifts booked their place in this season's Irish Cup final by beating Bangor 2-0 in their semi-final at Seaview on Saturday.\nKyle Owens' 17th-minute own goal and Dean Curry's 82nd-minute header ensured that the Stangmore Park outfit will face Cliftonville in the showpiece decider on 3 May.\nBangor defender Owens headed into his own net as he attempted to clear the ball to safety after Andy Mitchell had lobbed the ball over advancing goalkeeper James Taylor.\nSwifts captain Curry doubled the lead when he was left unmarked to head the ball home from Kealan Dillon's corner.\nThe Swifts will be playing in only their second Irish Cup final, having lost to Linfield in a penalty shootout on their only previous appearance in 2007.\nManager Rodney McAree guided Dungannon to League Cup success in 2018 and their progression to face the Reds at the start of May represents another high point of an outstanding season which also sees them sit in a lofty fourth position in the Premiership table with five rounds of post-split fixtures remaining.\nChampionship leaders Bangor had caused a major upset at the last-eight stage as they defeated Glentoran 3-1 at their Clandeboye Park home but they were unable to repeat the dose against Dungannon.\nOwens' own goal had them on the back foot early on, although later in the first half Ben Arthurs headed narrowly wide and then at the start of the second 45 Reece Neale had a well-struck free-kick held by Declan Dunne at the second attempt.\nThe second period proved to be a much more frantic affair and while the Seasiders, having the wind in their favour, enjoyed their fair share of possession, it was their top flight opponents who created the more clearcut chances.\nMitchell could only find the side-netting after meeting Adam Glenny's delivery from the left at the back post.\nJohn McGovern's low left-foot shot was well saved by James Taylor with his legs and Mitchell fired over the bar from six yards out.\nFor Bangor, Jack O'Mahony saw his shot blocked by defender Danny Wallace.\nCurry's headed goal gave McAree's side some breathing space and substitute Tomas Galvin went close to extending the advantage moments after entering the fray when his long-range drive cannoned off the post.\nDisappointment then for Bangor who were left to rue the absence of experienced suspended players Robert Garrett and Tiarnan Mulvenna, cup-tied defender Jack Reilly and goalkeeper Patrick Solis Grogan, who was not permitted to face his parent club.\nThe north Down side had previously won the competition when they saw off near neighbours Ards after a second replay in 1993 and then reached the final again 12 months later, going down to Linfield.\nLee Feeney's charges will now concentrate on securing promotion to the Premiership as they enjoy an eight-point lead at the top of the league standings in the second tier.", "url": "https://www.bbc.com/sport/articles/cm2n2dgz9vwo"}