{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 06:48:43", "date_modify": "2025-05-21 06:48:43", "date_publish": "2025-03-28 21:14:45", "description": "Former Australia batter Stuart Law is appointed as Nepal's new head coach.", "filename": "sport_cricket_articles_cdrx8e421jgo_1747810123.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4739/live/f0a67520-0c16-11f0-baa1-f7cf5f55c93a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cdrx8e421jgo_1747810123.html", "title": "Stuart Law: Former Australia batter appointed as Nepal head coach", "title_page": "Stuart Law: Former Australia batter appointed as Nepal head coach   - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Australia batter Stuart Law has been appointed as Nepal's new head coach on a two-year contract.\nThe Cricket Association of Nepal (CAN) had been searching for a new coach for their men's side since parting ways with Monty Desai in February.\nDesai guided Nepal to last year's T20 World Cup but CAN decided against renewing the 50-year-old Indian's contract.\nLaw, 56, got the job ahead of West Indies legend Shivnarine Chanderpaul, experienced former Sri Lanka coach Dav Whatmore and ex-India batter Wasim Jaffer, who were all shortlisted.\nLaw was most recently in charge of the United States but was sacked by USA Cricket six months into a three-year contract in October.\nDuring Law's tenure USA completed one of the biggest shocks in cricket history at the T20 World Cup by beating Pakistan in Dallas, and went on to qualify for the Super 8s.\nLaw, who played 54 one-day internationals and one Test for Australia, has previously coached Sri Lanka, Bangladesh, West Indies, Afghanistan and Middlesex.\nNepal face Scotland and the Netherlands in Cricket World Cup League 2, a tournament which forms part of the qualification process for the 2027 50-over World Cup, in June.", "url": "https://www.bbc.com/sport/cricket/articles/cdrx8e421jgo"}