{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:21:51", "date_modify": "2025-04-26 06:21:51", "date_publish": "2025-03-04 00:00:00", "description": "Leyton Orient's poor run continues as they lose 1-0 at Rotherham to fall further behind in the race for the League One play-offs.", "filename": "sport_football_live_c6255kg15lkt_1745648511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d82e/live/44549140-f5ea-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c6255kg15lkt_1745648511.html", "title": "Rotherham United 1-0 Leyton Orient", "title_page": "Rotherham United 1-0 Leyton Orient - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leyton Orient's poor run continued as they lost 1-0 at Rotherham to fall further behind in the race for the League One play-offs.\nA second-half own goal from Jayden Sweeney ensured a fourth loss on the bounce for Richie Wellens' side and left them five points off the top six.\nOrient's Dan Agyei threatened twice in the opening stages but only once forced a routine save from Rotherham goalkeeper Dillon Phillips.\nJosh Keeley's first save at the other end came when Mallik Wilks muscled his way into the box and drove in a low shot.\nAgyei's menacing run almost ended in the opener before the break but his shot spiralled up off Hakeem Odoffin and forced Phillips to readjust to keep out.\nRotherham could have gone in front from a long ball which fell to Sam Nombe but his effort was tame and kept out by Keeley.\nThe deadlock was finally broken in the 60th minute when a corner fell the way of Louie Sibley and his effort took a deflection off Sweeney on its way into the bottom corner.\nOrient should have earned a point when Jamie Donley flicked the ball into Charlie Kelman's path but he lashed over the crossbar from close range.", "url": "https://www.bbc.co.uk/sport/football/live/c6255kg15lkt"}