{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:46", "date_modify": "2025-05-20 14:43:46", "date_publish": "2023-07-28 11:31:30", "description": "'Johnson should refund the fans that travelled'", "filename": "sport_articles_cedek7qvl2eo_1747752226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea6f/live/7761d9e0-2d27-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cedek7qvl2eo_1747752226.html", "title": "'Johnson should refund the fans that travelled'", "title_page": "'Johnson should refund the fans that travelled' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you for your views following Hibs' shock defeat in Andorra last night.\nHere's a selection of what you said:\nGeorge: Dearie Me, that was grim. Even the basics were absent at times. Sure, it was hot, dry bumpy pitch, but surely, we can pass, move, pass, etc? Nope, apparently not. D'Escaldes were poor. Ref didn't help as they played 90 minutes in a robust style and he never got to grips with them. Nor did Hibs. Some real worrying basic errors too that cost us. Hmm.\nAnon: Just appalling! I’d say they didn’t look as if they’d played as a unit before, but it was worse than that! They looked as if some of them had never played football before!! Utterly disjointed, totally lacking in cohesion and the ability to play simple passes to one another. Shameful.\nAnon: Lee Johnson brings the pressure on himself. He should be made to refund the supporters who paid good money to go and watch this shocking display by his team that he put on the park. Drop Marshall and put Boruc in goal. Substandard results for years now have been Hibs' downfall and will continue till players are proud to wear a Hibs strip.\nKen: My team have plunged to new depths since I started attending games in 1968. Difficult to find a positive from this abysmal display. New goalkeeper on the bench, new midfielder replaced at half time and the only tactic appeared to be pumping long balls into the box as ball retention was not good enough. Going to be a very long season without further additions.\nAnon: Johnson has learned nothing in the close season. He is clueless and should be kicked out\nMartin: Embarrassing and gutless", "url": "https://www.bbc.com/sport/articles/cedek7qvl2eo"}