{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:03:05", "date_modify": "2025-05-21 04:03:05", "date_publish": "2025-04-04 06:47:03", "description": "Chelsea 1-0 Tottenham: What Ange Postecoglou said", "filename": "sport_football_articles_c24qn1nzd5jo_1747800185.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b06/live/71b73ad0-111e-11f0-b9d8-bd74da7b5dce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c24qn1nzd5jo_1747800185.html", "title": "Chelsea 1-0 Tottenham: What Ange Postecoglou said", "title_page": "Chelsea 1-0 Tottenham: What Ange Postecoglou said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham boss Ange Postecoglou, speaking to Sky Sports after Thursday's 1-0 defeat at Stamford Bridge: \"A difficult night, a tight game and not an easy place to come. We had to work hard to stay in the game. We let in a disappointing goal then fought our way back into the game but weren't able to get anything out of it.\n\"It is still a work in progress. In the final third, we could've been a bit cleaner with our football but for the most part we handled it quite well.\n\"It's a tough ask coming here, there was still enough there tonight to show the lads are getting back to the level we need.\"\nOn the intervention of VAR after it ruled out a Pape Matar Sarr equaliser: \"It's killing the game mate, it's not the same game it used to be.\n\"You are standing around for 12 minutes. It's just killing the game, but no-one cares about that - they just love the drama and controversy and I'm sure there will be 24 hours' discussion about it and that's what everyone wants. They're not really interested that it's killing the spectacle of the game.\n\"If a referee sees that and he needs to see it for six minutes, what's clear and obvious about it?\"\nOn claims he cupped his ears towards Spurs fans: \"Oh, jeez mate. It is incredible. We just scored - I wanted to hear them cheer, I wanted them to get excited. I wanted to win the game with the momentum - it wasn't the first time my substitution was booed.\n\"I am at some disconnect with the world these days - I don't know. Maybe you are right.\"", "url": "https://www.bbc.com/sport/football/articles/c24qn1nzd5jo"}