{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:33:26", "date_modify": "2025-05-20 13:33:26", "date_publish": "2023-07-25 07:16:13", "description": "Arsenal defender Kieran Tierney admits his future is out of his hands, Ridvan Yilmaz wanted in Turkey, plus more.", "filename": "sport_football_66292431_1747748006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/113DC/production/_130502607_-9367ad9b-8986-4d90-b204-017769293ccf.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66292431_1747748006.html", "title": "Scottish football transfers: Tierney, Yilmaz, Doig, Forrest, Cifuentes, Kent", "title_page": "Scottish football transfers: Tierney, Yilmaz, Doig, Forrest, Cifuentes, Kent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal defender Kieran Tierney admits his future is out of his hands, with Celtic keen to bring the Scotland left-back back to Glasgow after he dropped behind Oleksandr Zinchenko at Emirates Stadium. (TalkSport), external\nRidvan Yilmaz - who joined Rangers from Besiktas for about £5m 18 months ago - is a target for Turkish Super lig side Fenerbahce this summer. (Fotosport via Scottish Sun), external\nHibernian could miss out on £1.4m if Josh Doig joins Torino from Hellas Verona in a swap deal rather than a transfer, which could negate the 27.5% sell-on clause the Edinburgh club inserted in his deal last summer. (Football Scotland), external\nAberdeen are to make changes to Pittodrie that could slash away attendances from around 1,700 to anything as low as 300. (Press & Journal), external\nJames Forrest knows Brendan Rodgers got the best out of him in his first stint as Celtic boss - but the winger feels he still has to prove himself all over again. (Daily Record), external\nRangers are set to pay a fee and sign Los Angeles player Jose Cifuentes immediately after initially agreeing a pre-contract with the Ecuador midfielder. (The Athletic), external\nHeart of Midlothian beat off late competition from a Scottish Premiership rival to sign centre-back Frankie Kent from Peterborough. (Edinburgh Evening News), external\nManager Barry Robson says Aberdeen are \"down the line\" with more signings as he looks to build a squad ready to perform in Europe. (Sky Sports), external\nRangers target Danilo, who moved to the Netherlands in 2017, is set to switch nationalities and represent his home of six years instead of his birthplace Brazil. (Scottish Sun), external\nFormer Celtic midfielder Jiri Jarosik - who spent two years at Parkhead after he was signed in 2006 for £2m - has launched a scathing attack on Scottish football and says it is lagging 30 years behind England. (Scottish Sun), external\nEx-Rangers and Motherwell forward Ross McCormack has been named player and director of football by English eighth-tier club Liversedge - after two years out of the game since leaving Aldershot Town. (Football Scotland), external\nKyle Vassell has embraced his new role as Kilmarnock captain after a pep talk from his girlfriend. (The Herald), external", "url": "https://www.bbc.com/sport/football/66292431"}