{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:42", "date_modify": "2025-05-21 06:58:42", "date_publish": "2025-03-29 10:55:49", "description": "Northampton Saints boss Phil Dowson hails Henry Pollock as a \"world-class\" talent following the back row's brilliant try against Sale Sharks.", "filename": "sport_rugby-union_articles_cn040nklg53o_1747810722.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/67ca/live/1855d4e0-0c84-11f0-b6c2-a58dae0af4a0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn040nklg53o_1747810722.html", "title": "Henry Pollock: Northampton Saints star hailed as \"world-class\" after Sale try", "title_page": "Henry Pollock: Northampton Saints star hailed as \"world-class\" after Sale try - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northampton Saints boss Phil Dowson hailed Henry Pollock as a \"world-class\" talent following the back row's brilliant try against Sale Sharks.\nThe 20-year-old collected his own chip over Sale scrum-half Gus Warr to touch down and make the score 17-17 - but Saints eventually lost 27-24.\nPollock scored twice on his England debut against Wales during the Six Nations and is now being spoken of as a possible for the British and Irish Lions tour to Australia in the summer.\n\"He has that ability to both change the game and inspire the people around him,\" director of rugby Dowson told BBC Radio Northampton.\n\"He can do things others can't do - yes, [he is] world-class.\"\nEngland wing Tommy Freeman, who added a try to the five he scored during the Six Nations, described his young team-mate as \"different gravy\".\nDespite their efforts, the 2024 Premiership champions suffered their eighth defeat in 13 league games this season and are 11 points adrift of the play-off places with five left to play.\n\"We showed a lot of heart and wanted to do that after last week's game [a 33-0 home loss to Leicester Tigers] - there are some things to take away that are pretty positive,\" Freeman added.\n\"As the game opened up, we moved the ball and started to play how we wanted to play, we asked questions and created some tired legs for them, and it felt we were in the drivers' seat.\n\"But a few errors and some penalties we gave away, and they managed to get the scoreboard [moving]. It kind of cost us, so we'll get back to the drawing board and be excited for Clermont in a different competition next week.\"\nThe last 16 European Champions Cup tie against Clermont Auvergne on Friday now assumes even greater significance for Saints in their quest to add further silverware this season.\n\"They're all massive games [now] - this was a huge game as well - and we've got to make sure we continue to work hard in training and give ourselves the opportunity to be better than we were tonight,\" Dowson said.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn040nklg53o"}