{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:52:16", "date_modify": "2025-04-26 03:52:16", "date_publish": "2025-03-03 10:30:32", "description": "Mack Hansen agrees a new two-year deal with the Irish Rugby Football Union while lock Joe McCarthy signs a three-year contract extension.", "filename": "sport_rugby-union_articles_cqly2gx240yo_1745639536.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7d9b/live/6a6dc940-f81b-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cqly2gx240yo_1745639536.html", "title": "Mack Hansen: Wing commits to Ireland and Connacht until end of 2026-27 season", "title_page": "Mack Hansen: Wing commits to Ireland and Connacht until end of 2026-27 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mack Hansen has agreed a new two-year contract with the Irish Rugby Football Union which commits his future to Ireland and Connacht until the end of the 2026-27 season.\nThe Australian native, 26, joined Connacht as an Irish-qualified player in 2021 and has earned 27 Ireland caps since making his international debut in February 2022.\nThe wing was nominated for World Rugby Breakthrough player of the year award in his debut season at Test level and his international try tally now stands at 12.\n\"Since moving to Ireland, I have loved my time and I'm delighted to sign this new contract,\" said Hansen.\n\"I'd like to thank the IRFU for putting their faith in me and I'm hugely excited about the future.\"\nLock Joe McCarthy, meanwhile, has agreed a contract extension with the IRFU which will extend until the end of the 2027-28 season.\nIRFU performance director David Humphreys described Hansen \"as a mainstay of the Ireland and Connacht sides in recent years\".\n\"Securing Mack's signature over the coming season is a huge boost for Irish rugby. He is a proven performer, someone who wears his heart on his sleeve and delivers on the big occasion,\" added Humphreys.\nHansen helped Ireland clinch the Six Nations Grand Slam in 2023 and is part of the squad attempting to achieve that feat once again this season.\nSecond row McCarthy, 23, made his Ireland debut in November 2022 and his 17 international caps have included helping his country win last year's Six Nations title.\n\"I have loved playing for my home province and representing my country is a huge honour which means the world to me,\" said the Leinster lock.\nIreland's Six Nations campaign will continue on Saturday in the home contest against France.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cqly2gx240yo"}