{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 15:28:30", "date_modify": "2025-05-19 15:28:30", "date_publish": "2017-07-15 13:15:10", "description": "Lewis Hamilton sends the Silverstone crowd wild with a storming lap to set pole position at the British Grand Prix.", "filename": "sport_formula1_40619287_1747668510.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BECC/production/_96944884_hamitlon.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_40619287_1747668510.html", "title": "Lewis Hamilton storms to record British Grand Prix pole position", "title_page": "Lewis Hamilton storms to record British Grand Prix pole position - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Hamilton sent the Silverstone crowd wild with a storming lap to set pole position at the British Grand Prix by more than half a second.\nHe also equals the record for pole positions at the British Grand Prix with five - alongside Jim Clark.\nThe Mercedes driver was 0.547 seconds quicker than Ferrari's Kimi Raikkonen with his title rival Sebastian Vettel only third, a massive 0.756secs adrift.\nHamilton's team-mate Valtteri Bottas was fourth quickest but will start ninth after a five-place grid penalty.\nIt is the perfect start to a weekend on which Hamilton knows he needs to win.\nThe Briton is 20 points behind Vettel heading into the race and has said he wants to use this weekend to get his season back on track.\nHis performance was the perfect riposte to criticisms of his decision to miss the F1 demonstration in London on Wednesday.\nHamilton was the only driver not to attend the event in Trafalgar Square, a decision he said was based on making sure he was as prepared as he could be for his home race.\n\"I needed to make sure I got that lap in,\" he said. \"I didn't do it last weekend.\" That was a reference to his qualifying third in Austria last week, which meant he started eighth following a gearbox penalty for the same reason as Bottas has his rather than eighth.\nAs for the race, he said the car had been quick in practice in race trim, adding: \"I need to do it for these guys,\" gesturing at the crowd.\nHamilton was bubbling with enthusiasm about his Mercedes' performance around the high-speed corners of Silverstone.\nThere had been speculation before the weekend that Copse corner would be flat-out, but Hamilton said it was actually quicker to have a small lift and take it in seventh gear.\nBut he added that the faster, more demanding 2017 cars meant that part of the middle left-hander of the Becketts complex that follows Copse was flat-out when it never had been before.\nHe said: \"You can take Copse flat in eighth but it is not necessarily quicker - you scrub a lot of speed off and the rpm drops off too much. I don't personally take it flat.\nThere was an unfamiliar sight in first qualifying, when Fernando Alonso made a late call to switch to slick tyres right at the end, only just made it around to start a final lap and ended the session fastest of all after a superb lap.\nOnly one other driver did the same - Force India's Esteban Ocon - and he was more than two seconds slower than Alonso.\nThe Spaniard, who has a 30-place grid penalty for using too many engine parts, did not make it through into final qualifying, ending up 13th. Alonso will start from the back.\nBut the good news for McLaren continued as team-mate Stoffel Vandoorne out-qualified the two-time champion for the first time this season and snuck through into the top 10 shoot-out as the last man in Q2.\nThe highly rated Belgian, who for the first time has shown the form expected of him, qualified ninth, sneaking ahead of Haas' Romain Grosjean with his final lap.", "url": "https://www.bbc.com/sport/formula1/40619287"}