{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-19 15:23:49", "date_modify": "2025-05-19 15:23:49", "date_publish": "2015-02-09 21:53:55", "description": "Former Lions player Stephen Ferris fully expects Ireland to beat France but is not \"100% sure\" they will win the Six Nations.", "filename": "sport_rugby-union_31327141_1747668229.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80895000/jpg/_80895321_jsexton.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31327141_1747668229.html", "title": "Six Nations 2015: Ferris fully expects Ireland to beat France", "title_page": "Six Nations 2015: Ferris fully expects Ireland to beat France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Lions player Stephen Ferris says he fully expects Ireland to beat France in Saturday's Six Nations game in Dublin but admits he is unsure if they will go on to win the tournament.\nThe Irish began their campaign with a 26-3 victory over Italy in Rome.\n\"Every single person in that Ireland squad sitting at Carton House will be expecting to beat France,\" said Ferris.\n\"I'm not 100% sure they'll win the Six Nations but they're in with a great shout. The England game is pivotal.\"\n\"It's all about getting momentum going and before you know it you can be in the running for a Grand Slam. Everyone wants to go into the World Cup with some level of consistency and it's about developing a winning habit.\n\"You never know which France team is going to turn up, but they seem well drilled and it's going to be a tough game.\n\"It wasn't an amazing Ireland performance against Italy and they need to up the ante, but with Johnny Sexton and perhaps a few forwards coming back to get the pack going forward, I can't see anything other than an Ireland win,\" added the former Ulster back-rower.\nFerris added that he believes the return of Racing Metro number 10 Sexton at fly-half after a concussion stand-down will make the Irish a \"totally different proposition\".\n\"In terms of place kicking Ian Keatley did very well against Italy, but in terms of game management, Jonny brings that little bit more quality and he knows what the Head Coach, Joe Schmidt, expects of him.\n\"Ian maybe doesn't completely understand that yet, though it will probably come. He was under a lot of pressure and did a good job in Rome but Johnny is one of the best fly-halves in the world.\n\"Joe said after the game that the team performed at 60-70% and if they had played like that against England or Wales they would have lost, so there's still at lot to work on.\"\nThe retirement of Brian O'Driscoll has left a major void in the Ireland back-line, but the 35-times capped international believes one of his former Ulster team-mates could challenge present first-choice incumbents Jared Payne and Robbie Henshaw for a place at centre.\n\"Darren Cave is possibly the in-form centre in European rugby and he didn't even make the match-day squad at the weekend.\n\"Then you look at Jared and Robbie, the way they played in the autumn internationals, and they deserved their call back into the team.\n\"Hopefully Darren will get a shout at some stage and with the World Cup round the corner he might sneak in there.\n\"The centre pairing are doing well, not doing anything unbelievably well, but not doing anything unbelievably wrong, which is most important.\"\nFerris adds that the Irish have a wealth of options in the back row, of which he used to be such an important part.\n\"People thought when I retired you had the likes of Peter O'Mahony coming in with not a lot of experience, but now you look at him and he's the Munster captain and is probably going to be a future Lion.\n\"Jamie Heaslip is a world class number eight and Tommy O'Donnell is sticking his hand up, but I think Chris Henry has a massive part to play in the World Cup and he brings something completely different to the other guys, turning over ball, holding up ball and disrupting the opposition.\n\"Some players might be able to run with the ball over the top of people but you're not going to do that against the All Blacks.\"\nLike members of the present squad, the ex-Ulster forward says the appointment of Joe Schmidt has played a huge part in the Irish side's upturn in fortunes over the last 18 months.\n\"I didn't work with Joe that much because I was injured but he's somebody I've kept in touch with - I'd send him a text before big games and he'd reply.\n\"He's the Ireland coach and doesn't have to reply to 'an old has-been' but that's the kind of guy he is.\n\"He earns the respect of the people he works with, the guys love him, and his attention to detail is something crazy.\n\"The players enjoy it and the reason they enjoy it is because they are winning. It's all down to great performances and a good coaching team.\"\nFerris agrees with Schmidt's post-match observations that England set the benchmark with their display in defeating Wales and anticipates a potentially \"winner-takes-all\" encounter against Stuart Lancaster's side on 1 March.\n\"What England did at the Millennium Stadium was to beat Wales at their own game, starting with the mind games before the start of the match. That kind of turned the tables and said 'this is what we are going to do'.\n\"Everyone likes to see England lose but I like to see Warren Gatland lose even more. To see England win at the Millennium Stadium was good to see.\n\"Ireland against England in Dublin promises to be a humdinger and there won't be a ticket in sight if both sides keep winning ahead of that game.\"", "url": "https://www.bbc.com/sport/rugby-union/31327141"}