{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:37", "date_modify": "2025-05-21 06:51:37", "date_publish": "2025-03-30 00:00:00", "description": "Follow live text commentary & score updates of Manchester Utd host Everton plus five other fixtures from the WSL.", "filename": "sport_football_live_cjevkjee327t_1747810297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/819b/live/70d49d50-0d8c-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cjevkjee327t_1747810297.html", "title": "WSL LIVE: Chelsea v West Ham plus five other fixtures", "title_page": "WSL LIVE: Chelsea v West Ham plus five other fixtures - listen, score & text - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's all for today's WSL live text.\nThanks for joining us, we hope you enjoyed the goals and action as much as we did.\nDo come back and join us over the international break as we continue build up to this summer's Euros in Switzerland.\nIf not catch you on 12th and 13th April for FA Cup semi final weekend or the following week when the WSL returns.\nBye for now!\nTable talk\nHere's what today's results mean for the WSL table...\nChelsea's shock draw at home to West Ham (after being two goals up) sees Arsenal and Manchester United move to within six at the top of the table.\nMan City are 7 points further back from those two in the race for Champions League.\nAston Villa's huge late win at Liverpool means that they climb four points clear of rock bottom Crystal Palace, who saw another heavy defeat compounded by being cut adrift in the relegation spot.\nWest Ham leapfrog Everton into 7th place after their point at Kingsmeadow.\n'We need to look at the bigger picture'\nFT: Chelsea 2-2 West Ham\nChelsea\nChelsea manager Sonia Bompastor speaking to Sky Sports: \"I think we had a dominant first half and especially the first 30 minutes. We created a lot of opportunities. I think the performance in the second half was not enough for us to get a result.\n\"This block of fixtures has been crazy. Eight games in 28 days, we travelled a lot, we played sometimes four games in a row against City where the players left everything on the pitch. It is hard to have all the energy but at Chelsea we have enough depth and quality to finish this block of fixtures with a better result. I think we conceded too many situations defensively but when you look at the bigger picture, we are six points ahead of the second-placed team and I think every team would wish to be in our position.\n\"I think the spaces today were in the outside corridors and sometimes we forced too much inside but we will reflect and see where we can improve. Disappointing result but we need to stay positive. We are in a good position for all competitions we are challenging in and we need to stick together and remain positive.\"\n'We are frustrated'\nFT: Chelsea 2-2 West Ham\nChelsea\nChelsea attacker Aggie Beever-Jones speaking to Sky Sports: \"I think the first half we were really strong and sometimes it comes down to switching off. We have ad a busy month and against teams like West Ham you can't make mistakes. I think in the second half we could have came out with more fight and we unfortunately dropped our Chelsea standards.\n\"At Chelsea we have so many players who are ready. We have games every few days and it is frustrating right now. The international break we can reflect on it and get back to our standards. Annoying to let them get back into the game and yeah, we will analyse it and see where we can improve.\n\"I think whenever we concede we are not happy with it. It is frustrating right now and we have to analyse where we are and make sure we are better. I think we could have come out and got the third goal and I think that would have killed the game off. I think West Ham are in great form at the moment and we need to work on what we need to do better.\n\"The first 30 minutes we played some quality football and could have had more goals and it is about being more clinical to create a bigger gap in the game. It is frustrating to hear the goal was offside because it shouldn't have been allowed effectively but they had the momentum and we need to nullify that better.\"\n'We want to get as high up the table as we can'\nFT: Chelsea 2-2 West Ham\nWest Ham United\nMore from West Ham boss Rehanne Skinner on what success looks like for her: \"It's all about our performances because that generates the points and the outcomes. In the last four games, we have to deliver each week. We want to get as high up the table as we can. We want to beat the next team and the next team is Manchester United and that's what we are focussed on.\n\"We've got to keep growing and growing. All we can really do is make sure that every game which comes in front of us, we are competitive. The budgets are significantly different between the top four and everyone else but we want to keep pushing and driving forward.\"\n'Delighted with the point'\nFT: Chelsea 2-2 West Ham\nWest Ham United\nWest Ham boss Rehanne Skinner speaking to Sky Sports: \"I'm delighted with the character and the way that the team has gone about the game. The squad depth has improved and we are prepared to battle all the way until the end. The confidence has grown so much in the team and we are getting late goals in the games. I'm delighted with the point to be honest.\nOn why the form has improved since January: \"We've been building the team and the quality of the squad. We got a lot of players in September and it took time for the team to gel. Now we are in a position where we are able to get results. There is just a belief and we have lots of people who can put the ball in the back of the net which makes the difference when you don't have to rely on one individual.\"", "url": "https://www.bbc.com/sport/football/live/cjevkjee327t"}