{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:39:59", "date_modify": "2025-05-21 04:39:59", "date_publish": "2025-01-18 00:00:00", "description": "Leon Goretzka scores twice as Bayern Munich held on against Wolfsburg to go seven points clear at the top of the Bundesliga table.", "filename": "sport_football_live_c203n71w4let_1747802399.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c203n71w4let_1747802399.html", "title": "Bayern Munich 3-2 Wolfsburg: Leon Goretzka scores twice for Bundesliga leaders", "title_page": "Bayern Munich 3-2 Wolfsburg: Leon Goretzka scores twice for Bundesliga leaders - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leon Goretzka scored twice as Bayern Munich held on against Wolfsburg to go seven points clear at the top of the Bundesliga table.\nVincent Kompany's side took a 20th-minute lead when Goretzka struck from 25 yards into the bottom left-hand corner for his second league goal of the season.\nWolfsburg levelled within four minutes, though, as Algeria international Mohamed Amoura netted after a well-worked set-piece routine.\nBut Michael Olise, a £45m signing from Crystal Palace last summer, put Bayern back in front six minutes before the break with his 10th goal of the season when Wolfsburg goalkeeper Kamil Grabara spilled the France international's long-range effort.\nJoshua Kimmich thought he had given them a two-goal advantage at half-time but his effort from Kingsley Coman's cross was ruled out for handball.\nBayern did go 3-1 up in the 62nd minute when Goretzka struck his second of the afternoon just after the hour mark, heading Olise's free-kick into the bottom corner.\nWolfsburg ensured a nervy finish for the league leaders when Amoura, on loan from Belgian side Union Saint-Gilloise, scored his second with two minutes left of normal time.", "url": "https://www.bbc.com/sport/football/live/c203n71w4let"}