{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:42:33", "date_modify": "2025-05-21 06:42:33", "date_publish": "2025-03-29 00:03:39", "description": "Celtic 1-2 Glasgow City: What did the manager say?", "filename": "sport_articles_c62x2wdx2xyo_1747809753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dbc0/live/527ccec0-0c30-11f0-bdd1-0b3343d6d115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62x2wdx2xyo_1747809753.html", "title": "Celtic 1-2 Glasgow City: What did the manager say?", "title_page": "Celtic 1-2 Glasgow City: What did the manager say? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic head coach Elena Sadiku: \"The [small] margins in the game cost us.\n\"Brenna Lovera scores a goal that is not a shot, and then the set play, again, a situation where we can't clear the ball.\n\"I said it to the players, I'm proud of how they fought tonight and how they bounced back in the performance-wise.\n\"We fought really hard to get the goal in. We created some half chances that we need to deal with better. I don't think that Glasgow City is a lot in our box, to be fair.\n\"But it's just this season and these last games, it's just been post-out. It just feels like we need some luck, like we need something just to give us something in terms of margins.\n\"It's so harsh, it hurts so much, but I said to the players, I was really proud of how they took the tactical changes and how they fought so hard for each other.\n\"It's never beyond our reach. I think it's still eight games left, there's 24 points to play for. I said to the girls, we have an international break now, we have training tomorrow morning.\n\"We're going to fight hard because we can't surrender.\n\"We need to keep going and we need to keep pushing hard and that's what exactly we're going to do against Rangers.\n\"We're going to show up as a team again and we're going to fight really hard for those three points.\"", "url": "https://www.bbc.com/sport/articles/c62x2wdx2xyo"}