{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 04:59:51", "date_modify": "2025-05-21 04:59:51", "date_publish": "2025-04-04 11:46:53", "description": "'I'd love to' - Luke Armstrong keen to extend Motherwell stay", "filename": "sport_articles_cp315g4zw49o_1747803591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3df0/live/f56224e0-10aa-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp315g4zw49o_1747803591.html", "title": "'I'd love to' - Luke Armstrong keen to extend Motherwell stay", "title_page": "'I'd love to' - Luke Armstrong keen to extend Motherwell stay - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On-loan Carlisle United striker Luke Armstrong says he would \"love\" to extend his stay with Motherwell.\nManager Michael Wimmer has also said he would be open to the possibility of the 28-year-old returning to the club next season.\nIn seven appearances for the Fir Park side, Armstrong's two goals have come against Celtic and Rangers.\nDespite the forward's eagerness to stay in Lanarkshire beyond the end of the campaign, he concedes there are \"many factors\" involved in a potential move given his Carlisle contract runs until the summer of 2027.\n\"The summer could be anything for me, I've just got to do as well as I can,\" Armstrong said.\n\"I'd love to [stay] if that was a possibility. There are a lot of factors, I'm contracted at Carlisle, but it would be good to come back if that was possible.\"\nVictory at Kilmarnock on Saturday would ensure Motherwell - who were accused of \"giving up\" by boss Michael Wimmer in the latter of stages of last week's 4-1 trouncing by Aberdeen - go into the final pre-split game against Hearts still with a chance of finishing in the top six.\n\"We just want to show the gaffer and everyone that we'll keep fighting to the end and that's not the case of us, that's not a thing that he needs to worry about or anyone needs to worry about,\" Armstrong added.\n\"It's definitely not a criticism you want to be involved with. We want to be known as someone who fights to the end.\n\"All we can do is put that right by proving it wrong and making sure that if we're in a situation like that again, we keep pushing.\"", "url": "https://www.bbc.com/sport/articles/cp315g4zw49o"}