{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 04:15:03", "date_modify": "2025-05-21 04:15:03", "date_publish": "2025-04-05 20:13:21", "description": "Aston Villa 2-1 Nottingham Forest: Morgan Rogers shows star quality again", "filename": "sport_football_articles_c62xq90z665o_1747800903.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1aba/live/54e51020-125a-11f0-8f89-f7b65e1a8fac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62xq90z665o_1747800903.html", "title": "Aston Villa 2-1 Nottingham Forest: Morgan Rogers shows star quality again", "title_page": "Aston Villa 2-1 Nottingham Forest: Morgan Rogers shows star quality again - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Morgan Rogers once again demonstrated his star quality and vast potential when Aston Villa needed it most in their crucial win over Nottingham Forest.\nThe 22-year-old is proving what a bargain Aston Villa got when they prised this uncut gem away from Middlesbrough in February 2024, in a deal that could eventually be worth £15m.\nWith speculation about Rogers' development catching the eye of other clubs, that fee looks a snip now - although Villa will have no intention of selling such a talent.\nThe statistics underline his importance.\nIn 44 games in all competitions this season, Rogers has scored 13 goals and provided nine assists. Seven of his eight Premier League goals this season have either put Aston Villa in the lead or drawn them level.\nHe has also had a hand in 10 goals in his last 14 appearances for the club in all competitions, with six goals and four assists. Only Ollie Watkins (26) has had a hand in more goals for the club overall this season than Rogers (22 – 13 goals, nine assists).\nRogers, like Chelsea's Cole Palmer, was another who was unable to make the breakthrough at Manchester City, but might now have his old club casting envious glances in the direction of Villa Park.\nHere, it was Rogers' composed finish that set Aston Villa on the way to a 2-1 win and he almost crowned a top-class display with a sensational solo goal in the second half, only to be denied by Nottingham Forest goalkeeper Matz Sels at the end of a long run.\nHalesowen-born Rogers was a product of the West Bromwich Albion academy before going to City, eventually being sold to Middlesbrough for £1.5m after loan spells at Lincoln City, Bournemouth and Blackpool.\nCity received a proportion of the fee Middlesbrough received, having negotiated a 25% sell-on fee from any profit, but he is currently priceless as far as Unai Emery is concerned - particularly as he has helped them reach the FA Cup semi-finals, the Champions League quarter-finals and move closer to a place in the Premier League's top four.\nRogers will now be a central figure when Emery returns to former club Paris St-Germain in that quarter-final first leg on Wednesday night.", "url": "https://www.bbc.com/sport/football/articles/c62xq90z665o"}