{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:30", "date_modify": "2025-05-21 05:56:30", "date_publish": "2025-02-08 18:15:42", "description": "Sheffield United boss Chris Wilder admits his side were below their best in the 2-1 win over Portsmouth.", "filename": "sport_football_articles_cdxed00deypo_1747806990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0835/live/98dbe8b0-e647-11ef-83f8-35f434c6ab1c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxed00deypo_1747806990.html", "title": "Chris Wilder: Sheffield United 'second-best' in win against Portsmouth", "title_page": "Chris Wilder: Sheffield United 'second-best' in win against Portsmouth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United boss Chris Wilder admitted his side had dodged dropped points when he spoke to BBC Radio Sheffield after the 2-1 win over Portsmouth.\n\"We weren't very good today and it's as simple as that,\" he said.\n\"It was one we escaped with because we have the ability to win a game of football when we don't play very well.\n\"They were better than us in all departments, first and second balls. It wasn't anything about tactics today, it was about an attitude towards the game which I told them at half-time.\n\"We looked to short-cut the game which is really surprising and we won't do that again.\n\"There's an arrogance about us. I want us to have belief, I want us to be confident, I want us to stick our chest out and believe we're a good team because we are - we've won as many games as anyone in the division and sit on 60-odd points.\"\n\"The reaction in the second half was better, even though it wasn't to my liking, but there's a little bit of arrogance about us which I talked about at half-time and we can't afford to let that happen.\n\"If we think that is going to be the stock standard performance from our point of view then we're going to get hurt and we're not going to achieve anything.\"", "url": "https://www.bbc.com/sport/football/articles/cdxed00deypo"}