{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 07:45:12", "date_modify": "2025-05-21 07:45:12", "date_publish": "2025-01-03 21:48:03", "description": "Glentoran recover from 2-1 down to beat H&W Welders 4-2 and advance to the sixth round of the Irish Cup.", "filename": "sport_articles_cwy4ze8p7wlo_1747813512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8dea/live/9bbaabb0-ca19-11ef-9ca4-e15068af8864.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwy4ze8p7wlo_1747813512.html", "title": "Irish Cup: Glentoran survive scare to beat Welders in fifth round", "title_page": "Irish Cup: Glentoran survive scare to beat Welders in fifth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran came from a goal behind to defeat east Belfast neighbours H&W Welders 4-2 on Friday night and advance to the sixth round of the Irish Cup.\nJames Singleton headed the Glens in front in the 11th minute but goals from Ewan McCoubrey in the 22nd minute and twenty seconds into the second half edged their Championship opponents in front at the Blanchflower Stadium.\nDavid Fisher's 58th-minute left-foot strike into the roof of the net drew the visitors level, then Welders defender Lewis Patterson headed into his own net 12 minutes later.\nFrankie Hvid was alert in the box to fire home the rebound after Danny Amos's shot had crashed off the post on 77 minutes.\nGlentoran extend their unbeaten record in all competitions to eight games as their bid for a 24th success in the competition and a first since 2020 clears the first hurdle.\nIt took a penalty shootout to separate the two sides in a County Antrim Shield first-round tie at the same venue in September, the Glens emerging victors on that occasion after a 2-2 draw at the same venue.\nThe Welders again proved formidable opposition for their Premiership opponents on this occasion but ultimately fell short of supplying a cup upset.\nThe early exchanges saw Jack Mills make a fine save to deny Dylan Connolly, who was through one-on-one with the home goalkeeper.\nAt the other end, Andrew Mills was called into action to make a smart stop from Brandon Doyle as the Welders displayed some of the form which has seen them go unbeaten in their last four Championship matches to occupy fourth place in the table.\nJordan Jenkins saw a penalty appeal waved away after he was challenged by Patterson in the area but immediately after Singleton rose unmarked to head in from an Amos corner.\nMcCoubrey delivered a composed finish to equalise, coolly lobbing the ball over the Glens keeper after Tiarnan O'Connor's shot had been deflected into his path.\nJoshua Kee fired wide soon after but after the restart McCoubrey grabbed his second, sliding the ball into the net after getting on the end of a clever backheel from O'Connor.\nFisher's leveller eased Glens nerves and then Patterson's unfortunate own goal from Jenkins' delivery from the left nudged Declan Devine's charges in front.\nHvid's goal completed the scoring as the relieved Oval outfit secured their berth in Saturday's sixth round draw.", "url": "https://www.bbc.com/sport/articles/cwy4ze8p7wlo"}