{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:23", "date_modify": "2025-05-21 05:22:23", "date_publish": "2025-02-08 22:28:04", "description": "Chelsea prepare bid for Antoine Semenyo, Liverpool monitoring Feyenoord's David Hancko, Barcelona will allow Frenkie de Jong to leave in the summer, plus more.", "filename": "sport_football_articles_c20gy173dglo_1747804943.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60a4/live/298c0f10-e658-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20gy173dglo_1747804943.html", "title": "Football gossip: Hancko, Semenyo, De Jong, Fati, Saliba, Kelleher", "title_page": "Football gossip: Hancko, Semenyo, De Jong, Fati, Saliba, Kelleher - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea prepare bid for Antoine Semenyo, Liverpool monitoring Feyenoord'sDavid Hancko, Barcelona will allow Frenkie de Jong to leave in the summer.\nChelsea are preparing a 50m euro (£41.6m) bid for 25-year-old Bournemouth and Ghana forward Antoine Semenyo. (Fichajes - in Spanish) , external\nChelsea are closing in on a deal to sign 19-year-old Sporting midfielder Dario Essugo, who has impressed on loan at La Liga side Las Palmas this season (Sun), external\nLiverpool are understood to be closely monitoring Feyenoord and Slovakia defender David Hancko, 27, as a potential transfer target for the summer. (Caughtoffside), external\nNetherlands midfielder Frenkie de Jong, 27, has been told Barcelona will not stand in his way of making a summer move to Liverpool. (El Nacional - in Spanish) , external\nEngland striker Harry Kane, 31, is keeping tight-lipped on reports that he could make a shock move to Arsenal next year, because of a release clause in his Bayern Munich contract. (Mirror), external\nSpain forward Ansu Fati, 22, is not considering offers from Turkish clubs and is instead fully focused on Barcelona. (Fabrizio Romano) , external\nReal Madrid want to sign two centre-backs in the summer, with Arsenal and France defender William Saliba, 23, one of the names on the Spanish club's list. (Relevo - in Spanish) , external\nChelsea are one of five clubs interested in signing 26-year-old Liverpool and Republic of Ireland goalkeeper Caoimhin Kelleher in the summer. (TBR Football), external\nArsenal, Manchester United and Liverpool are showing a strong interest in the 20-year-old Eintracht Frankfurt and Sweden midfielder Hugo Larsson. (Caughtoffside) , external", "url": "https://www.bbc.com/sport/football/articles/c20gy173dglo"}