{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-04-26 04:03:44", "date_modify": "2025-04-26 04:03:44", "date_publish": "2025-03-03 19:48:18", "description": "Vinicius Jr says he is \"living the dream\" at Real Madrid and wants to sign a new deal with the Champions League holders.", "filename": "sport_football_articles_ckg8qwv0ek1o_1745640224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b26d/live/2c221b00-f866-11ef-b178-ef4d5e65c5ca.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8qwv0ek1o_1745640224.html", "title": "Vinicius Jr: Real Madrid forward wants to sign new deal amid Saudi interest", "title_page": "Vinicius Jr: Real Madrid forward wants to sign new deal amid Saudi interest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Vinicius Jr says he is \"living the dream\" at Real Madrid and wants to sign a new deal with the Champions League holders.\nThe Brazil forward, 24, has two years left on his current contract and is rumoured to be a transfer target for the Saudi Pro League.\n\"I am very calm because my contract lasts until 2027 and I hope to renew my contract as soon as possible because I am happy here,\" he said.\n\"I am living the dream of playing with the best players in the world, the best coach, the best president, the best fans. Here everybody loves me so much. I couldn't be in a better place.\"\nVinicius left Flamengo to join Real in 2018 and has won three La Liga titles and the Champions League twice.\nReal continue the defence of their European crown on Tuesday, when they host neighbours Atletico in the first leg of their last-16 tie, and Vinicius goes into the game with 102 goals from 300 appearances for the club.\n\"My child dream was to make it here,\" he added. \"Now I have managed to make it to here, I am writing my story.\n\"I have won but I can still win much more and make it into the history of the club. That is very complicated because many good players have been here, legends, and I want to be just like them.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8qwv0ek1o"}