{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:53:57", "date_modify": "2025-05-20 14:53:57", "date_publish": "2023-07-27 13:53:09", "description": "Plymouth Argyle manager Steven Schumacher says he will not rush into bringing a new striker to the club.", "filename": "sport_football_66327827_1747752837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/163F5/production/_130552119_steveschumachertorquaypreseason2023rex1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66327827_1747752837.html", "title": "Steven Schumacher: Plymouth Argyle boss says club will not rush to find new striker", "title_page": "Steven Schumacher: Plymouth Argyle boss says club will not rush to find new striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle manager Steven Schumacher says he will not rush into bringing a new striker to the club.\nThe Pilgrims have just Ryan Hardie and Ben Waine as recognised number nines as they prepare for a return to the Championship after 13 years.\n\"If we're still looking for players throughout the start of August that's fine,\" Schumacher told BBC Radio Devon.\n\"I think the squad's in a good position where we can handle the first few games if necessary.\"\nHaving bolstered the other parts of their squad with seven new players - including £1m signings Bali Mumba and Morgan Whittaker - an out-and-out striker is top of Schumacher's list.\nHardie and Waine are the only front men left following Niall Ennis' summer move to Blackburn Rovers and Sam Cosgrove returning to Birmingham City at the end of his loan last season.\n\"Waino and Ryan have got different attributes to each other, and if we can bring in a striker that's going to compliment their attributes that's what we'll look to do,\" added Schumacher.\n\"Hopefully we can certainly get one down, and we'll see what happens with the rest, we'll see how much money we've got left.\n\"I would be happy if we did do it before the season started, but it won't break my heart if we don't because we're probably going to go with one number nine to start the season, whether we play 3-4-3 or whatever, so having one to start and one to come on will be fine,\" he said.\n\"You run the risk if you get an injury, but if we do do that we'll move quicker if we need to.\"\nThe Pilgrims begin life back in the Championship at home to Huddersfield on 5 August.", "url": "https://www.bbc.com/sport/football/66327827"}