{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-05-21 06:20:56", "date_modify": "2025-05-21 06:20:56", "date_publish": "2025-03-31 15:48:46", "description": "Caroline Weir says Scotland must build on the \"definite progress\" in the Nations League amid a \"transitional period\" for the manager-less national side.", "filename": "sport_football_articles_cn5xzzv1vero_1747808456.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b0e/live/8e03abf0-0e3b-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn5xzzv1vero_1747808456.html", "title": "Scotland must build on 'progress' against elite Germany", "title_page": "Scotland must build on 'progress' against elite Germany says Weir - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Caroline Weir says Scotland must build on the \"definite progress\" in the Nations League amid a \"transitional period\" for the managerless national side.\nScotland face a double header against Germany, ranked third in the world, after a 1-0 defeat in Austria and a 2-1 home loss to the Netherlands in their opening games.\nThose were both under the stewardship of interim boss Michael McArdle as the Scottish FA continues its search for a new manager after the departure of Pedro Martinez Losa, following the failed bid to qualify for Euro 2025.\nMcArdle will continue to guide the team for the visit of Germany to Tannadice on Friday, before the return in Wolfsburg the following Tuesday.\nWeir says \"clarity\" on who the next manager will be is the \"most important thing\" but until then she and the rest of the squad must focus on taking on one of the world's best sides.\n\"It's two really tough games, but I think they're important for us,\" Weir told BBC Scotland.\n\"They are one of the best teams. I'm interested to see how we do. Off the back of the last camp, that performance against the Netherlands, I think there was definitely some positives to take.\n\"We were competitive for most of the match as much as we didn't get any points.\n\"It is a transitional period for sure for the squad, the manager situation and then obviously the change in personnel and the players.\n\"But for us, it's easy. We turn up, we want to be in the best shape possible, prepare the best we can to play an international match.\"", "url": "https://www.bbc.com/sport/football/articles/cn5xzzv1vero"}