{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 04:15:11", "date_modify": "2025-05-21 04:15:11", "date_publish": "2025-01-15 07:55:29", "description": "Emile Cairess leads the British charge at this year's London Marathon, where Eilish McColgan will make her debut over the distance on 27 April.", "filename": "sport_athletics_articles_c07kggzm20do_1747800911.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3364/live/2ad489a0-d349-11ef-a669-f140c338bce3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c07kggzm20do_1747800911.html", "title": "London Marathon: Emile Cairess leads British charge as Eilish McColgan makes debut", "title_page": "London Marathon: Emile Cairess leads British charge as Eilish McColgan makes debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emile Cairess will lead the British charge at this year's London Marathon, where Eilish McColgan will make her debut over the distance.\nCairess, who finished third in last year's race before placing fourth in the Olympic marathon, joins Olympic and world triathlon champion Alex Yee and Olympic champion Tamirat Tola on the start line on 27 April.\nThe 27-year-old Cairess became the second-fastest British athlete in history when he ran two hours, six minutes and 46 seconds in 2024 and could target Sir Mo Farah's record of 2:05.11.\n\"I had a great year in 2024 with some really positive results. I'm still learning about the event, which makes me even more excited and positive for the future,\" Cairess said.\nIn the women's race, McColgan, 34, will hope to make her long-awaited marathon debut after injury ruled her out in 2023.\nMcColgan, whose mother Liz won the London Marathon in 1996, will be joined by Charlotte Purdue - the third-fastest British woman of all time - in a women's race featuring world record holder Ruth Chepngetich and Olympic champion Sifan Hassan.\nRecord eight-time winner David Weir returns for his 26th consecutive appearance in the men's wheelchair race, while Boston Marathon champion Eden Rainbow-Cooper, 23, will aim to improve on her best finish of third in 2022.", "url": "https://www.bbc.com/sport/athletics/articles/c07kggzm20do"}