{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 04:14:15", "date_modify": "2025-04-26 04:14:15", "date_publish": "2025-03-04 11:16:59", "description": "Manchester United forward Chido Obi is ineligible for the Europa League, but why?", "filename": "sport_football_articles_cpv4jmpmk1ko_1745640855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ca7/live/df4b8320-f8e2-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpv4jmpmk1ko_1745640855.html", "title": "Man Utd: Why is Chido Obi not in Europa League squad?", "title_page": "Man Utd: Why is Chido Obi not in Europa League squad? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chido Obi is being discussed as a potential answer to Manchester United's goalscoring woes - but the 17-year-old is not in the squad for Thursday's Europa League last-16 first-leg tie against Real Sociedad.\nUnited say the Danish forward is \"ineligible for the competition\" and cannot feature for the club this season in Europe.\nBut why?\nObi was signed from Arsenal's academy last October, aged 16.\nAfter scoring a hat-trick in a 5-1 FA Youth Cup win over Chelsea on 12 February, he was drafted into United's first-team squad after they were hit by a number of injuries - including winger Amad Diallo - and a lack of forward options, with Marcus Rashford and Antony sent on loan in January.\nFour days later he made his first senior appearance as a substitute in a 1-0 loss to Tottenham, becoming United's third-youngest ever Premier League player.\nObi's third appearance came on Sunday as United lost to Fulham on penalties in the FA Cup, replacing striker Rasmus Hojlund in the second half.\nWhile £72m Denmark striker Hojlund and Netherlands international Joshua Zirkzee both managed one effort on goal, Obi had three and forced Fulham goalkeeper Bernd Leno into an outstanding reaction save.\nPremier League rules are different as they have an 'Under 21' list which is not included on the 25-man squad list.\nObi is one of 57 players who are named on this.", "url": "https://www.bbc.co.uk/sport/football/articles/cpv4jmpmk1ko"}