{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:21:52", "date_modify": "2025-05-20 12:21:52", "date_publish": "2023-07-26 06:12:54", "description": "Rotherham 1-0 Sheffield United: Stuart McCall reaction", "filename": "sport_articles_cxrx0g4lrkeo_1747743712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/877d/live/7e63fab0-2b7a-11ee-9d60-11e9a57a96d1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cxrx0g4lrkeo_1747743712.html", "title": "Rotherham 1-0 Sheffield United: Stuart McCall reaction", "title_page": "Rotherham 1-0 Sheffield United: Stuart McCall reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United assistant manager Stuart McCall said \"we do not like to lose any game\", but insists the result was not the priority after the Blades slipped 1-0 to neighbours Rotherham United in Tuesday's pre-season friendly.\nUnited were beaten by a audacious back-heeled volley and McCall told the club media, external it was a good workout for his side and that is what matters at this stage of their build-up to the new season.\nThat is particularly pertinent given they play again on Wednesday in Manchester against Spanish side Girona.\n\"It is about getting minutes, building confidence and coming through without injuries,\" McCall said. \"It was a competitive game. We could have done better with a few opportunities and been a little tidier in the final third.\n\"We want to start building patterns but there were some young boys in there as well. For the game tomorrow, the likes of John Egan and Sander Berge will be playing. It is a gradual build-up.\"\nOne particular youngster stood out for McCall as he praised Harrison Neal for a fine full 90 minutes.\n\"He has been outstanding, but that's him,\" McCall said of the 22-year-old. \"He does everything right and is a great example to young kids.\n\"He had a great season on loan at Barrow - I know they want him back - and he has a great attitude to go far.\"", "url": "https://www.bbc.com/sport/articles/cxrx0g4lrkeo"}