{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:19", "date_modify": "2025-05-21 06:14:19", "date_publish": "2025-04-01 10:59:34", "description": "Gloucestershire's new red-ball captain Cameron Bancroft has experience of winning that can \"boost\" his team, says Mark Alleyne.", "filename": "sport_cricket_articles_czjer8d4mpro_1747808059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/39a6/live/3b576140-0ee4-11f0-bb66-1953ea6c7fa4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_czjer8d4mpro_1747808059.html", "title": "Cameron Bancroft: Gloucestershire new captain 'boosts team'", "title_page": "Cameron Bancroft: Gloucestershire new captain 'boosts team' - Mark Alleyne - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucestershire's new red-ball captain Cameron Bancroft has an experience of winning that can \"boost\" his team-mates, says head coach Mark Alleyne.\nThe Australian was named Gloucestershire's new captain last month for the 2025 County Championship campaign.\nBancroft, who has played in 10 Test matches for Australia, has won three Sheffield Shield titles - the country's domestic first-class competition - with Western Australia.\n\"What he brings is experience of winning four-day competitions; over the last five, six years Western Australia have been prolific, so having someone who knows how to get over the line leading the group is another boost for the rest of the team,\" Alleyne told BBC Radio Bristol.\n\"They know he's been there, done it and there's nothing like that in sport. He sets a really good example, great professional, has the respect of everyone in the group and works well with the coaches.\"\nGloucestershire finished seventh in Division Two in 2024, winning just two of their 14 matches - although six ended in draws.\nAlleyne, who is Gloucestershire's most decorated player, returned to the top job last season for a second spell.\nHe said the team showed a \"glimpse\" of their potential in 2024.\n\"We've got a group at the moment that the world's their oyster, these guys haven't reached potential yet,\" Alleyne said.\n\"It's exciting in the batting and bowling groups and if you can put that together as a team, they can be really awesome. They showed a glimpse last year and I'm hoping that's just a start of what they can do.\"", "url": "https://www.bbc.com/sport/cricket/articles/czjer8d4mpro"}