{"authors": ["Sami Mokbel", "Gary Rose", "www.facebook.com"], "date_download": "2025-05-21 07:43:00", "date_modify": "2025-05-21 07:43:00", "date_publish": "2025-03-28 10:22:58", "description": "Arsenal are turning to Andrea Berta, who previously worked at Atletico Madrid, to be their new sporting director, so what is on his to-do list?", "filename": "sport_football_articles_crrd4gjvkwjo_1747813380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d25b/live/61defcd0-0bc2-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crrd4gjvkwjo_1747813380.html", "title": "Andrea Berta: What can Arsenal fans expect from new sporting director?", "title_page": "Andrea Berta: What can Arsenal fans expect from new sporting director? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal have confirmed the appointment of Andrea Berta as their new sporting director.\nItalian Berta, 53, becomes the permanent successor to Edu after the former Gunners midfielder left Emirates Stadium at the end of 2024.\nEdu's deputy Jason Ayto was appointed interim sporting director following the Brazilian's departure and was a serious contender for the position.\nThere is hope that Berta will be in attendance for Arsenal's Premier League meeting with Fulham on Tuesday night.\n\"I am thrilled to be joining Arsenal in what is a hugely exciting period for the club,\" said Berta.\n\"The club has great values and a rich history, and I am looking forward to playing my part in shaping a successful future with a great team.\"\nBerta arrives in north London with the reputation of being one of the shrewdest sporting directors in European football.\nHe worked for Italian sides Parma and Genoa before joining Atletico Madrid, initially as their technical director, in 2013.\nWhile at Atletico, he was instrumental in signing Rodri, Antoine Griezmann and Jan Oblak.\nArsenal co-chairman Josh Kroenke said: \"Anyone who knows football knows Andrea is an impressive figure. He has vast knowledge of the game, a great track record, a strong network and an insatiable desire to build winning teams.\n\"We undertook a thorough recruitment process and we were hugely impressed with the level of all the other candidates, but it was Andrea's experience and the success he has enjoyed that stood out.\"\nSpanish football expert Guillem Balague told BBC Sport: \"He's quite unique compared to other sporting directors.\n\"He had no playing career, started in banking, and only got into football later, first at Carpenedolo, an amateur club, then at Parma and Genoa, where he built key connections with Peter Kenyon and Jorge Mendes.\n\"Under his watch, Atletico won two La Liga titles (2013-14, 2020-21), a Copa del Rey (2013), a Europa League (2017-18), and a Uefa Super Cup (2018).\n\"He's seen as the architect of the squad rebuild after the 2014 title-winning team faded.\"\nWorking with manager Diego Simeone, Berta helped Atletico make some astute acquisitions during that rebuild.\nFrance striker Griezmann was signed from Real Sociedad for £24.8m in 2014 and five years later was sold to Barcelona for £103m. Atletico then bought him back in 2021 for just £16.5m.\nSpain midfielder Rodri, now a Ballon d'Or winner, was signed for £16.5m in 2018 and sold to Manchester City the following year for £62.5m, while Slovenian goalkeeper Oblak signed from Benfica in 2014 for just £13m. He's now widely regarded as one of the best goalkeepers in the world.\nMore recently, forward Julian Alvarez joined from Manchester City last summer for £81.5m and he has scored 23 goals for Atletico this season.\n\"He brought in key players like Griezmann (twice), Luis Suarez, Kieran Trippier, Llorente, De Paul, and Julian Alvarez,\" added Balague.\n\"But he also had some flops, like Joao Felix, Kalinic, Arias, Torreira, but he always worked within the club's financial limits.\n\"In total, he made 52 signings since 2017, spending around 828 million euros (£692m), leaving a big mark on Atletico's squad. An end of an era for them.\"\nBBC Sport's Arsenal reporter Alex Howell\nThere are a few immediate issues he has to deal with.\nThe main and most obvious task is to ensure that Arsenal bring in a much-needed forward. The Gunners have suffered key injuries to key attackers this season and have not brought in a forward for two transfer windows in a row.\nKai Havertz has done excellently in filling that void but at times Arsenal's need for a natural goalscorer has been obvious.\nRB Leipzig striker Benjamin Sesko has long been monitored, while Newcastle forward Alexander Isak is also being linked with a move to north London.\nHowever, Eddie Howe's Magpies are in the mix for the Champions League places, making a deal for Isak expensive and more difficult to do.\nThere is also an argument that Arteta's side could do with a player who has some flair and the ability to make something happen when they play against teams that sit in a low block against them in the Premier League.\nIt's not only incomings that Berta will need to address. It's a big summer for the club with key players Bukayo Saka, William Saliba and Gabriel Magalhaes entering the last two years of their contracts.\nBerta will need to make sure that those players are locked down so that Arteta can continue to build on the impressive work he has done with the team.\nThere are also players who need to be moved on. Oleksandr Zinchenko has dropped further down the pecking order after the emergence of Myles Lewis-Skelly and the Gunners were willing to let him go in January if they received the right offer.\nIt is an exciting project for any sporting director to come into but with the Gunners challenging for silverware in recent seasons, this summer is not something that they can afford to get wrong.", "url": "https://www.bbc.com/sport/football/articles/crrd4gjvkwjo"}