{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:26:47", "date_modify": "2025-05-21 04:26:47", "date_publish": "2025-04-05 21:52:46", "description": "Ulster back Michael Lowry says the Irish province must start matches better as the Irish province prepares to face French giants Bordeaux Begles in the last 16 of the Champions Cup this weekend.", "filename": "sport_rugby-union_articles_ckg2d83d8zyo_1747801607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c920/live/e8d12340-0fdb-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ckg2d83d8zyo_1747801607.html", "title": "Bordeaux Begles v Ulster: We need to start games better", "title_page": "Bordeaux Begles v Ulster: We need to start games better - Lowry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster back Michael Lowry says the Irish province must start games better following a run of three games which has seen them recover from deficits to secure narrow wins against Scarlets, Dragons and Stormers in the United Rugby Championship.\nIn their most recent outing, Richie Murphy's side found themselves 17-0 down to their South African opponents just eight minutes into their meeting in Belfast, before mounting a comeback to prevail 38-34.\nOn Sunday, Ulster face the daunting task of taking on French side Bordeaux Begles in the last 16 of the Investec Champions Cup and Lowry knows they will not have the luxury of giving their hosts a head start if they are to have any hope of progressing.\n\"We haven't started well in the last three games but we came back into them, which gives us confidence and belief that we are doing a lot of things really well, just not starting well. We have to address it and review it and think of ways we can improve it.\n\"Last time out we were 17 points down, and it can happen so quickly. It's just about winning the next moment and gaining control again because if you're not careful against the likes of the Stormers or Bordeaux if they get another opportunity they're away again.\n\"We have to go there and start well. If you don't it can spiral. Those French teams have big powerful packs and quick backs.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/ckg2d83d8zyo"}