{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:25", "date_modify": "2025-05-21 07:28:25", "date_publish": "2025-01-22 12:40:28", "description": "'Pressure is on Scotland' following McArdle appointment", "filename": "sport_articles_c07k11p3gmzo_1747812505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce91/live/18210780-d8b6-11ef-89b6-372b2b3acad8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c07k11p3gmzo_1747812505.html", "title": "'Pressure is on Scotland' following McArdle appointment", "title_page": "'Pressure is on Scotland' following McArdle appointment - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Scotland international Leanne Crichton says the \"pressure is on\" the international squad following the appointment of Michael McArdle as interim head coach.\nThe women's national team are in search for a permanent successor to Pedro Marintez Losa after he left his role last month following Scotland's failure to qualify for Euro 2025, in addition to missing out on the 2023 World Cup.\nFormer Ayr United assistant McArdle is the head of women's elite football for the SFA and will take charge of the upcoming Nations League games next month.\n\"Whatever this next appointment looks like, we have to get it right,\" Crichton told the BBC's Behind the Goals podcast.\n\"If it takes a bit longer to go through the process - if it ends up back at Mick and he does really well - the pressure is on the group to show the signs that we can really move forward. Whether that has an element of transition or not, he's going to have to steer that.\n\"The only thing I'm interested in is how he manages his workload. He's the busiest guy on the planet, doing a brilliant job in his current role at the Scottish FA. I'm looking forward to the next international window and seeing how it pans out.\"", "url": "https://www.bbc.com/sport/articles/c07k11p3gmzo"}