{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-04-26 07:54:05", "date_modify": "2025-04-26 07:54:05", "date_publish": "2025-02-25 13:50:08", "description": "Two of Europe's heavyweights go head-to-head at Wembley on Wednesday in a repeat of the Women's World Cup final as England host world champions Spain.", "filename": "sport_football_articles_cm2ner9jndjo_1745654045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0b3/live/dd9e8b60-f2cc-11ef-b605-1fa85cd40094.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2ner9jndjo_1745654045.html", "title": "England v Spain: Women's World Cup finalists meet at Wembley in Women's Nations League", "title_page": "England v Spain: Women's World Cup finalists meet at Wembley in Women's Nations League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two of Europe's heavyweights go head-to-head at Wembley on Wednesday in a repeat of the Women's World Cup final as England host Spain.\nIt is the second round of Women's Nations League matches and England are hoping to bounce back from an underwhelming draw with Portugal.\nWorld champions Spain came from 2-0 down to beat Belgium 3-2 in their last match to lead the group, overcoming a difficult week off the pitch to show their credentials.\nBut how much have the teams changed since their meeting in Sydney two years ago? And are they ready for Euro 2025?\nEngland won Euro 2022 and made it to a second successive major tournament final at the World Cup a year later.\nBut it has not been plain sailing since.\nThey missed out on a place at the Olympic Games in 2024 and have won just two of their past six matches.\nDefender Millie Bright described it as a \"rollercoaster\" few years for the World Cup runners-up.\n\"Of course, everyone wants to win every single game and for us to be the best team, but that's just not a reality,\" she added.\n\"It's a good thing when you experience tough moments because it builds character. Football's always a journey. It's always important to stay in the moment.\"\nFor Spain, their achievements on the pitch have been overshadowed by their challenges off it.\nFormer Spanish football federation boss Luis Rubiales was last week found guilty of sexual assault after kissing player Jenni Hermoso on the lips without her consent during the 2023 World Cup medal ceremony.\nPlayers testified in court in support of Hermoso, after World Cup-winning coach Jorge Vilda was sacked by the federation as part of the incident.\nBut on the field Spain have enjoyed further success, winning the inaugural Nations League, although they were upset in the Olympic semi-finals by Brazil.\nThey were held to back-to-back draws in October but beat European heavyweights France 4-2 in Nice in December, before last week's comeback win over Belgium.\n\"Since [the World Cup], I think both teams have been a little bit up and down. I would say we arrive in the same moment,\" Spain defender Laia Codina said.\n\"We know both teams have to be so much better if we want to do something in the Euros. The teams that played against each other at the World Cup are different.\"\nEngland beat Spain in a dramatic quarter-final at Euro 2022 before the world champions got their own back in Sydney a year later.\nWednesday's match (20:00 GMT kick-off) will be the first time they have faced each other since Australia.\nLionesses manager Sarina Wiegman says the meetings are \"absolutely big games\" but they are used to them.\n\"When you play Germany, USA they are big games too,\" added Wiegman.\n\"There are many big games at the moment because everyone is improving so quickly to [get to] the next level. I am really looking forward to it.\"\nA number of Spanish players are at clubs in the Women's Super League, including Arsenal's Codina, who is excited to face her team-mates.\n\"When we found out the groups, we were speaking a lot in the [Arsenal] changing room. I spoke with Alessia [Russo] because she is next to me,\" said Codina.\n\"It is special - not just because it is against England - but also because we are playing in Wembley. It is such a nice stadium.\n\"I said to [my Arsenal team-mates] that we have to get to the FA Cup final because I want to play at Wembley. Now we have the opportunity with Spain.\n\"That is so special. Now England is home to me - so I feel like I'm coming back home with my national team.\"\nWith just five months to go until Euro 2025, the Nations League competition is the perfect preparation for England and Spain.\nHowever, Wiegman has insisted she is \"not concerned\" by England's underwhelming form of late and is not looking too far ahead.\nIt is a message echoed by Chelsea captain Bright - but she also admits there is \"a lot of work to do\".\nShe added: \"We're aware of what we need to do. I think with each game, we just have to make sure we keep closing the gap and get closer to the levels we want to be.\"\nCodina says it is \"too early to think about the Euros\" but knows both teams need to improve before July.\n\"We are playing big games now in the Nations League. It's a way to work for the Euros,\" she added.\n\"Spain is in a good position but I also think a lot of other teams are in the same moment. It is going to be a tough tournament.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cm2ner9jndjo"}