{"authors": ["Adwaidh Rajan", "www.facebook.com"], "date_download": "2025-05-21 04:58:16", "date_modify": "2025-05-21 04:58:16", "date_publish": "2025-04-04 12:59:26", "description": "Vitor Pereira press conference: Ipswich Town vs Wolves preview", "filename": "sport_football_articles_c0jz14q9523o_1747803496.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4488/live/8cfca750-be1a-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0jz14q9523o_1747803496.html", "title": "Vitor Pereira press conference: Ipswich Town vs Wolves preview", "title_page": "Vitor Pereira press conference: Ipswich Town vs Wolves preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pereira reported no fresh injury concerns and also confirmed Goncalo Guedes and Rodrigo Gomes, who were not involved in the win over West Ham, are fit.\nOn whether his side is now safe from being dragged into the relegation battle: \"It's not over until the end. I've said it before - it's a league that can surprise you. Ipswich have the quality to fight for a lot of points. I feel my team is confident and consistent. For sure, we will compete. I never prepare my team to go to a game for a draw. We just want the three points.\" \"\nHowever, he added that the battle to avoid relegation will not be won even if Wolves win against Ipswich and move 12 points clear of safety.\nOn the potential of midfielder Joao Gomes who signed a new five-year contract earlier this week: \"He is young, he has shown humility and he wants to learn and help. Tactically and technically, he can improve, but he has the spirit. He will have a fantastic career.\"\nPereira also had praise for striker Jorgen Strand Larsen, who scored the winner against the Hammers: \"My striker must be a fighter and the responsibility is not only to score goals. He has this spirit and this character. I like him.\"\nPereira praised his counterpart Kieran McKenna's \"fantastic work\" at Ipswich, saying he had built a team with tactical ideas and good players.", "url": "https://www.bbc.com/sport/football/articles/c0jz14q9523o"}