{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-04-26 06:30:08", "date_modify": "2025-04-26 06:30:08", "date_publish": "2025-02-27 10:48:08", "description": "West Ham analysis: Is it time we rethought Wan-Bissaka?", "filename": "sport_football_articles_cn48zezezvno_1745649008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/83ca/live/299623a0-f46e-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn48zezezvno_1745649008.html", "title": "Is it time we rethought Wan-Bissaka?", "title_page": "West Ham analysis: Is it time we rethought Wan-Bissaka? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aaron Wan-Bissaka has not had it easy.\nBack in 2021, two years after Manchester United handed Crystal Palace £50m for his services, former England great Paul Scholes described him as \"useless on the ball\" even while praising his virtues as a defender.\nEnsnared in the seemingly constant state of chaos at Old Trafford, Wan-Bissaka acquitted himself well as an one-and-one defender but became labelled as a full-back that lacked end product.\nSince his move to West Ham in the summer, the underlying numbers suggest this is no longer the case.\nOn the surface, two goals and two assists this season is not headline-grabbing. However, Wan-Bissaka is already two thirds of the way to his best Premier League return of six goal involvements in 2020-21, with 13 matches still to play,\nIndeed, the 27-year-old has become one of the Hammers' most important creative outlets, illustrated by his fine assist for Jarrod Bowen's winner against Arsenal on Saturday.\nIn a turbulent season in east London, Wan-Bissaka has consistently ranked closely with star attackers Bowen and Mohammed Kudus in several key metrics.\nHe is crucial in driving his team forward, shown by him leading the squad for progressive carries [76] and carries into the final third [44], while his 10 crosses into the penalty area is level at the top alongside Kudus.\nPerhaps more surprisingly, he has 40 successful take-ons, behind only Kudus' 64 and ahead of Bowen's 35, suggesting a willingness to get at his opponent.", "url": "https://www.bbc.co.uk/sport/football/articles/cn48zezezvno"}