{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 04:33:25", "date_modify": "2025-05-21 04:33:25", "date_publish": "2025-04-04 21:14:29", "description": "Edinburgh score four tries in a 24-12 win over the Lions to reach the quarter-finals of the Challenge Cup.", "filename": "sport_rugby-union_articles_c934gxdp2gwo_1747802005.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c7a3/live/760007a0-1198-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c934gxdp2gwo_1747802005.html", "title": "Edinburgh see off Lions to reach last eight", "title_page": "European Challenge Cup: Edinburgh see off Lions to reach last eight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Edinburgh held off the Lions to book their place in the quarter-finals of the European Challenge Cup.\nThe home side took control from the off and crossed for first-half tries from Wes Goosen, Ben Vellacott and Jamie Ritchie.\nFrencke Horn and Jaco Visagie hit back for the South African side after the break either side of a try from Ali Price for the home side, but it was not enough as Edinburgh ensured their passage to the last eight.\nSean Everitt's side will face either Bayonne or Vodacom Bulls at home in next weekend's quarter-finals.\nThe low point of Edinburgh's season was a grisly 55-21 URC hammering by the Lions in Johannesburg in October.\nThe South African side are a different proposition away from home, however, and it took Edinburgh just 80 seconds to carve them open, Goosen marking his 50th appearance for the club by finishing off a slick attack.\nThe home side started at a high tempo, aided by the sharp service of Vellacott, and the scrum-half darted through a gap around the fringes to score Edinburgh's second try.\nAn electric break from deep from Darcy Graham took Edinburgh into back into the red zone before Ritchie powered over to give the hosts a 17-0 lead at the break.\nThe capital side looked to be cruising to victory after a dominant first-half performance, but the Lions took the initiative after the break and a try from captain Horn gave them hope.\nThe match lost its fluency through a succession of stoppages and replacements, with neither side able to exert any meaningful pressure near their opponent's line.\nThat was until Matt Currie sliced through the Lions defence on a terrific line and found substitute Price on his shoulder for the score.\nLions were not done yet and substitute hooker Visagie stretched brilliantly for the line to bring the visitors back within 12, but it was too little and too late as Edinburgh saw it out to progress to the quarter-finals.\n\"The guys put in a tremendous amount of effort in the first half and played some scintillating rugby,\" Everitt said.\n\"Probably could have scored some more tries if we're being picky, but pleased with how we defended. It was a good performance all-round.\n\"It's a massive opportunity [in the quarter-finals]. For us, it's back to work on Monday and trying to improve on this performance.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c934gxdp2gwo"}