{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:26:55", "date_modify": "2025-05-21 04:26:55", "date_publish": "2025-04-05 21:08:15", "description": "Rodgers explains reasons behind Maeda's development", "filename": "sport_articles_ce8gyxk26xjo_1747801615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48af/live/070b4740-1262-11f0-9588-191c47a09f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce8gyxk26xjo_1747801615.html", "title": "Rodgers explains reasons behind Maeda's development", "title_page": "Rodgers explains reasons behind Maeda's development - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daizen Maeda is cruising to a host of end-of-season awards as he enjoys his most prolific season in Scotland since signing for Celtic.\nThe 27-year-old has stepped up in the absence of countryman Kyogo Furuhashi and manager Brendan Rodgers has credited the forward's development to being \"a great learner\".\n\"He works closely with Jack Lyons here, one of our young coaches who will focus individually on some of the details on that and what we see in him,\" Rodgers said.\n\"He's also very coachable and he's a great learner and that's what you want in your players.\n\"You can have players that are very good players but they're not very coachable. But his ability to learn is also what has helped him.\n\"So he gets pointed out items with all the coaches and we'll speak to him as a manager and Jack will do specific stuff with him as well. But all of that he's shown an ability to learn and so that's always a good sign.\"\nMaeda has 10 goals in his last seven league starts and has enjoyed playing in a more central role since Kyogo departed in the winter window to join Rennes.\n\"Being in the middle of the goal means he's making different runs. He's not where he's ended up crossing a lot on the left-hand side,\" Rodgers added.\n\"He's not always in the positions he would be as a central striker but I think we've seen that he can make all the moves and do everything you want in that position.\n\"His movement, pace, technical ability, but also the hunger and pressing is massive for an attacking team and he's playing ever so well and consistently well.\"", "url": "https://www.bbc.com/sport/articles/ce8gyxk26xjo"}