{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-05-21 07:28:14", "date_modify": "2025-05-21 07:28:14", "date_publish": "2025-03-28 13:14:48", "description": "Pep Guardiola press conference: Bournemouth vs Man City preview", "filename": "sport_football_articles_ce303qd0ry1o_1747812494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deec/live/405a9a50-4922-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce303qd0ry1o_1747812494.html", "title": "Pep Guardiola press conference: Bournemouth vs Man City preview", "title_page": "Pep Guardiola press conference: Bournemouth vs Man City preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Guardiola spoke about Bournemouth's style of play: \"I wouldn't say they are chaotic. They have a special way to play and it works. They have had a really good season and football would be boring if all the teams played in the same way.\"\nHe said he and his players are still not concerned about the outcome of the 115 charges against the club: \"It has been over a year with that. Nothing has changed over another one or two weeks.\"\nThe manager confirmed that everyone has returned healthy from the international break: \"Some are a little bit tired, but the others are good. Ederson is good - he has trained the past two days. Let's see tomorrow [if he or Ortega plays].\"\nThere is still no update on the future of Kevin de Bruyne, who is out of contract in the summer, with Guardiola adding the decision is \"between the club, the player and his agent\".\nGuardiola is \"delighted\" with Abdukodir Khusanov's start to life in England: \"He wasn't expected to play this many games but he has really special quality. He is so fast and shows his passion in many actions. He has helped us a lot.\"\nAsked if Rodri could return for the Club World Cup in June, Guardiola said: \"I don't know - I hope. It would be nice, but it's the wrong decision [to make] right now. I rely on what the doctor says. We have to be sure that he is fine.\"", "url": "https://www.bbc.com/sport/football/articles/ce303qd0ry1o"}