{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:55:40", "date_modify": "2025-05-20 11:55:40", "date_publish": "2023-08-05 15:59:35", "description": "DIGIONLY", "filename": "sport_football_66378688_1747742140.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66378688_1747742140.html", "title": "Saturday's League One reports", "title_page": "Saturday's League One reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barnsley 7-0 Port Vale\nDevante Cole scored a hat-trick as Barnsley started life under Neill Collins in sensational fashion with a 7-0 thrashing of lacklustre Port Vale at Oakwell.\nLiam Kitching, Jon Russell and Andrew Dallas were on also on target while Dan Jones netted an own goal as last season's League One play-off finalists, now managed by Collins following Michael Duff's departure to Swansea, ran riot.\nThe hosts broke the deadlock in the 23rd minute when debutant Corey O'Keeffe intercepted a loose pass and swept a low ball across to Cole who slotted home.\nBarnsley doubled their lead on the stroke of half-time when Jones turned into his own net.\nCole, the son of former England and Manchester United striker Andy Cole, notched his second just two minutes after the break, this time latching onto Barry Cotter's cross and lashing home.\nThe hat-trick was completed in the 53rd minute. As his side countered, Cole went alone and struck with just enough power for the ball to roll into the net.\nReds skipper Kitching added a fifth on the hour mark. Receiving the ball from Herbie Kane, the defender had time to control and calmly finish beyond Connor Ripley.\nCollins' side added a sixth four minutes later as Russell headed in from Nicky Cadden's free-kick.\nSubstitute Dallas grabbed a debut goal in the sixth minute of added time, diving to head home from Cotter's cross.\nMatch report supplied by PA Media.\nBlackpool 2-0 Burton Albion\nShayne Lavery's first-half brace gave Blackpool an opening-day 2-0 win over Burton in League One.\nThe opener came 19 minutes in as a neat passing move eventually broke down but when Albie Morgan's pass rebounded off a defender's legs, it fell kindly for Lavery to fire home.\nBlackpool should have had a second moments later, but Morgan shot wide with the unmarked Lavery screaming for a pass to give him a simple tap-in.\nLavery's second goal came from his harrying of Brewers centre-back Sam Hughes, who surrendered possession too easily, the striker showing great composure to lob stranded keeper Jamal Blackman.\nBurton posed precious little threat in the first half though Joe Powell almost pulled one back in stoppage time, Dan Grimshaw palming his shot over.\nLavery blew a chance to complete his hat-trick 10 minutes after the break, skewing horribly wide.\nAt the other end Josh Gordon had Burton's best chance but a deflection took his finish wide and, with little else to trouble them, Blackpool eased to a comfortable victory.\nMatch report supplied by PA Media.\nBolton Wanderers 3-0 Lincoln City\nComeback defender Jack Iredale scored his first goal for the club as Bolton recorded their best opening day win for 12 years with a 3-0 League One success over Lincoln.\nAustralian Iredale had not played for last season's play-off semi-finalists since injuring his knee at Barnsley on 2 January.\nBut the ex-Cambridge star needed only four minutes to make an impact, heading in Aaron Morley's corner.\nThe Imps sought a quick response and Ben House fired a shot into the side netting.\nHowever, the Trotters were always in control and Randell Williams headed wide from debutant Josh Dacres-Cogley's cross before the interval.\nLincoln's set-piece frailty was evident again when Wanderers doubled their lead after 58 minutes. This time the unchallenged Victor Adeboyejo headed in from Williams' corner.\nBolton could not match their 4-0 win at QPR on the first day of the 2011-12 campaign but they added a third goal 16 minutes from time as Lincoln's new skipper Paudie O'Connor turned a cross from George Thomason - the substitute's first touch of the game - into his own net.\nMatch report supplied by PA Media.\nCarlisle 1-1 Fleetwood\nNewly-promoted Carlisle started life back in League One with a 1-1 draw against Fleetwood.\nOwen Moxon opened the scoring for the Cumbrians with a 30-yard free-kick, but it was cancelled out by Brendan Wiredu's strike just before half-time.\nCarlisle captain Paul Huntington went close to opening the scoring in the 29th minute, but his header from Moxon's floated free-kick was cleared from danger by Promise Omochere.\nSeven minutes later, Moxon put the home side ahead with a beautifully curled free-kick into the top left corner after he had been fouled by Scott Robertson.\nFleetwood equalised, though, in the fourth minute of first-half stoppage time as Wiredu's first-time volley flew into the bottom left corner after Huntington had headed clear Phoenix Patterson's cross.\nJordan Gibson had a great chance to restore Carlisle's lead just after half-time, but he miscued a shot from Fin Back's cross with the goal gaping.\nAt the other end, Omochere should have scored after Josh Vela's cross broke his way, but he pulled his effort across goal and wide.\nCarlisle substitute Joe Garner, formerly of Fleetwood, saw his late header saved by Jay Lynch as the spoils were shared.\nMatch report supplied by PA Media.\nCambridge United 2-0 Oxford United\nCambridge started their League One campaign with a 2-0 victory over Oxford.\nThe hosts moved ahead after 15 minutes when Saikou Janneh's shot was spilled by goalkeeper James Beadle, allowing Jack Lankester to fire home the rebound.\nJanneh played a major role in Cambridge's second goal 13 minutes later, producing an exhilarating run down the left touchline before providing a perfect cross which was nodded in from close range by debutant forward Gassan Ahadme.\nThe momentum could have been turned in the final seconds of the half when Josh McEachran played a short free-kick to Cameron Brannagan, but his effort from outside the box was pushed away by Jack Stevens.\nJanneh headed a James Brophy cross straight at Beadle, while at the other end Brannagan's fierce shot went only narrowly wide on the hour.\nStevens produced a big save 14 minutes from the end, keeping out a Stan Mills header from point-blank range, to help Mark Bonner's side make it five years unbeaten on the opening day of the season.\nMatch report supplied by PA Media.\nCharlton Athletic 1-0 Leyton Orient\nCharlton got their League One campaign off to a winning start with a 1-0 win against newly-promoted Leyton Orient.\nA first-half strike by captain George Dobson was enough for the south Londoners in their local derby.\nAlfie May was denied his first goal for the hosts after just four minutes, when Sol Brynn stopped his effort.\nOrient held their own in the first half - although they had to wait until the half-hour mark for their first attempt - as Ashley Maynard-Brewer turned away a Theo Archibald effort.\nHowever, the hosts broke the deadlock a minute before first-half injury time. Corey Blackett-Taylor found space on the left to cross the ball in low for Dobson to finish.\nOrient struggled for a breakthrough in the second half, although Tom James saw his effort after 57 minutes deflected over the crossbar.\nTyreece Campbell just failed to control the ball enough to round Brynn after 72 minutes, while May saw his shot four minutes later flash over the bar.\nSubstitute Panutche Camara missed a sitter in stoppage time to double the Charlton lead, but the hosts held on for the narrow victory.\nMatch report supplied by PA Media.\nDerby County 1-2 Wigan Athletic\nCharlie Wyke scored a brace as Wigan edged a 2-1 League One win at promotion favourites Derby as the new season got under way.\nWyke scored in each half, either side of Craig Forsyth's equaliser for Derby early in the second half.\nThe hosts created plenty of chances in the opening 30 minutes but Sam Tickle made good saves from James Collins and Nathaniel Mendez-Laing.\nSonny Bradley headed wide but Wigan also had their moments with Callum Lang narrowly off target before Thelo Aasgaard fired just over from 20 yards.\nIt got even better for Wigan in the 38th minute when Bradley's backpass sent Wyke through to round Joe Wildsmith and score.\nLang ran clear in the 45th minute but failed to beat Wildsmith and Latics were punished when Forsyth volleyed a superb 57th-minute leveller from Joe Ward's cross.\nForsyth was denied by Tickle in the 70th minute but - two minutes later - Wyke headed in Tom Pearce's cross.\nWigan, who started the season on minus eight points, held on through nine minutes of added time to claim an impressive win.\nMatch report supplied by PA Media.\nNorthampton Town 0-1 Stevenage\nStevenage started the new Sky League One season with a 1-0 victory at fellow promoted side Northampton.\nBoro's first ever win at Sixfields came courtesy of Carl Piergianni's scrappy late goal as Steve Evans' side began life in the third tier with three well-deserved points.\nCobblers hit the frame of the goal twice in the space of three minutes early on as Taye Ashby-Hammond tipped Patrick Brough's shot against the crossbar before Tyreece Simpson found the base of a post from an acute angle.\nStevenage enjoyed a good spell in the middle of the first half, with Ben Thompson sidefooting wide and Aaron Pressley volleying past the far post, and they continued to edge proceedings after the restart but clear-cut chances were few and far between.\nThe visitors failed to hit the target with a number of long-range efforts, but they increased the pressure and eventually took the lead with nine minutes remaining through Piergianni's close-range finish.\nJordan Roberts was denied by Lee Burge before Marc Leonard nearly rescued a point for the Cobblers, with his stoppage-time free-kick dropping narrowly wide.\nMatch report supplied by PA Media.\nPortsmouth 1-1 Bristol Rovers\nA dramatic added-time equaliser from debutant Kusini Yengi saw Portsmouth grab a draw against Bristol Rovers.\nLuke Thomas had put Rovers ahead in the first half and it appeared they were heading for an opening day victory in League One before Yengi's late strike.\nThe enthusiastic welcome the players received was not matched by either side in the opening period, with constant downpours making the pitch difficult to play on.\nRovers forced the early pressure and took the lead in the 24th minute. A quick break saw Jevani Brown go clear on the left and a low cross fell to the feet of Thomas, who confidently drove home.\nPompey produced two good efforts from Colby Bishop and Gavin Whyte as they pressed for an equaliser.\nThe second half saw the home side coming out all guns blazing and the same pair again caused problems. Whyte had a stunning strike pushed over by Matthew Cox within the first two minutes, followed quickly by a Bishop header that missed the target.\nIt appeared Rovers were going to hold on but Yengi headed home the equaliser two minutes into added time.\nMatch report supplied by PA Media.\nReading 0-1 Peterborough United\nTroubled Reading began life in League One with a dispiriting home defeat against Peterborough.\nThe Posh winner arrived shortly before the break through Ephron Mason-Clark's looping header, as the Royals played their first third-tier match in 21 years.\nReading had endured a torrid summer after relegation from the Championship, with numerous financial problems hampering the team rebuilding plans of new manager Ruben Selles.\nBut they enjoyed the better of the first half, with debutant Posh goalkeeper Nicholas Bilokapic forced into fine saves from Harvey Knibbs and Kelvin Ehibhatiomhan.\nPeterborough, beaten play-off semi-finalists last season, took a while to warm up.\nNew Posh skipper Mason-Clark saw a fierce drive superbly tipped over by Reading keeper Dean Bouzanis but he nodded home in the 43rd minute from a precise Kwame Poku cross.\nMason-Clark departed soon after the interval due to injury, with replacement Ricky-Jade Jones' angled effort denied by Bouzanis at his near post.\nReading pushed energetically for an equaliser late on but Peterborough held firm to complete a hard-earned win.\nMatch report supplied by PA Media.\nShrewsbury Town 1-0 Cheltenham Town\nRyan Bowman's second-half strike was enough to earn Shrewsbury a 1-0 win over Cheltenham and give new boss Matty Taylor the perfect start.\nThe Shrews skipper pounced in the 50th minute after Luke Southwood had to dive at full stretch to parry Ben Williams' header towards his own goal following Jordan Shipley's cross.\nBowman had shot wide a minute earlier after a long clearance from Marko Marosi caught out the away defence.\nThree Cheltenham staff, including director of football Micky Moore, left for Shrewsbury this summer, meaning there was an extra edge building up to the opening-day clash, but the game did not come to life until late in the first period.\nDaniel Udoh turned a low ball in from Shipley over for Shrewsbury and at the other end after Liam Sercombe's shot was saved, Rob Street nearly netted against his former loan club but Morgan Feeney's fine challenge denied him.\nAfter Bowman's goal, Udoh - back from a 12-month ACL injury absence - forced Southwood into a block at his near post in the 75th minute as Shrewsbury nearly made it 2-0, but they had done enough.\nMatch report supplied by PA Media.\nWycombe Wanderers 0-3 Exeter City\nTwo goals inside the opening five minutes helped Exeter to a 3-0 victory over a lacklustre Wycombe at Adams Park.\nDebutant Jack Aitchison and captain Will Aimson both bagged early goals, before the visitors had a Sam Nombe penalty saved after just 10 minutes.\nThe opening left Wycombe stunned and they were unable to fight back, with substitute James Scott scoring for the visitors seven minutes from time.\nAitchison was one of 13 debutants across both sides and made the perfect start since joining from Motherwell, scoring after just 24 seconds.\nA goalmouth scramble from a corner three minutes later then saw Aimson tuck home to double the lead.\nNombe could have made it three from the spot after Demetri Mitchell was felled by Max Stryjek, but the Wycombe keeper saved superbly.\nWycombe rung the changes and had second-half penalty appeals waved away after substitute Josh Scowen was barged over in the box, but failed to muster a single clear-cut chance and Scott's late goal saw Exeter seal victory.\nMatch report supplied by PA Media.", "url": "https://www.bbc.com/sport/football/66378688"}