{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-04-26 04:25:00", "date_modify": "2025-04-26 04:25:00", "date_publish": "2025-03-03 12:22:26", "description": "Wolves news: Matheus Cunha could face further punishment after Bournemouth red", "filename": "sport_football_articles_c7573k3pl9ko_1745641500.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60fa/live/ac4f0ed0-f827-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7573k3pl9ko_1745641500.html", "title": "Wolves news: Matheus Cunha could face further punishment after Bournemouth red", "title_page": "Wolves news: Matheus Cunha could face further punishment after Bournemouth red - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolves' Matheus Cunha is facing an anxious wait to discover if he will be charged by the Football Association after his red card at Bournemouth - which could have a huge impact on the Premier League relegation battle.\nThe striker was sent off after clashing with Cherries defender Milos Kerkez and had to be dragged down the tunnel as Wolves lost their FA Cup fifth-round tie on penalties on Saturday.\nCunha lashed out at Kerkez three times, fighting and kicking out at the Hungarian full-back before aiming a headbutt when Kerkez got back to his feet.\nReferee Sam Barrott eventually issued a red card but a furious Cunha - who scored the winner in Wolves' 1-0 league victory at Vitality Stadium last week - ultimately had to be escorted and pushed down the tunnel.\nThe FA could now issue a further charge following Cunha's refusal to leave the field.\nIt has until the end of Wednesday, with the club having a further three business days to respond.\nAnother three business days is given for the FA to reply, with a hearing held no later than 10 business days after their final response.\nCunha is already suspended for Wolves' games against Everton, Southampton and West Ham. A one-game extension to the ban would see him miss the crucial trip to relegation rivals Ipswich on 5 April.\nWolves are 17th, five points above the third-bottom Tractor Boys.\nCunha was suspended for two games in January after clashing with a member of Ipswich's security and grabbing his glasses from his face following the visitors' 2-1 win at Molineux in December.\nThat is not expected to be a mitigating factor in any further ban if the Brazil international is charged.", "url": "https://www.bbc.co.uk/sport/football/articles/c7573k3pl9ko"}