{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:47:47", "date_modify": "2025-05-21 05:47:47", "date_publish": "2025-01-14 14:22:42", "description": "Ulster announce full-back Ethan McIlroy sustained a \"significant\" knee injury in Saturday's defeat to Leicester Tigers.", "filename": "sport_rugby-union_articles_cz7ew2yqge7o_1747806467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0aef/live/dbaf87b0-d282-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cz7ew2yqge7o_1747806467.html", "title": "Ethan McIlroy: Ulster full-back suffered 'significant' knee injury in Investec Champions Cup game", "title_page": "Ethan McIlroy: Ulster full-back suffered 'significant' knee injury in Investec Champions Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster full-back Ethan McIlroy sustained a \"significant\" knee injury in Saturday's Investec Champions Cup defeat away to Leicester Tigers.\nMcIlroy, who was making his return from injury, was forced off after 22 minutes of the game at Welford Road after pulling up hurt when catching the ball.\nUlster said on Tuesday that the 24-year-old will visit a specialist to determine the extent of the injury.\nWing Zac Ward will follow return-to-play protocols after being forced off with a concussion midway through the second half.\nIn a boost to head coach Richie Murphy's back-three options, Michael Lowry and Stewart Moore have returned to full training ahead of Ulster's final Pool A match with Exeter Chiefs and will be assessed for selection.\nFirst-choice hookers Rob Herring and Tom Stewart will also be monitored ahead of the game after returning to training from injury.\nProgression in the Champions Cup is unlikely even if Ulster defeat Exeter on Friday; however, a draw or victory in Belfast would secure fifth in the pool and a place in the Challenge Cup.\nUlster have lost all three of their European matches so far this season, to Toulouse, Bordeaux and Leicester, while Exeter are also winless in the competition.", "url": "https://www.bbc.com/sport/rugby-union/articles/cz7ew2yqge7o"}