{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 04:15:47", "date_modify": "2025-05-21 04:15:47", "date_publish": "2025-04-05 18:39:32", "description": "After another chaotic meeting between the two, BBC Sport explains why Crystal Palace and Brighton are such bitter rivals.", "filename": "sport_football_articles_cx28km4dy0no_1747800947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1aaf/live/a301e100-1248-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx28km4dy0no_1747800947.html", "title": "Crystal Palace 2-1 Brighton: Why are Eagles & Seagulls rivals?", "title_page": "Crystal Palace 2-1 Brighton: Why are Eagles & Seagulls rivals? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a game that, for the neutral, had little riding on it - but try telling Crystal Palace and Brighton that.\nThree red cards - two for the Eagles, one for the Seagulls - and wild celebrations from the hosts following a dramatic 2-1 win showed that it wasn't 'just another game' to the teams involved.\nSupporters of other sides often poke fun at the fixture because of the 45-mile distance between the clubs, but it's a dislike that has been building since the 1970s.\nYou won't find anyone from either club referring to it as the 'M23 derby' - as it is so often called in some quarters - but this was the latest chapter in a serious rivalry.\nPalace went in front through Jean-Philippe Mateta in just the third minute when the striker, who has built cult hero status with supporters thanks to his goals and corner-kicking celebration, curled into the top corner.\nDanny Welbeck equalised with a goal that made him Brighton's all-time leading goalscorer in the Premier League, before wing-back Daniel Munoz scored what proved to be the winner.\nThen came the chaos.\nEddie Nketiah has had a mixed time at Crystal Palace since his move from Arsenal in a deal worth up to £30m. The one-time England international was brought on in the 68th minute here - only to be sent off 10 minutes later.\nHis first booking was for simulation when he went to ground in the penalty area after a challenge from Pervis Estupinan, and then he received a second yellow for a high foot on Brighton centre-back Jan Paul van Hecke.\nThe game looked like it was unravelling for the Eagles when Marc Guehi was sent off for a late challenge, leaving Palace with the prospect of playing a lengthy stint of added time - 12 minutes were signalled, almost 14 played - with nine players.\nThe red cards did not stop there and Van Hecke received one when he brought down Daichi Kamada six minutes into injury time.\nIt's a rivalry that might not leap to mind first for every football fan.\nBut a rivalry is exactly what Palace and Brighton have.\nIt all started when the two teams played each other five times in 1976.\nCrystal Palace were managed by Terry Venables and Brighton were led by Alan Mullery. The two had been team-mates at Tottenham Hotspur but were never close.\nIt was an FA Cup first-round tie, rather than a league game, that caused the original controversy.\nThis was in the days before penalty shootouts were an option to decide FA Cup ties. If a match was drawn, there was a replay. And the teams involved kept on replaying until there was a winner.\nAfter two draws, Crystal Palace beat Brighton 1-0 in the third game.\nAfterwards, Brighton boss Mullery says he had a pot of boiling hot coffee poured on him by Palace fans.\n\"So I pulled a handful of change out of my pocket, threw it on the floor and shouted, 'That's all you're worth, Crystal Palace,'\" he told the Guardian - and since then the two clubs have never got on.\nBrighton used to be known as the Dolphins but changed their nickname to the Seagulls and Palace fans argue it was done to be similar to their nickname, the Eagles.\nPalace have been in the Premier League since 2013 - thanks to goals from club icon Wilfried Zaha, they beat Brighton in the Championship play-off semi-final on their way to sealing promotion at Wembley.\nThat game also had its own issues, though, as on entering their dressing room before the match, the Palace team found excrement on the floor.\nNow both in the Premier League, the teams meet more regularly - with a number of tight recent encounters. Before Saturday's incident-packed game, the five previous matches at Selhurst Park had ended 1-1.\nThis time, Palace won a game that will live long in the memory - completing their first league double over Brighton since the 1932-33 season, when both were in the third division.\nCrystal Palace boss Glasner on his feelings after the game: \"It's a massive win but I'm really exhausted because there was so much going on and [because of] this atmosphere in the stadium.\n\"The fighting spirit of the team and the togetherness with our fans, it is just really great to experience.\n\"We talked about it very often, these moments you can't buy. You can't buy, you have to experience and that is great to get this experience and be part of it. Even so, I'm really happy to lay on my sofa and just do nothing today.\"\nOn joining in with crowd chants: \"I could see how the players were fighting together in many situations.\n\"Brighton are such a good team, such quick players and I felt that they need all the support we can give.\n\"It was a fantastic atmosphere. I needed something to do with my arms as I couldn't keep them in my pockets. At the end, it's a really fantastic win today.\"\nOn feeling like stoppage time would never end: \"We defended with a lot of passion, with a lot of heart but always waiting for this moment to go forward. This is the mindset, this togetherness, this spirit that everybody could see.\n\"Like when JP [Mateta] and Maxence [Lacroix] celebrated on the pitch but it was still not over because we thought maybe we would play until sunset. This spirit is unbelievable. It is the character of this group and the character of these players.\"\nBrighton manager Fabian Hurzeler on how the game played out: \"Very emotional game, a very wild game. Difficult to get a rhythm into this game especially in the second half.\n\"That was a little bit to our disadvantage. We weren't able to control the game like in the first half because of everything. The emotional final part of the game didn't help us to control it.\nOn his team not being mature enough? \"For sure. Especially in derbies, it is very important to stay rational. Of course to have these emotions inside of you but in the right moments and at the right timing.\n\"In some moments, we weren't mature enough. It didn't help us to get the rhythm back and that is something we have to learn.\"", "url": "https://www.bbc.com/sport/football/articles/cx28km4dy0no"}