{"authors": ["Andy West", "www.facebook.com"], "date_download": "2025-05-19 14:31:03", "date_modify": "2025-05-19 14:31:03", "date_publish": "2017-08-02 14:31:44", "description": "With Barcelona on the brink of crisis, why did Neymar decide to leave for PSG, who could replace him and what are the ramifications?", "filename": "sport_football_40804584_1747665063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16D24/production/_97167439_messiiconicneymar_fcbarcelona.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40804584_1747665063.html", "title": "Neymar: Was this the moment PSG target decided to leave Barcelona?", "title_page": "Neymar: Was this the moment PSG target decided to leave Barcelona? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In March, Barcelona achieved one of the most remarkable comebacks in Champions League history as three goals in the final seven minutes secured a sensational 6-5 aggregate victory over Paris St-Germain.\nThe chief inspiration on that historic night, without any doubt, was Neymar, who capped a brilliant performance by scoring the first two of those late goals before assisting Sergi Roberto's winner with a perfectly placed chipped cross.\nThe following day, the high emotions of the unforgettable occasion were encapsulated by the publication of a dramatic image which quickly went viral: Lionel Messi in a Messiah-like pose, standing on the advertising boards to celebrate the victory as awestruck fans hailed his glory.\nAt that precise moment, Neymar decided enough was enough: he had just delivered the best performance of his career to inspire an amazing victory, and still everyone was talking about Messi.\nThat, at least, is an intriguing theory proposed by journalist Ramon Besa in Spanish newspaper El Pais, , externalattempting to understand why Neymar is packing his bags from Barcelona for Paris.\nAlthough Neymar and his entourage have not yet revealed their precise motives, the general belief is that he is no longer content to play second fiddle to Messi.\nAt the prime age of 25, with a potentially career-defining World Cup on the horizon, he has opted to join a club who will make him the centre of attention, both on and off the pitch.\nAnd in doing so, he has left Barca on the brink of a full-blown crisis.\nWhatever the reasons for Neymar's departure, it is merely the latest in a long line of serious setbacks to have hit the Catalan club in recent years.\nNeymar was also at the centre of the biggest, with allegations of tax evasion during the Brazilian's transfer from Santos eventually forcing the resignation of then president Sandro Rosell, who is now facing a long prison sentence in a separate money-laundering case.\nAfter assuming office in 2014, Rosell's long-time associate and successor Josep Maria Bartomeu soon saw the club handed a transfer ban from Fifa after breaking regulations on the signing of youth players from overseas.\nThat's not all. Many fans believed that Barca's 'More Than A Club' motto was sacrificed for commercial reasons in a recently expired shirt sponsorship with Qatar Airways, and there is ongoing concern that the supply of youth talent from the famed 'La Masia' academy system has dried up.\nAnother cause for complaint has been a loss of the club's playing identity, with the departure of Xavi leading to the emphasis on midfield dominance being jettisoned for a more direct approach by manager Luis Enrique, who was consequently unpopular with many fans before his departure at the end of last season.\nThere has also been great sadness at the death of the club's most influential figure, Johan Cruyff, who fell victim to cancer last year - as did ex-manager Tito Vilanova, Pep Guardiola's former assistant, two years previously.\nSo it has been a rough ride for Barca fans, but throughout those travails they could always console themselves that their club remained untouchable in their position at the pinnacle of world football: scandals came and went, but Barca's power and influence remained undimmed and unmatched.\nNow, though, they have suffered the rare shock of losing their second most important player entirely against their will, and the club's previously impregnable confidence has been shaken to the core.\nFrom Barcelona's point of view, this summer was supposed to be about three things: extending Messi's contract (finally achieved last month), strengthening the midfield (ironically, PSG's Marco Verratti was the chief target), and easing in new manager Ernesto Valverde.\nThe prospect of Neymar leaving was never considered as a real possibility, and even when the initial reports of PSG's interest first surfaced they were dismissed as the usual silly season inconsequential rumours.\nWith the player himself remaining silent, it took a long time for anyone in Barcelona to actually believe that Neymar might go.\nThe uncertainty and confusion around his future was perhaps best illustrated by Gerard Pique's infamous \"he stays\" tweet, external - if even one of Neymar's most senior and influential team-mates didn't know what was going on, how on earth could anyone else?\nSince it became clear that the Brazilian really does intend to leave, he has predictably become the target of much bitterness - on Monday, homemade signs denouncing him as a 'traitor' and 'mercenary' appeared on lampposts around the Nou Camp, and social media is full of similar smears from furious Barca fans.\nInterestingly, the dressing room appears to have moved in a similar direction. A couple of weeks ago, Barca's players were reported to be pleading with him to stay and expressing those sentiments in news conferences.\nBut the last few days, perhaps accepting the inevitable, have been met with a deafening silence amid widespread reports in the Spanish media that senior players, including Messi, have been angry with the way Neymar has treated them and the club.\nConsidering Neymar's ability to influence a game and the on-pitch chemistry he enjoyed with Messi and Luis Suarez, replacing him will be a major task.\nFor the past three seasons Barca's 'MSN' forward line have enjoyed unprecedented success, scoring an outrageous combined total of 364 goals - enough to overcome the team's structural weaknesses and claim eight trophies, including a La Liga, Copa del Rey and Champions League treble in 2015.\nOn the plus side, Neymar's departure does open up the possibility for new boss Valverde to move away from the overwhelming reliance on just three players and instil a more team-focused approach.\nBut Neymar's contribution has been pivotal, scoring 105 goals and providing 59 assists during his time with the club, and the idea that somebody else - whoever it is - will be able to step into his shoes is unrealistic.\nThe most heavily touted potential signing is Liverpool star Philippe Coutinho, who continues to be linked with Barca despite Jurgen Klopp's repeated insistence that his star player is not for sale.\nBut in tactical terms Coutinho would not be the most obvious recruitment, because Neymar's departure leaves Barca in need of a player who can provide pace and penetration from the left wing - and the same argument counts against highly rated Juventus star Paulo Dybala.\nIn that context, Kylian Mbappe of Monaco, Chelsea ace Eden Hazard and Atletico Madrid's Antoine Griezmann would be better options, but they will all be very difficult to obtain with Mbappe likely to join Real Madrid while Hazard and Griezmann will be tough to prise away from their current clubs.\nSo perhaps Barca's best bet would be Borussia Dortmund's 20-year-old France international Ousmane Dembele, while a partial swap deal with PSG for Angel di Maria would also be intriguing.\nOne thing is for sure: after selling Neymar for 222m euros, Barca will not be short of funds.\nThe loss of Neymar could prove to be highly significant off the pitch, with the controversial transfer set to contribute heavily to an ongoing battle in the Nou Camp's corridors of power which could well see Bartomeu voted out of office.\nThe current president's biggest critic is Agusti Benedito, who was among the losing candidates at the last elections in 2015 but has since continued his quest to unseat Bartomeu.\nSpeaking to BBC Sport, Benedito believes the current board bears a \"very evident responsibility\" for the loss of Neymar, explaining: \"The player has the final word, but the board is responsible for creating the circumstances in which that decision is taken.\n\"Ultimately, what Bartomeu has achieved is earning 220 million euros. And if you look at it economically, we have made an extraordinary sale - nobody has ever sold a player for that much money.\n\"But I'm with [Barca captain] Andres Iniesta, who said last week that he'd prefer to have Neymar than the money.\"\nLike many fans, Benedito is downcast at the prospect of losing Neymar, believing it will be impossible to replace him with a player of equal standing.\n\"I use the analogy of chess,\" he said. \"At Barca, Messi is the king but Neymar was the queen, and in chess you are never interested in sacrificing your queen.\n\"If you sacrifice your queen for a knight or a bishop, it's always a bad deal. And that's what we're talking about here. We have sold our second most important piece and it is disastrous for the team.\"\nEven before Neymar's departure, Benedito had already announced a motion of censure against Bartomeu in an ongoing bid to force early presidential elections.\nWith ex-president Rosell facing a long jail sentence and the club still haunted by all the controversies of recent years, Benedito was eager to emphasise that his unhappiness with the running of the club stems from much more than just football.\n\"Rosell and Bartomeu are two sides of the same coin,\" he claimed. \"And we are in an extremely grave situation institutionally - I repeat, institutionally. Not only in sporting terms.\n\"There have never been so many reasons to introduce a motion of censure, and I think it's completely fair that the club's members should decide whether the board continues or not. It's a matter of democracy.\"\nNeymar might finally be going, but the aftermath is only just beginning to unravel.", "url": "https://www.bbc.com/sport/football/40804584"}