{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 07:16:00", "date_modify": "2025-05-21 07:16:00", "date_publish": "2025-05-20 10:34:02", "description": "Immanuel Feyi-Waboso will take part in a two-day training camp with England later this week as he continues towards a comeback from a dislocated shoulder.", "filename": "sport_rugby-union_articles_clynn24407eo_1747811760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d36/live/b6105210-3564-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clynn24407eo_1747811760.html", "title": "Immanuel Feyi-Waboso: England wing returns for training camp", "title_page": "Immanuel Feyi-Waboso: England wing returns for training camp - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter and England wing Immanuel Feyi-Waboso's prospects of playing Test rugby this summer increased after the 22-year-old was selected for a two-day England training camp this week.\nFeyi-Waboso has not played since dislocating his shoulder in December, with his comeback delayed by a setback suffered at an England camp in February.\nGloucester centre Seb Atkinson, Leicester back row Emeke Ilione and Sale midfielder Rekeiti Ma'asi-White are also included in a 33-strong group that does not include either British and Irish Lions, or players from Northampton and Bath, who are preparing for European finals this weekend.\nGloucester's 20-year-old prop Afolabi Fasogbon, who was ruled out of Six Nations contention with an ankle injury, is named, along with the likes of Jamie George, George Ford and Ben Curry, who missed out on Lions selection earlier this month.\nIn 2017, England toured Argentina in the same summer that the Lions were taking on New Zealand.\nA teenage Tom Curry and Sam Underhill made their Test debuts against the Pumas and a little more than two years later were key parts of a Rugby World Cup semi-final win over New Zealand.\nHead coach Steve Borthwick expects similar to happen again this year with 13 of his players selected for the Lions tour of Australia.\n\"There is no doubt players will emerge this summer and will be part of the Rugby World Cup 2027 squad that wouldn't have been if we had to pick it today,\" he told 5 Live Sport.\n\"I have no doubt. It is the same thing that happened in 2017 - players grab the opportunity.\n\"I told them today that opportunity rises and change happens – the players that get the chance have to grab hold of it with both hands.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/clynn24407eo"}