{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:33:13", "date_modify": "2025-05-21 04:33:13", "date_publish": "2025-01-23 17:32:52", "description": "The January arrivals continue at Glentoran as Larne midfielder Joe Thomson agrees a two-and-a-half-year deal with the Oval club.", "filename": "sport_football_articles_clykzlx17x5o_1747801993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/08b8/live/32f20240-d9af-11ef-a6db-29ca006e3088.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clykzlx17x5o_1747801993.html", "title": "Joe Thomson: Glentoran add to squad by signing Larne midfielder", "title_page": "Joe Thomson: Glentoran add to squad by signing Larne midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran have made a further signing by snapping up Larne midfielder Joe Thomson for an undisclosed fee.\nThe 28-year-old's arrival is the latest during an January transfer window which has already seen winger Christie Pattisson move from Waterford and Shane McEleney and Ciaran Coll join the Oval outfit from Derry City.\nFormer Scotland Under-21 international Thomson has agreed a two-and-a-half-year deal with the Glens.\nA product of Celtic's academy, Thomson had loan spells at Dumbarton, Livingston and Queen of the South before establishing himself at Dunfermline Athletic and later Derry City, where he played under Glens boss Declan Devine.\nThomson moved Larne in January 2023 and helped them win consecutive Irish Premiership titles and achieve qualification for the Uefa Conference League.\n\"I'm absolutely delighted to sign for Glentoran,\" said Thomson.\n\"As an opposition player, it was always a challenge [to play at the Oval] and I can't wait to experience that incredible support as a home player.\"\nDevine described Thomson as a \"proven performer with a blend of quality, tenacity and creativity that makes him an outstanding box-to-box midfielder capable of influencing games at both ends\".\n\"His arrival bolsters an already competitive midfield group featuring [Fuad] Sule, [James] Singleton, [Cameron] Palmer, [James] Douglas, [Charlie] Lindsay and [Finley] Thorndike, adding both depth and quality to a crucial area of the team,\" added the Glentoran manager.\nThe east Belfast outfit won their first trophy since the 2020 Irish Cup when beating Larne on penalties to secure the County Antrim Shield on Tuesday night.", "url": "https://www.bbc.com/sport/football/articles/clykzlx17x5o"}