{"authors": ["Tim Oscroft", "www.facebook.com"], "date_download": "2025-05-21 06:51:09", "date_modify": "2025-05-21 06:51:09", "date_publish": "2025-01-04 07:35:01", "description": "Rishabh Pant hits a brilliant 61 but Scott Boland takes 4-42 as India lead Australia by 145 with four wickets remaining after day two of the final Test.", "filename": "sport_cricket_articles_crrw4pqyjd9o_1747810269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/da54/live/e06a4520-ca75-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_crrw4pqyjd9o_1747810269.html", "title": "Australia vs India: Rishabh Pant hits 61 but fifth Test finely poised", "title_page": "Australia vs India: Rishabh Pant hits 61 but fifth Test finely poised - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rishabh Pant's stunning 61 helped give India a lead of 145 runs in the final Test against Australia after an enthralling second day that saw 15 wickets fall.\nThe wicketkeeper-batter produced the explosive innings off just 33 deliveries after Scott Boland had put the home side in the driving seat at the start of India's second innings.\nThe Australia fast bowler took three quick wickets in an inspired spell after his side had posted a first innings of 181.\nDebutant Beau Webster top scored for the hosts with 57 as India took a first-innings lead of just four runs.\nIndia captain Jasprit Bumrah walked off the field early in the afternoon session and left the ground to have an injury assessed, although he was seen returning before the close of play.\nOne of Boland's victims was Virat Kohli as the India great's final Test innings on Australian soil ended for six as the tourists finished the day on 141-6.\nPant's arrival at the crease came moments after Kohli had been smartly caught by Steve Smith at slip and that significant moment was quickly followed by the explosive left-hander hitting Boland over the long-on boundary for six.\nHe missed an attempted ramp shot completely two deliveries later but was not to be deterred and at one stage Australia captain Cummins had six fielders on the rope.\nMitchell Starc, taken for 16 by Yashasvi Jaiswal in the first over of the innings, was hit for two consecutive sixes as Pant reached a frantic 50 off only 29 deliveries, one slower than the record he set against Sri Lanka in 2022.\nA swipe off Cummins through to Alex Carey brought the mayhem to an end, and Ravindra Jadeja and Washington Sundar piloted India to stumps after Nitish Kumar Reddy had holed out to Cummins at mid-off.\nSmith dropped Jadeja to deny the impressive Webster a second wicket just before the close.\nWhile it remains to be seen whether Bumrah will bat on day three, it feels more certain the Border-Gavaskar Trophy - which Australia lead 2-1 - will be decided with plenty of time to spare.\nAustralia's decision to replace the out-of-form Mitchell Marsh with Webster looks an inspired one after the 31-year-old Tasmanian made an important contribution on his second day of Test cricket.\nWith Australia in trouble at 39-4 after Mohammed Siraj had dismissed Sam Konstas and Travis Head in the same over, Webster knuckled down with a determined innings that included six fours.\nHe then claimed his first Test wicket when a swipe from Shubman Gill was pouched by Carey, and should have had Jadeja as his second - but Smith could not hold on to a one-handed effort in front of Usman Khawaja at first slip.\nThe bowling honours for Australia went to Boland, who was an immediate threat after Starc had proved expensive.\nThe delivery that moved off the seam to clip Jaiswal's off stump was a highlight for the popular 35-year-old Victorian.\nIf Boland and the rest of the attack can finish India off quickly on the third morning then Australia will have a good chance of winning the match and making sure of the series victory.\nThat said, the dramatic second day suggested making predictions is folly, and the availability of Bumrah will surely prove to be crucial.\nAustralia's Alex Carey on ABC: \"The game is in the balance, it is exciting Test cricket in fast-forward mode.\n\"The pitch has not died down, I have not seen as much bounce at the SCG for a while. Let's see if we can take four early ones, and see how we go.\n\"250 would be a lot to chase, we will back ourselves to take those four quickly. We are creating chances.\n\"These two batters have proved difficult to get out in this series but there is enough there. If we can get them out and get their bowlers in, hopefully we can run through them.\n\"I thought Beau's innings was fantastic, he jumped on anything full - he's a big boy and killed off the movement.\"\nFormer Australia fast bowler Glenn McGrath on ABC: \"There is enough in this pitch that if you get on a roll when bowling, you can knock two, three or four wickets over very quickly.\n\"Without Pant's innings, India would be in some serious trouble. If you are just looking to defend on this pitch, one has got your name on it. You have to look at putting pressure on the bowlers, you have to find a way to score runs.\n\"If you are just looking to survive then it is all over.\"", "url": "https://www.bbc.com/sport/cricket/articles/crrw4pqyjd9o"}