{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 05:00:44", "date_modify": "2025-05-21 05:00:44", "date_publish": "2025-04-04 10:55:44", "description": null, "filename": "sport_football_articles_cgen9ggled4o_1747803644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4086/live/49cbc160-113e-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgen9ggled4o_1747803644.html", "title": "Wolves news: Boss Vitor Pereira marks milestone in football management", "title_page": "Wolves news: Boss Vitor Pereira marks milestone in football management - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves boss Vitor Pereira will mark his 600th game in management against Ipswich on Saturday.\nThe Portuguese replaced Gary O'Neil in December when Wolves were four points from safety and has guided them to 17th and nine points above the Premier League relegation zone.\nOnly Liverpool (17) and Arsenal (14) have earned more points than Wolves (13) in the past two months.\nWolves go to Portman Road closing in on survival and a win over the third-bottom Tractor Boys will restore their 12-point advantage over their rivals.\n\"Six hundred matches across the world, filled with moments of great joy as well as challenges,\" Pereira said. \"Football is just like life - a world of intense emotions. It is an immense privilege to be in this great league, which I consider the best in the world and to help Wolverhampton achieve its goals.\n\"These include securing our place in the Premier League while playing quality football and fostering a true sense of unity between the players, fans, club and city. We take great pride in our work, restoring joy and a sense of belonging to our fantastic supporters.\"\nPereira started his managerial career with Sanjoanense in 2004 while he has also had two spells at Porto and Fenerbache and time at 1860 Munich, Olympiacos, Corinthians, Flamengo and Al-Shabab before joining Wolves.\nHis record stands at 320 wins, 144 draws, and 135 defeats, having won two titles in Portugal and the double in Greece.", "url": "https://www.bbc.com/sport/football/articles/cgen9ggled4o"}