{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-05-21 03:46:57", "date_modify": "2025-05-21 03:46:57", "date_publish": "2025-01-05 20:48:48", "description": "Britain's Mia Brookes produces another stunning display of big air snowboarding to seal back-to-back World Cup victories.", "filename": "sport_articles_c4gl1jzz2nlo_1747799217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c60a/live/ba765970-cba7-11ef-89db-bb3259d092c8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4gl1jzz2nlo_1747799217.html", "title": "Mia Brookes clinches back-to-back big air World Cup wins", "title_page": "Mia Brookes clinches back-to-back big air World Cup wins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mia Brookes produced another stunning display of big air snowboarding on Sunday to seal back-to-back World Cup victories.\nThe 17-year-old Briton won last month's event in Beijing and followed that up with another victory in Klagenfurt, Austria.\nSitting third after her first jump, Brookes did just enough with her second and third runs to climb above Japan's Mari Fukada into the gold medal position.\nBrookes, who became the youngest ever snowboard world champion in slopestyle in 2023, clinched victory after claiming the best run score of the day with her final attempt (95.75), just as she did in Beijing.\nShe finished with a total score of 184.25 - two points clear of Fukada, whose compatriot Momo Suzuki was third with 166.75.\n\"It was insane, I surprised myself,\" Brookes told the BBC.\n\"I didn't even plan to do a 14 (cab 1440 melon trick). I knew I could do the trick, it was just whether I could get it round on the jump.\n\"I did the same thing in China. Going in to that third run I was like 'I've done the stuff I wanted to do and I'm happy. I might as well give it a swing and see what happens'.\n\"It feels kind of unreal. I think it needs to sink in. It's insane to say I've won two back-to-back competitions.\"\nThe next World Cup event takes place in Kreischberg, Austria, next weekend.", "url": "https://www.bbc.com/sport/articles/c4gl1jzz2nlo"}