{"authors": ["Matt Warwick", "www.facebook.com"], "date_download": "2025-05-20 14:39:01", "date_modify": "2025-05-20 14:39:01", "date_publish": "2023-07-28 12:36:25", "description": "As Formula 1 goes through a cycle of domination for one team and one driver, there is racing elsewhere which could not be more dramatic.", "filename": "sport_motorsport_66339103_1747751941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/286B/production/_130574301_jakedennis.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_motorsport_66339103_1747751941.html", "title": "Formula E: Jake Dennis leads title race before 'high-pressure weekend' at London E-Prix", "title_page": "Formula E: Jake Dennis leads title race before 'high-pressure weekend' at London E-Prix - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Formula 1 goes through a cycle of domination for one team and one driver, there is racing elsewhere which couldn't be more dramatic.\nFollowing a thrilling centenary edition of the Le Mans 24 Hours race last month, which Ferrari won on their first appearance for 50 years, this season's Formula E season is coming to a head, with four drivers all within a shout of taking the title at the weekend's two-race season finale in London.\n\"It's never been more competitive,\" says new Formula E CEO Jeff Dodds, \"coming at a time when I think other parts of the motorsport industry are struggling to deliver that level of excitement.\"\nThe all-electric racing series is now in its ninth season, and its 'gen 3' cars reach speeds approaching 200mph.\n\"These are exciting times with battery racing,\" says Briton Jake Dennis, who leads the title race heading into the London E-Prix.\n\"The gen 3 car is a huge step forward in technology for the batteries; the cars reach top speeds of 280kph, which is impressive compared to previous years when gen 1 could only do half a race before drivers had to swap cars.\n\"It's a high development rate.\"\nDodds adds: \"There's no question the biggest impact we can have is to help accelerate the move to electric vehicles. And we aren't anywhere near unlocking the potential of these cars.\n\"The faster we move to electric vehicles, the faster we can have an impact on the carbon footprint. I think the current trajectory is that if we continue at the current rate of 25% electric vehicle growth each year, by 2030 we will use five million barrels of oils a day less.\"\nWhile Lewis Hamilton, George Russell and Lando Norris wait behind the dominant Max Verstappen for their turn on the top step of the Formula 1 podium, Dennis is on the verge of making history as Britain's first Formula E champion.\nHe is one of four drivers mathematically capable of winning, with New Zealanders Nick Cassidy and Mitch Evans and Germany's Pascal Wehrlein between 24 and 49 points adrift.\nA race win is worth 25 points, with bonuses for pole position and the fastest lap.\nDennis is serene as he heads into a huge few days.\n\"It's a high-pressure weekend; a home race, a lot of family and friends there, British fans,\" he says. \"There's pressure on my shoulders, but I don't feel it too much.\"\nDennis has been competing in Formula E since 2020, driving for the Avalanche Andretti team. After two wins and six second places already this season, the 28-year-old is the likeliest candidate to become the eighth Formula E champion.\nGiven he is familiar with Formula 1 machinery as a Red Bull development driver, his class was never in doubt.\nAnd while he thinks he is a \"little old\" to appear on the F1 grid, he is very happy on the often chaotic street circuits of Formula E.\n\"I've driven every single-seater there is to drive and Formula 1 cars are incredible machines.\n\"But Formula E is a different category - we're not trying to achieve what F1 are trying to do. The way you drive the car is different; the way you hit the brake pedal, turn the wheel - it's a different style.\"\nThe lack of female drivers competing in motorsport's elite events is stark - and it is safe to say none will make the breakthrough in F1 without the same having happened in series such as Formula E.\nYet even the Formula E rookie test line-up - where drivers can get used to the speeds of the gen 3 cars and be in the shop window for teams - does not feature any female drivers.\nWomen beat men regularly in sports cars and in Formula E's sister rally series Extreme E, in which teams must field one man and one woman.\nSo what has to happen?\n\"It's a question which gets asked fairly regularly,\" says Dodds. \"I absolutely agree we need more diversity in motorsport - not just drivers, but in all areas. I really believe women and men can compete against each other.\n\"Part of the challenge of my era is to bring more diversity to the series. Part of the challenge is to get more women to want to get into Formula E.\n\"Whether it's season 10 or 11, one thing for sure is that it is a key focus.\"\nDennis adds: \"Formula E is a great opportunity for any female driver to come in.\n\"If they have talent and have speed, any racing team can allow them to come in - it's great for them and great for the sport to come in and perform at a high level.\"", "url": "https://www.bbc.com/sport/motorsport/66339103"}