{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:38", "date_modify": "2025-05-21 05:33:38", "date_publish": "2025-04-02 16:13:52", "description": "Ross Graham on being local Dundee United hero and sporting weekend to remember", "filename": "sport_articles_creqj1yeelpo_1747805618.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6fd/live/4ecd3c30-0f0d-11f0-8926-611e8cb1ab81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_creqj1yeelpo_1747805618.html", "title": "Ross Graham on being local Dundee United hero and sporting weekend to remember", "title_page": "Ross Graham on being local Dundee United hero and sporting weekend to remember  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United defender Ross Graham had a weekend to remember, and not just for his winning header against Ross County.\nJim Goodwin's side all but secured a top-six berth, a magnificent feat for a newly-promoted side, but the Graham household had another sporting achievement to celebrate as well.\nHis partner, Anastasia Vaipan-Law, was taking part in the World Figure Skating Championships in Boston and secured a spot on Team GB for next year's Winter Olympics.\n\"Yeah, it's been a very special week for the two of us, probably more for her, probably a bigger achievement,\" Graham told BBC Scotland.\n\"She finished 12th and qualified for a spot for next year's Winter Olympics. So, yeah, it's a very happy household.\"\nUnited's stellar top-flight form is particularly sweet for 24-year-old Graham, having joined the club's academy over a decade ago and worked his way to the first team as a local lad.\nHe said: \"You can't beat that feeling, being from the area, you know a lot of people in the stands who are out watching and supporting you all the time and you go to shops and you're always speaking to fans and they're always wanting to speak to you.\n\"So it's a nice feeling after you've scored and you've got a win and you just know how much it means to them.\"\nOn a possible push for a European spot, he adds: \"We're not looking too far ahead into that just now. We want to get the job done of securing top six first.\"", "url": "https://www.bbc.com/sport/articles/creqj1yeelpo"}