{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:40:49", "date_modify": "2025-05-20 14:40:49", "date_publish": "2023-07-28 10:25:16", "description": "‘I don't really want a break’ - Kelly", "filename": "sport_articles_c2l9p7g22ejo_1747752049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f3b2/live/09ed6610-2d2f-11ee-81a6-8f7e7ff66d52.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c2l9p7g22ejo_1747752049.html", "title": "‘I don't really want a break’ - Kelly", "title_page": "‘I don't really want a break’ - Kelly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell goalkeeper Liam Kelly insists he is “not interested in taking any breaks” as his side eye Viaplay Cup progress this weekend when they host East Fife.\nThe 27-year-old was in the Scotland squad for the Euro 2024 qualifiers against Norway and Georgia and swiftly returned to pre-season with the Steelmen.\n\"I got four or five days after the last game of the season and went away to Spain, then came back and I was away with Scotland for a training camp,\" said Kelly.\n\"After the Georgia game on the Tuesday night, I was back in here on the Friday morning.\n\"No real break other than a few days but I love football, I don't really want a break, I will get a break when I finish.\n\"I am not interested in taking any breaks, I will be in here trying to train as much as I can and play as many games as I can, I love that.\"\nStuart Kettlewell handed Aston Oxborough his debut against Queen of the South in the second group game ending a run of 112 consecutive games for Kelly since he joined in January 2021.\n\"That day was always going to come for me, there was always going to be a game when I wasn't going to play and that's the manager's decision and I respect that,\" he said.\n\"I want to play every game, everyone wants to play every game. It's not always going to happen.\n\"Big Aston came in and did absolutely fine in the game and obviously had a really good save for the penalty, so that wasn't an issue.\n\"I was disappointed but that day was always going to come for me and I was always going to be disappointed.\"", "url": "https://www.bbc.com/sport/articles/c2l9p7g22ejo"}