{"authors": ["Michael Pearlman", "www.facebook.com"], "date_download": "2025-05-21 04:12:56", "date_modify": "2025-05-21 04:12:56", "date_publish": "2025-02-09 13:57:05", "description": "Swansea rip up the Championship form book as Josh Tymon's goal gives them a 1-0 win against play-off-chasing Bristol City at Ashton Gate.", "filename": "sport_football_articles_c9vm3044329o_1747800776.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/628c/live/36803690-e6eb-11ef-96cd-45cf16ace6f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9vm3044329o_1747800776.html", "title": "Tymon earns Swansea surprise win at Bristol City", "title_page": "Josh Tymon earns Swansea surprise win at Bristol City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City ripped up the Championship form book as Josh Tymon's goal gave them a 1-0 win against play-off-chasing Bristol City at Ashton Gate.\nThe hosts had won four home games on the spin and they dominated the first half against a Swansea side who were without a victory since December, but visiting goalkeeper Lawrence Vigouroux denied the Robins with two excellent saves.\nSwansea were markedly improved after the interval and took the lead when Tymon was in the right place to fire home a rebound in front of the visiting Swansea supporters.\nVigouroux continued to stand firm as Bristol City pushed for an equaliser and he denied Sam Bell by tipping his effort on to the post.\nThe win lifts Swansea to 16th in the Championship, with Bristol City remaining ninth, three points off the play-off places.\nThere can be little question the form book was ripped to shreds at Ashton Gate with Bristol City's quiet January sure to be firmly in the spotlight as they missed a massive chance to move into sixth spot.\nThe Robins were one of only two clubs in the Championship to make no signings in the January transfer window - along with league leaders Leeds - but having won their past four league games at Ashton Gate, Liam Manning was able to make three changes to the team held 1-1 by Oxford United.\nSwansea, who made four changes to the side beaten by Coventry City, have found clean sheets hard to come by in recent weeks as they have slid down the Championship, with boss Luke Williams admitting in recent week the club need to \"stop making the fans unhappy,\" but they defended resolutely throughout.\nIt was no surprise that the hosts started strongly and it was home danger man Scott Twine who had the first opportunity of the match as he fired against a defender and then over the crossbar inside the penalty area.\nSwansea are adjusting to life without Matt Grimes, who has been an almost ever present presence in their side for a decade and then could easily have been behind in the opening exchanges as goalkeeper Vigouroux produced a superb reflex save to tip Lawrence Knight's powerful header over the crossbar.\nTwine has been involved in five goals in his last six home games in the Championship, scoring four and assisting one, and his set-piece delivery continued to trouble Swansea with Vigouroux producing another excellent sprawling save to deny Luke McNally's low volleyed effort on 23 minutes.\nBristol City looked a huge threat from every corner and free-kick and defender Rob Dickie headed over unmarked from a corner on 34 minutes, moments after Swansea's first opportunity of the contest was thwarted as Ronald finished meekly after Kyle Naughton's excellent pass split the Robins defence.\nThe Swans might have even sneaked into half-time ahead, but Zan Vipotnik could not apply the finish after another precision pass by Naughton sent him clear, with the Slovenia international striker failing to get a proper connection on his shot.\nLosing has become a habit for the Swans in recent times but they took the lead on 54 minutes as Vipotnik and Franco exchanged passes before Bristol City goalkeeper Max O'Leary was only able to parry Franco's shot into the path of Tymon, who applied the finish.\nThe Swans had lost four successive games on the road in the Championship and the hosts began to probe for an equaliser, with Dickie again heading off target from a set-piece as the home fans tried to lift their side.\nHowever, Swansea were having more and more joy on the counter and they missed an incredible chance to lead 2-0 when debutant Lewis O'Brien picked out Eom Ji-Sung who was totally unmarked, but he fired first time - despite having the time and space to take a touch and settle himself - and O'Leary made the save.\nVigouroux continued to be in inspired form at the other end and he made a third brilliant save of the contest to tip substitute Bell's shot onto the inside of the post on 76 minutes as the hosts endured one of those days where nothing seemed to fall for them.", "url": "https://www.bbc.com/sport/football/articles/c9vm3044329o"}