{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:24", "date_modify": "2025-05-21 07:51:24", "date_publish": "2024-12-23 11:01:05", "description": "Norwich City midfielder Anis Ben Slimane says they must keep their concentration in games if they are to end a poor run of results.", "filename": "sport_football_articles_cvgnj9we213o_1747813884.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a14c/live/018ed080-c117-11ef-a48e-dbb90985ae4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgnj9we213o_1747813884.html", "title": "Anis Ben Slimane: Norwich City cannot afford to 'switch off' in games", "title_page": "Anis Ben Slimane: Norwich City cannot afford to 'switch off' in games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich City midfielder Anis Ben Slimane said the Championship side must stop losing concentration during games if they are to halt a disappointing run of results.\nSaturday's 2-1 defeat at Sunderland was their third in the past four matches - with their only point earned coming from a goalless draw at Portsmouth.\nThe unexpected downturn followed back-to-back wins over Plymouth Argyle and Luton Town last month in which they scored 10 goals.\n\"We really need to be switched on [in] every single situation and every single second on the pitch,\" Slimane told BBC Radio Norfolk.\nThe on-loan Sheffield United player scored his second goal for the club in the 21st minute to put Norwich in front against the Wearsiders.\nBut Jose Cordoba was sent off in the second half, and as in the previous game against Burnley, they could not prevent their opponents from coming from behind to win, although Ashley Barnes went close to rescuing a point when he hit the post.\n\"First half we were really good, everyone put in the hard work from the first minute and went into half-time with a 1-0 lead. Second half, even before the red card, we were not there with the same energy,\" Slimane said.\n\"After the red card, it's of course more difficult but we did better with the 10 men. We created the big chance for Barnes, which unfortunately didn't go in. It's really frustrating.\n\"We know with this league how hard it is, you can be in front 1-0 but if you switch off the opponent can score two goals and that's what happened last week and that's what happened again.\"\nJohannes Hoff Thorup's side are now 13th in the Championship, nine points adrift of the play-off places.\nAnd they face the possibility of going into the Boxing Day home game against Millwall with three players - Cordoba, Kenny McLean and Angus Gunn - suspended, although the outcome of goalkeeper Gunn's misconduct charge has yet to be decided.\n\"I don't think we have a discipline issue, the discipline and mentality is right, and it's the mentality of winning - everyone wants to win,\" Slimane said.\n\"When we're not winning it causes some frustration, but we need to stick together, stick to the plan we've got, and hopefully we'll get the three points next time.\n\"Every day feels like an opportunity. This league is so busy we just need to look forward and keep going.\"\nHe added: \"There's a plan and a style of play but this way of playing takes time and we work every single day to improve that and it's going in the right direction, we just need results.\"", "url": "https://www.bbc.com/sport/football/articles/cvgnj9we213o"}