{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:19:51", "date_modify": "2025-05-21 04:19:51", "date_publish": "2024-12-25 22:30:08", "description": "Manchester City boss Pep Guardiola says the club are in danger of missing out on a place in next season's Champions League.", "filename": "sport_football_articles_cd0ey4mjydko_1747801191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e286/live/3dcb1780-c210-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd0ey4mjydko_1747801191.html", "title": "Manchester City may not qualify for next season's Champions League, says Pep Guardiola", "title_page": "Manchester City may not qualify for next season's Champions League, says Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola says the club are in danger of missing out on a place in next season's Champions League.\nCity are currently in their 14th consecutive season in European football's most prestigious club competition.\nOnly Arsenal between 1998 and 2017, and Manchester United between 1996 and 2014, have a longer record of qualifying among English clubs.\nCity are seventh in the Premier League after 17 matches, four points behind Nottingham Forest in fourth and a point behind fifth-placed Bournemouth.\nEngland are currently top of Uefa's European Performance Spot table and well placed to secure a fifth place in next season's Champions League, although City would still not qualify on current standings.\n\"When I said before, people laughed,\" said Guardiola. \"They said, 'qualifying for the Champions League is not a big success'.\n\"But I know it because it happens with clubs in this country. They were dominant for many years and after they were many years not qualifying for the Champions League.\"\nGuardiola's side host Everton on Boxing Day, before a trip to Leicester on 29 December and a home match against West Ham on 4 January.\nGiven all three opponents are in the bottom seven, it offers City a chance to improve on an appalling recent record of four points from eight games, which Guardiola acknowledges has left their lofty European ambitions in doubt.\n\"The one team that has been in the Champions League for the past years has been Manchester City,\" he added.\n\"Now we are at risk, of course we are. Definitely.\"\nArsenal, Chelsea, Liverpool and Manchester United finished in the Premier League's top four from the 2005-06 season to 2008-09. At least three of them also occupied the top four spots for 15 successive campaigns until 2012.\nBut United have spent five out of the past 11 seasons outside the Champions League. Arsenal spent six seasons out of the competition before returning last term. Liverpool missed out all but one year in seven from 2010, while Chelsea are in their second successive campaign outside Europe's elite.\nThis term the threat to City comes from unexpected sources. As well as Forest and Bournemouth, Aston Villa are ahead of City, while Newcastle, Fulham and Brighton are also within a couple of points.\n\"There are a lot of contenders,\" said Guardiola, whose side have lost nine of their last 12 games in all competitions. \"For every club it is so important and if we are not winning games, we will be out.\n\"If we don't qualify it is because we don't deserve it, because we were not prepared and because we had a lot of problems and didn't solve them.\"", "url": "https://www.bbc.com/sport/football/articles/cd0ey4mjydko"}