{"authors": ["Craig Nelson", "www.facebook.com"], "date_download": "2025-05-21 07:54:01", "date_modify": "2025-05-21 07:54:01", "date_publish": "2025-01-13 15:42:11", "description": "Nuno Espirito Santo press conference: Nottingham Forest vs Liverpool preview", "filename": "sport_football_articles_cdxnvv01zjko_1747814041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxnvv01zjko_1747814041.html", "title": "Nuno Espirito Santo press conference: Nottingham Forest vs Liverpool preview", "title_page": "Nuno Espirito Santo press conference: Nottingham Forest vs Liverpool preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There are no \"major\" injury issues with the only question mark about Ibrahim Sangare's return and \"assessing players who played all of the [last] game [against Luton]\".\nOn Liverpool and being considered as title challengers: \"We are here to compete against all of the teams and I think we are doing well, but nothing changes in our approach, which stays the same. We know what we can do and how we want to do things. We know each other, our strengths and weaknesses. So let's play the game.\"\nOn whether Liverpool boss Arne Slot has been playing mind games: \"I don't know but we try as much as possible to ignore what's around. We never change. It is the way we see things, the way we see the competition. I would say it is the way we see life. It's day by day - focus on our tasks and tomorrow is another tough one.\"\nOn compliments from opposition managers: \"I am very pleased. When we do things good we should be pleased, but too many compliments can distract us so we don't pay too much attention.\"\nOn Forest's win at Liverpool earlier in the season: \"It was a long time ago. Many things have changed. Both teams are different now. It is a new game and new things will happen.\"\nOn his plan for stopping Mohamed Salah: \"Salah, Diaz, Gakpo, Mac Allister, Gravenberch, Van Dijk, Konate, Trent... quality all over the place. A fantastic team. They have shown, not only in the Premier League but in Europe, how good they are. It is about us realising this and facing the game with the true respect necessary to play against Liverpool.\"\nOn the transfer window: \"We are in the market - that's not an if. But the transfer window in January is very difficult to operate in. One of the things we are sure on is that we have a good squad. We have good options and we have healthy players - this is not an if, this is a reality.\"\nOn whether Liverpool underestimated Forest in the reverse fixture: \"I cannot answer that. I don't know. We don't ever underestimate any opponent and the proof was against Luton. There's no easy game in football. In my view, never, ever underestimate anybody.\"", "url": "https://www.bbc.com/sport/football/articles/cdxnvv01zjko"}