{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:50", "date_modify": "2025-05-21 04:11:50", "date_publish": "2025-04-06 00:00:00", "description": "Live coverage from Ballybofey as holders Donegal host Derry in the Ulster Senior Football Championship preliminary round.", "filename": "sport_live_c1dr5pew3nnt_1747800710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/249e/live/6b87a1e0-12ef-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_c1dr5pew3nnt_1747800710.html", "title": "Holders Donegal secure Ulster prelim win over Derry - as it happened", "title_page": "Holders Donegal secure Ulster prelim win over Derry - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal advance to last eight\nFT: Donegal 1-25 Derry 1-15\nRight, that'll do us for today. It's Donegal's day as Jim McGuinness' bid for back-to-back Ulster titles begins with an ultimately comfortable 10-point win over Derry.\nIt wasn't always one-sided. Shane McGuigan missed a penalty for Derry early on and the Oak Leafers got themselves back to within two in the third quarter, but Donegal's class told in the end.\nThe holders face a trip to Monaghan in the quarter-finals in a fortnight's time and we'll be back next week for two last-eight games - Antrim v Armagh and Tyrone v Cavan - which are both live across the BBC!\nThanks for joining us!\n'We were chasing the game for the most part' - Rogers\nFT: Donegal 1-25 Derry 1-15\nDerry's Brendan Rogers, who picked up the man-of-the-match award, reflects on a disappointing day for the Oak Leafers:\n\"At the end of the first half we were three down and I suppose at that point we'd have been better off trying to kill the first half out and we maybe over-egged a couple of attacks.\n\"That actually led to them getting 1-1 and stretched it a wee bit for us at half-time, but we did come out with a bit of a bounce.\n\"I suppose after the first 12 minutes (of the second half) we had a fair gap of rushed shots and I had one myself. When you don't get that momentum again, it becomes tougher when they're chipping away at the one-pointers and we were missing maybe a couple of two-pointers.\n\"Lots of ourselves to look at in terms of how the momentum swung but look, Donegal were clinical and they kept pegging away and made it harder for us to chase. It was a difficult day for us now, we were chasing for most of it.\"\n'It took us time to settle' - O Baoill\nFT: Donegal 1-25 Derry 1-15\nDonegal's Daire O Baoill speaking to the BBC:\n\"We left it a bit late in the first half, we got caught in the atmosphere early with the home crowd and it took us maybe 18, 20 minutes to settle and then the chances opened up.\"\nOn Jim McGuinness' Ulster record (lost only one game):\n\"I didn't know that stat, to be honest. We don't pay much heed to it. We're week by week with Jim. What he says you do. There's a trust both ways and I think you can see from today that we trust in the system.\"\nOn Monaghan up next:\n\"Big days in Clones are hard to beat if the weather stays nice.\"\nMan of the match - Brendan Rogers\nDonegal 1-24 Derry 1-15\nPhilly McMahon\nEight-time All-Ireland winner with Dublin on BBC Sport\nDaire O Baoill had a really good first half. It is strange picking a player from the losing side, but throughout the whole game, Brendan Rogers has taken the game to Donegal.\nHe got a couple of two-pointers, won the battle around the middle and if he had a few more players around him like him, Derry may have made more of a challenge, But for me, Brendan Rogers is the man-of-the-match.", "url": "https://www.bbc.com/sport/live/c1dr5pew3nnt"}