{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 14:27:30", "date_modify": "2025-05-20 14:27:30", "date_publish": "2023-07-29 10:09:29", "description": "Northern Ireland swimmer Daniel Wiffen makes the 1500m freestyle final at the World Swimming Championships in Fukuoka as the second fastest qualifier.", "filename": "sport_swimming_66348608_1747751250.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3C9E/production/_130581551_danielwiffen.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66348608_1747751250.html", "title": "World Swimming Championships: Wiffen second fastest into 1500m freestyle final", "title_page": "World Swimming Championships: Wiffen second fastest into 1500m freestyle final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel Wiffen has made the World Championship 1500m freestyle final in Fukuoka as second fastest qualifier.\nThe Magheralin swimmer went stroke for stroke with Tokyo Olympic champion Bobby Finke in the heats with Wiffen finishing just half a second behind the American in a time of 14:43.50.\nConor Ferguson finished 13th in the men's 50m backstroke after making his first World Championships semi-final.\nThe 23-year-old Larne man was sixth in his semi-final in 25.09.\nFerguson's time was not quite as fast as his heat swim of 24.95, just .14 of a second off his best time of 24.81 from 2021.\nMona McSharry's individual events came to a close when she finished 11th overall in the women's 50m breaststroke.\nThe 22-year-old was sixth in her semi-final in a time of 30.54, outside of her own Irish record of 30.29.\nIt's been a good week for McSharry, reaching three breaststroke semi-finals and finishing fifth in the 100m final while making the Paris Olympic qualification time.\nFinke and Wiffen were both well clear of world 800m freestyle winner Ahmed Hafnaoui from Tunisia who won the final heat in 14:49.53 with the fastest man in the world this year, Florian Wellbrock from Germany, surprisingly missing out on Sunday's final.\nIt was a second Paris Olympic qualification time for Wiffen who will hope to go at least one place better than the 800m where he was fourth earlier this week as he looks to win Ireland's first ever medal at a World Long Course Championship.\n\"It was great, my strategy was to go in and break up the field and I did that quite well and then after about 500m sit back on a good pace that would get me through to the final so I did that, it was good, a good race as well there with the American Bobby Finke, but it was alright, it was fun.\"\nWiffen's best time is a 14:34.91, which he swam in Sweden earlier this year. That swim has him ranked as the fifth fastest man in the world ever and is the fastest time of any of the swimmers competing in the final.\n\"I think I'm still going with my aspirations of hitting that world record (14:31.01), need to get out now, get some recovery done for tomorrow night, 36 hours, get that done and have a good final. It hurt a little, but I'm holding back still, so still that bit left.\"\nDanielle Hill clocked 25.55 in the 50m freestyle in her final individual swim of the Championships.\nHill returns on Sunday for the Women's 4x100m Medley Relay.\n\"I'm happy, yesterday, and today were all about finding a way to swim fast in the morning because I know I have to step up tomorrow and do that, not only for myself but for those girls,\" said Hill.", "url": "https://www.bbc.com/sport/swimming/66348608"}