{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:53", "date_modify": "2025-05-21 03:41:53", "date_publish": "2025-04-06 18:28:20", "description": "All-rounder Lyndon James leads the way with a superb 125 as Nottinghamshire take advantage of a benign batting surface to build a 201-run first innings lead over Durham.", "filename": "sport_cricket_articles_c3v9pzlxkx1o_1747798913.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d030/live/a0c4a180-1314-11f0-a8f7-59659b31eb3f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c3v9pzlxkx1o_1747798913.html", "title": "County Championship: Lyndon James hits 125 to put Notts in control", "title_page": "County Championship: Lyndon James hits 125 to put Notts in control - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All-rounder Lyndon James led the way with a superb 125 as Nottinghamshire took advantage of a benign batting surface to build a 201-run first innings lead over Durham.\nDurham were still 87 behind on 114-3, with Colin Ackermann 45 not out, at the close of day three of their Rothesay County Championship season opener at Trent Bridge.\nJames was backed up by Matt Montgomery's 75 and fast bowler Josh Tongue's career-best 55 in a Nottinghamshire total of 579 - their biggest since returning to Division One in 2023.\nThey built on the earlier efforts of Ben Slater (92) and Freddie McCann (79) to enable a handsome Nottinghamshire overhauling of Durham's 378 on another day of unbroken sunshine in the East Midlands.\nEngland fast bowler Matty Potts finished with 4-112, but it was Nottinghamshire's debutant Australian quick bowler Fergus O'Neill who made a bid to seize the spotlight again in the final session, taking 2-29 in his new-ball spell to go with his first-innings 5-81.\nIf James was the star with the bat for the home side, the part played by Montgomery deserved much credit too.\nAlthough he had been dropped on four off a difficult slip chance on Saturday evening, Montgomery's solid 146-ball innings guided his side from four down and still 134 behind when he arrived to eight down but 59 in front when an unplayable ball from Potts finally sent him on his way.\nThe South African-born batter, who made 178 against Durham in his fourth first-class match for Nottinghamshire in 2022, suffered a dip in form that merited only four appearances in the Championship side last year and this was his highest score in almost two years.\nWhether it is enough to keep him in the Nottinghamshire line-up once South African Kyle Verreynne arrives to relieve Joe Clarke of wicketkeeping duties remains to be seen.\nMontgomery's partnership with James added 118, frustrating Durham after the removal of nightwatchman Farhan Ahmed by Potts at 319 for six put them one wicket away from getting into the Nottinghamshire tail.\nThe departure of O'Neill first ball as Potts claimed his fourth wicket did suggest that Durham would not be in the field for too much longer, but once he had seen off his erstwhile England team-mate's hat-trick ball Tongue was as keen as anyone to take advantage of the bat-friendly conditions.\nShowing he has a decent cover drive in his armoury, Tongue racked up nine boundaries in his 55 as he overtook his previous best of 45 not out, made for Worcestershire against Nottinghamshire.\nJames, meanwhile, had made his way to 94, content to wait for the right ball as Tongue increased Durham's frustrations at the other end. The all-rounder found his timing and struck the ball cleanly almost from the start. Only when his ninth-wicket partner fell was there a more urgent need to finish the job. A punched four off the back foot took him to 98.\nVisibly weary, he then had the fortune to have no slips in place as he thick-edged Rhodes for his 14th boundary to take him past the milestone for the fifth time in his first-class career, curiously the third time against Durham. A popular figure with spectators and team-mates, he threw back his head and removed his helmet to acknowledge the applause.\nHis departure for 125, caught off a steepling top edge, signalled a tea interval delayed by the ninth wicket falling, after which Durham faced 30 overs and a deficit that soon grew tougher still with two wickets lost in three balls, leaving them 29-2.\nAussie O'Neill thudded one into skipper Alex Lees's back pad before sending Emilio Gay's off stump flying as the ex-Northamptonshire man bagged a debut pair.\nAckermann and Ben McKinney added 71 for the third wicket, but McKinney, dropped at first slip on 33, was caught behind off Tongue for 37 six overs before the close.\nECB Reporters Network supported by Rothesay.", "url": "https://www.bbc.com/sport/cricket/articles/c3v9pzlxkx1o"}