{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:20:12", "date_modify": "2025-05-21 06:20:12", "date_publish": "2025-01-14 00:00:00", "description": "Follow live text and radio commentary as Britain's Katie Boulter launches her Australian Open campaign against Rebecca Marino.", "filename": "sport_tennis_live_cx2pzg772n0t_1747808412.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_live_cx2pzg772n0t_1747808412.html", "title": "Australian Open LIVE: Katie Boulter beats Rebecca Marino", "title_page": "Australian Open LIVE: Katie Boulter beats Rebecca Marino - tennis scores, results & radio - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThat's all from us as today's tennis winds up in Melbourne.\nDon't worry if you missed any of the drama, you can catch up with it all by reading through our reports.\nBoulter wins in Melbourne to set new British record\nMedvedev destroys net camera in five-set battle\n'My serve had its own mind' - Raducanu wins despite 15 double faults\nRybakina takes just 53 minutes to win Melbourne opener\nWe'll be back tomorrow to do it all over again with four Britons - Jack Draper, Jacob Fearnley, Harriet Dart and Jodie Burrage - in singles action.\nSee you then!\nWhat's happened so far on day three?\nHere's a look at what else has been going on in the men's draw today.\nRussian fifth seed Daniil Medvedev destroyed a net camera as he battled to control his emotions in a five-set thriller against world number 418 Kasidit Samrej.\nThere were also five-set wins for Gael Monfils and Holger Rune, while Taylor Fritz, Ben Shelton and Hubert Hurkacz all saw out straight-set victories.\nThere was disappointment, however, for British number two Cameron Norrie, who fell to Matteo Berrettini after winning the first set.\n'Fonseca is born for this stage'\nRublev 6-7 (1-7) 3-6 6-7 (5-7) Fonseca\nDaniel Kiernan\nFormer British tennis player\nI'm sitting here with a big smile on my face and goosebumps because we are watching the birth of another superstar, right before our eyes.\nAt match point, Joao Fonseca got the opportunity, he didn't blink and he smashes the forehand for the winner down the line. He milks it, he takes it on, he loves it.\nHe is born for this stage - welcome to the world of tennis Joao Fonseca.\nGame, set and match - Fonseca\nRublev 6-7 (1-7) 3-6 6-7 (5-7) Fonseca\nA remarkable result on Margaret Court Arena.\nMen's ninth seed Andrey Rublev is OUT!\nAnd he has fallen to Brazil's 18-year-old qualifier Joao Fonseca, making his Grand Slam debut. Remember the name.\nIt's a day he will not forget in a hurry, that's for sure, as he wraps up a stunning straight-set victory over the 10-time major quarter-finalist.\nA frustrated Rublev took out his frustration on his racquet as Fonseca fought back from a break down at 3-1 in the third set to force a tie-break.\nAnd the talented Brazilian condemns Rublev to his first Australian Open first round exit in six years with his first match point to huge cheers in Melbourne.\n'Australia is the closest I have ever felt to home'\nBoulter 6-4 3-6 7-5 Marino\nMore from Katie Boulter on whether Australia feels like a home away from home: \"It's funny you ask that - this is the closest I have ever felt to home. So it's all because of you guys. From the moment I landed here in Australia, even in Sydney, I have felt the love and I can't tell you how much it means to me. Thank you so much.\"\nOn whether she is happy with where she is at coming into the season: \"Yeah. I mean I am always striving for more. I feel like I had a really good year last year, on paper it was my career-high ranking best year. I really feel like I can improve my game so much more and every match that I play I have so much to keep improving.\n\"Hopefully you are going to keep seeing more and more of me this year and I'll be higher up the rankings.\"\nOn Alex de Minaur playing at the same time as herself: \"I'm guessing he won? I kind of figured that if he lost he wouldn't be sat there. I'm so happy to see him through.\"\n'That was way too stressful'\nBoulter 6-4 3-6 7-5 Marino\nBritish number one Katie Boulter has been speaking courtside after sealing her first round win: \"That was way too stressful for me. I would have way preferred an easier match but I mean Marino came out firing today. It is literally because of you guys that I got through this match, so I really appreciate it.\"\nOn having to come from behind a number of times: \"That was massively a mental challenge for me. I have been playing great tennis on the practice court and I tried so hard to put that on the match court. Sometimes, when you really try to force it, it doesn't work and I found that out tonight. She was playing great and I know how tough she can be, I'm just thankful I found a way and sometimes that is what these first round matches are about.\"\n'The best tennis players turn up in the moment'\nBoulter 6-4 3-6 7-5 Marino\nDaniel Kiernan\nFormer British tennis player\nThat is a win for the De Minaurs!\nHe turned up and I asked the question about whether that was going to make the difference - you would have to say yes now. The intensity changed.\nAll of a sudden we heard her exhaling and that's what you do when you are playing in the moment with intensity. That was the best return game she had played in the whole match and she got in behind every single ball.\nThat's what the best tennis players do, they turn up in the moment.", "url": "https://www.bbc.com/sport/tennis/live/cx2pzg772n0t"}