{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:07", "date_modify": "2025-05-21 06:58:07", "date_publish": "2025-03-29 12:00:09", "description": "Brighton news: Georginio Rutter says winning FA Cup 'would be unbelievable'", "filename": "sport_football_articles_cq8y8z923weo_1747810687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/326c/live/f325e0f0-0bfe-11f0-b5ba-bf75c437a038.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq8y8z923weo_1747810687.html", "title": "Brighton news: Georginio Rutter says winning FA Cup 'would be unbelievable'", "title_page": "Brighton news: Georginio Rutter says winning FA Cup 'would be unbelievable' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton's Giorginio Rutter says winning the FA Cup would be an \"unbelievable\" achievement for the club.\nThe Seagulls face Nottingham Forest on Saturday in the quarter-finals knowing victory would see them reach a Wembley semi-final for the second time in three years, and a third time in six, after losing to Manchester City in 2019 and to Manchester United in 2023.\n\"Of course we are ready,\" Rutter told BBC Radio Sussex.\n\"We can have something very good at the end of the season. But, we have to stay mature and played how we did in the last game.\n\"We have to take it game by game because both are very important. We will see at the end but I think the FA Cup can be a very good thing.\"\nBrighton have never won a major trophy but Rutter believes the team is in \"good shape\" as they prepare for the run-in to the end of the season.\n\"Everybody knows the FA Cup and for Brighton I think to win a cup like this is unbelievable,\" he added\n\"We believe, if it's working it's good and if it's not we try again next season and the season after. Now, we are in a good shape and we need to stay like this.\n\"The fans know it's important for everybody. They know it's a special day and after that we can go to Wembley so I trust my fans.\"", "url": "https://www.bbc.com/sport/football/articles/cq8y8z923weo"}