{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:16", "date_modify": "2025-05-21 06:31:16", "date_publish": "2025-02-08 12:37:32", "description": "Ballymena boss Jim Ervin says that his side's dramatic 2-2 draw with Linfield was a \"hard pill to swallow\".", "filename": "sport_articles_c07ky8zzlvpo_1747809076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/99cd/live/53b57820-e618-11ef-8f4e-69ca3422ff89.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c07ky8zzlvpo_1747809076.html", "title": "Irish Premiership: Draw against Linfield 'feels like a defeat'", "title_page": "Irish Premiership: Draw against Linfield 'feels like a defeat' - Jim Ervin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ballymena boss Jim Ervin said that his side's dramatic 2-2 draw with Linfield was a \"hard pill to swallow\".\nAfter falling behind to Matthew Fitzpatrick's opener, the Sky Blues levelled through Donal Rocks before taking the lead in injury time through a Patrick McEleney penalty.\nKyle McClean salvaged a point for leaders Linfield with an 100th-minute equaliser, which was deflating for Ervin and his players.\n\"It feels like a defeat, I don't know what to say I'm gutted,\" he told BBC Sport NI.\n\"The boys went a goal down early on after a mistake, but the response was great, and I think if we came away with three points anyone who was watching would not have disagreed,\" Ervin continued.\n\"We have to take the positives, we went toe to toe with the league leaders and should have got three points, so we need to build on that.\"\nErvin refused to be drawn on whether he thought the Blues' late equaliser should have been ruled out after Ballymena players claimed that there was a foul on Caolan Loughran in the build-up to the goal.\n\"I'm not going to comment, I haven't seen it back and emotions are high, so I don't want to say something and get myself in trouble.\"", "url": "https://www.bbc.com/sport/articles/c07ky8zzlvpo"}