{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 07:48:09", "date_modify": "2025-05-21 07:48:09", "date_publish": "2025-05-18 18:32:59", "description": "Lewis Hamilton says there are \"lots of positives to take\" from the Emilia-Romagna Grand Prix after he finished fourth from 12th on the grid.", "filename": "sport_formula1_articles_cy0jy85jg4lo_1747813689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b29b/live/13e85640-3410-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cy0jy85jg4lo_1747813689.html", "title": "Emilia-Romagna Grand Prix: Lewis Hamilton says 'more to come' from Ferrari", "title_page": "Emilia-Romagna Grand Prix: Lewis Hamilton says 'more to come' from Ferrari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Hamilton says there is \"more to come\" from Ferrari after he fought back from 12th place on the grid to finish fourth in the Emilia-Romagna Grand Prix.\nThe seven-time champion said racing in front of the famous Ferrari fans, the tifosi, had been \"a highlight of the year so far\" and that there were \"lots of positives to take\" from the race.\nIt is the first time this year he has finished ahead of his team-mate Charles Leclerc, who was sixth in Imola.\n\"I did think we would make an improvement this weekend with something I've fixed. And I think there is more to come,\" Hamilton said.\n\"The set-up was really good, the car felt really mega and the team did a fantastic job on strategy and pit stops.\n\"It was a lot of pressure on us with struggling through the year with the car so far, and particularly with our qualifying.\n\"I don't remember the last time I had a race like that moving forwards. I'm sure there was one last year but this was different because I'm in the red car. To finally have that connection, that synergy with the car, was a really great feeling.\"\nHamilton used an off-set strategy, starting on the hard tyre, to run long and then was helped by two safety cars. That put him on fresh tyres in seventh place for the final restart, from where he moved up to his final position.\n\"Bit by bit strategy started to pan out and the car really came alive when I got on to the medium tyres, and a great call at the end,\" Hamilton said.\nThe 40-year-old Briton said he also savoured the experience of racing in Italy for the first time as a Ferrari driver.\n\"It was just really very reminiscent of when I was growing up watching it sitting at home on my couch, having a bacon sandwich watching Michael Schumacher here racing with Ferrari and seeing the connection,\" he said.\n\"It was quite an incredible experience to think that I'm now here in one of the two Ferraris and having that connection with them. It is such a large passion for me, it's unbelievable.\"\nThe result - Hamilton's equal best of the year so far in a grand prix - came despite Ferrari's worst qualifying result of the season, with Hamilton and Leclerc starting 12th and 11th.\nHamilton added: \"We just got to unlock the potential in qualifying. If we had qualified better, we would have been in the fight for a podium, which is something we didn't think would be possible.\"\nF1 moves on to Monaco next weekend, and Hamilton was thinking positively about the famous race on the streets of the principality.\n\"It will still be a question about getting the tyres working in a single lap. If we can figure that out next week, then I think we could be in a good position,\" he said.\nBut Leclerc, who won in Monaco last year, fears the Ferrari's weakness in slow-speed corners could mean \"a very difficult weekend\".\n\"Monaco is exposing quite a few weaknesses of our car,\" he said.\nLeclerc, whose Imola race was undone by the timing of the two safety cars, added: \"I don't think there's any silver bullet to the situation we are in.\n\"We just need to work and try to understand where this problem that we have in qualifying comes from. Which is what is slowing us down at the moment, the Saturdays.\"\nTeam principal Frederic Vasseur said: \"It's clear that we are trying to extract the best from the car on Saturday. The last two weekends what we didn't improve is on the set-up in qualifying.\n\"There is a bit of frustration for us. For sure we need to put all our effort on this.\"", "url": "https://www.bbc.com/sport/formula1/articles/cy0jy85jg4lo"}