{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:39", "date_modify": "2025-05-21 05:44:39", "date_publish": "2025-01-31 17:00:56", "description": "Arsenal boss Renee Slegers said a conversation with \"thoughts, feelings and questions from both ends\" took place with Chloe Kelly before she joined the club from Manchester City on loan.", "filename": "sport_football_articles_cly7z9ye3deo_1747806279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2c4/live/dd632ed0-dfee-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly7z9ye3deo_1747806279.html", "title": "Chloe Kelly: Arsenal boss Renee Slegers said 'we both opened up' before singing forward on loan", "title_page": "Chloe Kelly: Arsenal boss Renee Slegers said 'we both opened up' before singing forward on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal boss Renee Slegers said a conversation with \"thoughts, feelings and questions from both ends\" took place with Chloe Kelly before she joined the club from Manchester City on loan.\nThe England forward was a late addition on Thursday's deadline day as the Gunners beat competition from Manchester United to sign the 27-year-old.\n\"It was a conversation with thoughts, feelings and questions from both ends, and it was very good,\" Slegers said.\n\"We both opened up – I tried to open up about what Arsenal is and what she could mean for us, and she opened up about what she can bring to us and what her ambitions are, so it was a very good conversation.\"\nKelly is ineligible to play on Sunday when Arsenal face City in the Women's Super League.\nOn how Kelly is after posting emotional statements on social media surrounding her situation at City, Slegers added: \"I think those questions, you're better off asking her because I haven't spoken to her much yet about the situation\n\"We are convinced that she will come to us, to Arsenal, to contribute and show her qualities and ambitions, so we're very excited.\"", "url": "https://www.bbc.com/sport/football/articles/cly7z9ye3deo"}