{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 07:36:15", "date_modify": "2025-05-21 07:36:15", "date_publish": "2025-05-20 15:43:28", "description": "Jamestown backed Hearts' push for Derek McInnes, says sporting director Graeme Jones", "filename": "sport_articles_cewdgpx2ddeo_1747812975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac6c/live/8cab08e0-358f-11f0-8f95-179a79186756.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cewdgpx2ddeo_1747812975.html", "title": "Jamestown backed Hearts' push for Derek McInnes, says sporting director Graeme Jones", "title_page": "Jamestown backed Hearts' push for Derek McInnes, says sporting director Graeme Jones - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamestown Analytics backed Hearts' decision to identify Derek McInnes as their top target to become the club's new head coach, sporting director Graeme Jones has confirmed.\nWhen Neil Critchley was appointed in mid-October, chief executive Andrew McKinlay was keen to emphasise that \"the analytics only guide us\".\nThat was also the case for recruiting a replacement for Critchley, who was sacked just six months after his appointment.\n\"We looked at coaches within Scotland and also outside Scotland,\" Jones said. \"It became clear as the process went on that Derek was the right man for us.\"\nCEO McKinlay referenced that Critchley was \"the preferred candidate from an analytics perspective\" back in October.\nWhen asked if McInnes was the number one choice by Jamestown Analytics, Jones replied: \"They don't really provide information like that. They provide a very neutral output to help inform the decision.\n\"He was my number one pick and Jamestown Analytics supported my reasoning, but they don't really rank it in that fashion.\n\"His experience within Scotland is very important. He's able to deal with the intensity of the Scottish game.\n\"He has real first-hand experience of the expectations of what our fanbase want. Combining that with the fact he's a very good coach and a proven leader, everything really matched up.\"\nJones joined Hearts at the end of last year from the Scottish FA, just at the time the club were announcing Critchley as head coach.\nHe says looking back the appointment of the former Blackpool boss proved to be the wrong one.\n\"Hindsight's a wonderful thing and the decision was made back then to look for candidates outside Scotland,\" Jones explained.\n\"That's the decision that was made and it didn't prove to be the correct decision.\"", "url": "https://www.bbc.com/sport/articles/cewdgpx2ddeo"}