{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:58:31", "date_modify": "2025-05-21 05:58:31", "date_publish": "2025-01-31 13:40:39", "description": "Captain Caelan Doris believes reversing England's \"collision dominance\" will be key to Ireland's hopes in their Six Nations opener on Saturday afternoon.", "filename": "sport_rugby-union_articles_c5y7j6rkpmeo_1747807111.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2dba/live/067315f0-dfcd-11ef-976a-75f9ab68fe5f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5y7j6rkpmeo_1747807111.html", "title": "Six Nations: Caelan Doris expecting 'ultimate test' as England come to Aviva Stadium", "title_page": "Six Nations: Caelan Doris expecting 'ultimate test' as England come to Aviva Stadium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Caelan Doris believes reversing England's \"collision dominance\" is key to Ireland's hopes in their Six Nations opener on Saturday afternoon.\nThe reigning champions saw their ambition of historic back-to-back Grand Slams ended by England in Twickenham last year when Marcus Smith's late drop-goal guided Steve Borthwick's side to victory.\nDoris admitted that defeat still hurts \"massively\" and is expecting a real tussle with an England back row that contains twins Tom and Ben Curry this time.\n\"Last year over there it was probably their collision dominance and eking out a few yards post-contact,\" he said.\n\"Ben Earl was at the top of his game on that day and has been for the last couple of years, as are the two Currys.\n\"So from the back row point of view it is going to be a fun one.\"\nEngland's only victories in the eight games since that dramatic win last year have come against Japan and they struggled to see out games during the autumn.\nThey had been similarly lacking rhythm when the sides met 11 months ago, but Doris said Ireland had a sense that there was a \"big performance brewing\".\n\"It's always the ultimate test coming up against these guys. There's a rich history and a massive rivalry there over the last number of years.\n\"We'd had a pretty good run [last year], fourth round going in over there and there was a lot of belief. We also respected them massively and knew that there was a big performance brewing from them.\n\"They obviously hadn't gone so well at that point but you look back six months prior to that and they're in a World Cup final [semi-final].\n\"It's similar now in that they've been on the wrong side of some of their results in the autumn but we have massive respect for them as a team and the quality in their squad.\"\nDespite winning three of four Tests in the autumn, there was a feeling that Ireland had not hit top form themselves in November.\nHandling issues and a slew of penalty concessions were evident in a defeat to New Zealand and victories over Argentina and Australia.\nWhen asked for areas improvement, Doris talked about discipline, the line-out and scrum, as well as the attack and breakdown, before noting he had \"mentioned basically the whole game\".\nHe added: \"But there is that feeling that there is growth from individuals, from us as a collective across the board, and that's the exciting thing for us.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c5y7j6rkpmeo"}