{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-20 14:35:28", "date_modify": "2025-05-20 14:35:28", "date_publish": "2023-07-28 16:19:10", "description": "British boxer Conor Benn says he is free to fight in the United Kingdom again after a provisional UK Anti-Doping (Ukad) suspension is lifted.", "filename": "sport_boxing_66341548_1747751728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16B27/production/_130576929_gettyimages-1481920474.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66341548_1747751728.html", "title": "Conor Benn: UK Anti-Doping confirms fighter 'no longer suspended'", "title_page": "Conor Benn: UK Anti-Doping confirms fighter 'no longer suspended' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Conor Benn says he is free to fight in the United Kingdom again after a provisional UK Anti-Doping (Ukad) suspension was lifted.\nBenn, 26, failed two voluntary tests for female fertility drug clomifene before his cancelled October bout with fellow Briton Chris Eubank Jr.\nUkad provisionally suspended Benn in March as it conducted its investigation.\n\"The Ukad process has now firmly ended and I remain free to fight,\" Benn said.\nThe body later issued a statement which read: \"Ukad can confirm Mr Benn is no longer provisionally suspended under the UK Anti-Doping Rules.\"\nBut it added that it had 21 days to assess whether it wanted to appeal against the decision, which was taken by the independent National Anti-Doping Panel.\nThe British Boxing Board of Control (BBBoC), which licenses fighters in the UK, said it was \"aware\" of Benn's statement.\nGeneral secretary Robert Smith said the organisation would \"provide a further statement if and when able to do so\", and directed enquiries to Ukad.\nHowever, promoter Eddie Hearn said Benn's \"nightmare is over\" and that he could have a smaller fight in September before a bigger one in December.\nIn a statement issued on Friday, Benn added: \"Today marks the end of the of a gruelling 10-month process, during which the WBC had already decided that I was innocent of any wrongdoing.\n\"After a hearing with the National Anti-Doping Panel and Ukad, I have now been vindicated for the second time.\n\"Hopefully the public and various members of the media can now understand why I have maintained my innocence so strongly all the way through.\"\nBenn and Eubank were scheduled to meet on 8 October at a catchweight of 157lb, 30 years after their fathers Nigel Benn and Chris Eubank Sr fought.\nHaving failed the two voluntary drug tests, Benn gave up his licence with the the BBBoC in the weeks after his planned contest with Eubank was cancelled.\nThe board refused to let him compete in the UK until he co-operated with Ukad, although Benn did comply with a World Boxing Council (WBC) investigation.\nThe WBC is a sanctioning body and not an anti-doping watchdog.\nAfter a short investigation into one of the failed drug tests, the WBC said it did not believe Benn was guilty of \"intentional doping\" and added a \"highly elevated consumption of eggs\" could have caused the positive test in July.\nBenn provided a 270-page document to the WBC outlining his defence, but insisted eggs were never offered as an excuse. He also said he does not accept the banned substance was ever in his system.\nPromoter Hearn, speaking on Matchroom Boxing's YouTube channel, says he expects Benn to reapply for his licence with the BBBoC and be cleared to fight in the UK.\n\"It's been a brutal, painful year of work and belief,\" Hearn said.\n\"The nightmare is over and he can get back to his career. Now we sit down with Conor and we look at the plan.\n\"Maybe he has a slightly smaller fight first. He's been out of the ring for a year and a half, but he wants the big fights ASAP.\n\"We'll decide what's right for him. I like him coming back and having a fight maybe in September, and then going into a huge fight in December.\"\nIn Benn's Friday statement, he continued: \"Naturally I am pleased that I can now put this behind me once and for all.\n\"As you can imagine the last 10 months have weighed heavily on me and I am anxious that if this happened to me it could potentially happen to any honest, dedicated and clean athlete like me.\n\"I now intend to put this matter behind me and look forward. Which begins with fighting as soon as possible so I can remind everyone who I am.\"", "url": "https://www.bbc.com/sport/boxing/66341548"}