{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:08", "date_modify": "2025-05-21 07:22:08", "date_publish": "2025-05-20 07:39:50", "description": "Steven Gerrard is Rangers' preferred candidate to be head coach with one outlet, but others suggest he is just one of several names being considered.", "filename": "sport_football_articles_cm2kkyr9y09o_1747812128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22df/live/cb0132e0-354e-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2kkyr9y09o_1747812128.html", "title": "Scottish gossip: Gerrard, Martin, Ancelotti, Maloney, Carver, Brown, Graham, Imrie", "title_page": "Scottish gossip: Gerrard, Martin, Ancelotti, Maloney, Carver, Brown, Graham, Imrie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Rangers manager Steven Gerrard has been identified as the Ibrox club's preferred candidate following the decision not to retain interim head coach Barry Ferguson, with Real Madrid assistant Davide Ancelotti and former Southampton boss Russell Martin having also been on the shortlist. (Daily Mail), external\nFormer Rangers manager Steven Gerrard and former Ibrox defender Russell Martin have emerged as the leading contenders to be the club's next team boss and a decision could be made by the end of this week following final talks. (Scottish Sun), external\nFormer Southampton manager Russell Martin is a serious contender to be Rangers head coach, but Real Madrid assistant Davide Ancelotti has also held discussions with the Scottish Premiership club and former Ibrox boss Steven Gerrard remains under consideration. (TeamTalk), external\nDanny Rohl's multi-million-pound release clause with Sheffield Wednesday is likely to prohibit a Rangers move for the highly-rated coach. (Football Insider), external\nFormer Rangers manager Steven Gerrard and Real Madrid assistant Davide Ancelotti are just two names that have been sounded out over taking charge at Ibrox, while former Southampton manager Russell Martin, ex-Luton Town boss Rob Edwards are also under consideriation and Sheffield Wednesday's Danny Rohl could also make the final shortlist, with no front runner at this stage. (Sky Sports), external\nBookmakers have slashed the odds on Steven Gerrard returning to Rangers as manager and he has emerged as favourite with the Ibrox club waiting on a response from Real Madrid Davide Ancelotti, who is considering his options amid interest from a number of clubs this summer. (Glasgow Times), external\nReal Madrid assistant Davide Ancelotti is leaving the Spanish club with father Carlo, who is taking charge of the Brazil national team, but is expected to move on after the two World Cup qualifiers with Ecuador and Paraguay in June to begin his career as a head coach. (The Athletic), external\nFormer Hibernian and Wigan Athletic boss Shaun Maloney is the frontrunner to become the new Dundee manager following the sacking of Tony Docherty and the former Celtic midfielder is interested in the position. (The Herald), external\nFormer Scotland midfielder Shaun Maloney is strong favourite to take over as Dundee manager, but Neil Lennon, Stuart Kettlewell and former Dundee players Temuri Ketsbaia, Mark Fotheringham, Darren O'Dea and Charlie Adam could also be considered. (The Courier), external\nAyr United head coach Scott Brown has been installed as the bookmakers' favourite for the Dundee manager's job. (Daily Record), external\nScotland assistant John Carver, who took charge of Polish top flight club Lechia Gdansk in November, is a contender to become the next manager of Kilmarnock. (The Herald), external\nPartick Thistle are set for talks with striker Brian Graham, who has been in interim charge along with coach Mark Wilson, about their manager's job this week, but Greenock Morton's Dougie Imrie is also in the frame. (Scottish Sun), external\nDavid Strelec, for whom Celtic had a £7m offer rejected in January, expects to be in pre-season training with Slovan Bratislava, despite Feyenoord and Real Betis joining the hunt for the striker, but the 24-year-old is wondering if a better offer might arrive in the meantime. (The National), external\nAmid fresh interest from Celtic, 23-year-old striker Mathias Kvistgaarden has told TV 2 Sport he is ready to leave Brondby if the club grant his wish to exit this summer. (Daily Record), external\nOn-loan striker Marco Tilio says he will return to Celtic from Melbourne City a more mature and more complete player. (Daily Record), external\nMotherwell manager Michael Wimmer thinks 18-year-old midfielder Lennon Miller will depart the club this summer, with Celtic having reportedly considered a transfer bid in January. (Glasgow World), external\nSam Dalby has refused to rule out extending his stay with Dundee United after the 25-year-old striker turned down an extended contract with Wrexham. (The Courier), external\nDavid Babunski will depart Dundee United this summer after the Premiership club opted not to take up the option of a one-year extension to the 31-year-old midfielder's contract. (The Courier), external\nThe Scottish FA compliance officer is set to review comments made by former defender John Brown on Rangers TV querying the integrity of officials during Saturday's 2-2 draw with Hibernian. (The Herald), external\nRangers have branded the possibility of disciplinary action after John Brown's \"corrupt\" outburst on Rangers TV as \"excessive, surprising and inconsistent\". (The National), external\nSt Johnstone are set to hit Dundee with a £10,000 bill for damage caused to McDiarmid Park during Sunday's pitch invasion, the Perth club having found broken seats, graffiti and damage to the toilets in the areas housing the 3,000 visiting fans. (Scottish Sun), external", "url": "https://www.bbc.com/sport/football/articles/cm2kkyr9y09o"}