{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:09", "date_modify": "2025-05-21 07:41:09", "date_publish": "2025-03-28 11:09:03", "description": "Celtic's Sinisalo 'should be relishing this opportunity'", "filename": "sport_articles_c23434219k8o_1747813269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8de1/live/8c0070a0-0bc4-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c23434219k8o_1747813269.html", "title": "Celtic's Sinisalo 'should be relishing this opportunity'", "title_page": "Celtic's Sinisalo 'should be relishing this opportunity' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Viljami Sinisalo's last league start was 11 months ago on loan at Exeter City in a 2-1 defeat by Oxford in English League One.\nOn Saturday the Finland goalkeeper is set to be thrust into the Celtic starting line-up to replace Kasper Schemeichel, who has suffered a suspected shoulder injury on Denmark duty.\nSinisalo has featured just once for Celtic - in the 5-0 Scottish Cup rout of Raith Rovers in February - following his arrival from Aston Villa last summer.\nSo while the 23-year-old is largely an unknown quantity to Celtic fans, can he prove a safe pair of hands against Hearts on Saturday and beyond?\n\"The fact Schmeichel has been so dominant and so important for Celtic is one of the reasons we haven't seen Sinisalo this season,\" said Gemma Fay, the former Celtic and Scotland goalkeeper, on the BBC's Scottish football podcast.\n\"But as a goalkeeper, these are the types of situations which are more common than not. You often get your break by getting chucked in when there's an injury or a significant drop in form.\n\"He's a young lad, but if I'm him, I'd be seeing this as an opportunity to stake a claim for that position.\n\"We don't know how long Schmeichel is going to be out. Suspected shoulder injury, those are not things that heal quickly, especially in a goalkeeping position with the robustness you need in that part of your body.\n\"So depending on the severity, this could be Schmeichel for the rest of the season and Sinisalo has an opportunity to help Celtic secure the title and show Brendan Rodgers what he can do.\"", "url": "https://www.bbc.com/sport/articles/c23434219k8o"}