{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:29:02", "date_modify": "2025-05-21 06:29:02", "date_publish": "2025-01-22 18:06:03", "description": "Everton news: Fan views on what nobody is talking about but should be", "filename": "sport_football_articles_c1kmed19nwro_1747808942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1kmed19nwro_1747808942.html", "title": "Everton news: Fan views on what nobody is talking about but should be", "title_page": "Everton news: Fan views on what nobody is talking about but should be - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for you what one thing - good or bad - nobody is talking about at Everton but should be.\nHere are some of your comments:\nGareth: We have so many players either out of contract this summer (Dominic Calvert-Lewin, Ashley Young, Idrissa Gana Gueye) or leaving following a loan period (Jack Harrison, Orel Mangala, Jesper Lindstrom). Even if (when) we do stay up, and move into the new stadium, we require a huge volume of new players at undoubtedly great expense subject to FFP. We'll need to spend a fortune just to stand still.\nLuke: How many players are we going to be left with at the end of this season? With a dozen or so of our first-team squad out of contract at the end of the season, it could be a very busy summer transfer window and, despite the Friedkin money, are we going to be in a position to strengthen the squad while staying within PSR constraints?\nBarry: The one thing people aren't talking about is the owners - and that can only be good news for Evertonians! After the turmoil of Moshiri, The Friedkin Group seem to be going about business quietly and discreetly in the background. If we can have owners who focus on running the business and leave the football to those appointed to run the club, we might get back to the stability of the previous David Moyes era.\nDave: For all the fair criticisms of Sean Dyche and Kevin Thelwell, they have left the club in a much better position for Moyes than it was a couple of years ago. All the big-money flops are gone, the wage bill is right down, the books are much healthier for PSR and the personality of the squad is good - lots of grafters in there. Moyes took the same steps when he first joined way back when and now, hopefully, he can start to add touches of class to the fairly blank slate he has inherited.", "url": "https://www.bbc.com/sport/football/articles/c1kmed19nwro"}