{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:52:25", "date_modify": "2025-05-20 14:52:25", "date_publish": "2023-07-27 15:39:35", "description": "Captain Claire Maxwell says Scotland head to the World Cup determined not to 'underachieve' at the top table again as she eyes making history.", "filename": "sport_netball_66296833_1747752745.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F282/production/_130528026_scotlandnetball.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66296833_1747752745.html", "title": "Netball World Cup 2023: Scotland aim to dispense with 'underachieving' label", "title_page": "Netball World Cup 2023: Scotland aim to dispense with 'underachieving' label - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Claire Maxwell is poised to make personal history at the Netball World Cup, but the Scotland captain is more concerned about making sure her side do not \"underachieve\" at the top table again.\nThe Scots begin their campaign in South Africa on Friday - part of a tough four-team group that contains England, the tournament's third favourites.\nScotland have finished sixth three times - but not since 1983 - and are looking to improve on their 11th place from four years ago in Liverpool.\nIndeed, Maxwell told BBC Scotland \"we want to challenge between fifth and eighth position\" this time round.\n\"In previous major championships that I've been at, we've potentially underachieved in terms of our finishing position,\" she admitted.\n\"But we've got a nice blend of experienced players and new, fearless players that have come on to the scene, so I'm really excited.\"\nWith 121 caps already, Maxwell is the most experienced of those campaigners and is expected to surpass the national record held by Lesley MacDonald while in South Africa.\n\"It's not at all in my mind,\" Maxwell insisted. \"It's just a huge honour. I didn't know that was coming, so to get the phone call to say that is the case is super exciting. I can't quite believe it to be honest - it seems not long ago I was getting my first cap.\"\nThe Scottish Thistles captain is more focused on a tough opener against Malawi, who sit four rungs above the 10th-placed Scots in the world rankings, suggesting that \"for us, it's pressure off, no fear\" while citing previous close encounters with Friday's opponents.\nMaxwell thinks her side also have an ace up their sleeve in the shape of head coach Tamsin Greenway, the former England international.\n\"She's brought in a different aspect to our game,\" she said. \"She views it slightly different from any other coach I've seen before, so everyone is really trusting the processes and tactics she is putting in place.\"\nSeven of Scotland's squad will be making their World Cup debuts, and Greenway points out the \"disparity\" between seasoned campaigners like Maxwell and those who \"haven't even competed at\" British Superleague level.\nWhile eight of Scotland's 12-strong squad come from a Strathclyde Sirens side that finished eighth this season, two play for their development side.\nHowever, Greenway believes Scotland are \"tactically ready\" and \"fitter than we've ever been\". They will need to be considering they will face a game per day depending on how far they go up to the 6 August final.\n\"I've been in the role three years,\" the head coach said. \"It has flown by, but one of the biggest things was building the talent pool. That was so important.\n\"I was really happy that we had two players pushing for each position, which is huge. A much better position than when I came into the role.\n\"This is a young group. Regardless of this World Cup, a lot of them can do two, maybe three, cycles and that's really important for the future of the Thistles.\"\nScotland, who finished ninth at last year's Commonwealth Games, booked their place in South Africa by coming second behind Wales in October's six-team European qualifying section in Glasgow.\nNow they must finish in the top three in their section to progress to the second group stage of the finals.\nConsidering Greenway is viewing Sunday's final game against England as a mere \"opportunity for us to try things\", the second on Saturday against 14th-ranked Barbados is likely to be crucial if they are to achieve their \"realistic\" ambitions.\n\"We've won in our last two outings against them, so we'd hope to win that one and get across to the next group,\" she said. \"That group, from six to 12, on any given day can take one another.\"\nGreenway stressed that the World Cup is just the next stage of her long-term planning for Scotland and vice-captain Emily Nicholls thinks expanded coverage of the event will help grow the sport further.\n\"The BBC has just announced its coverage of it, which is going to make it way more accessible to everyone back here to watch,\" Nicholls said.\nShe is particularly relishing the opener against Malawi considering it pits her up against Sirens team-mate Towera Vinkhumbo.\n\"Barbados have now got the Corbyn sisters, who used to play for England, playing for them, so that brings a new flair to their squad,\" Nicholls added. \"Then we've got the good old rivalry with England, which I'm sure every fan loves to watch.\"", "url": "https://www.bbc.com/sport/netball/66296833"}