{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:59", "date_modify": "2025-05-21 04:16:59", "date_publish": "2025-04-05 17:43:38", "description": "West Ham 2-2 Bournemouth: What Graham Potter said", "filename": "sport_football_articles_c5y6e995xv3o_1747801019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6747/live/782e9ed0-1245-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y6e995xv3o_1747801019.html", "title": "West Ham 2-2 Bournemouth: What Graham Potter said", "title_page": "West Ham 2-2 Bournemouth: What Graham Potter said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham manager Graham Potter has been talking to BBC Match of the Day about the free-kick decision that led to Bournemouth's second goal: \"I haven't seen it back, to be honest, so I have nothing to comment on. But obviously we are disappointed with how we defended the goal. But, how soft the free-kick was, I'm not sure.\n\"The substitutes helped us I think and, apart from the first five or 10 minutes of the second half, I thought the team were fully committed. It was a tough match, absolutely.\n\"In the first half, I think there was a period where we dropped a little bit. Apart from that, it was OK without being great. But it was a tough Premier League game and a hard-earned point.\"\nOn striker Niclas Fullkrug scoring: \"He changes the dynamics of our play and gives us a focal point. We are able to play more long balls and go for second balls, a much simpler way of attacking and it gets us up the pitch a bit more.\n\"I'm delighted for him. He is battling back from a significant injury. He is not ready to start, but he is happy to help from the bench.\n\"We scored two very good goals, clinical. I'm pleased for Jarrod [Bowen] because he is also working hard. Sometimes you just need that goal to set you off.\n\"Psychologically, we have to go through barriers together. There are little things we need to keep doing. We've got games to go and we need to stick together, keep fighting and keep going forward.\"", "url": "https://www.bbc.com/sport/football/articles/c5y6e995xv3o"}