{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:01:07", "date_modify": "2025-05-21 04:01:07", "date_publish": "2025-01-15 09:56:33", "description": "Aston Villa news: Fan views on Donyell Malen", "filename": "sport_football_articles_cx2pn8wkkyxo_1747800067.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2pn8wkkyxo_1747800067.html", "title": "Aston Villa news: Fan views on Donyell Malen", "title_page": "Aston Villa news: Fan views on Donyell Malen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Aston Villa completed the signing of Donyell Malen from Borussia Dortmund, we asked for your views on on the new forward.\nHere are some of your comments:\nDamo: One of those players who was hyped as a huge talent when very young but has seemingly stagnated a bit. Quotes from Dortmund make it clear their relationship wasn't great. Unai Emery tends to target players with good attitude and usually manages to get the best from them, so this is his big shot now in his prime years. If he can find form he will be an invaluable option across the frontline.\nPeter: Malen is definitely an upgrade on Jaden Philogene who has never really lived up to the expectations. Malen can play anywhere across the frontline and once he gets acquainted with the Premier League I expect him to be a useful addition to the squad, but we really need to bolster our defence.\nCarl: He is some player if you can get him consistently performing to the standard he is capable of getting to. Could be a bargain.\nZak: Seen him play in person - don't know if he is better than Ollie Watkins, though. As well as that, he isn't consistent.\nRichard: Looks like a good signing and it appears obvious Villa are open to offers for Jhon Duran if the money is right. He is seen by the other players as a great talent, but too disruptive to the team as a whole (think Paul Pogba).\nLuke: Fantastic value, especially in January. Proven international and Champions League player who is a clear and necessary upgrade on Philogene. Hopefully Emery can help with his consistency. Even if the effect from his joining is to make Leon Bailey play better (as Moussa Diaby did), it is a win.", "url": "https://www.bbc.com/sport/football/articles/cx2pn8wkkyxo"}