{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-04-26 04:05:35", "date_modify": "2025-04-26 04:05:35", "date_publish": "2025-03-03 17:12:28", "description": "Boxing promoter Frank Warren says a world title fight \"will happen\" for super-featherweight Ryan Garner.", "filename": "sport_boxing_articles_c3rnp0ngv9no_1745640335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7644/live/0b4646e0-f84d-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_c3rnp0ngv9no_1745640335.html", "title": "Ryan Garner: Frank Warren says world title fight 'will happen'", "title_page": "Ryan Garner: Frank Warren says world title fight 'will happen' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Boxing promoter Frank Warren has said that a world title fight \"will happen\" for super-featherweight Ryan Garner.\nThe Southampton man claimed the vacant EBU European title on Saturday when he defeated Spaniard Salvador Jimenez in Bournemouth.\nGarner won the contest by unanimous decision with all three of the judges at ringside scoring it 120-108 in his favour.\n\"It was a classic performance from Ryan - Southampton and Britain have a star there,\" Warren told BBC Sport.\n\"He has put himself well up there to fight for a world title before the end of the year.\n\"He is a quality fighter and I want to deliver for him what his dream is and that is to do that for him at St Mary's.\n\"We'll make a world title fight, that will happen, but in the meantime he will have to be kept busy.\"\nGarner packed out the Bournemouth International Centre for what was his 17th professional victory.\nWarren said that he was unable to attend the event due to picking up the flu while out in Saudi Arabia the week prior.\nIn the super-featherweight division, the holder of the British and Commonwealth titles is Hertfordshire's Reece Bellotti.\nHe has defended both of his titles on three occasions now and professionally has 20 wins with five defeats.\n\"I like that fight for him (Garner), it would be great for him and the fans.\" Warren added.\n\"We'll obviously speak to our counterparts at Matchroom and see if we can do that.\"\nGarner has told many times of his dream to fight at the stadium of his hometown football club - Southampton.\nBut the show in Bournemouth was deemed a massive success with his performance on the night and the backing of a few thousand fans.\nThe BIC was packed and noisy on Saturday with supporters singing Garner's name hours before he even made his ring walk.\n\"That (venue) is his home for now,\" Warren told.\n\"It was brilliant working with them down there and it's a no-brainer to go down there again, it's just a shame it isn't bigger.\n\"Every time a fighter fights at that level they're learning, have a couple more and then he'll be ready to go.\n\"He's a young man and he's very capable, I genuinely believe he will be a world champion.\"\nAs well as holding the European super-featherweight title Garner has the WBC International belt and is ranked 15th within their organisation.\nThe current WBC world super-featherweight champion is American O'Shaquie Foster who won the belt in November of 2024.\nGarner's pro career has been far from straightforward with injuries halting progress and also issues away from the ring that set him back.\n\"I never thought I'd give up on him through it all,\" Warren said.\n\"From all those years ago when he signed with us I thought he was a precocious talent and he had the potential to be a great fighter.\n\"He was losing his dedication but he turned his life around, he has some direction in his life now with his family and it is nice to see that happen now and see that your faith in them was justified.\"", "url": "https://www.bbc.co.uk/sport/boxing/articles/c3rnp0ngv9no"}