{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:48:09", "date_modify": "2025-04-26 03:48:09", "date_publish": "2025-03-05 15:13:56", "description": "Brighton podcast: Albion Unlimited discusses Yankuba Minteh", "filename": "sport_football_articles_c04zdkzx4vdo_1745639289.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c6b7/live/34e04270-f9d4-11ef-adf5-bddd64abc471.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c04zdkzx4vdo_1745639289.html", "title": "Brighton podcast: Albion Unlimited discusses Yankuba Minteh", "title_page": "Brighton podcast: Albion Unlimited discusses Yankuba Minteh - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Brighton striker Warren Aspinall has criticised Yankuba Minteh's attitude in their FA Cup victory at Newcastle on Sunday.\nSpeaking on the Albion Unlimited podcast, he said: \"It's all about attitude of the players now [for the rest of the season]. Look at Tariq Lamptey - he has waited and waited and he has been playing out of his skin in the past three games.\n\"I didn't like the way that [Yankuba] Minteh came off, when he was shaking his head. Just get yourself off, hug your team-mate and sit down.\n\"If you have got any problems, go and knock on the manager's door on Monday morning. Don't show disrespect to the manager because he has made those decisions. The substitutions who came on won us the game.\n\"If I was the manager, I would be having a word with him and asking what his problem was.\"\nBBC Radio Sussex's Johnny Cantor added: \"You could say that his challenge gave away the penalty and I thought that if his shot hadn't been deflected, he probably wouldn't have scored. To be shaking your head in front of the manager, it's frustration there.\n\"It should be the norm [to support your team-mates coming on as a substitute].\"", "url": "https://www.bbc.co.uk/sport/football/articles/c04zdkzx4vdo"}