{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:52:51", "date_modify": "2025-04-26 06:52:51", "date_publish": "2025-02-28 17:00:46", "description": "Brighton news: Seagulls publish 2023-24 financial accounts", "filename": "sport_football_articles_ce982jjmjzjo_1745650371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb2a/live/bb041640-f5f3-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce982jjmjzjo_1745650371.html", "title": "Brighton news: Seagulls publish 2023-24 financial accounts", "title_page": "Brighton news: Seagulls publish 2023-24 financial accounts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton recorded a profit after taxation of £42.9m in the 2023-24 season with stellar player trading bolstering their financial performance.\nThe Seagulls made a profit of over £110m on player dealing, helped in no small part by the sale of Moises Caicedo to Chelsea for a British record fee thought to be around £115m.\nFor the 2023-24 season, the club achieved turnover of £222.4m, excluding income associated with the New Monks Farm development. The figure represents the highest turnover in the club's history.\n\"By way of contrast our turnover in 2016-17, our last in the Championship, was £29.2m – an incredible 762% increase in seven years,\" the club wrote in a statement accompanying their results., external\nChairman Tony Bloom said: \"The accounts show another healthy profit for the period. We've stayed competitive on the field while also making some significant investments in terms of transfer dealings ahead of that June deadline.\n\"The hard work, expertise and professionalism of our board of directors, executive team, and entire staff continues to provide the platform to make this all possible. I remain incredibly proud of our club and all who work here, and I would like to thank all our staff for their ongoing efforts.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce982jjmjzjo"}