{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:21", "date_modify": "2025-05-21 05:35:21", "date_publish": "2025-01-14 16:09:43", "description": "Portsmouth boss John Mousinho says players rested for their FA Cup loss at Wycombe will return to face Blackburn in the Championship.", "filename": "sport_football_articles_c2eg7ymepldo_1747805721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28d6/live/7adc7800-d28f-11ef-9b53-b56bc9bcdc17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2eg7ymepldo_1747805721.html", "title": "John Mousinho: Portsmouth to recall rested players for Blackburn", "title_page": "John Mousinho: Portsmouth to recall rested players for Blackburn - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth will recall the players they rested for their FA Cup defeat by Wycombe when they face Blackburn in the Championship, says boss John Mousinho.\nPompey made nine changes for the loss at Adams Park on Friday but one of them, goalkeeper Jordan Archer, won't be available because of a quad muscle injury.\nThe match at Blackburn on Wednesday is a rearranged meeting after the original game at Ewood Park in November was postponed because of Storm Bert.\n\"Thankfully we managed to rest some players on Friday who should be available to come back in on Wednesday and then it's a quick turn around for Saturday (against Middlesbrough),\" Mousinho told BBC Radio Solent.\n\"We'd rather have not had a game this midweek - it's not ideal but we have to deal with it and get on with it.\"\nPortsmouth have lost three of their past four games in the Championship and they visit a Blackburn side who are just one point outside the play-off places and won at Middlesbrough in the FA Cup on Saturday.\n\"They've had a fantastic first half to the season. Of late their form hasn't been as good as it had been but they pose a real threat.\n\"I think John (Eustace) is a really good coach and they've got some excellent players there and a side with a bit of confidence after the weekend.\"", "url": "https://www.bbc.com/sport/football/articles/c2eg7ymepldo"}