{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:30", "date_modify": "2025-05-21 07:59:30", "date_publish": "2025-03-27 17:23:22", "description": "Hull City defender Cody Drameh has returned to training as the Tigers prepare to host Luton Town in Saturday's early kick-off (12:30 GMT).", "filename": "sport_football_articles_c1w0r14r80go_1747814370.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8be/live/95fcc550-0b2d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1w0r14r80go_1747814370.html", "title": "Drameh returns to training for 'fresh' Tigers", "title_page": "Hull City: Cody Drameh returns to training for 'fresh' Tigers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City defender Cody Drameh has returned to training as the Tigers prepare to host fellow relegation-threatened rivals Luton Town in Saturday's early kick-off (12:30 GMT).\nDrameh has missed the past two league games with a knee injury but is expected to return for the weekend.\nAs is the case for midfielder Kasey Palmer, who was unable to travel with Jamaica during international break due to an ankle issue.\n\"It wasn't anything major but we decided with the support of the Jamaican federation to keep him out of that call and give him the week to be able to train,\" Selles told BBC Radio Humberside.\n\"He's good for this weekend.\"\nThe international break has not just been beneficial for Palmer, Selles believes that the week away from the Championship has revitalised his squad.\n\"They have been looking really fresh, really well,\" Selles added. \"They got what they needed from that period away from us.\n\"That period off the pitch or off from the usual dynamic, gives them the perception of being more fresh, wanting train and do more things.\"", "url": "https://www.bbc.com/sport/football/articles/c1w0r14r80go"}