{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:09:16", "date_modify": "2025-04-26 08:09:16", "date_publish": "2025-02-26 13:26:54", "description": "Hull FC prop Ligi Sao will miss the rest of the 2025 Super League season having suffered a serious knee injury.", "filename": "sport_rugby-league_articles_c1mn51e55ego_1745654956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ab5b/live/1e24a940-f443-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_c1mn51e55ego_1745654956.html", "title": "Ligi Sao: Hull FC prop to miss rest of the season with serious knee injury", "title_page": "Ligi Sao: Hull FC prop to miss rest of the season with serious knee injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hull FC have signed prop Sam Eseh on a season-long loan after confirming Ligi Sao will miss the rest of the 2025 Super League campaign with a serious knee injury.\nSao, 32, was injured during Hull's defeat by Wigan Warriors on Friday and is now sidelined for the rest of the season, just two league games into the campaign.\nHead coach John Cartwright said that following surgery this week, Sao will be out for a minimum of nine months.\n\"I'm really disappointed for him - that hurt us the other night as he's been very good for the club for a long period of time,\" Cartwright told BBC Radio Humberside.\n\"He's tough, he's a good leader. He's going to be sorely missed. It's very unfortunate for him and the team but that's footy so we've just got to soldier on.\"\nLater on Wednesday, the club announced fellow prop Eseh - who previously made four appearances for the Black & Whites during a brief spell at the MKM Stadium last summer - would arrive on loan from Wigan.\nA product of Wakefield Trinity's youth programme, 21-year-old Eseh made his Super League debut in 2023 and has amassed more than 40 senior appearances.", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/c1mn51e55ego"}