{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:01:19", "date_modify": "2025-04-26 08:01:19", "date_publish": "2025-02-26 17:37:08", "description": "Lewis Crocker says support from \"all\" of his native Belfast will help him beat Paddy Donovan in the all-Irish IBF world welterweight eliminator on Saturday.", "filename": "sport_boxing_articles_czdnlzd80m2o_1745654479.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93a6/live/eceeb020-f463-11ef-8dd5-1d47b25c094a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_czdnlzd80m2o_1745654479.html", "title": "Lewis Crocker vs Paddy Donovan: World title eliminator as Crocker to box for 'all of Belfast'", "title_page": "Lewis Crocker vs Paddy Donovan: World title eliminator as Crocker to box for 'all of Belfast' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lewis Crocker says support from \"all\" of his native Belfast will help him overcome Limerick man Paddy Donovan in the all-Irish IBF world welterweight eliminator on Saturday night.\nIn the build-up to the contest at Belfast's SSE Arena, Donovan appeared to make a play for support from Belfast fight fans by reportedly referring to Crocker as being a \"Rangers fan\".\nDonovan's coach, former world middleweight champion Andy Lee, moved to \"squash\" the issue at the start of Wednesday's pre-fight news conference in Belfast.\n\"Paddy was asked about Lewis being a Rangers fan - it was taken out of context in the headline,\" said Lee.\n\"That's not what it's about for us. These are two great fighters and you're in a for a treat.\"\nCrocker was not convinced by Lee's explanation.\n\"He doesn't realise I represent all of Belfast. I'm from Sandy Row but I boxed for Holy Trinity,\" said Crocker, who like Donovan, has an unbeaten record going into the world title eliminator.\n\"It's not like that in Belfast - especially in sport. I think he knows he messed up and all of Belfast is behind me.\"", "url": "https://www.bbc.co.uk/sport/boxing/articles/czdnlzd80m2o"}