{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-21 07:30:05", "date_modify": "2025-05-21 07:30:05", "date_publish": "2025-03-28 18:05:32", "description": "England bring back their \"superstars\" for record game at Principality Stadium against Wales.", "filename": "sport_rugby-union_articles_cd9292jedz3o_1747812605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/20c4/live/a3aca970-0bc5-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cd9292jedz3o_1747812605.html", "title": "Women's Six Nations 2025: England's 'superstars' return for Wales challenge", "title_page": "Women's Six Nations 2025: England's 'superstars' return for Wales challenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If plan A doesn't work, the alphabet has 25 more letters.\nJohn Mitchell's England started their Women's Six Nations campaign with a bonus-point win over Italy in York on Sunday to extend the Red Roses' winning run to 21 games.\nDespite an underwhelming second half that brought only five points through full-back Emma Sing, their goal of scooping up a seventh successive Six Nations title and fourth Grand Slam in a row got off to a strong start.\nOn paper, Mitchell's starting XV against Italy was the weaker of the \"two teams\" he is trying to build before a home Rugby World Cup in August.\nHis alternative plan still delivered and notes about new faces could be slotted away in his back pocket, with a different approach called for in round two.\nThat is because over 20,000 tickets have been sold for Saturday's game against Wales at Principality Stadium - a record for a Welsh women's team event in Wales, meaning he requires his trusty first teamers.\nMitchell has made 13 changes to his starting XV, with a large majority of his side who played key roles in last year's Six Nations and WXV1 title successes returning.\nIn a World Cup year, exact scenario building can be very difficult, but with a loud Cardiff atmosphere incoming, situations may be thrown up that are slightly off script.\nUnder former head coach Simon Middleton, England's record 30-Test winning streak came crashing down when it mattered most in the World Cup final loss to New Zealand in 2022.\nThe uniqueness of a World Cup means more than just relentless winning is needed in preparation.\n\"We had multiple plans [in 2022] but probably only plans A and B, now we have plans A, B, C, D,\" England forwards coach Louis Deacon, who remains from that coaching group, told BBC Sport.\n\"What we are trying to ultimately do is that we are looking to evolve our game.\"\nEngland have won 20 of their previous 22 Six Nations matches against Wales, and given the strong team named by Mitchell, matching their average winning margin (over the last eight championship wins) of 46 points looks likely.\nWorld player of the year Ellie Kildunne, who scored two tries against Wales in last year's 46-10 victory, returns to the starting XV to win her 50th cap.\nThe 25-year-old full-back is joined by wings Abby Dow and Jess Breach, with the trio ready to chase down their 18 combined tries in last year's championship.\nZoe Harrison gets an opportunity to press forward her case to be the starting fly-half in a star-studded backline also containing regular centres Meg Jones and Tatyana Heard.\nQuality returns to the pack in the form of prop Sarah Bern, who was at her barnstorming best off the bench in York, while 22-year-old Morwenna Talling and Abbie Ward form a balanced second-row partnership that brings work-rate and line-out nous.\n\"You could field two completely England different 23s and both could win the Six Nations, that is the calibre we are talking about,\" former Wales player Philippa Tuttiett told BBC's Rugby Union Weekly.\n\"There are some superstars throughout that team, it is an incredible team.\"\nTo cap off the exciting team selection, Olympian Abi Burton, who nearly lost her life in 2022, is set to make her England debut from the bench.\nThe 25-year-old back row spent 25 days in an induced coma after being diagnosed with autoimmune encephalitis, which occurs when the body's immune system mistakenly attacks the brain.\nWhen Burton came out of her coma she was unable to walk and talk, and had lost more than three stone, but she miraculously returned to rugby sevens in time for her second Olympics in Paris.\nEngland centre Jones said when Burton came out of her coma she \"manifested\" playing for the Red Roses and the back rower has impressed following her switch back to XVs with Trailfinders.\n\"Since I've been ill and come back into playing rugby at the Paris Olympics and coming back into XVs, I feel like I am thriving as a person on and off the pitch,\" Burton told BBC Sport.\n\"My family are now finally seeing me fully play rugby like I will never play again, every single game, and they love seeing that enjoyment on face.\n\"It will be a really special moment for them just seeing me happy and enjoying myself.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cd9292jedz3o"}