{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-04-26 03:44:27", "date_modify": "2025-04-26 03:44:27", "date_publish": "2025-03-05 07:19:30", "description": "BBC Sport looks at the state of play in the Irish Premiership title race and relegation battle as Linfield look to regain the Gibson Cup.", "filename": "sport_football_articles_cx2x07dml97o_1745639067.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4f7/live/3fbcbac0-f939-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2x07dml97o_1745639067.html", "title": "Irish Premiership: When can runaway leaders Linfield win the title?", "title_page": "Irish Premiership: When can runaway leaders Linfield win the title? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As we edge ever closer towards the end of the season, Linfield are in a strong position to lift the Irish Premiership title.\nDavid Healy's side are 16 points clear of Glentoran in second place despite a strong recent run of form from the east Belfast side.\nGlentoran have a game in hand over Linfield but it seems a matter of when, not if, the Blues, who also have a superior goal difference, are crowned champions.\nIn short, Linfield require four wins from their final eight matches to secure the title.\nHere's how things stand in the table as we approach the business end of the season.\nAfter Larne won the title in the past two seasons, it looks like the Gibson Cup is heading back to Windsor Park.\nGlentoran defeated Ballymena United on Tuesday to move three points closer to their rivals, but if anything it has consolidated second place, rather than put any huge pressure on the Blues.\nThree of the Linfield's final eight matches take place before the Irish Premiership is split into two halves for the remaining five fixtures - when the top six teams face each other and likewise with teams in the bottom half.\nIn theory, they could have it wrapped up by then.\nHere's a look at the fixtures for the top two.\nThe Glens are in action in the BetMcLean Cup final against Cliftonville on Sunday, which could allow Linfield to take another step closer to the title if they defeat Crusaders in front of the BBC cameras on Friday night.\nWhile Linfield are just four wins away, that's also assuming Glentoran pick up maximum points from their remaining fixtures. Any slip-ups from Declan Devine's side will put Linfield closer to the trophy.\nTheoretically, Linfield could win the title as early as 15 March if they defeat Crusaders and Glenavon, and Glentoran lose at home to both Paddy McLaughlin's rejuvenated Lurgan Blues and away to Carrick Rangers.\nThe Glens also face tricky tests at home to Larne and Crusaders before the split, while Linfield face Dungannon Swifts.\nBehind the top two, there are eight points separating third place to eighth as teams battle for the European places.\nThe top two in the Irish Premiership automatically qualify for European football in the summer, along with the play-off winner and Irish Cup champion.\nThe play-off consists of the teams from third to seventh in the Irish Premiership at the end of the season.\nIt's been a stunning campaign for Dungannon Swifts under Rodney McAree, who has developed and guided one of the most exciting teams in the Irish Premiership.\nThe Swifts are third in the table and are in the semi-finals of the Irish Cup, so two avenues to European football are still open.\nCrusaders have been hot and cold, but hold fourth in the table while holders Larne have been playing catch up due to their own, historic European exploits before Christmas.\nIrish Cup holders and this year's semi-finalists Cliftonville round out the top six, while in the second half of the table Portadown, Coleraine, Glenavon and Ballymena United are in contention for a European play-off spot.\nThe title race and relegation battle (which you can read about below) may be fairly clear cut, but the race for Europe promises to be extremely exciting.\nLoughgall face two tough fixtures against Larne and Crusaders before a final pre-split fixture at home to Ballymena United.\nIf they are 15 points adrift heading into the spilt then their relegation into the Championship will be confirmed.\nDean Smith's side also have the worst goal difference in the league, so will need a miracle if they are to claw their way to safety.\nWith the tight nature of the middle of the table - as we mentioned above - both Carrick and Loughgall will have to wait to see who they will play in the split.\nAfter picking up their first win since November on Tuesday, Carrick will be hoping to stick a run of form together to move further up the bottom half.\nHowever, preparation for a relegation/promotion play-off with a Championship side looks the more likely outcome at this stage.", "url": "https://www.bbc.co.uk/sport/football/articles/cx2x07dml97o"}