{"authors": ["Rob Staton", "www.facebook.com"], "date_download": "2025-05-21 03:55:59", "date_modify": "2025-05-21 03:55:59", "date_publish": "2025-04-07 13:24:20", "description": "BBC Radio Sheffield's Rob Staton on the increasing number of questions surrounding the future of the club and chairman Dejphon Chansiri.", "filename": "sport_football_articles_cx27gy8pz0xo_1747799759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b14d/live/f6ff0230-13ae-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx27gy8pz0xo_1747799759.html", "title": "Sheffield Wednesday: Expert View", "title_page": "Sheffield Wednesday: Expert View - Questions going unanswered - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Sheffield Wednesday players might have been finally paid today but the further reputational damage to the club will linger.\nThis latest episode, along with controversial fans forums, late HMRC payments and other issues have definitely not gone unnoticed in football.\nWith Southampton parting with Ivan Juric today, it feels like a matter of when not if they make a move for Owls boss Danny Rohl. They won't be the only interested party. It seems inevitable the club will lose its biggest asset.\nHow many of the out of contract players will also be minded to move on after this?\nChairman Dejphon Chansiri bears complete responsibility and there are larger than ever calls for him to find a buyer and sell the club.\nHowever, a growing passion for change among Wednesday fans online didn't translate to anger in the stands on Saturday. The reaction was meek, a couple of strangled chants calling for Chansiri to go. It feels clearer than ever that there simply isn't an appetite for protest at Hillsborough.\nThis isn't a modern thing.\nOwls fans, by and large, are not protesters. There was more anger shown by Rotherham fans the week prior at now former boss Steve Evans than we saw at Chansiri at the weekend.\nThe 1867 Group, which has organised protests over the last 18 months, phoned our show to tell us they were often abused, spat at and one volunteer had a punch aimed in his direction. They say they had no choice but to give up.\nWe requested an interview with Chansiri but were told by the club he isn't doing any audio interviews.\nThese are some of the questions that fans want answers to:\nThe club sold early bird season tickets at Christmas, recently hosted a big crowd for the Steel City Derby and gave hospitality box holders a seven-day deadline to renew and pay to get a cheaper rate. How did the club not have sufficient funds to pay players and staff on time in March?\nThat has to be explained in more detail. The fans deserve answers because they're the ones being asked to pay for not only early season tickets, but also some of the highest ticket prices around.\nIf the club is now reliant on money coming into the chairman's other businesses to pay monthly salaries, what are these other businesses exactly? Do fans have a right to know if the sustainability of the club is reliant on them?\nHow long is it until the next cashflow issue? Is it a matter of time until the next problem? And if so, doesn't the chairman have a duty to look for alternative investors and/or new owners?\nWho advises the chairman? We're constantly asked about Amadeu Paixao. What is his role, specifically, and how was he introduced to the chairman?\nThere are of course many more questions to be asked. This is a historic football club that is not being run properly.", "url": "https://www.bbc.com/sport/football/articles/cx27gy8pz0xo"}