{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:22", "date_modify": "2025-05-21 05:59:22", "date_publish": "2025-04-05 00:00:00", "description": "Crystal Palace finish with nine men but hold on to beat Brighton as Daniel Munoz's second-half winner decides a match of three red cards at Selhurst Park.", "filename": "sport_football_live_c8dgj13lm5et_1747807162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2fdd/live/8b52bfd0-1238-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c8dgj13lm5et_1747807162.html", "title": "Crystal Palace 2-1 Brighton: Three sent off as Daniel Munoz gives hosts win", "title_page": "Crystal Palace 2-1 Brighton: Three sent off as Daniel Munoz gives hosts win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace finished with nine men but held on to beat Brighton as Daniel Munoz's second-half winner decided a match of three red cards at Selhurst Park.\nSubstitute Eddie Nketiah was dismissed after picking up two yellow cards in nine minutes, before Marc Guehi was sent off for a second bookable offence too.\nVisitors Brighton themselves ended with 10 men after defender Jan Paul van Hecke was shown a red card for hauling down Daichi Kamada.\nPalace had taken the lead in the third minute when striker Jean-Philippe Mateta was played in by Eberechi Eze and curled the ball excellently into the top corner.\nBrighton started to build pressure and almost equalised when Dean Henderson was forced into a smart double save from Carlos Baleba before he pushed away Danny Welbeck's follow-up.\nBrighton made their pressure count and drew level in the 31st minute. Winger Yankuba Minteh curled an excellent cross into the box and Welbeck turned it in from close range, becoming the Seagulls all-time top goalscorer in the Premier League.\nColombian Munoz scored what proved to be the winner when Eze played a quality pass for him to drill a low shot into the far corner.\nSecond half substitute Nketiah was sent off with 12 minutes to go, collecting his second booking for a high foot on Brighton defender Van Hecke.\nThen as the clock ticked towards the start of almost 14 minutes of stoppage time, Guehi followed him down the tunnel, getting his second yellow card for a late tackle on Brajan Gruda.\nThat wasn't the end of the drama, though, as Van Hecke then saw red for fouling Kamada.\nPalace's victory means that they have won five of their past six matches in all competitions and are just two points from the top half of the table.\nThe drama of a match with three red cards threatened to overshadow what was another impressive win for Palace.\nOliver Glasner's side have an exciting end to the campaign to look forward to, with a top-half finish a possibility and an FA Cup semi-final against Aston Villa at the end of the month.\nWith so many talking points, this game adds another chapter into the rivalry between these two sides.\nNketiah's red card, received just 10 minutes after coming on as a substitute, sums up his first season at Palace, with flashes of quality but moments of frustration.\nKamada, who arrived in the summer transfer window with Nketiah, has been much criticised by supporters since his move to Palace.\nHowever, the Japan international was excellent in his deeper midfield role and it was his bursting run after the Eagles went down to nine men that led to Brighton's Van Hecke seeing red.\nPalace have a tough Premier League run-in - facing seven of the top 10 - but supporters won't be thinking of that as they celebrate their first league double over Brighton since the 1932-33 season.", "url": "https://www.bbc.com/sport/football/live/c8dgj13lm5et"}