{"authors": ["Steve Bunce", "www.facebook.com"], "date_download": "2025-05-20 13:54:33", "date_modify": "2025-05-20 13:54:33", "date_publish": "2023-07-26 05:21:16", "description": "In his BBC Sport column, Steve Bunce says Errol Spence Jr v Terence Crawford in Las Vegas this weekend is a 'brilliant fight, but missing the stardust'", "filename": "sport_boxing_66266721_1747749273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2473/production/_130513390_177f04d3a81e76a6a48623b0df67842b4a3293ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66266721_1747749273.html", "title": "Steve Bunce column: Errol Spence Jr v Terence Crawford a 'brilliant fight, but missing the stardust'", "title_page": "Steve Bunce column: Errol Spence Jr v Terence Crawford a 'brilliant fight, but missing the stardust' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Errol Spence Jr versus Terence Crawford is a brilliant fight. A spectacularly brilliant fight. But there is just something missing - a little bit of stardust, perhaps.\nThese two men have held world titles at welterweight for the past five or so years and are finally facing each other. The winner will stake his claim as the best in the division and maybe even the pound-for-pound star of world boxing.\nBut I have to be brutally honest - and this is by no means me knocking the contest - as great as it is, this is not as big as boxing purists may think.\nAnd if you don't think there's something missing, then I'm convinced you're deceiving yourself. Sometimes we live in a boxing bubble.\nThis is not Sugar Ray Leonard v Thomas Hearns. This is not Floyd Mayweather v Manny Pacquiao, even though that fight happened years too late.\nThese two - personality wise - are not Roberto Duran, Oscar de la Hoya or even Ricky Hatton.\nYou've got two guys who have tried really hard to build the fight up in the past six weeks or so, but outside of that boxing bubble not many people will have heard of Crawford or Spence.\nIt's a ridiculous thing to say when you look at their records, but this could - in many ways - be a breakout fight for the winner to go and cross over into the mainstream.\nWe talk about Crawford and Spence maybe not getting the recognition it deserves, you can make the same argument for a sensational match-up we had in Tokyo on Tuesday as Naoya Inoue beat Stephen Fulton to become a four-weight world champion.\nYou could say that was a generational event which too went under the radar. The reason is because boxing, right now, is peak event driven.\nTyson Fury v MMA fighter Francis Ngannou in October is the best crossover freak-fight circus event that's ever been a legal boxing match.\nIt's a 'genuine' fight in Saudi Arabia - in that it's boxing rules, they'll wear boxing gloves and they'll fight over boxing distance - but it's a total mismatch.\nAnd that will generate so much more money than Spence v Crawford. It will gain more publicity than Spence v Crawford. And that's just the nature of the beast.\nYou just need to look at Tommy Fury against Jake Paul. It was enormous. It was the best eight-round novice fight in history, so to speak. That's what it was. Yet look at the interest that generated.\nThink about just how big some of Mayweather's fights were. Some of them were not great spectacles, but they were enormous events. But it was all about Mayweather's stardust, to use that word again.\nIn an ideal world, I'd like to have seen this fight two or three years ago, but I don't get the impression either of them are past their peak.\nThey might have reached their peak, but I don't see signs they're falling away.\nYou've got to really search for weaknesses in either fighter. When you speak to people that fought the pair or have done a lot of sparring with them, you hear all sorts of praise.\nCrawford and Spence are both accurate, they're both smart, don't waste any punches, they're powerful, can hurt you, and they can open up fast and finish you off.\nPerhaps Spence Jr can drop you quicker, but Crawford can break you down.\nSpence has been a welterweight since around 2013 and at the same time Crawford was operating at lightweight or super-lightweight. But I don't think the size will be a factor.\nI've seen them two of them together, and I've seen them when they're preparing for fights. I look at the two of them, and they're very similar.\nI think it might come down to who's the smartest. Some people are convinced that's Spence but I think Crawford might be smarter.\nThe main unknown about this fight is who's got the most left in the tank. I've just got a feeling it might be Crawford.\nBut even though I'm favouring Crawford, I would be stunned if one of them walks away with this fight. I'd be absolutely amazed if there's one master.\nWhoever wins this weekend, his next fight needs to be another massive welterweight showdown against either Jason 'Boots' Ennis or Virgil Ortiz Jr, two young stars chomping at the heels.\nBeat one of those and Crawford or Spence can move up to light-middleweight and fight a champion in that division. All of the time, eyes on bigger prizes.\nFor the loser, perhaps this is the fight where he becomes an old man overnight, which can happen.\nSteve Bunce was speaking to BBC Sport's Kal Sajad.", "url": "https://www.bbc.com/sport/boxing/66266721"}