{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 07:23:25", "date_modify": "2025-05-21 07:23:25", "date_publish": "2025-05-20 06:42:40", "description": "Everton: 30 years since 1995 FA Cup win - Phil McNulty", "filename": "sport_football_articles_ckg70r8vjdko_1747812205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f878/live/2a4df350-3266-11f0-a80a-0d849379e1d9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg70r8vjdko_1747812205.html", "title": "Everton: 30 years since 1995 FA Cup win", "title_page": "Everton: 30 years since 1995 FA Cup win - Phil McNulty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton's 1995 FA Cup Final win over Manchester United at Wembley remains the club's last major trophy - but the manner in which it capped a remarkable transformation under manager Joe Royle remains fresh in the memory of all who witnessed it 30 years ago.\nRoyle left Oldham Athletic to return to his beloved Goodison Park in November 1994 with Everton rooted to the bottom of the Premier and, in his words, \"needing snookers\" to survive.\nEverton, under his guidance, did not just get the snookers required, they then cleared the table to not only stay in the top flight but crown Royle's stunning renaissance with the most glamorous prize in domestic football.\nThis was the year of Everton's famous \"Dogs Of War\", a throwaway phrase Royle used to describe a combative, fiercely competitive style led by the midfield pair of Barry Horne and Joe Parkinson.\nIt was instantly adopted by Everton supporters, who wore T-shirts bearing the phrase in their thousands, but was also turned back on Royle by those who chose to diminish the dramatic turnaround.\nTo suggest Everton were one dimensional that season can be dismissed, as the team contained the mercurial talents of the brilliant Swede Anders Limpar as well as the subtle forward play of Graham Stuart and Paul Rideout.\nDuncan Ferguson was the great talisman, scoring his first Everton goal in Royle's opening game in the Merseyside derby against Liverpool, but he was actually sidelined for the latter part of the run to Wembley, missing the semi-final and only appearing as a substitute in the final.\nEverton's 4-1 win in the semi-final against Tottenham Hotspur at Elland Road was their finest performance in years and remained so long afterwards, fuelled by two goals from second-half substitute Daniel Amokachi, who entered the pitch by accident as a replacement for Rideout, mistakenly thinking he had been waved on.\nRoyle later called it: \"The greatest substitution I never made.\"\nEverton's demolition of a Spurs side containing Jurgen Klinsmann and Teddy Sheringham wrecked what many regarded as the so-called \"dream final\" with Manchester United, Royle literally spelling out the colourful phrase he used in the direction of those disappointed at the planned party being spoiled.\nAnd so to Wembley on 20 May 1995, and a meeting with hot favourites United, Sir Alex Ferguson's side without the inspirational Eric Cantona, serving an eight-month suspension for a kung fu kick at a Crystal Palace supporter in January 1995.\nUnited had lost the Premier League to Blackburn Rovers on the final day of the season the previous week, but this was not an Everton side given to sympathy.\nThey gave no quarter to an opposition midfield containing Paul Ince and Roy Keane, but also utilised the skills of Limpar, an enigmatic figure Royle had boosted before the final by comparing his natural gifts with French great Michel Platini.\nEverton held sway in the first half, going ahead after 30 minutes.\nMan-of-the-match and Everton captain Dave Watson won a crunching duel with Ince deep in his own half. Limpar broke clear at pace before passing to Matthew Jackson, who fed Stuart. He looked certain to score but hit the bar, Rideout reacting first to head home the rebound.\nUnited pushed in the second half but the great Everton keeper Neville Southall, now 36, rolled back the years with a magnificent display, especially with a double save from Paul Scholes and then from Gary Pallister's header.\nThe FA Cup, lifted by Watson, went to Goodison Park and remains Everton last success.", "url": "https://www.bbc.com/sport/football/articles/ckg70r8vjdko"}