{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:50:52", "date_modify": "2025-05-20 11:50:52", "date_publish": "2023-07-25 14:37:58", "description": "Oxford United manager Liam Manning says he still needs \"two or three\" new players to complete his squad.", "filename": "sport_football_66302135_1747741852.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7991/production/_130512113_shutterstock_editorial_14018103o.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66302135_1747741852.html", "title": "Liam Manning: Oxford United boss hoping for more new signings", "title_page": "Liam Manning: Oxford United boss hoping for more new signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United head coach Liam Manning says he still needs \"two or three\" new players to complete his squad ahead of the new League One season.\nThe U's have signed six players this summer - a goalkeeper, two defenders, a midfielder and two strikers.\n\"We need two or three and we are still in the process of adding,\" he told BBC Radio Oxford's The Dub podcast.\n\"We're working hard behind the scenes, hopefully we'll have some news soon.\"\nOxford struggled for most of last season and when Manning took over at the end of April they had failed to win a game in eight outings.\nTaking over from sacked manager Karl Robinson, the ex-MK Dons boss managed to guide the floundering U's to League One safety, avoiding relegation by two points.\nThe upcoming season will be his first full campaign in charge at the Kassam Stadium and the club are believed to be eyeing a left back and a striker.\n\"I think we are quite clear, we want to get the right players and not just rush to get numbers in,\" added Manning.\n\"We have got some quality in depth already and for me it is about adding quality in key areas.\n\"The sooner we get players in the better. We would love to get players in straightaway, but when you look at Premier League teams away on tour they tend to take big squads with fringe players.\n\"When those teams come back it tends to open up potential options.\n\"So we are grafting and making lots of calls so that we can get the targets we've identified in.\"", "url": "https://www.bbc.com/sport/football/66302135"}