{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:39:07", "date_modify": "2025-05-19 15:39:07", "date_publish": "2017-08-10 12:31:39", "description": "Rising tensions over North Korea are being \"closely monitored\", says the IOC, with the 2018 Winter Olympics to take place in South Korea in February.", "filename": "sport_winter-olympics_40885700_1747669147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/376B/production/_97278141_mediaitem97278140.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_winter-olympics_40885700_1747669147.html", "title": "Winter Olympics 2018: IOC says it is monitoring tensions over North Korea", "title_page": "Winter Olympics 2018: IOC says it is monitoring tensions over North Korea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rising tensions over North Korea are being \"closely monitored\" says the International Olympic Committee (IOC), as preparations continue for February's 2018 Winter Olympics in South Korea.\nHeated rhetoric between North Korea and the United States has intensified since the testing of two missiles in July.\nOn Tuesday, President Donald Trump said North Korea \"will be met with fire and fury\" if it threatens the US.\nThe IOC said it believes preparations for the Games are still \"on track\".\nA statement added: \"The IOC is keeping itself informed about developments. We continue working with the organising committee.\"\nTrump's comments came amid reports that North Korea may have finally succeeded in miniaturising a nuclear weapon that could fit on an inter-continental missile - a prospect long-dreaded by the US and its Asian allies.\nNorth Korea has threatened to fire missiles at the US island territory of Guam - home to 163,000 people.\nIt denounced Donald Trump's warnings of \"fire and fury\" and said the US leader was \"bereft of reason\".", "url": "https://www.bbc.com/sport/winter-olympics/40885700"}