{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:19", "date_modify": "2025-05-21 07:27:19", "date_publish": "2025-03-28 13:46:24", "description": "BBC Sport Online Voting: Privacy Notice", "filename": "sport_articles_c2kgkqvl0v7o_1747812439.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c2kgkqvl0v7o_1747812439.html", "title": "BBC Sport Online Voting: Privacy Notice", "title_page": "BBC Sport Online Voting: Privacy Notice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Your trust is very important to us. This means the BBC is committed to protecting the privacy and security of your personal data. It is important that you read this notice so that you are aware of how and why we are using such personal data. This privacy notice describes how we collect and use personal data about you during and after your relationship with us, in accordance with data protection law. This privacy notice applies to any voting, polls, or quizzes associated with BBC Sport.\nThe BBC uses your personal data to tally the votes and to ensure we meet regulatory compliance requirements when running our votes.\nAs part of our ongoing efforts to improve user experience, we are exploring ways to improve user interaction with quizzes, polls and voting. We will look at whether requiring users to sign in before participating leads to more completed responses. The data gathered during this process will be used strictly for analysis and improving our services. This will not impact your ability to access or use the BBC platform.\nFor online voting via your BBC account, The BBC will collect and process the following personal data about you:\nBBC Account identification\nGeographic location\nIP Address\nYour vote choice\nFor other online voting, The BBC will collect and process the following personal data about you:\nGeographic location\nIP Address\nYour vote choice\nThe BBC is the \"data controller\" of your personal data. This means that the BBC decides what your personal data is used for, and the ways in which it is processed. For the avoidance of doubt, your personal data will be collected and processed solely for the purposes set out in this privacy notice. As the data controller, the BBC has the responsibility to comply, and to demonstrate compliance with, data protection law.\nThe lawful basis on which the BBC processes the personal data for the purposes of your vote choice activities is the performance of its public task. The BBC's role is to act in the public interest and to serve all audiences with content which informs, educates and entertains, and to reflect the United Kingdom and its cultures and values to the world.\nThe lawful basis on which the BBC processes the personal data for regulatory compliance purposes is legal obligation.\nThe BBC works with our approved third-party providers who help us to provide some of our services. These partners only use your personal data on behalf of the BBC and not independently of the BBC. We currently use a third-party data provider to facilitate the online voting system.\nWe may also share personal data with a third party where required or permitted by law.", "url": "https://www.bbc.com/sport/articles/c2kgkqvl0v7o"}