{"authors": ["Jonathan Sutherland", "www.facebook.com"], "date_download": "2025-05-21 07:13:13", "date_modify": "2025-05-21 07:13:13", "date_publish": "2025-01-31 08:02:18", "description": "David Martindale says he owes a \"debt of gratitude to Livingston\" and will never apply for another managerial job while he remains in charge.", "filename": "sport_football_articles_cdxnerxr22xo_1747811593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9adb/live/16749740-df1d-11ef-bddc-73056f4f0cdb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxnerxr22xo_1747811593.html", "title": "Livingston's David Martindale rules out applying for Motherwell job", "title_page": "Livingston's David Martindale rules out applying for Motherwell job - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Martindale says he will never apply for another managerial job while he is in charge of Livingston.\nThe 50-year-old is the third-longest serving boss in the Scottish Professional Football League and has been with the West Lothian club for more than a decade in a variety of roles.\nLivingston visit Championship leaders Falkirk on Friday, with both Martindale and home head coach John McGlynn linked with the vacancy at Motherwell.\n\"I genuinely don't read anything about it,\" was Martindale's response to the speculation.\n\"I will never apply for a job while I am Livingston manager. Never ever going to take a job unless the people at Livingston tell me someone has been on the 'phone and we would like you to speak to them or your time is up.\n\"I owe a debt of gratitude to Livingston. I am just delighted the club has stuck by me to try and get them back into the Premiership.\"\nDespite his long service, Martindale admits there may come a time when he does move on.\n\"I am probably loyal to a fault,\" he added. \"That is the way I am wired, that is who I am. I am going to be very, very loyal to Livingston as long as Livingston want me to be loyal to them.\n\"I think it is pretty open the club are looking for investment. So potentially the club is going to be under some kind of new ownership structure, maybe come the summer. Maybe I am not going to be part of that.\n\"If the club can bring in investment and the correct people, I would genuinely shake their hands and thank them very much if I wasn't going to be part of that fabric.\"\nMcGlynn's Falkirk are riding high at the top of the table, four points clear of Livingston with a game in hand.\nThe 63-year-old was voted PFA Scotland manager of the year after an unbeaten campaign won promotion to the second tier and that good form has continued this season.\n\"In some ways it is flattering,\" he said of the Fir Park links.\n\"When a job like this comes up, the media drive it. It goes hand-in-hand with how well the team is doing. I think people have recognised the style of play over the past 18 months.\n\"But obviously I am enjoying my job here right now, contracted here right now and I'm very much focused on the game.\"\nThis is the first of three home matches in a row for Falkirk against fellow promotion hopefuls. After Livingston come Partick Thistle and Ayr United.\nMcGlynn is targeting maximum points from those games to turbo charge the push for the top flight.\n\"If we can do that, even I would fancy us,\" he said. \"It is a big ask because all of these teams are very really good, but it has to be the target.\n\"If we can do that, we will take a bit of catching, even though we are going to have to go away from home to these teams in the last quarter of the season.\n\"Getting that cushion would break the back and would really cement that situation and I think the boys would take so much confidence and we would really dig in to make sure we went all the way.\"", "url": "https://www.bbc.com/sport/football/articles/cdxnerxr22xo"}