{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:38", "date_modify": "2025-05-21 08:00:38", "date_publish": "2025-01-13 09:58:06", "description": "IOC chief Thomas Bach says swimmer Gary Hall Jr will get new Olympic medals after they were destroyed in the LA wildfires.", "filename": "sport_articles_cd0jg5z2992o_1747814438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58a7/live/da26b090-d18c-11ef-8075-4d88325174ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd0jg5z2992o_1747814438.html", "title": "Gary Hall Jr to receive new Olympic medals to replace his lost in LA fires", "title_page": "Gary Hall Jr to receive new Olympic medals to replace his lost in LA fires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former United States Olympic swimmer Gary Hall Jr will receive a new set of medals after his were destroyed in the Los Angeles wildfires, International Olympic Committee president Thomas Bach has confirmed.\nThree-time Olympian Hall had to evacuate from his home in Pacific Palisades last week as fire swept through the neighbourhood.\nHe said he fled taking only his dog, the insulin he uses to treat his diabetes, a painting of his grandfather, and a religious artifact.\nThe 50-year-old was unable to return to the house to get the five gold, three silver and two bronze medals he won at Olympic Games from 1996-2004.\n\"I was getting pelted by embers on that first run,\" Hall told the Los Angeles Times. \"So I grabbed my dog and some dog food, and that was it.\n\"Could I have stayed 30 seconds longer and maybe got the medals? I wasn't willing to take that risk.\"\nBach said in a post on X that Hall will be given replica medals.\n\"We are in full solidarity with the citizens of Los Angeles and full of admiration for the tireless work of the firefighters and the security forces,\" he said.\n\"Currently the full focus must be on the fight against the fires and the protection of the people and property.\n\"We have also learned that a great Olympian, Gary Hall Jr has lost his medals in the fire. The IOC will provide him with replicas.\"", "url": "https://www.bbc.com/sport/articles/cd0jg5z2992o"}