{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:48:04", "date_modify": "2025-04-26 03:48:04", "date_publish": "2025-03-05 15:17:27", "description": "'Difference maker' Eilidh Adams fuelling Hibs title bid", "filename": "sport_articles_c757rd05v7zo_1745639284.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f382/live/79813ab0-f9d4-11ef-adf5-bddd64abc471.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c757rd05v7zo_1745639284.html", "title": "'Difference maker' Eilidh Adams fuelling Hibs title bid", "title_page": "'Difference maker' Eilidh Adams fuelling Hibs title bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"wonderful season\" from Eilidh Adams is fuelling Hibernian's surprise SWPL title challenge.\nThe 20-year-old striker continued her fine form by netting the only goal of the game to down champions Celtic on Sunday and leave Hibs neck and neck with Glasgow City at the top of the table.\nIt took Adams' goal haul to 21 in 22 league appearances this term and completed a memorable couple of weeks in which she made her Scotland debut and then first international start in the Nations League double-header with Austria and Netherlands.\nAmong those impressed by the young forward's exploits is former Scotland midfielder Leanne Crichton, the current Glasgow City assistant.\n\"She's having a wonderful season, she's coming off the back of her national team debut as well, certainly contributing,\" said Crichton on the BBC's Behind the Goals podcast.\n\"This season is up there with the best she's ever had, certainly individually and collectively as a team, and things just keep getting better and better.\n\"I think to be the difference maker in that type of fixture [against Celtic] for her as well, it'll do her the world of confidence. She's having a wonderful season, she's a top player and she'll only get better as well.\n\"Hats off to her, it's been a busy schedule and I'm sure it's been an awful lot for her to take in, but she seems to be taking it all in her stride, that's the type of person that she is.\"\nScotland captain Rachel Corsie praised the 20-year-old for being able to \"readjust\" quickly to club duties.\n\"Good on her, it can be tough coming back from international break and then having to quickly readjust to the schedule, a club, the environment,\" said Corsie.\n\"I always find that transition after the international games quite stressful mentally.\n\"There's a lot to adjust to that just adds to it, so credit to her for having a big week and then being able to just roll right back into club form.\"", "url": "https://www.bbc.co.uk/sport/articles/c757rd05v7zo"}