{"authors": ["Sandy Smith", "www.facebook.com"], "date_download": "2025-04-26 04:14:09", "date_modify": "2025-04-26 04:14:09", "date_publish": "2025-03-04 11:23:49", "description": "'Famous win has dialled back doomsday clock on Everitt's Edinburgh career for now'", "filename": "sport_articles_cvg172mk3k0o_1745640849.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d95c/live/beb81430-f87d-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvg172mk3k0o_1745640849.html", "title": "'Famous win has dialled back doomsday clock on Everitt's Edinburgh career for now'", "title_page": "'Famous win has dialled back doomsday clock on Everitt's Edinburgh career for now' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Edinburgh packed up their troubles in their old kit bags and turned everyone's heads as they defeated Munster in Cork for the first time since 2019.\nEdinburgh are consistently inconsistent and continued that trend by following up a pitiful display against Zebre with a first away win in the league since April. In the process they scored the most points and tries they ever have against Munster.\nThe team's first hat-trick since Darcy Graham against Bulls in September 2022 earned Matt Currie the man of the match award but it was a game where almost everyone turned up with the correct mindset and did a great job.\nI have to give a big shoutout to the front row especially, but the whole pack did a number on Munster's scrum, forcing them to concede around 10 penalties in that area.\nIncidentally, Boan Venter will become eligible to play for Scotland in February 2026. I'm of the firm opinion he is the best scrummaging loosehead in Scotland so I expect he and Pierre Schoeman will be our first and second choices in that position thereafter.\nIt was good to see Ben Vellacott get a start and it was clear his dynamism gave some time to Ross Thompson, who although wasn't perfect did have a strong game.\nA good try, strong off the tee, a great pass and a crossfield kick that led directly to tries were on Thompson's credit side. He did get charged down and was caught in possession by Munster's Alex Nankivell but it may well have been his best game so far for Edinburgh.\nThis result will have dialled back the doomsday clock on Sean Everitt's Edinburgh career, but it will take a quantum leap forward if he can't find a way to get his team to replicate this performance on an ongoing basis.\nIf he can then our run-in is decent and of the six teams we still have to face only Sharks are currently above us in the table. Not one of them have scored more tries or points than we have.\nThis was a famous win against statistically our most difficult opponent in the league, so it should be celebrated regardless of the eventual margin at the 80-minute mark. Take it, enjoy it and we can worry about Benetton in a couple of weeks.", "url": "https://www.bbc.co.uk/sport/articles/cvg172mk3k0o"}