{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-05-21 06:04:51", "date_modify": "2025-05-21 06:04:51", "date_publish": "2024-12-24 15:38:51", "description": "Newcastle United news: Opinion - fan's moment of the year", "filename": "sport_football_articles_c1kep14e7xlo_1747807491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1kep14e7xlo_1747807491.html", "title": "Newcastle United news: Opinion", "title_page": "Newcastle United news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I'd like to take a minute to indulge myself if you'll allow it. It is Christmas, after all.\nI have been ruminating on my Newcastle United moment of the year so far and I'm struggling to get past a moment from the last week. So I'm going to talk about it.\nI'll set the scene: the season has been weird. The table is tight, and our performances haven't been consistent enough or win-focused enough for us to be where we want to be. Last season we had a plethora of injuries, and this season we don't but somehow it still isn't working. Our marquee signing of 2023, Sandro Tonali, came back from his 10 month ban in August 2024 and we seemed unable to work out how he fits into the squad. We are all frustrated, and desperate for the team and management to make it all better.\nThen last week Brentford came to Newcastle to play us in the Carabao Cup Quarter Final. We win - but that's not my favourite moment.\nMy favourite moment was being directly in front of the goal as Sandro Tonali scored his second just before half time. We've been talking all season about it not clicking - well, for me, something clicked at that moment. I could feel it in my bones. The goal came from a corner - unusual for Newcastle United in the first place - and was so beautiful that I have re-watched it about six hundred times since the game. Tonali jumps, and manages to get enough power behind the ball from mid-air to whip it past several Brentford players and into the net. It seems like it defies physics.\nThe moment was compounded by the fact it was Tonali who did it; a man who has talked about wanting to show Newcastle fans his gratitude for the support we showed him last year. For me, it was just magnificent. I'm so excited to see what the next year will bring with such a creative, talented footballer in our team.", "url": "https://www.bbc.com/sport/football/articles/c1kep14e7xlo"}