{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:30:59", "date_modify": "2025-04-26 06:30:59", "date_publish": "2025-02-27 10:09:45", "description": "Matt Beard's second spell as Liverpool manager comes to an end as he is sacked with the Reds sitting seventh in the Women's Super League.", "filename": "sport_football_articles_c0rzz5rwrlno_1745649059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9b1/live/14fa8f50-f4f3-11ef-be5b-6577f7dded4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rzz5rwrlno_1745649059.html", "title": "Liverpool sack manager Matt Beard with Reds sitting seventh in WSL", "title_page": "Liverpool sack manager Matt Beard with Reds sitting seventh in WSL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool have sacked manager Matt Beard with the club sitting seventh in the Women's Super League, bringing his second spell in charge to an end.\nThe 47-year-old, who won two WSL titles with the Reds during his first spell, re-joined Liverpool in 2021 and guided them to promotion back to the top flight in his first season.\nLiverpool finished fourth last season and are currently mid-table, nine points above bottom side Crystal Palace.\n\"We have all experienced some fantastic moments with Matt as manager of LFC Women and we express our gratitude for his significant contribution,\" the club said.\n\"Our priority was to return this team to where it belongs and we collectively achieved that in 2022 by winning promotion to the WSL.\n\"We need to build on that momentum and although this has been a difficult decision, we believe it provides us with the best opportunity for future success on the pitch.\"\nAmber Whiteley will take interim charge of the team, with a search for a new manager already under way.\nBeard led Liverpool to consecutive WSL titles in 2013 and 2014 during his first spell as manager.\nHe left the club in 2016 to join National Women's Soccer League side Boston Breakers but spent just one season in America before returning to English football with West Ham.\nAfter two years with the Hammers and an interim spell in charge of Bristol City, Beard re-joined Liverpool in 2021.\nHe guided the club to promotion back to the WSL and helped the Reds to a seventh-placed finish on their return to the top flight.\nThe Reds improved on that the following season, breaking into the top four at the expense of Manchester United as they finished fourth.\nBut a 4-0 defeat by Manchester City on 16 February would prove to be Beard's last game in charge, with the side having lost seven of their 14 league fixtures this term.", "url": "https://www.bbc.co.uk/sport/football/articles/c0rzz5rwrlno"}