{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 14:08:50", "date_modify": "2025-05-20 14:08:50", "date_publish": "2023-06-30 18:45:07", "description": "England's style of cricket has won many admirers but their Ashes approach is hurting the people who love them the most, says Stephan Shemilt.", "filename": "sport_cricket_66073213_1747750130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17C5F/production/_130257379_stokes.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66073213_1747750130.html", "title": "Ashes 2023: Why England's Bazball style is starting to lose its shine", "title_page": "Ashes 2023: Why England's Bazball style is starting to lose its shine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hello darkness, my old friend.\nIt's times like these you wonder why you put yourself through it. Nothing twists the feelings like sport can. Unbridled joy, the depths of despair and everything in between. Only love can hurt like this.\nEngland toy with the emotions more than most. Think of what they have put you through in the past.\nTurning off the TV because you can't bear to watch any more. Crowding around the radio when nothing else matters. Staying up all night, getting up disgustingly early, constantly wondering \"what's the Test score\".\nThis? It's not anger. It might even go beyond disappointment. Sadness? Let's be honest, we're absolutely gutted.\nThey were on to something. We'd seen it work from Manchester to Mount Maunganui with Multan in between. From one win in 17 (at which point the overriding emotion was apathy) they had given us something to believe in.\nThere was hope, too. Hope of sticking it to the Aussies. \"They haven't done it against us yet,\" said everyone from Steve Smith to Glenn McGrath to Bluey the dog. Yeah? Well have that up your baggy green, Skippy.\nInstead, there is this, the very real danger that the most eagerly anticipated Ashes series in a generation is on the way to being done after only eight days of cricket thanks to one of the most daft, dumb and downright infuriating batting displays you could ever see, even by England's standards.\nFrom 188-1 on Thursday evening to 325 all out on Friday morning, falling for a crude Australian plan hook (literally), line and sinker. By the close on day three, Australia had grown their lead to 221 runs with eight wickets in hand. It's a good job England don't like draws, because they might not have that option.\nTwo days before the Lord's Test, a dim-witted journalist (yours truly) asked Joe Root about the way England play. It was put to Root that England's style isn't a choice, but actually the best way for this group of players to be successful.\n\"There's more to it than that,\" said Root.\n\"There are times we try to put pressure back on the opposition, but there are also times when we have been very good at absorbing that, soaking it up.\n\"That's a big part of what we're about, being smart enough to recognise passages of play where we have to suck it up a little bit.\n\"It's easy to get lost in all of the extravagant stuff, the amazing shots and partnerships, but there are other things that are vitally important to what we're about as a team.\"\nRoot is right, too. In England's run of 10 wins from 11 Tests there were the rampant run-fests of Trent Bridge, Edgbaston and Rawalpindi, but just as many times when they had to do the hard yards. Lord's against New Zealand, Old Trafford against South Africa, Karachi against Pakistan.\nAt Lord's this time, England lost their ability to read the room. With Nathan Lyon hobbling around the boundary, the pitch dormant and the Australia pacers shattered, the tourists had one last throw of the dice.\nFour top-order batters out flapping at the short ball, a final collapse of 6-46. Not soaking up pressure, but Lemmings marching off a cliff.\nWhen asked on the second evening if England could have been more pragmatic given the match situation and Lyon's injury, opener Ben Duckett said: \"I don't think that's the way we go about our cricket.\n\"If Australia saw us doing that, they would think they had won that battle.\"\nWhen it's put like that, it's a good job Australia don't think they have won the battle, as opposed to actually winning it.\nAt this point, it is worth lingering on what has made England successful under Ben Stokes and Brendon McCullum.\nThey have played some thrilling, ruthless and, at times, revolutionary cricket. They have always been ultra-positive, but have rarely tipped into recklessness.\nEngland have vowed to put entertainment at the heart of everything they do, which is a pretty good idea when the very future of Test cricket is under threat. Their style has won them plenty of friends and even nerve-shredding defeats by New Zealand in Wellington and Australia at Edgbaston have been exhilarating because of the way England played.\nBut the quest for entertainment is not the absolver of all sins. Was anyone who does not hail from Australia entertained by what they saw on Thursday evening and Friday morning?\nDaring strokeplay and ingenious tactics can be gripping entertainment, but so too can the nuance of a Test match like, for example, the knowledge of Lyon being injured, the pitch benign and the pace bowlers flagging.\nYou can skip to the end of a book to know the ending, but that is not nearly as satisfying as reading all the pages to get to that point.\nPerhaps the bigger area of debate is who the England team actually exists for. It is hugely positive for England to have created an environment where all the players feel comfortable, for them to play in a way they believe gets the best out of their talents. They should certainly never be concerned about what the media say.\nBut the England team is more than the 11 players in the dressing room. It is for all of us who buy a ticket, watch on TV and listen on the radio. When they fail, we hurt. The hope is that is understood when they try to mesh an aggressive method with a desire to entertain and a quest for victory.\nAll is not lost. England have been in worse situations than this before and won. In Stokes, they are led by English cricket's patron saint of lost causes and they should not throw the Bazball out with the bathwater. They just might need a cold shower.\nWe'll believe in England because believe is all we can do, willing to ride the emotional rollercoaster again and again and again.", "url": "https://www.bbc.com/sport/cricket/66073213"}