{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-20 11:47:57", "date_modify": "2025-05-20 11:47:57", "date_publish": "2023-08-07 11:09:47", "description": "Manchester United defender Raphael Varane says new injury time and dissent rules are \"damaging our game\" and players are \"not being heard\".", "filename": "sport_football_66426840_1747741677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C9C9/production/_130675615_gettyimages-1594153379.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66426840_1747741677.html", "title": "Raphael Varane: Manchester United defender criticises added time and dissent rule changes", "title_page": "Raphael Varane: Manchester United defender criticises added time and dissent rule changes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United defender Raphael Varane says new injury time and dissent rules are \"damaging our game\" and players are \"not being heard\".\nMatches will have more injury time this season to more accurately reflect stoppages in play, while players and managers have been warned they face tougher punishments for poor behaviour at games.\nOn Sunday the new added time rule was criticised by Manchester City boss Pep Guardiola.\nHe claimed the \"big brains\" did not consult people in the game after his side conceded in the 101st minute of the Community Shield, which they went on to lose on penalties to Arsenal.\nAlso in that match, Arsenal's Thomas Partey and City's Julian Alvarez were both booked for kicking the ball away after the whistle was blown for a free-kick, while Gunners boss Mikel Arteta was shown a yellow card after asking for Rodri to be booked as new conduct rules from the Football Association kicked in.\n\"We had a meeting last week with the FA. They recommended from the referees new decisions and rules,\" former France international Varane, 30, wrote in a post on social media on Monday., external\n\"From the managers and players, we have shared our concerns for many years now that there are too many games, the schedule is overcrowded, and it's at a dangerous level for players' physical and mental well-being.\n\"Despite our previous feedback, they have now recommended for next season: longer games, more intensity, and less emotions to be shown by players. We just want to be in good condition on the pitch to give 100% to our club and fans. Why are our opinions not being heard?\"\nWorld Cup winner Varane, who retired from international football earlier this year, added: \"As a player I feel very privileged to do the job I love every day but I feel these changes are damaging our game. We want to be at our maximum level, the best we can be and put on amazing performances for fans to celebrate every week.\n\"I believe it is important that we, players and managers, highlight these important issues as we want to protect the game we love and give the fans our best.\"\nMeetings took place with both City and United last week to discuss the implementation of these new rules.\nThe Professional Footballers' Association said its chief executive Maheta Molango had met with a \"significant number\" of senior players and managers in the past few weeks, including Varane.\n\"There are concerns about how the new additional time rules will play out over a long season of league and cup games, as opposed to short tournaments,\" a PFA spokesperson said.\n\"Across what is now essentially a year-long football season, players are already thinking of these additional minutes in terms of extra games being played. It also comes at a time when players are pushing back against what is, increasingly, a completely unsustainable football calendar.\"\nTalking to BBC Sport about fixture congestion last month, Fifa vice-president and Concacaf president Victor Montagliani said: \"The pressure on the players is really only for the 1% [at the top of the game]. The rest of the footballers in the world don't play enough football. I can say that not only in my Confederation but even in Europe, for the majority of players, unless you are playing for a top, top club, when you are maybe not playing to the level others are playing at.\"", "url": "https://www.bbc.com/sport/football/66426840"}