{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:10", "date_modify": "2025-05-21 06:17:10", "date_publish": "2025-03-31 08:45:12", "description": "BBC Sport NI takes a look at the state of play in the bottom six of the Irish Premiership ahead of the beginning of the post-regular season split.", "filename": "sport_articles_c1lm50pdgy4o_1747808230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/464d/live/271b23f0-0e09-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1lm50pdgy4o_1747808230.html", "title": "What's at stake in the bottom half of the split?", "title_page": "Irish Premiership: What's at stake in the bottom half of the split? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The post-regular season split in the Irish Premiership begins on Tuesday and there is still plenty to play for with five games to go.\nIn the bottom half of the table it seems a case of if, not when, Loughgall's relegation to the Championship will be confirmed.\nThe Villagers, who will play their first match under new manager Darren Murphy on Tuesday against Ballymena United, are nine points behind Carrick Rangers, and have a worse goal difference.\nShould Loughgall lose to Ballymena, and Carrick defeat Cliftonville, then Loughgall's relegation would be all but confirmed.\nStephen Baxter's Carrick are in no man's land in 11th, and will likely face a relegation/promotion play-off against a Championship side.\nIrish Cup semi-finalists Bangor are currently eight points clear at the top of the second tier and look set for automatic promotion, while there are a host of teams behind - including H&W Welders, Limavady United and Annagh United - who could take on Carrick for the final place in next season's Premiership.\nGlenavon are also isolated in 10th position, but above that there is a race for the European play-off spot.\nCliftonville currently hold that advantage in seventh, and are level on points with Portadown, while Ballymena United are just three points behind.\nThe team that finishes in seventh position will qualify for a European play-off, but Cliftonville can also qualify for Europe by winning the Irish Cup.\nIn the event that Jim Magilton's Reds win the Irish Cup and finish seventh, the European play-off will consist of teams in the top half.\nHowever, if Cliftonville finish outside the top seven and beat Dungannon Swifts in the Windsor Park final, then it is likely that seventh will face sixth in a play-off quarter-final before third through fifth enter at the semi-final stage.", "url": "https://www.bbc.com/sport/articles/c1lm50pdgy4o"}