{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:36", "date_modify": "2025-05-21 05:35:36", "date_publish": "2025-04-02 14:35:41", "description": "Tottenham manager Ange Postecolgou hopes Mauricio Pochettino returns to the club one day and does not feel \"disrespected\" by his recent comments.", "filename": "sport_football_articles_ckgr78l0lz8o_1747805736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aaf6/live/f2ef5cc0-0fd1-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgr78l0lz8o_1747805736.html", "title": "Ange Postecoglou: Tottenham manager hopes Mauricio Pochettino returns to the club in the future", "title_page": "Ange Postecoglou: Tottenham manager hopes Mauricio Pochettino returns to the club in the future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham manager Ange Postecolgou hopes Mauricio Pochettino returns to the club one day and said he did not \"feel disrespected\" by recent comments from the Argentine.\nPochettino, who managed Tottenham from 2014 to 2019, said last month that he wants to reunite with Spurs in the future.\nHe has had spells with Paris St-Germain and Chelsea since leaving north London and was appointed head coach of the United States in September 2024.\nPostecoglou became Spurs boss in June 2023, making him the club's fourth full-time appointment since Pochettino departed, after Jose Mourinho, Nuno Espirito Santo and Antonio Conte.\n\"If he wants to come back one day then I hope it happens for him,\" Postecoglou said when asked about Pochettino's comments.\n\"We all have dreams and aspirations. You're suggesting that he's trying to put pressure on me?\"\nPostecoglou was asked if the timing of Pochettino's comments was disrespectful as the Australian's future at Spurs remains uncertain, with the club sitting 14th in the Premier League.\n\"I don't feel disrespected,\" Postecoglou said. \"If you asked Mauricio that question directly, I think you'd get a pretty clear answer about what his intent was.\"\nPochettino remains a hero among some of the Tottenham fanbase after leading them to a second-place finish in the 2016-17 Premier League season, the 2015 EFL Cup final and the 2019 Champions League final.\nHe has overseen eight matches with the United States but is already under pressure after losing three times, including successive defeats against Panama and Canada last month.\nThe 53-year-old was drafted in by the United States Soccer Federation to build momentum ahead of the 2026 World Cup, which they will co-host with Canada and Mexico.\nPostecoglou is under contract at Tottenham until 2027, but they are in danger of their lowest finish in the Premier League since 2003–04, when they finished 14th, and may yet end up even lower.\nThey make the short journey to face Chelsea at Stamford Bridge on Thursday.\nShould Tottenham soon part ways with Postecoglou, they would be required to pay \"one of the biggest financial compensation fees in football history\" if they wanted to prise Pochettino away from his US job, according to a well-placed source.\nPochettino signed a two-year contract in September, with multiple reports stating he earns £4.6m a year.", "url": "https://www.bbc.com/sport/football/articles/ckgr78l0lz8o"}