{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-21 06:23:51", "date_modify": "2025-05-21 06:23:51", "date_publish": "2025-01-22 23:12:14", "description": "This year's Six Nations will use 20-minute red cards for the first time.", "filename": "sport_rugby-union_articles_c17erz1n5j1o_1747808631.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e483/live/782f3360-d913-11ef-9428-b3549db3d6c8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c17erz1n5j1o_1747808631.html", "title": "Six Nations to use 20-minute red cards for first time", "title_page": "Six Nations to use 20-minute red cards for first time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This year's Six Nations will use 20-minute red cards for the first time.\nThe trial was in place for the Autumn Nations Cup in November and has been extended to this year's men's, women's and Under-20s Championships.\nLawmakers say the 20-minute red card is designed to \"punish the player and not the team\", with sides able to replace a dismissed player after 20 minutes.\nThe men's Six Nations starts on Friday, 31 January with France hosting Wales in Paris.\nWhile referees are still able to award a full and permanent red card for \"deliberate and dangerous acts of foul play\", the 20-minute red card constitutes a major change to rugby union's disciplinary process.\nA crackdown on head contact has been in place since January 2017, with a number of the sport's biggest recent matches affected by red cards.\nThe losing side in the past two Rugby World Cup finals - England's women against New Zealand in 2022 and the All Blacks against South Africa in the 2023 men's showpiece - played the majority of the match with 14 players, as did Bath when beaten by Northampton in last year's Premiership final.\n\"Across the game, everyone is working together to ensure we are exploring new and innovative ways to make the game as safe as possible, alongside ambitions to enhance the spectacle for fans, and the experience for players,\" said Six Nations chief of rugby Julie Paterson.\nThere are two global law trials which will also come in during the 2025 Championship, with scrum-halves being given more protection at the base of rucks, mauls and scrums, while throws that aren't straight when the line-out is uncontested will not be penalised.\nReduction in the time allowed for conversions as well as quicker formation of scrums and line-outs - introduced in the autumn - will also continue into all three championships, as will referees broadcasting key decisions over the public address system for the benefit of fans in the stadium.", "url": "https://www.bbc.com/sport/rugby-union/articles/c17erz1n5j1o"}