{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:57:34", "date_modify": "2025-05-20 14:57:34", "date_publish": "2023-07-27 06:42:45", "description": "Fulham: Marco Silva on Aston Villa defeat", "filename": "sport_articles_cd1zrnvxln7o_1747753054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ace2/live/3d467c70-2c41-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1zrnvxln7o_1747753054.html", "title": "Fulham: Marco Silva on Aston Villa defeat", "title_page": "Fulham: Marco Silva on Aston Villa defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham boss Marco Silva says his team showed \"good things\" despite a 2-0 pre-season defeat by Aston Villa in Orlando on Wednesday night.\nNew £5.5m signing from Wolves Raul Jimenez was unveiled before the match, but his team-mates were 1-0 down at half-time before a youthful side conceded another without reply in the second period.\n\"I think we started the game well, controlling well the moments on the ball,\" Silva said after the match.\n\"We should have created more chances in those moments, but overall the first half was good.\n“In two moments we lost the focus and the timing to press, when they had the penalty. Straight away after the penalty they created a chance and they scored.\n\"Second half was different. When you have a team that can change seven, eight players and put fresh players [in] at the same level, same quality, of course it will have an impact on the game. That was clear.\n\"We wanted to manage the physical condition of our players, unfortunately we are really short in numbers and don’t have senior players on the bench.\n\"Just Willian came on second half, all the other players were our under-21s, and the level and the quality is completely different.\n\"For them, getting the experience at this level, everything is new. Even so, I think they showed personality, they showed character as well.\n\"Overall, the room to improve is big, but the players showed good things.\"", "url": "https://www.bbc.com/sport/articles/cd1zrnvxln7o"}