{"authors": ["Richard Petrie", "Stephen Watson", "www.facebook.com"], "date_download": "2025-05-21 07:30:15", "date_modify": "2025-05-21 07:30:15", "date_publish": "2025-03-28 17:42:37", "description": "Six-time World Superbike champion Jonathan Rea tells BBC Sport NI the injuries he sustained in a crash at Phillip Island in February could have been worse.", "filename": "sport_motorsport_articles_c4gdgejnyx3o_1747812615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/558a/live/caad6990-0bf9-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_c4gdgejnyx3o_1747812615.html", "title": "Jonathan Rea on horror crash: 'I count my blessings it was just a foot'", "title_page": "Jonathan Rea on horror crash: 'I count my blessings it was just a foot' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonathan Rea feels fortunate the injuries he sustained in a high-speed crash during testing at the Phillip Island circuit in February were not more serious.\nThe six-time World Superbike champion was ruled out of the 2025 season opener in Australia and will also sit out this weekend's second round of the championship at Portimao in Portugal after sustaining multiple fractures to his left foot in the \"horrible\" crash.\nThe Northern Ireland rider subsequently had successful surgery in Belfast and is continuing his recovery at home.\n\"I have footage of the crash and it's horrible. What seemed like a small little crash, all of a sudden I felt like I hit a wall or something. My bike had picked up momentum and had started flipping in the air and it came down and hit my foot quite aggressively,\" said the 37-year-old in an interview with BBC Sport NI.\n\"If that had been an upper limb or a chest or worse, I count my blessings that it was just a foot but you're also very unlucky as well because it's fine margins.\"\nRea explained that he had considerable pain in the first couple of weeks after the crash and also found that period mentally challenging.\n\"It was really painful in the first couple of weeks, I have three plates, six screws. It was mentally tough too.\n\"I've got back to some sort of training regime, feeling good in myself but unfortunately the fracture to my foot was a lot more complicated than I thought.\n\"Displaced fractures, a ligament graft as well, and with it being a load-bearing part of your body it just needs time to heal, so I'm doing everything in my power to massage that healing process.\"\nRea says the continued healing process is now \"a waiting game\" which may also see him sit out the third round of the series at Assen in the Netherlands on 11-13 April.\n\"It's just going to take some time. I'll get my first review next week and that's when I'll understand whether the last five weeks have been productive or not.\n\"I've been working hard at home. Straight away I went out and purchased a hyperbaric chamber, I checked this morning and I've done 63 hours since the accident, generally a couple of hours a day.\n\"There are bone-healing ultrasound machines, acupuncture, physio, my diet has completely changed, rest, I've got an ice compression machine that I'm constantly in, just doing everything I can. You have to allow the bone to heal but this helps give it the best possible chance.\"\nDespite an obvious desire to return to the track as soon as possible, Rea says he will not be too hasty.\n\"I'm now back to a good level of training and I'm waiting for the bones to knit and hopefully we see some good pictures of that come next week.\n\"The doctor's advice is to give it time. Assen is approaching fast and it's a track I love but that's very close, only another two weeks away, but let's see.\n\"It would be a nice target to achieve but I have to listen to my body. Better to get back when I'm fully ready and try to get some good results.\"", "url": "https://www.bbc.com/sport/motorsport/articles/c4gdgejnyx3o"}