{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:54", "date_modify": "2025-05-21 04:18:54", "date_publish": "2025-01-15 00:00:00", "description": "Build-up to Wednesday's matches including Arsenal against Spurs. plus all the latest transfer news.", "filename": "sport_football_live_c3vpl2nvz95t_1747801134.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c3vpl2nvz95t_1747801134.html", "title": "Transfers and Premier League build-up LIVE: Ruben Amorim, Man Utd, Arsenal, Spurs", "title_page": "Transfers and Premier League build-up LIVE: Ruben Amorim, Man Utd, Arsenal, Spurs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat is all from this live page. Thank you for joining us and for all your tweets and texts.\nBefore you go I'd like to point you in the direction of some of today's breaking stories:\nNew Match of the Day presenters announced\nWhy is frustration growing at Arteta's Arsenal?\nMoyes will push Everton forward - Dyche\nChelsea recall Chalobah from Palace loan\nMake sure you stick with the BBC Sport website for live text commentary of tonight's four Premier League games - that live page will crank into action around 18:30 GMT.\nWe will also be back on Thursday morning for all the best reaction.\nSee you there!\nKick It Out 'concern' over Tamworth’s Chris Wreh\nKick It Out have released a statement supporting Tamworth forward Chris Wreh, who was racially abused online following the FA Cup third round defeat to Tottenham.\nWreh has since refused to play for the National League side as he felt the club had not supported him enough after the incident.\nThe statement reads:\n“We support Chris Wreh’s decision to take time out from playing following the vile racist abuse he received online after Tamworth’s FA Cup match against Tottenham on Sunday.\n\"It’s concerning that Chris does not feel he has had the right level of support when faced with discrimination. When this happens, it’s vital that it’s taken seriously and players have the backing of their club, and from authorities so that the case can be investigated.\n\"His decision to call out this abuse was a selfless act to highlight the level and regularity of racism that players face online. He should be commended and, most importantly, supported for taking this action rather than being told to keep it internal. It’s a collective responsibility for all of football and social media companies to end this abuse.”\nBarnes out for Magpies, Cunha back for Wolves\nNewcastle v Wolves ( Wed, 19:30 GMT)\nNewcastle winger Harvey Barnes is expected to be out for a month after sustaining a thigh injury against Bromley.\nThe Magpies will continue to assess Joe Willock, Sven Botman, Jacob Murphy and Alexander Isak, all of whom were absentees for Sunday's FA Cup tie.\nWolves welcome back Matheus Cunha following a two-game ban, though the Brazilian is still recovering from the issue which forced him off against Tottenham on 29 December and may not be able to play 90 minutes.\nToti Gomes remains sidelined but Nelson Semedo and Craig Dawson return to contention and new signing Emmanuel Agbadou could make his first Premier League appearance.\nChalobah absent for Eagles\nLeicester v Crystal Palace (19:30 GMT)\nCrystal Palace will be without defender Trevoh Chalobah who was recalled by parent club Chelsea today, for tonight's game against Leicester.\nEvery Palace player impacted by last week's flu outbreak has recovered, including Dean Henderson, Tyrick Mitchell, Maxence Lacroix and Jean-Philippe Mateta.\nWill Hughes has overcome a foot problem and is in contention to start.\nLeicester City defender Jannik Vestergaard is fit again and could take the place of Wout Faes.\nThe Foxes have no fresh injury concerns.\n'Man Utd are trying to find the right way'\nMan Utd v Southampton (Thu, 20:00 GMT)\nSouthampton\nSouthampton boss Ivan Juric on team news: \"Flynn Downes trained today. He is okay and we will see if he can play later. Everybody else is fit.\"\nOn Manchester United: \"They have changed the manager and the style of play, playing 3-4-3 formation like [Amorim played] at Sporting. They are trying to find the right way\".\nOn building on the FA Cup win over Swansea: \"It was a good game. We did some good things and there's things to improve. It will be different against Manchester United but we are preparing well. We will see.\"\n'The deal isn't quite done'\nIpswich v Brighton (Thur, 19:30 GMT)\nIpswich Town\nIpswich manager Kieran McKenna on potentially signing Jadene Philogene: \"If it's possible to bring him to the club we'll do so. What's really important is that Jaden has shown a desire to come here and join our football club. He's had a lot of attention from Premier League clubs but he wants to come here.\n\"It's not an easy deal for us to do. Aston Villa need to get the best deal they can, so does our club and the player.\n\"He's a player we'd like to get at the football club but the deal isn't quite done.\"\n'It's best for Dibling to stay'\nMan Utd v Southampton (Thur, 20:00 GMT)\nSouthampton\nSouthampton boss Ivan Juric on playing Tyler Dibling up front: \"I think he is better when he plays further forward because he does not need to do as much defensive work. He can score one v one, so for now it [playing upfront] is good for him.\"\nOn whether he thinks Dibling should stay at Southampton amid transfer links: \"Absolutely, because he needs to play and improve, so it is best for him to stay here of course.\"\nOn the future of Kyle Walker-Peters, who is out of contract this summer: \"I don't want him to leave. He is a very good player for me. I will be happy if he stays.\"\n'Tomorrow will tell us more about the team than the last two games'\nMan Utd v Southampton (Thur, 20:00 GMT)\nManchester United\nManchester United boss Ruben Amorim on whether he believes the team have turned a corner: \"I think tomorrow will tell us more about our team than the last two games.\"\nOn whether Toby Collyer has given him a selection headache after his performance against Arsenal: \"Toby is training really well - he has a lot of pace. He likes to learn and he is one more option for tomorrow.\"\n'We need time to build a different way of playing'\nMan Utd v Southampton (Thur, 20:00 GMT)\nManchester United\nManchester United boss Ruben Amorim on how different he is expecting the game to be against a team like Southampton where his side are expected to take the initiative: \"The most difficult thing to train in one team is the way you build with the ball and in the final third the way you create situations. That is what a big team should do very well and for that we also need time to train. We have had for a long time a lack of goals.\n\"We don't spend a lot of times during games in the last third with the ball - we did it against Nottingham Forest but we need to improve in that part of the game. I understand in this moment it is ok to play like that against Liverpool and Arsenal - against Arsenal we waited for the opportunity but in the future you cannot play like that and I know that but we need time to build a different way of playing. In the future we are going to focus a lot on that.\"\n'I don't feel pressure, I just want to win'\nMan Utd v Southampton (Thur, 20:00 GMT)\nManchester United\nManchester United boss Ruben Amorim on whether the pressure of the club is why players have underperformed in recent years: \"Of course you feel the pressure of the club but in this moment, I don't feel that pressure.\n\"In the last years we haven't won the league. In the past here, if you didn't win the league one year you would have to win it the next. I don't feel that pressure.\n\"We have to bring that pressure to us because outside the fans are amazing. I don't feel that pressure, I just want to win. To feel that pressure in the future we need to win - we need to win titles and we need to win games.\"\n'Southampton game will teach me more about players'\nMan Utd v Southampton (Thur, 20:00 GMT)\nSimon Stone\nBBC Sport's chief football news reporter\nManchester United head coach Ruben Amorim says he will learn more about his players during tomorrow’s Premier League match with Southampton than he did from recent encouraging performances against Liverpool and Arsenal.\nUnited followed up their draw at Anfield by knocking Arsenal out of the FA Cup despite having Diogo Dalot sent off during the second-half at Emirates Stadium.\nIt has generated a positive atmosphere around Old Trafford after a run of four straight defeats over the Christmas period.\nHowever, Amorim is aware his team cannot play on the counter-attack at home to a Southampton side that has won just once in the league this season and is eight points adrift of second-bottom Leicester.\n“This next game will teach me more about my players than the last two,” he said.\n“There is no expectation in the last two games. Against Arsenal we waited for the opportunity. In the future we can’t play like that and I know that. Fans will expect more tomorrow. We have to deliver.”\nAmorim refused to answer a question about the future of Marcus Rashford, who has not played for United since 12 December and has been linked with moves away from the club before the transfer window closes.\n'In terms of firepower, Moyes is armed with a water pistol'\nEverton v Aston Villa (19:30 GMT)\nDavid Moyes is back in charge of Everton and has a really tough job on his hands. In terms of firepower, he is armed with a water pistol.\nHe has taken over a team which did not score enough goals under Sean Dyche. That was their biggest issue, and it is hard to see how Moyes can solve it with the same players that Dyche had.\nWith Jordan Pickford, James Tarkowski and Jarrad Branthwaite, Everton have got players who can hold them together at the back, but Moyes' conundrum is to increase their attacking threat, and that is going to be a struggle, especially in these early days.\nI have got Aston Villa's Emi Martinez in my Fantasy team, and I see him as the best goalkeeper in the Premier League, but they always seem to concede silly goals.\nSo it is possible to get at Villa, I just don't see Everton managing it.\nSutton's prediction: 0-2\nAmorim looks forward\nMan Utd v Southampton (Thur, 20:00 GMT)\nSimon Stone\nBBC Sport's chief football news reporter\nRuben Amorim made the point ahead of Manchester United's FA Cup trip to Arsenal he didn't have a concern about his side in the really big games.\nAmorim's issue was how they played against lesser lights, which explained how they could win at Manchester City and draw at Liverpool, yes lose to Wolves and at home against Nottingham Forest and Newcastle.\nWell, after booking an FA Cup fourth round meeting with Leicester by winning at the Emirates Stadium, United now entertain Southampton and Brighton, matches that must be won if they are to start properly climbing the table.\nAmorim is due to speak to the media shortly. He may also get asked about Marcus Rashford, who last played over a month ago.", "url": "https://www.bbc.com/sport/football/live/c3vpl2nvz95t"}