{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:12:28", "date_modify": "2025-05-20 12:12:28", "date_publish": "2023-08-05 00:00:00", "description": "Watch live coverage and follow text and radio commentary as Birmingham Phoenix face Trent Rockets in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306804_1747743148.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306804_1747743148.html", "title": "The Hundred 2023 LIVE: Watch Birmingham Phoenix vs Trent Rockets in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Watch Birmingham Phoenix vs Trent Rockets in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWe'll be back tomorrow to try again.\nSouthern Brave v Northern Superchargers kicks off the women's competition and we'll be live here from 10:45 BST.\nThe men's teams then play at 14:30 BST, with Oval Invincibles and Welsh Fire women playing at the same time, followed by their male counterparts at 18:00 BST.\nWe'll have live text coverage and in-play clips here for you throughout the day - so let's hope for more cricket, and less rain.\nPost\nThe great British summer strikes again.\nThe ground staff worked so hard today across all four matches but there's very little they could have done.\nTo see how things currently stand in the men's Hundred, take a look at the table here.\nPost\nThroughout the 2023 Hundred, BBC Sport is running a feature series called England Next Gen, designed to look at players who may make the step up to international cricket in the next few years.\nNext up is Trent Rockets and Hampshire fast bowler John Turner, who could be in action tonight if the rain allows.\nDuring an impressive campaign in the T20 Blast for Hampshire Hawks, Turner bagged 21 wickets at an average of 11.76 and an economy of 6.67 - the best of anyone who had bowled more than 10 overs in the competition.\nThere have even been comparisons made to Australia great Glenn McGrath - read more about Turner here.\nPost\nIt looks like it may have stopped raining at Edgbaston but because of the amount of rain that has fallen, there is going to be a pretty big clear-up operation required.\nWe'll bring you news from the pitch inspection as soon as we have it.\nHow to follow\nWe will have updates and in-play clips for you here, and also a quick reminder that this game will be live for you to watch on BBC Two when or if play starts.\nIt will also be available on iPlayer and at the top of this page, and there is also radio commentary on BBC Sounds and Radio 5 Sports Extra.", "url": "https://www.bbc.com/sport/live/cricket/66306804"}