{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:55:19", "date_modify": "2025-05-20 13:55:19", "date_publish": "2023-07-31 11:51:55", "description": "Your Newcastle views on Premier League Summer Series", "filename": "sport_articles_cqq449xz5z1o_1747749319.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea7f/live/313a7ca0-2f80-11ee-999b-b74dedc428d3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cqq449xz5z1o_1747749319.html", "title": "Your Newcastle views on Premier League Summer Series", "title_page": "Your Newcastle views on Premier League Summer Series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two draws and a victory featured in Newcastle United's Premier League Summer Series.\nEddie Howe says the squad is returning to Newcastle \"more united\" after a positive trip to the US.\nWe asked what you made of the tour and who has impressed you the most.\nHere are some of your thoughts:\nLeonard: I'm impressed by the youngsters, particularly Elliot Anderson and Lewis Miley. I also think we’ve bought fantastic players in Sandro Tonali and Harvey Barnes. I'm betting Tonali will thrive at Newcastle.\nDan: We need a proper left-back and a centre-back, in case of injury to Schar or Botman. Lascelles is a bench player at best and Dan Burn covers left and centre but struggles against top-tier opposition. Same back four all last season and we'll struggle with defensive depth in Champions League at present.\nJohn: I think we should go with what we’ve got now, and if so strengthen in January. Matt Targett hasn’t really had a chance yet to prove himself. With the young blood we have coming through we’re in a great position. This is all experimental for the new owners and we’re a lot further ahead than we thought we could ever be. Patience is the key.\nSimon: I'm not sure what to make of this pre-season tour. There were some positives with Anderson, Miley and Gordon, but I just can't help feel we haven't done enough in the transfer market to take on next season, we are very thin in several areas.", "url": "https://www.bbc.com/sport/articles/cqq449xz5z1o"}