{"authors": ["Dan George & Lewis Coombes", "www.facebook.com"], "date_download": "2025-05-21 05:49:40", "date_modify": "2025-05-21 05:49:40", "date_publish": "2025-01-31 16:15:34", "description": "Reading Football Club say the sale of striker Sam Smith will help support the \"essential short-term finances required to run the club\".", "filename": "sport_football_articles_c93qne617nko_1747806580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9bda/live/400ba450-dfee-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93qne617nko_1747806580.html", "title": "Sam Smith: Reading were not 'actively' looking to sell striker to Wrexham", "title_page": "Sam Smith: Reading were not 'actively' looking to sell striker to Wrexham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reading Football Club have said that the sale of striker Sam Smith will help support the \"essential short-term finances required to run the club\" as fans continue to wait for news of a takeover.\nThey also admitted that they were not actively seeking to sell the forward this winter window.\nSmith was sold to League One rivals Wrexham on Friday for an undisclosed fee, leaving after over a year at the SCL Stadium. BBC Sport understand that fee to be in the region of £2m.\n\"Since returning to Reading in the summer of 2023, Sam has been a regular figure in attack,\" Reading said., external\n\"Whilst the club was not actively seeking to sell Sam, the significant offer payable by Wrexham will help support the essential short-term finances required to run the club.\n\"We would like to thank Sam for his contributions and wish him the very best in this next chapter of his career.\"\nThe 26-year-old made 74 appearances during his time at the Royals, scoring 27 times, including 11 in 25 games this season.\nNoel Hunt's Royals are currently 10th in the League One table with 41 points having won just once in their last five matches.\nThey are next in league action on Saturday when they welcome Bolton Wanderers to the SCL Stadium (15:00 GMT).", "url": "https://www.bbc.com/sport/football/articles/c93qne617nko"}