{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 04:35:02", "date_modify": "2025-04-26 04:35:02", "date_publish": "2025-02-28 12:34:13", "description": "England fast bowler Mark Wood will see a specialist next week amid fears he could require surgery on a left knee issue sustained at the Champions Trophy.", "filename": "sport_cricket_articles_cn899wnxy3wo_1745642102.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47c6/live/33f8b170-f5ca-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cn899wnxy3wo_1745642102.html", "title": "Mark Wood: England fast bowler to see specialist about knee injury amid surgery fears", "title_page": "Mark Wood: England fast bowler to see specialist about knee injury amid surgery fears - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England fast bowler Mark Wood will see a specialist next week amid fears he could require surgery on a left knee injury sustained at the Champions Trophy.\nWood, 35, was injured in his fourth over of England's defeat by Afghanistan on Wednesday and spent 10 overs off the field.\nHe returned to bowl a further four overs, returning figures of 0-50, but limped throughout.\nWood will have a scan when England return to the UK after their final Champions Trophy group match against South Africa in Karachi on Saturday.\nSignificant damage that requires an operation would be a serious blow to England and Wood, who has had a number of injury issues during his career.\nHe had an operation on the same knee in 2019 and only returned in January after five months out with bone stress in his elbow. He had surgery on the same elbow in 2022.\nWood is seen as crucial to England's plans over the next year.\nHe is a key component of England's Test side that faces India in the summer and the Ashes in Australia next winter, where his ability to bowl at extreme pace will be crucial.\nFast bowler Brydon Carse suffered a toe injury that ruled him out of the rest of the Champions Trophy - another in a group of quicks alongside Wood, Gus Atkinson and Jofra Archer who England hope will play a role in Australia.\nThe positive for England is that after Saturday's match against the Proteas they do not play again until a one-off Test against Zimbabwe on 22 May.\nWood is not scheduled to play in the upcoming Indian Premier League or Pakistan Super League.\nCaptain Ben Stokes is currently out after hamstring surgery but Durham coach Ryan Campbell told BBC Test Match Special on Thursday he expects the all-rounder to play in the County Championship prior to the Zimbabwe Test.\n\"The stuff he does to get himself ready to play is unbelievable,\" said Campbell.\n\"How are you going to prepare him for the Ashes? The only thing I can say as a given is that nobody will be more prepared than Ben Stokes.\"\n\"He will put himself through hell and back to get ready and be OK.\"\nDefeat against South Africa would be England's seventh in a row in one-day internationals and would make it their worst losing run in the format since 2006.\nThey have also not exited a global event without winning a match since the International Cricket Council Knockout event in 2000. They have never failed to win a match at an ICC event with a group stage.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cn899wnxy3wo"}