{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 05:00:30", "date_modify": "2025-05-21 05:00:30", "date_publish": "2025-04-04 11:11:33", "description": "England's fast-bowling stocks are further depleted after Olly Stone was ruled out of the Test summer by a right knee injury.", "filename": "sport_cricket_articles_cvg7rvj8080o_1747803630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/74e1/live/f9ef1d40-113d-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvg7rvj8080o_1747803630.html", "title": "Olly Stone: England pace bowler to miss Test cricket summer with knee injury", "title_page": "Olly Stone: England pace bowler to miss Test cricket summer with knee injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's fast-bowling stocks have been further depleted after Olly Stone was ruled out of the Test summer by a right knee injury.\nStone, who played two Tests last summer and was part of the winter tours to Pakistan and New Zealand, had scans earlier this week.\nSubsequent surgery has sidelined the 31-year-old for 14 weeks, meaning he will miss all of England's home Tests against Zimbabwe and India.\nStone joins Mark Wood in being ruled out of the home Test summer after Wood had surgery on a knee injury, sustained at the Champions Trophy.\nIt means neither will play any Test cricket before the Ashes tour of Australia this winter.\nNottinghamshire's Stone has endured a stop-start England career because of injuries. He returned to Test cricket in 2024 after a three-year absence to take his total number of caps to five.\nHe endured discomfort on Nottinghamshire's pre-season tour of Abu Dhabi in March and will now miss almost all of the 2025 season.\nEngland have made no secret of their preference for bowlers of high pace, particularly for the tour of Australia, where they have not won a single Test since 2011.\nAnd while the injury to Wood and the subsequent doubt over his availability to travel down under is the major concern, the loss of a back-up in Stone only adds to England's worries.\nBrydon Carse is missing the start of the season because of blisters and cuts on his left foot, while Chris Woakes is absent from Warwickshire's early games in the County Championship because of an ankle problem. Gus Atkinson and Matthew Potts have been England's other first-choice seamers in recent times.\nJosh Tongue is playing for Nottinghamshire this week after an 18-month battle with injuries and Jofra Archer continues his route back to full fitness at the Indian Premier League, though there are doubts over his long-term ability to play Test cricket again.\nEngland's injury list could enhance the case of Surrey's Dan Worrall, who played three one-day internationals for Australia but will qualify to play for England by the time of the Test against Zimbabwe in May.\nHampshire pair John Turner and Sonny Baker, along with Essex's Sam Cook and Surrey's Jamie Overton, could come into the equation.\nLeicestershire 20-year-old Josh Hull, who made his Test debut last summer, is missing the start of the County Championship season through injury.", "url": "https://www.bbc.com/sport/cricket/articles/cvg7rvj8080o"}