{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-20 14:17:48", "date_modify": "2025-05-20 14:17:48", "date_publish": "2023-07-29 16:40:48", "description": "Alistair White wins the Bowls Scotland Gents Singles title, seeing off a comeback from Alan Gray in Ayr.", "filename": "sport_bowls_66350810_1747750668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E215/production/_130577875_19938770-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_bowls_66350810_1747750668.html", "title": "Bowls Scotland National Championships: White wins Gents Singles in Ayr", "title_page": "Bowls Scotland National Championships: White wins Gents Singles in Ayr - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alistair White claimed the Bowls Scotland Gents Singles title with a dominant display against Alan Gray in Ayr.\nJedburgh's White led from the start on his way to a 21-15 victory.\nGray, from Eaglesham, found success in the Mixed Pairs earlier in the week alongside Christine Barradell, but could not produce a repeat performance.\nIn the Ladies Singles, teenager Emma Mitchell beat Commonwealth Games medallist Caroline Brown 21-17 in a pulsating final.\nWhite started his final in devastating fashion, with a three and four to get going in style. The full house was unfortunate for Gray, who tickled the jack with his last bowl to bring in a further two of White's shots.\nGray, who enjoyed bringing the mat up the green in his semi-final win, struggled to find find his feet, sending the jack straight into the ditch at the first time of asking and found himself trailing 13-1.\nAs the blistering sun was covered for moments by a passing cloud, there was a change in the air on the green, too. A loose end from White was capitalised on by Gray as he grabbed a full house to pull five back.\nBut, as the heat hit again, so did White, taking a 10-shot lead at 16-6.\nGray showed no signs of throwing in the towel, though. Risks had to be taken, and they were rewarded.\nWith a bowl each all-but-touching the jack, Gray showed no fear, forcing his final bowl into the mixer, springing the jack out a little and sitting for two. 18-9 on the board.\nGray continued to roll the dice, the mat hauled up to within a yard of the marker. A composed three made it 19-12.\nWhite lay Championship, before Gray coolly drew in number one with his last. The Jedburgh man clearly wanted the shot bowl clean out, but instead the connection was a little messy, with the jack spraying out into the open.\nOne down quickly turned into three down and it was 19-15 on the board.\nBut hopes of an unlikely comeback were then snuffed out. A repeat scenario of the previous end developed, but White held onto the pair that was needed to take him over the line.\nElsewhere, Hyndland were victorious in the Gents Pairs, as were Bainfield in the Ladies.\nIn the Triples, Abbeyview claimed the Gents title and Stonehouse the Ladies.\nAnd there will be a party at Windygates Durievale Bowling Club tonight, with both Gents and Ladies winning their respective Fours finals.", "url": "https://www.bbc.com/sport/bowls/66350810"}