{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-20 12:26:29", "date_modify": "2025-05-20 12:26:29", "date_publish": "2023-08-04 11:22:04", "description": "BBC Sport takes a look at the main things to come out of a thrilling group stage at the Women's World Cup in Australia and New Zealand.", "filename": "sport_football_66392913_1747743989.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4C26/production/_130649491_bbc-sport-index-imagery-3-split-images-gradient-9b8c2b97-7c6c-423d-99d4-cfb3a7df7b04.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66392913_1747743989.html", "title": "Women's World Cup: What we have learned from the group stages?", "title_page": "Women's World Cup: What we have learned from the group stages? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The group stages of the 2023 Fifa Women's World Cup have packed a punch.\nThere's been 48 games, 126 goals, and a whole host of of shocks and surprises across a thrilling 15 days of action.\nWith some of the favourites suffering early exits and underdogs proving themselves against the world's best, it's set to be an intriguing knockout phase.\nSo, what have been the main things we have learned from the opening stage of the tournament so far?\nOne of the biggest surprises of this tournament is that the teams tipped to go all the way haven't lived up to expectations and none of them look likely to run away with the tournament.\nReigning champions the USA, the top ranked nation, look a shadow of a team that beat the Netherlands 2-0 in the 2019 final, and they have come under plenty of fire for underwhelming performances that saw them scrape through to the last 16 with a draw against debutants Portugal.\nSpain and France have also looked below par while two-time winners Germany, Olympic champions Canada and Brazil all suffered surprise early exits.\nThere's only three teams - Japan, England, Sweden - who have reached the knockout rounds with a 100% win record.\nEven Sarina Wiegman's Euro 2022 winners, despite cruising through their final group stage match against China, didn't look overly convincing with narrow 1-0 wins over Haiti and Denmark.\nIn fact, Japan are the only team that haven't looked vulnerable. The 2011 World Cup winners, along with Jamaica and Switzerland, are the only sides who haven't conceded a goal at the tournament, while their 4-0 victory against Spain - a result very few expected - showed their fluidity in attack.\nWhile Brazil's Marta and Canada's Christine Sinclair bowed out of their sixth and final World Cups without making their mark, the next generation have been soaking up the limelight.\nNone more so than England's number seven Lauren James, who has racked up six goal involvements - the most of any player - with three goals and three assists.\nAfter starting the Lionesses' opening game against Haiti from the bench, the 21-year-old Chelsea forward has quickly established herself as a definite in manager Wiegman's starting line-up.\nHaiti may have exited their debut World Cup without a point, but 19-year-old Melchie Dumornay showed exactly why eight-time Champions League winners Lyon fought for her signature as the midfielder spearheaded Haiti's attack and was the main threat in each of their group stage matches.\nMeanwhile, Linda Caicedo has been the standout player for Colombia, who find themselves in the last-16 after topping Group H. The 18-year-old Real Madrid forward had no problem in finding the back of the net, scoring Colombia's second against South Korea and firing home a wonder goal in the South American's extraordinary 2-1 victory over Germany.\nAnother young star who has found herself on the scoresheet more than once is 20-year-old Netherlands midfielder Esmee Brugts. She scored with two sensational long-range strikes in the 7-0 win over Vietnam, while Sophia Smith, who was one of the most hyped young names before the tournament, has shown why she is one to watch with two goals also coming against the Asian side.\nWhen the tournament was expanded to 32 teams for 2023 - up from 24 - there were worries that the lower-ranked teams wouldn't be able to compete and scorelines tilted heavily towards bigger teams would be commonplace.\nHowever, we've seen the number of goals per game decrease from 2.94 in 2019 to 2.63, while the number of defensive blocks that have been broken through has decreased by 28%.\n\"During the tournament, what we're seeing is an increase in compactness within the defensive shape,\" said Jill Ellis, the former US manager who led them to their last two World Cup titles.\n\"Some of the higher ranked nations are facing teams that are a lot more defensively organised. They're really clear on what their strengths are.\n\"Teams have a tactical plan now and they really focus in on what their strengths are, it's not so much about having possession of the ball as a strength.\"\nAfter Germany's surprise early exit, captain Alexandra Popp's quest for the Golden Boot is also over.\nPopp had scored four goals, the joint highest with Hinata Miyazawa, but the Japan forward leads on assists.\nThere are plenty of others hot on Miyazawa's tail with James, France's Kadidiatou Diani, Norway's Sophie Haug, Swedish defender Amanda Ilestedt of Sweden and the Netherlands' Jill Roord all on three goals.\nAnd, there are 14 players remaining in the competition who have netted twice and still have the Golden Boot in their sights.", "url": "https://www.bbc.com/sport/football/66392913"}