{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:36:44", "date_modify": "2025-04-26 04:36:44", "date_publish": "2025-02-28 11:43:03", "description": "Celtic and Rangers' managers welcome the forthcoming return of away supporters at Old Firm games.", "filename": "sport_football_articles_c05mm3npv7lo_1745642204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4158/live/fadf1410-f5c9-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c05mm3npv7lo_1745642204.html", "title": "Celtic v Rangers: Managers welcome return of away fans to Old Firm derbies from March", "title_page": "Celtic v Rangers: Managers welcome return of away fans to Old Firm derbies from March - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Celtic and Rangers managers have welcomed the forthcoming return of away supporters at Old Firm games.\nRangers fans will be at Celtic Park on 16 March, with Celtic supporters being given tickets for the sides' subsequent meeting at Ibrox later in the campaign.\nThere have been no visiting tickets allocations at the derbies since 2023, with the clubs unable to agree on ticketing arrangements, but they have now agreed to allocate \"4% of saleable capacity\" at each stadium to away fans.\nAsked if he would like a return to the much larger away supports he experienced when he was a Rangers player, new Ibrox head coach Barry Ferguson replied: \"At this moment in time, I'm just happy that the fans are back. In time, we'll wait and see, but at least it's a start.\n\"It'll be good that the fans will be at Celtic Park. I've always said it's something that the fixtures missed. In an ideal situation, it would be great if there was more.\n\"But the way it is, the way it's happened, the number of tickets we're getting, I'm just glad that away supporters are allowed back.\"\nCeltic's Brendan Rodgers commented: \"It's great for everyone. Great for the game, great for the spectacle of the game, and obviously ultimately for the supporters.\n\"It's a big part of the fixture. Having been involved in it with the supporters there, both home and away, and then obviously them being taken away, then it does make a difference.\n\"We just have to get supporters back in the stadiums again. That was the start point, and then hopefully it can get somewhere near to where it was before, because that always creates an amazing atmosphere.\n\"The club have dealt with it really well. Like I've said, I've always said before, this wasn't a Celtic thing. This was something that sadly was out of our control at the beginning of it all.\n\"But, thankfully now, both clubs come together and it's been [chief executive] Michael Nicholson and the people behind the scenes who have dealt with it.\"\nEarlier, Rangers had announced in a statement: \"Rangers supporters will be able to attend our match with Celtic on 16 March, with the two clubs agreeing for a reciprocal percentage of tickets to be allocated to away fans.\n\"Approximately 4% of saleable capacity at both stadiums will be given to the visiting club, with everyone at Rangers looking forward to having the backing of our supporters in the East End of Glasgow in just over a fortnight's time.\n\"The arrangement will then be repeated for the Old Firm derby at Ibrox following the split.\"\nCeltic said: \"We can confirm that, following the previous SPFL determination from last year and with necessary requirements being addressed, away supporters will be present at the next two Glasgow derby matches this season at Celtic Park and Ibrox.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c05mm3npv7lo"}