{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:39:55", "date_modify": "2025-05-21 07:39:55", "date_publish": "2025-03-28 11:45:26", "description": "Gloucester's match with local rivals Bristol on Saturday could be \"one of the best\" this season, says Bears director of rugby Pat Lam.", "filename": "sport_rugby-union_articles_cpdew5wqqg3o_1747813195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a98/live/65fee390-0b39-11f0-80cd-45d386f77565.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpdew5wqqg3o_1747813195.html", "title": "Gloucester v Bristol could be one of 'best' games as attack-minded sides meet", "title_page": "Gloucester v Bristol could be one of 'best' games as attack-minded sides meet - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester's match with local rivals Bristol on Saturday could be \"one of the best\" this season, says Bears director of rugby Pat Lam.\nTwo of the Premiership's most attacking sides sit first and third in the league table for most points scored this campaign.\nIn Premiership statistics provided by Oval Insights, six out of the top 10 players for most line breaks play for Bristol or the Cherry and Whites, as well as five out of the top 10 for offloads and four out of the top 10 for metres made.\n\"The game potentially could be one of the best of the season - you've got 4G [pitch], weather's looking good, two teams who want to play. It's certainly going to be uncomfortable for players out there and hopefully enjoyable for the fans,\" Lam told BBC Radio Bristol.\nSecond-placed Bristol have long been known for their attacking flair and scored four rapid tries for a bonus point in just 16 minutes in Saturday's 52-38 victory against Exeter - which featured the highest-scoring first half in Premiership history.\nBut West Country neighbours Gloucester, who sit fifth, have revolutionised their game to a similarly more expansive style this season.\n\"With Bristol we know what we're getting - it's probably a supercharged version of the way we attack,\" Gloucester director of rugby George Skivington told BBC Radio Gloucestershire.\n\"We know it's going to be fast, we know it's going to be a lot of actual minutes of running round.\n\"I think our attack is closer to Bristol and they do a lot of good stuff at set-pieces as well. I don't think our identity is a million miles away.\n\"They are very wide-to-wide and they have some great one-off moments and Pat's very sharp with the areas he targets in games.\"\nGloucester finished ninth last season and were the second-lowest scorers in the league, ahead of only Newcastle.\nHowever, the signings of Wales scrum-half Tomos Williams and fly-half Gareth Anscombe last summer have helped revolutionise their backline.\nWhen the two sides met in September's reverse fixture in round two at Ashton Gate, Gloucester edged an 85-point thriller 44-41.\nLam said they were \"shocked\" by the Cherry and Whites that day.\n\"It's fair to say they shocked us in round two - we didn't expect they'd come out playing that way, and having Tomos Williams and Gareth Anscombe and Santi Carreras they certainly played to their strengths,\" Lam said.", "url": "https://www.bbc.com/sport/rugby-union/articles/cpdew5wqqg3o"}