{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 07:24:19", "date_modify": "2025-05-21 07:24:19", "date_publish": "2025-05-19 19:22:16", "description": "Northern Ireland manager Tanya Oxtoby says she is \"really excited\" by the inclusion of 16-year-old goalkeeper Abbie Smith in her squad for the Nations League games against Poland and Bosnia-Herzegovina.", "filename": "sport_football_articles_cy90vyx9409o_1747812259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ce9/live/07ef6c70-34e2-11f0-ac8f-578ab9a74773.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy90vyx9409o_1747812259.html", "title": "Women's Nations League: NI boss Tanya Oxtoby says there is 'no doubting' the talent of teenage goalkeeper Abbie Smith", "title_page": "Women's Nations League: NI boss Tanya Oxtoby says there is 'no doubting' the talent of teenage goalkeeper Abbie Smith - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland manager Tanya Oxtoby says she is \"really excited\" by the inclusion of 16-year-old goalkeeper Abbie Smith in her squad for the forthcoming Nations League games against Poland and Bosnia-Herzegovina.\nSmith has been named in the senior squad for the first time after joining Manchester City on a two-year scholarship from Crusaders Strikers in March.\nThe teenager was brought in to train with the squad last month but is now officially part of the panel after impressing the NI boss.\nNorthern Ireland sit second in Group B1, four points behind the table-topping Poles before the final pair of fixtures.\nThey will play the unbeaten group leaders at Seaview in Belfast on Friday, 30 May and then travel to Zenica to face third-placed Bosnia-Herzegovina on Tuesday, 3 June.\n\"Abbie came in and she was seamless in relation to training intensity, being in and around the group and the maturity that she showed,\" said Oxtoby.\n\"There's no doubting her talent so that was really impressive. The main thing when we're looking at the younger players coming in is are they ready for that senior environment?\"\nOxtoby has involved other young players in recent squads also, including Aimee Kerr, Abi Sweetlove, Keri Halliday and Kascie Weir.\n\"They're all playing really well and they add a lot. They add a lot of quality to our group,\" she added.\n\"We know their ability says they are, but from a cultural and an emotional point of view, are they ready? There are elements of that we need to appreciate are quite difficult for young players to come into.\n\"Our job is to support them in that and Abbie has really impressed in that area. We're really excited to see how she goes in a full camp.\"", "url": "https://www.bbc.com/sport/football/articles/cy90vyx9409o"}