{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 14:31:25", "date_modify": "2025-05-19 14:31:25", "date_publish": "2017-08-25 09:33:57", "description": "Ferrari's Kimi Raikkonen is fastest in first practice at the Belgian Grand Prix ahead of title rivals Lewis Hamilton and Sebastian Vettel.", "filename": "sport_formula1_41047610_1747665085.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2E6A/production/_97528811_kimi_raikkonen_afpgetty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_41047610_1747665085.html", "title": "Belgian Grand Prix: Kimi Raikkonen tops practice as Massa crashes", "title_page": "Belgian Grand Prix: Kimi Raikkonen tops practice as Massa crashes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ferrari's Kimi Raikkonen was fastest in first practice at the Belgian Grand Prix ahead of title rivals Lewis Hamilton and Sebastian Vettel.\nThe Finn pipped Hamilton by just 0.053 seconds, with the Mercedes driver 0.092secs ahead of Vettel, who leads the championship by 14 points.\nThe three were 0.7secs clear of the field, Red Bull's Max Verstappen and Daniel Ricciardo in fourth and fifth.\nValtteri Bottas was sixth and Williams' Felipe Massa crashed early on.\nThe headline lap times appeared to understate what looked like a significant advantage for Hamilton over the Ferraris.\nThe Briton set his fastest lap on the hardest tyre option available this weekend, the 'soft', while Raikkonen and Vettel used the softest, the so-called 'ultra-soft'.\nThere would be expected to be a lap-time difference of at least a second between the two types of tyre.\nOn top of that, Hamilton was 0.5secs slower through sector one on his fastest lap than his own best time through that section of track - the La Source hairpin and the daunting 200mph Eau Rouge swerves.\nThat suggests his potential fastest lap was at least one minute 45.0 seconds - Raikkonen's best was 1:45.502.\nIt was an incident-packed session, starting from an early crash for Massa, who lost control over the kerb at Malmedy, the right-hander after the Les Combes chicane at the top of the long straight.", "url": "https://www.bbc.com/sport/formula1/41047610"}