{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:29:33", "date_modify": "2025-05-20 14:29:33", "date_publish": "2023-07-28 16:27:06", "description": "MK Dons sign New Zealand centre-back Tommy Smith on a free transfer following his release by Colchester.", "filename": "sport_football_66340303_1747751373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/75EB/production/_130578103_gettyimages-1312652071.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66340303_1747751373.html", "title": "Tommy Smith: MK Dons sign NZ centre-back following Colchester United release", "title_page": "Tommy Smith: MK Dons sign NZ centre-back following Colchester United release - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "MK Dons have signed New Zealand international centre-back Tommy Smith on a free transfer.\nThe 33-year-old has agreed an undisclosed deal, having trained with the Dons for two weeks following his release by Colchester United.\nSmith made 95 appearances over three seasons with the U's.\n\"This is quite a young squad and I know the gaffer wants me to come in and use my experience as much as I can, on and off the pitch,\" he said.\n\"First and foremost, I want to contribute on the pitch and help the team get points on the board but naturally I'll try and be an experienced voice and help the players around me.\"\nSmith began his career at Ipswich Town, where he played almost 250 league games, before spending two years in the United States with Colorado Rapids.\nHe has 50 caps for New Zealand, playing for them at both the 2010 World Cup and 2012 London Olympics.\nHis arrival will help fill the gap created by Zak Jules' departure to Exeter City.\n\"Adding Tommy's abilities on the pitch, as well as his character off it, will be a big thing for us,\" head coach Graham Alexander told the club website., external\n\"Already, in the short space of time that he's been with us, we have seen him pass on the experience and knowledge he has from playing at a higher level and internationally.\"", "url": "https://www.bbc.com/sport/football/66340303"}