{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:36:13", "date_modify": "2025-04-26 07:36:13", "date_publish": "2025-02-27 14:43:14", "description": "Sunderland manager Regis Le Bris confirms they will be without midfielder Enzo Le Fee for \"three to four weeks\" due to a hamstring injury.", "filename": "sport_football_articles_cz9nn3yq829o_1745652973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ae5/live/08cda5d0-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz9nn3yq829o_1745652973.html", "title": "Sunderland: Enzo Le Fee out for up to four weeks with hamstring injury", "title_page": "Sunderland: Enzo Le Fee out for up to four weeks with hamstring injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sunderland will be without midfielder Enzo Le Fee for \"four to six weeks\" due to a hamstring injury, manager Regis Le Bris has confirmed.\nLe Fee and defender Dan Ballard sustained hamstring injuries in last week's defeat to Hull, with Ballard is expected to miss up to eight weeks.\nLe Fee has made an instant impact in a Black Cats jersey since arriving in January on loan from Roma, scoring one and assisting two in eight appearances but has also brought considerable quality to the Sunderland attack.\nCentre-back Ballard has made 12 Championship starts, including in the three games leading up to his injury.\nThe Black Cats have lost successive games against the Tigers and Leeds, and Le Bris expects his squad to rally at Sheffield Wednesday on Friday.\n\"We did well at Leeds, it wasn't our best against at Hull but we could have won,\" he told BBC Radio Newcastle.\n\"It is important to manage the squad and finish the season with momentum. We have many injuries and suspensions, but we have an opportunity.\n\"This stage of the season is tough for everyone, it is normal to have fatigue. Sometimes even if you are tired, you have to sustain the level.\"\nLe Bris has played down Sunderland's poor form, with the club sat fourth in the Championship, eight points off automatic promotion.\n\"The league is always tough. If you want to play at the top level there are challenges,\" he added. \"We have lost two games, it is not a crisis, we've lost only six all season.\n\"When it happens, it is new but we have to trust our game and find the good energy to finish the season.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cz9nn3yq829o"}