{"authors": ["Mark Jardine", "www.facebook.com"], "date_download": "2025-04-26 03:57:50", "date_modify": "2025-04-26 03:57:50", "date_publish": "2025-03-04 13:34:35", "description": "'A precarious sixth place standing has turned to ninth placed nervousness'", "filename": "sport_articles_cp8l2j22x0po_1745639870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9d8/live/1aa11380-f8f3-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cp8l2j22x0po_1745639870.html", "title": "'A precarious sixth place standing has turned to ninth placed nervousness'", "title_page": "'A precarious sixth place standing has turned to ninth placed nervousness' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Such is the degree of VAR-driven woe blasted in the direction of St Mirren fans this season, I would now accept as fact the suggestion we are the targets of some SFA-backed Punk'd revival. See also: Ant & Dec's Saturday Night Takeaway, Beadle's About, Noel's House Party or the shortlived Rio's World Cup Wind-Ups - depending on your personal vintage.\nLet's get the formalities out the way - Celtic scored five and Hearts scored three. Fair enough. There shall be no rewriting of history by this petulant keyboard warrior.\nToyosi Olusanya had a few golden chances he should have put away. Ryan Alebiosu conceded a clumsy penalty. Richard Taylor didn't have his best Wednesday night. Killian Phillips, on another night, might not have received the benefit of doubt when his Edinburgh red card was overturned.\nOn both nights, the Buddies showed plenty of what they're capable of before ultimately falling away in the last half hour or so.\nEntire seasons for clubs like St Mirren are decided on fine margins, whether that be routinely collecting single-goal victories or falling to the odd goal in tight contests.\nFor what feels like the 10th time this season, the weekend is over and most Saints fans are awaiting the tedious punchline of KMI panel consensus on another possibly game-changing error or omission.\nThe Buddies have made their way through a four-game stretch against Edinburgh and Glasgow opposition, with an unexpected win at Ibrox (insert your own quip here about Philippe Clement, Barry Ferguson etc) their sole reward. A precarious sixth-place standing has turned to ninth-placed nervousness, equally close to third as 12th.\nWhat lies ahead now is, to put it simply, season defining. Four consecutive games to take us to the split, all against opposition of similar position, station or frustration to ourselves.\nWrestling a near full complement of points from these fixtures could still see an unlikely third top-half finish be delivered. Any less, and handing those points to the teams around us in the quagmire, could lead to a relatively nervous run-in.\nIn this topsy-turvy campaign of unexpected drama and repeated hard knocks, preventing that nervy run-in would undoubtedly count as a job well done.", "url": "https://www.bbc.co.uk/sport/articles/cp8l2j22x0po"}