{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-05-21 06:46:32", "date_modify": "2025-05-21 06:46:32", "date_publish": "2025-03-30 15:35:13", "description": "VManchester City grind out a hard-fought Women's Super League win at Brighton.", "filename": "sport_football_articles_ce8g0z83x7vo_1747809992.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3086/live/6fd55af0-0d7a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8g0z83x7vo_1747809992.html", "title": "Brighton 1-2 Man City: City grind out hard-fought Women's Super League win", "title_page": "Brighton 1-2 Man City: City grind out hard-fought Women's Super League win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This is unlikely to go down as a game to remember for Manchester City, but they picked up three points nevertheless.\nBrighton were arguably the better side. They had more chances, played with better fluidity and defended well.\nCity's depleted squad often seemed shaky and found it difficult to get past Brighton as their aim of playing through their defence was stopped by the hosts' organisation and determined efforts to close down any gaps.\nThe hosts, however, did not make the most of their chances and that is all that matters.\nThey finally scored in injury time - but they did so after substitute Vivianne Miedema had already put City 2-0 ahead, meaning Charlize Rule's goal did little more than provide a late glimmer of hope.\nSeagulls manager Dario Vidosic will be able to take positives from the fact his side performed so well and that better end product would likely have given them a different result.\nFor interim City boss Nick Cushing, three points keep their slight hopes of finding a path to Champions League qualification alive. They are seven points behind Manchester United with four games left, but have a game against United still to play.\nCity will hoping their chances aren't over yet.", "url": "https://www.bbc.com/sport/football/articles/ce8g0z83x7vo"}