{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:53:48", "date_modify": "2025-05-20 13:53:48", "date_publish": "2023-07-24 16:19:49", "description": "All-rounder Cameron Green said Australia \"got out of jail\" after they clinched the Ashes following a rain-hit fourth Test.", "filename": "sport_cricket_66293704_1747749228.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/104B4/production/_130504766_gettyimages-1550762190.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66293704_1747749228.html", "title": "Cameron Green: Australia 'got out of jail' with Ashes-clinching drawn Test", "title_page": "Cameron Green: Australia 'got out of jail' with Ashes-clinching drawn Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia all-rounder Cameron Green acknowledged his side \"got out of jail\" after they clinched the Ashes following a rain-hit fourth Test.\nA day five washout at Old Trafford on Sunday ensured Australia retained the urn courtesy of a 2-1 lead going into the final Test at The Oval.\nEngland had been in a strong position to win the fourth Test before the weather scuppered their hopes.\n\"We definitely got out of jail. We didn't play our best game,\" Green said.\nGreen said it was a \"weird feeling\" to have secured the Ashes in an empty ground thanks to the rain.\n\"The rain gods were in our favour the last couple of days,\" he told cricket.com.au., external\n\"There's no point denying it. Whilst we were behind the game, and you never know what would have happened, cricket is a funny game, but England dominated this one.\n\"It's a weird feeling at the moment. When we look back we'll be proud of what we have done so far.\"\nGreen has scored 103 runs at 20.60 in six innings with a top score of 38 in three matches in this Ashes series. He has also taken five wickets at 47 having bowled 45.4 overs at an economy rate of 5.14.\nBut with the fellow all-rounder Mitch Marsh in fine form since his recall, and Australia considering spinner Todd Murphy for The Oval, Green could find his place under threat for the fifth Test.\nGreen added: \"There was obviously some tossing and turning between me or Todd for the fourth Test. There's always a benefit to having good competition for places. We'll have to wait and see what happens in the next game.\"", "url": "https://www.bbc.com/sport/cricket/66293704"}