{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:55:16", "date_modify": "2025-05-21 07:55:16", "date_publish": "2025-03-27 14:52:24", "description": "The Premier League says it will have two transfer windows this summer to allow Manchester City and Chelsea to sign players before the Club World Cup.", "filename": "sport_football_articles_c0egvyg7wllo_1747814116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ac0/live/058faa20-0b17-11f0-9b12-2d0d67b23402.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0egvyg7wllo_1747814116.html", "title": "Club World Cup: Premier League confirms split transfer window for summer of 2025", "title_page": "Club World Cup: Premier League confirms split transfer window for summer of 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Premier League has announced it will have two transfer windows this summer to allow Manchester City and Chelsea to sign players before the Club World Cup.\nThe window will open between Sunday, 1 June and Tuesday, 10 June, then close for five days before running again from Monday, 16 June until Monday, 1 September.\nThis summer features the first expanded Fifa Club World Cup, which involves 32 teams and adopts the format of the regular World Cup of the past few years.\nChelsea and Manchester City are the Premier League teams in the tournament which takes place in the United States from Sunday, 15 June.\nBut the Premier League can only have 12 weeks of a summer window - hence the five-day break in order to run it until 1 September.\nFifa has allowed new players to be registered for the Club World Cup from 1-10 June, and again from 27 June-3 July for the knockout stage.\nFirstly, to bring order to the global registration system, world governing body Fifa only permits the transfer window in any individual country to be open for 16 weeks in any calendar year.\nIn Europe, precedent dictates four of those weeks are for the winter window, leaving 12 in the summer. In 2024, the Premier League transfer window opened on 14 June and closed on 30 August.\nHowever, in October, Fifa approved an additional window from 1-10 June that would allow the 32 clubs competing in the Club World Cup to register new players before the tournament.\nIt also agreed to open a registration window mid-tournament, from 27 June and 3 July, to allow clubs to register additional players for the knockout stage.\nAs well as Manchester City and Chelsea, European heavyweights Real Madrid, Atletico Madrid, Inter Milan, Juventus, Paris St-Germain, Bayern Munich, Borussia Dortmund and Saudi Arabia's Al-Hilal are among others playing in the tournament.\nIn order to ensure Manchester City and Chelsea did not have an advantage over the other 18 top-flight clubs, the Premier League has adopted the same window.\nHowever, 12 weeks from 1 June is 24 August. The Premier League wanted to be aligned with the rest of Europe's big leagues around when the summer window closes. Those leagues preferred to close the window at the end of August, so that meant the window had to close and reopen.\nFirstly, the dates.\nThe Champions League final takes place in Munich on 31 May. After that, there are Nations League semi-finals and finals and World Cup qualifying double-headers. In Europe, those games take place 6-10 June.\nIt means players could be negotiating transfers in the build-up to important matches.\nOne potential impact concerns international players who may move to clubs competing in the Club World Cup.\nLet us take two examples - Trent Alexander-Arnold and Kevin de Bruyne. Both are internationals who might be called up by England and Belgium for their June matches.\nHowever, both are out of contract at Liverpool and Manchester City respectively on 30 June.\nAlexander-Arnold currently plays for a club not involved in the United States this summer, but looks likely to join Real Madrid who are.\nSo, do Real reach an agreement over a fee with Liverpool to trigger Alexander-Arnold's release early so he can play a full part in the competition? Or do they wait until 30 June and add him to their squad for the knockout stage?\nManchester City are involved in the Club World Cup. So, as it presently stands, De Bruyne could play in the group stage but would not be eligible for the knockout stage.\nIf De Bruyne does not want to commit for a further year, he could sign a short extension that covers the tournament and then leave. Or he could leave before the tournament and sign for a different club. If that club were also involved at the Club World Cup, De Bruyne would be in the same situation as Alexander-Arnold.\nFifa has also tweaked its registration rules to effectively mean clubs can sign players solely for the duration of the tournament. It is thought unlikely either Manchester City or Chelsea would be looking at that scenario.\nSemi-automated offside technology might be introduced to the Premier League in April.\nIt was trialled in the FA Cup fifth round - and will be tried again for the three quarter-final ties at Premier League grounds this weekend.\nThe plan was to introduce it for the Premier League in October or November, but issues with the system have delayed that.\nIf no problems arise from these FA Cup games, it will be rolled out in the Premier League next week.\nSemi-automated offsides are designed to make the judgement of tight calls easier for officials by rendering key parts of the process automatic.\nBespoke cameras have been installed at all 20 Premier League grounds.\nIn the last round of the FA Cup there was a record eight-minute VAR stoppage during Bournemouth's win against Wolves when officials were unable to rely on the new technology because of a congested penalty area.", "url": "https://www.bbc.com/sport/football/articles/c0egvyg7wllo"}