{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:43:50", "date_modify": "2025-05-21 07:43:50", "date_publish": "2025-03-28 09:52:10", "description": "Bristol City have to \"take confidence\" from their draw away at Sheffield United when they visit Burnley, says boss Liam Manning.", "filename": "sport_football_articles_c62zpzpx143o_1747813430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b457/live/9879a030-0bb1-11f0-8e25-91624fd3b00c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62zpzpx143o_1747813430.html", "title": "Burnley v Bristol City: Robins can 'take confidence' from Sheffield United draw", "title_page": "Burnley v Bristol City: Robins can 'take confidence' from Sheffield United draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City have to \"take confidence\" from their draw at Sheffield United when they visit Burnley on Saturday, says boss Liam Manning.\nThe Robins scored a 90th-minute equaliser to draw 1-1 with the second-placed Blades the week before the international break.\nThe Clarets, who are third, have the best defensive record in the Championship and are also the only team to have not lost at home this campaign, having only conceded five goals at Turf Moor.\n\"You look at their defensive record especially but even some of their attacking stuff, I think it's excellent,\" Manning told BBC Radio Bristol of Saturday's opposition.\n\"Everybody knows how difficult they are to play against. But we were saying that a few weeks ago against Sheffield United so we have to take confidence from that, belief from that and go there and 'do us'.\"\nBurnley won 1-0 in the reverse fixture in November and while Manning was full of praise for Clarets manager Scott Parker, he said his side should not be \"fearful\".\n\"[It will be a] tough game, one we should face head on and definitely not be fearful of, it's one that we should relish,\" he said.", "url": "https://www.bbc.com/sport/football/articles/c62zpzpx143o"}