{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:41", "date_modify": "2025-05-21 06:58:41", "date_publish": "2025-03-29 11:02:32", "description": "Brighton vs Nottingham Forest predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_cwynyp6d8xeo_1747810721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwynyp6d8xeo_1747810721.html", "title": "Brighton vs Nottingham Forest predictions: Chris Sutton on FA Cup tie", "title_page": "Brighton vs Nottingham Forest predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton will see this as the chance to get revenge for their 7-0 defeat at the City Ground at the start of February.\nI am sure some people felt the wheels had come off for Seagulls boss Fabian Hurzeler after that result, but instead his side have bounced back and gone on a great run of six wins and one draw.\nSometimes getting thrashed like that can have a positive effect on a team, and clear the air.\nI remember losing 7-1 at Blackburn Rovers in October 1992, when I was a centre-half for Norwich City, but we had a crate of beer on the coach home to put things right and we were still top of the Premier League table at Christmas. I did get moved up front after that, though.\nAs for Nottingham Forest, they are the only team left in the FA Cup where I could understand it if they rested players this weekend because of their league position.\nThey play Manchester United on Tuesday and the finish line is in sight for my boyhood team to finish third and secure Champions League football.\nThat is why it is disappointing to hear about Chris Wood getting injured while playing for New Zealand this week.\nHopefully it is not serious, but it is a blow for Forest if they are without their main number nine for any length of time.\nTheir gameplan will not change without Wood - they will sit deep and attack on the break. It is just a question on whether it is their A team who face Brighton or not, and my hunch is that Nuno Espirito Santo will make a few changes.\nSutton's prediction: 2-0", "url": "https://www.bbc.com/sport/football/articles/cwynyp6d8xeo"}