{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:53:17", "date_modify": "2025-05-21 07:53:17", "date_publish": "2025-05-20 11:19:26", "description": "Shelbourne manager Damien Duff says a viral photograph of him watching his side during a touchline ban is \"embarrassing\" and \"mortifying\" for the League of Ireland.", "filename": "sport_football_articles_cp922ng387go_1747813997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c87c/live/8f0023a0-3567-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp922ng387go_1747813997.html", "title": "Damien Duff: Shelbourne boss says viral photo of him on grassy bank 'embarrassing' for League of Ireland", "title_page": "Damien Duff: Shelbourne boss says viral photo of him on grassy bank 'embarrassing' for League of Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shelbourne manager Damien Duff says a viral photograph of him looking like \"the fool on the hill\" while watching his side during a touchline ban is \"embarrassing\" and \"mortifying\" for the League of Ireland.\nPhotographs of the former Chelsea and Republic of Ireland winger viewing Shelbourne's Dublin derby away to Bohemians on Friday from a grassy bank behind a stand at Dalymount Park attracted much attention on social media.\nDuff was serving a touchline suspension after picking up his fifth yellow card in his side's win over St Patrick's Athletic earlier this month.\n\"Probably the most difficult thing of the whole evening was for the league,\" Duff told Virgin Media before Monday's draw with Drogheda United.\n\"I thought it was an embarrassing, mortifying photo for the league when it's in such a good place.\"\nSpeaking to reporters after the Drogheda game, Duff - who led Shelbourne to the league title last season - said it was an \"awful reflection on the league\".\n\"We call it the greatest league in the world, I call it the greatest league in the world, but a picture has gone to a lot of countries around the world, some big people in the football world have texted me laughing,\" added the 46-year-old.\n\"I think for too long now people have laughed at Irish football and everything about us.\"", "url": "https://www.bbc.com/sport/football/articles/cp922ng387go"}