{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:42:22", "date_modify": "2025-05-20 14:42:22", "date_publish": "2023-07-28 08:31:18", "description": "Red Bull's Max Verstappen will have a five-place grid penalty for the Belgian Grand Prix as a result of using too many gearbox parts.", "filename": "sport_formula1_66334521_1747752142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EB19/production/_130558106_hi086502587.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66334521_1747752142.html", "title": "Red Bull's Max Verstappen will have five-place grid penalty for Belgium GP", "title_page": "Red Bull's Max Verstappen will have five-place grid penalty for Belgium GP - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Red Bull's Max Verstappen will have a five-place grid penalty for the Belgian Grand Prix as a result of using too many gearbox parts.\nThe punishment will apply for Sunday's grand prix and not Saturday's 'sprint'.\nThe penalty has not been officially confirmed, but BBC Sport has verified it with senior figures in Red Bull.\nSuch is the performance of Verstappen in the Red Bull that the penalty is unlikely to impact his chances of winning the race at Spa-Francorchamps.\nThe Dutchman, who is leading the championship by 110 points after winning nine of the 11 races so far in 2023, is on a run of seven consecutive grand prix victories, two short of the all-time record in a season set by Sebastian Vettel for Red Bull in 2013.\nAnd at last weekend's Hungarian Grand Prix, Red Bull won their 12th consecutive Formula 1 championship race, breaking a record held by McLaren since 1988.\nAlthough the penalty will mean Verstappen will start behind at least five other cars, he won last year's Belgian Grand Prix from 14th on the grid in arguably the most dominant performance since the start of F1's new regulations introduced in 2022.\nMcLaren's Lando Norris, who finished second to Verstappen in Hungary on Sunday, said on Thursday's media day before the penalty became apparent: \"Even if they started last in every race, they're going to come through [the field].\"\nTeams are limited to four each of a prescribed number of gearbox components in F1. Verstappen has taken his fifth of at least one of the components. It was not immediately apparent which part had caused the problem.", "url": "https://www.bbc.com/sport/formula1/66334521"}