{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:31", "date_modify": "2025-05-21 04:16:31", "date_publish": "2025-04-05 17:52:52", "description": "Marcus Harris' century on his Red Rose debut helps Lancashire take charge against Middlesex on day two at Lord's.", "filename": "sport_cricket_articles_c0kxv6g65leo_1747800991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/889a/live/a4881dc0-1246-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0kxv6g65leo_1747800991.html", "title": "County Championship: Marcus Harris puts Lancashire on top at Middlesex", "title_page": "County Championship: Marcus Harris puts Lancashire on top at Middlesex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marcus Harris' century on his Red Rose debut helped Lancashire take charge against Middlesex on day two at Lord's.\nThe Australian Test opener, batting at four, survived an early scare to share a stand of 120 for the fifth wicket with Luke Wells (38). It was Harris' 30th first-class ton and he became the sixth overseas player to make a hundred on his debut for the county, a trend started by his fellow Australian, the late Andrew Symonds in 2005.\nKeaton Jennings earlier weighed in 55 enabling the visitors to reach the close on 353-9\nThe Middlesex bowlers toiled hard, with little luck, Zafar Gohar returning 3-77 on debut and Blake Cullen 2-70, the latter's first County Championship wickets since he dismissed Mohammed Rizwan at Hove in May 2022, such have been the young seamer's injury woes.\nThe alliance between Harris and Wells turned the tide of a day where Middlesex had initially held sway.\nTheir frugal bowling in the morning session especially led to a pedestrian scoring rate of two an over by the visitors on a slow, unresponsive pitch.\nLancashire's inability to break the shackles brought reward for the home side, Jennings departing to a sharp catch at slip by Robson off Ryan Higgins, shortly after raising his 50 with the aid of eight fours.\nThe wicket came in a spell of six overs for one run from the Zimbabwean all-rounder and the pressure he exerted affected other batters too.\nJosh Bohannon was in skittish mood from the off, edging one just short of Robson at slip before he'd scored. He had got to 11 when he slashed at a slightly wider one from Higgins only for Leus du Plooy to grass the chance away to his right hand in the gully.\nEven so, there was further reward for the Seaxes shortly before lunch when Toby Roland-Jones found the edge of Michael Jones' bat and wicketkeeper Jack Davies took a low catch away to his right.\nOn the resumption, Bohannon briefly suggested he'd left his pre-lunch struggles behind him, driving Henry Brookes straight for four, but the introduction of Gohar proved his undoing.\nBohannon played back to one from the slow left-armer which went on with the arm and crashed into off stump.\nAnd when Matty Hurst injudiciously hooked a short one from Cullen down the throat of Nathan Fernandes at long leg the visitors were 169 for 4, still almost 100 in arrears.\nEven Harris wasn't exempt from such rushes of blood to the head, having charged Gohar on 11, inside edging the ball beyond both leg stump and wicket-keeper Davies. Had he not made the thinnest of contacts the stumping would have been a formality had he not been bowled in any event.\nHarris though resolved to make the most of his slice of fortune, knuckling down to take charge, driving with increasing authority before raising his 50 with his eighth boundary, a savage cut to the cover fence.", "url": "https://www.bbc.com/sport/cricket/articles/c0kxv6g65leo"}