{"authors": ["Raphael Jucobin", "www.facebook.com"], "date_download": "2025-04-26 03:44:10", "date_modify": "2025-04-26 03:44:10", "date_publish": "2025-03-05 07:37:09", "description": "Liverpool face a Paris St-Germain side in the Champions League who are hitting their best form of the post-Kylian Mbappe era.", "filename": "sport_football_articles_c1en06430z0o_1745639050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c994/live/6fb1f450-f909-11ef-bc87-ad84b3fde561.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1en06430z0o_1745639050.html", "title": "Paris St-Germain vs Liverpool: PSG's post-Mbappe era, no 'clans' & foreign stars' French buy-in", "title_page": "Paris St-Germain vs Liverpool: PSG's post-Mbappe era, no 'clans' & foreign stars' French buy-in - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rarely in the past decade and a half of Qatari ownership have Paris St-Germain entered the spring with this kind of confidence.\nOn Saturday evening, the runaway Ligue 1 leaders wasted little time in dismantling a Lille side who also had a midweek Champions League tie to look forward to, scoring four goals in what manager Luis Enrique would later call the team's \"best half of the season\".\nVictory against Les Dogues, who could only muster a consolation goal through Jonathan David 10 minutes from time, was more than simply a dress rehearsal before Liverpool's visit to the French capital on Wednesday for the first leg of their last-16 tie.\nLille, who have notably beaten both Real and Atletico Madrid in Europe this season, were swept aside as PSG continued their seemingly inevitable march towards completing an unbeaten campaign on home soil.\nThe all-conquering form of a rejuvenated PSG would have seemed unlikely at the start of the season.\nWhile the post-Kylian Mbappe era arguably started midway through last season, given that the France captain was mostly spared for high-profile matches at that point, replacing his output and leading role remained the major uncertainty on the eve of the new campaign.\nThat task was made all the more pressing by the absence of a centre-forward in name during most of the autumn.\nPortuguese international Goncalo Ramos was sidelined for three months with an ankle injury, while Randal Kolo Muani was progressively phased out of the team, eventually culminating in his loan move to Juventus this winter.\nInitially, it was Bradley Barcola, from the left wing, who took up the mantle by scoring 10 times in the first 11 league games of the campaign.\nHaving carried over his goalscoring form to international duty amid Mbappe's absence from Les Bleus, the 22-year-old was looking increasingly at ease in carrying the now-Real Madrid man's responsibilities for club and country.\nHis form only faintly translated to Champions League fixtures, though, as was the case for the rest of the team. Successive false-nine experiments, notably involving Kang-in Lee and Ousmane Dembele, were proving mostly ineffective as the team registered just one win in the first five European matchdays.\nThe team's league stage campaign, branded by Enrique \"unjust\" given the tough draw they faced, was stunted by an inability to capitalise on their dominance in possession in most matches.\nA disastrous early exit in January was an increasingly credible prospect, until the pieces of the Spaniard's plan finally began to fall into place.\nThe Parisians' free-scoring run since January has included 18 goals in four European encounters, a figure admittedly inflated by Brest's unfortunate collapse in their play-off tie.\nLeading the reversal in fortunes has been Dembele's newly found confidence in front of goal, with the 27-year-old finally realising the potential of his talent.\nThe France international, despite arguably being the face of the club with Mbappe gone, has scarcely been given any kind of preferential treatment.\nHis reinvention has been all the more unlikely given what was an ostensibly fraught rapport with his manager only a few months ago.\nHe was notably dropped for the trip to face Arsenal in October, for arriving late to training, a move which Enrique later branded more recently as \"the best thing I've done to him\".\nAfter a needless sending off in the defeat by Bayern Munich, Dembele was again relegated to the bench for the following league games.\nTensions were eventually appeased, though, as the former Barcelona player worked his way back into the team and claimed the unlikely false-nine role as his own.\nWith 18 goals across all competitions since the turn of the year, the 27-year-old has scored more in two months than any single season of his to date.\nWhile his talent has seldom been called into question, Dembele has, virtually overnight, managed to erase the erratic decision-making, which plagued the first decade of his career.\n\"It's a bit of everything. It's down to my positioning, but also a change in mentality,\" the forward told the Ligue 1 broadcaster on Saturday night.\nDembele's purple patch has also been aided by the team of young talents around him suddenly clicking into gear.\nThe pivot away from buying established names hasn't necessarily meant a decrease in activity in the transfer window, though.\nLast summer's arrivals of teenagers Joao Neves and Doue, along with Ecuadorian centre-back Willian Pacho, did not come cheap, and Kvaratskhelia's signing from Napoli cost the Parisians a reported 70m euros (£58m).\nGone are the \"clans\" that divided past PSG squads, with Enrique now able to mould a team of young (and evidently willing) talents around his philosophy.\nOf those who started in last weekend's hard-fought win in Lyon, only the 30-year-old Marquinhos was older than 26. Impressively, virtually all of the new arrivals from abroad have had little issue giving post-match interviews in French.\nFew in the team encapsulate the willingness to integrate and adapt according to the team's needs better than Neves. The creative-minded midfielder, while standing out as part of a three-man block alongside the equally impressive Vitinha, has filled in more than serviceably at both right-back and left-back when called upon.\nThe Benfica academy product, who has set up nine goals in all competitions this season, has displayed a technical ease in slicing through defences and evading pressure only rivalled by his compatriot.\nHis assist for Dembele against Lille, setting up the Frenchman despite finding himself virtually face-to-face with goalkeeper Lucas Chevalier, was emblematic of his selfless, all-action displays since arriving.\nNot all of the summer recruits hit the ground running straight away. French youth international Doue had already established himself as one of the continent's most promising talents even before joining from Rennes this summer, but a limited impact in his first few months in the capital drew increasing criticism over the necessity of his costly arrival.\nAn impressive display against Salzburg in December, though, was the catalyst for Doue's increased involvement and upturn in form.\nThe 19-year-old was key in three of PSG's four goals against Lille on Saturday, adding his name onto the scoresheet with a strike into the top corner.\nAt ease both on the wing and further back in midfield, Doue has bounced back from an uncertain start to life in the capital.\nBarcola has also bounced back from a dip in form during the winter months, perhaps aided by the fact that the goalscoring burden is now shared across the frontline.\nThe arrival of fierce competition in Kvaratskhelia in January also appears to have kick-started his output again, with his tally now standing at 17 goals and 11 assists this term.\nSitting behind the team's impressive firepower, though, is also a defence with new-found assurance. Goalkeeper Gianluigi Donnarumma, for instance, has appeared increasingly reliable and comfortable with the ball at his feet, far from the high-profile errors of past European campaigns.\nBarring some rare lapses in concentration, the 23-year-old Pacho has adapted seamlessly to the physically demanding nature of Ligue 1 after joining from Eintracht Frankfurt.\nHis composure and workrate in particular have complemented captain Marquinhos more effectively than the more experienced centre-backs PSG have signed over the past few years.\nHaving mostly seen off domestic opposition since their upturn in form, Wednesday night's game against Premier League leaders LIverpool will be the sternest test yet.\n\"It could have been a Champions League final,\" as the PSG manager noted on Saturday.\nThe Asturian is right to view the tie as a clash of equals.", "url": "https://www.bbc.co.uk/sport/football/articles/c1en06430z0o"}