{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:30:11", "date_modify": "2025-05-21 06:30:11", "date_publish": "2025-01-04 14:31:34", "description": "St Mirren captain Mark O'Hara expecting Celtic response after Rangers loss", "filename": "sport_articles_cdd6v85ne8mo_1747809011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58a9/live/8bec40c0-caa7-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdd6v85ne8mo_1747809011.html", "title": "O'Hara expecting Celtic response after Rangers loss", "title_page": "St Mirren captain Mark O'Hara expecting Celtic response after Rangers loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark O'Hara says St Mirren will have to perform to their best if they are to get a result against Celtic, despite the league-leaders' slip-up against Rangers last time out.\nBrendan Rodgers' side were beaten 3-0 by their Old Firm rivals at Ibrox on Thursday, but O'Hara expects a response on Sunday.\nThe Buddies go into the contest off the back of successive league defeats by Dundee and Kilmarnock, but can take heart from their last trip to Parkhead. O'Hara scored twice but Celtic eventually came from behind to win 3-2.\n\"I don't think it will really affect anything too much,\" O'Hara said of Celtic's first domestic loss of the season.\n\"To get anything from the game we'll need to be at our best - if it's Celtic at 100 per cent or 80 per cent. So, I don't think we'll take too much from that game but it's one we need to be ready for.\n\"We've had joy there before and we ran them close a few times recently. It may be a game that takes the pressure off a wee bit and maybe that's what we need after a game like Kilmarnock.\n\"I don't think many people outside of the changing room will give us much of a chance. It might be a game that suits us.\n\"In the games where we were the underdog, we went and surprised people. Hopefully Sunday will be more of the same.\"", "url": "https://www.bbc.com/sport/articles/cdd6v85ne8mo"}