{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:28:08", "date_modify": "2025-04-26 06:28:08", "date_publish": "2025-02-27 11:38:41", "description": "Ex-New Zealand rugby league head coach David Kidwell says the lure of silverware is what convinced him to join Michael Cheika's backroom staff at Leicester Tigers.", "filename": "sport_rugby-union_articles_crknn2x1rreo_1745648888.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5cec/live/de7c78d0-f4fc-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_crknn2x1rreo_1745648888.html", "title": "Leicester Tiger: David Kidwell eyes success as he makes coaching switch", "title_page": "Leicester Tiger: David Kidwell eyes success as he makes coaching switch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former New Zealand rugby league head coach David Kidwell says the lure of silverware is what convinced him to join Michael Cheika's backroom staff at Leicester Tigers.\nKidwell's move into club rugby union for the first time sees him reunited with Cheika, having previously been assistant coach to the Australian when he was in charge of Argentina.\nHis deal with Tigers is a temporarily swap from his job as Japan assistant coach where he works under former England and Australia boss Eddie Jones.\nThe New Zealander's arrival comes after Matt Everard was stood down as Leicester's defence coach earlier this month.\nKidwell will work with Tigers until the conclusion of the 2024-25 season and when Cheika's time as Tigers head coach comes to an end.\n\"Not only is it an opportunity to enhance my coaching but also one to do at a big club and a successful club, that are looking to add to that success this season,\" Kidwell told the Leicester Tigers website., external\n\"I love winning and want to keep winning, wherever I am, and I would not have said yes to Cheik if I didn't think there was a chance of winning. The Premiership is a tough competition and Tigers are in the mix at the top and I want to help the players and coaches get even better.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/crknn2x1rreo"}