{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:08:57", "date_modify": "2025-04-26 04:08:57", "date_publish": "2025-03-02 20:00:43", "description": "Manchester United forward Geyse posted an emotional message on Instagram after Sunday's Women's Super League win over Leicester.", "filename": "sport_football_articles_cly23130w36o_1745640537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7d8c/live/35d80af0-f79a-11ef-a0dd-8be68ae621be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly23130w36o_1745640537.html", "title": "Geyse: Man Utd forward describes 'agonising and lonely feeling'", "title_page": "Geyse: Man Utd forward describes 'agonising and lonely feeling' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United forward Geyse posted an emotional message about feeling lonely and unhappy on Instagram after Sunday's Women's Super League win over Leicester.\nThe 26-year-old Brazil forward came on in the 84th minute as Marc Skinner's side moved to within five points of league leaders Chelsea.\nGeyse, who moved to Manchester United from Barcelona in the summer of 2023, was recently granted compassionate leave after the death of her brother Geovane Ferreira and missed four matches across January and Februrary.\nShe has made 11 appearances in all competitions this season, with nine of those coming in the WSL, six of those as starts.\nUnited have been accused by her agent of trying to loan Geyse out to clubs in the United States, external while she attended her brother's funeral.\n\"Staying in a place where we don't feel happy is an agonising and lonely feeling,\" Geyse wrote. \"Every day seems heavier, and the simple fact of being there becomes a burden.\n\"The environment, which should be welcoming, becomes a field of discomfort, where inner peace is difficult to find. When we are not in tune with what surrounds us, the world around us loses its colour and energy.\n\"Sometimes, the desire for change arises as an urgent need, but the fear of the unknown or insecurity about the future can paralyse us. However, it is essential to remember that we deserve to be in places and situtions that bring us happiness and fulfilment. That's the only way we can grow.\"\nWhen contacted for comment, Manchester United told BBC Sport: \"We continue to support Geyse in her wellbeing and are continuing to look for options which suit all parties.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cly23130w36o"}