{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-21 06:07:05", "date_modify": "2025-05-21 06:07:05", "date_publish": "2025-01-31 15:05:41", "description": "Game of the weekend: Hibs v Aberdeen", "filename": "sport_articles_c62qdj89zz8o_1747807625.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1051/live/99968210-dfe4-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62qdj89zz8o_1747807625.html", "title": "Game of the weekend: Hibs v Aberdeen", "title_page": "Game of the weekend: Hibs v Aberdeen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Hibs and Aberdeen drew 3-3 at Easter Road in November, the hosts were sitting bottom of the Premiership, 23 points adrift of a Dons side just two behind Celtic at the top.\nLittle did we know then that the previous week's defeat away to St Mirren was the start of a 13-match run without a league win for the side that started the season unbeaten in their first 16 games under new manager Jimmy Thelin.\nThat dismal run included a 3-1 home loss to Hibs in December and another win over the Dons would lift David Gray's in-form hosts to within two points of a side who, remarkably considering those poor recent results, remain fourth in the table.\nSince that draw in Leith, Hibs have lost just once in 12 outings, are unbeaten in nine, six at home, and are up to sixth place, their eight-game unbeaten run currently being the longest in the top flight.\nThey have scored three times in five of those six home games despite their 35 goals from 39.2 'expected goals' making them the second most underperforming side in the Premiership behind Kilmarnock.\nIn contrast, the Dons have scored just once in their latest seven league games and have won once in 14 outings overall - and that was away to League 2 side Elgin City in the Scottish Cup.\nThelin's side will have to overturn the form book if they are not to go 10 games without an away league win and 13 overall without a victory since that last trip to Easter Road.", "url": "https://www.bbc.com/sport/articles/c62qdj89zz8o"}