{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:11:08", "date_modify": "2025-04-26 04:11:08", "date_publish": "2025-03-05 00:00:00", "description": "Watch Champions League Match of the Day as Liverpool survive onslaught to beat PSG as Barcelona and Bayern Munich also win in Champions League last 16.", "filename": "sport_football_live_c9841j9jnrgt_1745640668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/308d/live/00882a50-fa0c-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c9841j9jnrgt_1745640668.html", "title": "Champions League LIVE: Liverpool survive PSG onslaught to win 1-0, Barcelona & Bayern Munich also win", "title_page": "Champions League LIVE: Liverpool survive PSG onslaught to win 1-0, Barcelona & Bayern Munich also win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Enjoy the highlights\nTime for us to rest and recover after the drama from an incredible match.\nThe Champions League highlights show is on right now so click the 'watch live' button at the top of this page.\nBelow, you can find the best of the action from some of the key ties in the first legs. Enjoy!\n'If you don't score, you can always pay'\nFT: PSG 0-1 Liverpool\nJulien Laurens\nEuropean football expert on BBC Radio 5 Live at Parc des Princes\nDominating is not winning. Tonight is a little bit cruel. I have not seen this Liverpool side be so dominated.\nThe counter-press from PSG worked amazingly well, but if you don't score, you can always pay for it.\nIt's all part of the learning curve for this young team.\n'When you get a moment you have to take it'\nFT: PSG 0-1 Liverpool\nRio Ferdinand\nFormer Man Utd defender on TNT Sports\nThere was no one on earth that thought Liverpool would win this game with the way it was going. But when you get a moment you have to take it.\nPSG had many moments and didn't take them. If you don't punish teams when they are weak, when they are there for the taking, you can get punished yourself.\n'Best in the world'\nFT: PSG 0-1 Liverpool\nLiverpool\nMore from Liverpool boss Arne Slot, speaking to TNT Sports on Alisson: \"I have had some very good players as a manager but never the best goalkeeper in the world until now.\n\"He showed that he is the best in the world today. To go away with a win here was probably a bit more than we deserved.\"\nOn substitutes Nunez and Elliott: \"Darwin was in a difficult place after the Villa game but he showed again how important he can be. And Harvey, I asked him if he was quite frustrated with me because he only gets five minutes here or there, again tonight.\n\"It is a compliment to them that they made such an impact, but also to our staff because they have to keep these players going. The players showed up today.\"\n'I did not expect Leverkusen to crumble'\nFT: Bayern Munich 3-0 Bayer Leverkusen\nThomas Hitzlsperger\nFormer Germany midfielder on MOTD: Uefa Champions League\nThe surprise wasn’t Bayern’s dominance, because they were at home and they needed a result in the first leg, but I did not expect Leverkusen to crumble like they did in the second half and make such big mistakes.\nWe have not seen this from Xabi Alonso’s side in the past. You think why has this happened on a big stage, and is it down to a lack of experience? Probably not - I was very surprised.\nYou can hear more from Hitzlsperger on MOTD: Uefa Champions League at 22:40 BST on BBC One and the BBC Sport website and app.\nPost\nFT: PSG 0-1 Liverpool\nLiverpool\nLiverpool boss Arne Slot, speaking to TNT Sports: \"There were a lot of similarities today with our game against Manchester City, where we faced a team that is so, so good in ball possession and have some great wingers that dominate one v one situations.\n\"I said before the game that we would not dominate ball possession over here. The only thing I can blame my players for is that four, five, six times we tried to play through them and it was completely open and the last touch should be better. Maybe it was due to tiredness from defending so much. That is sometimes difficult after defending so much.\n\"If you look at the underlying stats in the Champions League too it shows you they were number one, and they have already played Atletico Madrid, Manchester City, Bayern Munich and Arsenal. To have the best stats after facing that quality tells you a lot.\n\"For us the only way over here with their fans behind them was to defend as we did. Now we are hoping that our fans at Anfield will help us a lot. We will need Anfield two times.\"\n'One of Liverpool's best results in years'\nFT: PSG 0-1 Liverpool\nAlly McCoist\nFormer Rangers striker on TNT Sports\nThat is one of the best results Liverpool have had in recent years. For the vast majority of the game they were hanging on and defending well and relying on their goalkeeper to make some wonderful saves.\nWe always thought that they may get a chance along the line and they did. Credit to the manager for making the correct substitutions.\n'Wonderful moment for Elliott'\nFT: PSG 0-1 Liverpool\nSteve McManaman\nFormer Liverpool and Real Madrid winger on TNT Sports\nI am absolutely thrilled for Harvey Elliott. He is a lovely kid and he has deserved his moment in the sun.\nHe has had a lot of injuries this year whilst others have come on, the likes of Curtis Jones and Conor Bradley, who have got a lot of minutes and acclaim. It is a wonderful moment for him.", "url": "https://www.bbc.co.uk/sport/football/live/c9841j9jnrgt"}