{"authors": ["Alex Seftel", "www.facebook.com"], "date_download": "2025-05-21 07:26:15", "date_modify": "2025-05-21 07:26:15", "date_publish": "2025-03-28 14:26:38", "description": "Hartpury University, a team comprised entirely of student players, are two games from reaching this season's FA Vase final at Wembley.", "filename": "sport_football_articles_cewkwg5gg7no_1747812375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fc23/live/922b71f0-0bf1-11f0-a31d-7bdcf6d7d2f6.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cewkwg5gg7no_1747812375.html", "title": "Hartpury University FC: Student club aiming to reach FA Vase final", "title_page": "Hartpury University FC: Student club aiming to reach FA Vase final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I always thought we could do it,\" says Dr Martin Longworth, a lecturer who is head coach of Hartpury University FC.\nThe Gloucestershire-based ninth-tier club, comprised entirely of student players, are preparing for Saturday's first leg of their FA Vase semi-final at Whitstable Town.\nIf successful over two legs, their young squad will secure a place in the final at Wembley Stadium on Sunday, 11 May.\n\"I have seen it being done before with students,\" Longworth told BBC Midlands Today.\n\"If you have enough heart, you have enough desire and you get some good people around there, anything can happen.\"\nLongworth, senior lecturer in sports coaching and PE at Hartpury University, speaks from experience. He was assistant coach at Cymru Premier side Cardiff Metropolitan University, who had been in the Welsh Football League Division Three as recently as 2013.\nThe club showed what was possible for university sport, even playing in Europa League qualifying in 2019.\nHartpury were only founded in 2020 and now sit top of the Hellenic Football League Premier Division.\nTheir squad can range from 16-year-old BTec and A-level pupils to a 25-year-old who is studying for a masters degree.\n\"It's been brilliant. It's a fantastic environment,\" said Longworth.\n\"We got to the last 32 two years in a row. This year, we just wanted to go one better.\n\"In the last round we realised this is huge. People are starting to take notice and it is what the lads deserve.\"\nWhitstable, who host the first leg, play in the ninth-tier Southern Counties East Football League, the same division as Erith & Belvedere who Hartpury beat 2-1 in the quarter-finals.\nAbout 3,000 tickets have been sold for the first leg in Kent, leaving the visitors relishing playing in front of a large crowd, before they host the return on 6 April.\n\"The most we have ever played against is probably 600-700 in the previous round,\" said Longworth.\n\"It will probably be one of the biggest games of these guys' lives, and for some of them the best opportunity they are ever going to have.\"", "url": "https://www.bbc.com/sport/football/articles/cewkwg5gg7no"}