{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-04-26 07:28:18", "date_modify": "2025-04-26 07:28:18", "date_publish": "2025-02-27 19:08:49", "description": "Peterborough United's penalty-saving goalkeeper Jed Steer reveals the secret smile behind Posh reaching Wembley again.", "filename": "sport_football_articles_clyrr42xv0yo_1745652498.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd05/live/154ba170-f533-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyrr42xv0yo_1745652498.html", "title": "Jed Steer: Peterborough's smiling keeper helps Posh reach Wembley", "title_page": "Jed Steer: Peterborough's smiling keeper helps Posh reach Wembley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Peterborough United's smiling Jed Steer says there's more to it than just simply saving spot-kicks when you are a goalkeeper in a penalty shootout.\nThe former Aston Villa man saved two Wrexham penalties to book a return trip to Wembley in the EFL Trophy final and a Wembley meeting with Birmingham City on 13 April - and quash the marketing men's dream of an an 'all-American' final.\nThat was after Posh had come from 2-0 down on the night to draw 2-2 and take the game to the supposed lottery of spot-kicks. But it is not such a lottery when your team has a keeper of 31-year-old Steer's calm, smiling presence.\nJust as he did with Dean Smith's Villa to inspire his side to the Championship play-off final in 2019 - and back to the Premier League at Wembley - Steer again kept his nerve when it counted.\nAnd, crucially, he also did his bit for Posh's penalty takers, meeting them between spot-kicks for a quick quip and a few kind words.\n\"Fair play to our players for showing the confidence to take one,\" he told BBC Radio Cambridgeshire. \"That can be a lonely walk.\"\nHe added: \"I've never had to do it, but I can only imagine the goal starts looking a bit smaller the closer you get. And I like to think a friendly face with a smile might help ease their nerves.\"\nSubstitute Bradley Ihionvien, Ryan de Havilland, Harley Mills and captain Hector Kyprianou all duly scored from the spot, but Steer was also particularly pleased to play his part too by saving from Paul Mullin and Elliot Lee as Posh upturned the League One table in this Trophy semi-final.\n\"People say that as a keeper you're not under any pressure,\" he said. \"But I still feel a bit of pressure on myself to step up and make a save.\n\"You want to make a save or make them miss. And Dan [Daniel Hutchings] our analyst, had put together a little dossier, which I'd gone through earlier in the afternoon.\n\"I believed I was going to save one at least. And it was fairly big that we won the coin toss and got it up the other end where there were no fans behind the goal. That was important.\"\nEqually important was the same belief Darren Ferguson's Posh had shown earlier to come back and take the game to penalties.\n\"To be 2-0 down away from home, life is always going to be tough. And Wrexham are very good at what they do. They're very difficult to play against. We found that in the games against them in the league. But, with this team, we always believe we're going to get chances.", "url": "https://www.bbc.co.uk/sport/football/articles/clyrr42xv0yo"}