{"authors": ["Dafydd Pritchard", "www.facebook.com"], "date_download": "2025-05-20 11:58:05", "date_modify": "2025-05-20 11:58:05", "date_publish": "2023-08-06 09:29:45", "description": "Leeds United make a dramatic return to the Championship, launching manager Daniel Farke's reign by fighting back from two goals down to draw 2-2 with Cardiff City.", "filename": "sport_football_66352124_1747742285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1FBF/production/_130672180_hi086736356.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352124_1747742285.html", "title": "Leeds United 2-2 Cardiff City: Late Crysencio Summerville goal rescues point for hosts", "title_page": "Leeds United 2-2 Cardiff City: Late Crysencio Summerville goal rescues point for hosts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United made a dramatic return to the Championship as new manager Daniel Farke saw Crysencio Summerville's added-time equaliser cap a fightback from 2-0 down to draw with Cardiff City.\nThe Bluebirds, also under the guidance of a new boss in Erol Bulut, had to withstand heavy Leeds pressure but clinical counter-attacking goals by debutants Josh Bowler and Ike Ugbo had given the visitors a convincing half-time lead.\nA towering header by Leeds captain Liam Cooper early in the second half fuelled a resurgence from the dominant hosts, who missed several chances.\nJust as it looked like Cardiff would cling on for a memorable victory, Summerville finished superbly five minutes into time added on to spark jubilant celebrations at Elland Road.\nA point was the least Leeds deserved. The statistics told the story of their supremacy: 72% possession, 25 shots to Cardiff's seven and six on target compared to their opponents' two.\nAnd yet for all that, Bulut's side will feel crushed that their resolute defensive display - and ruthless finishing on the break - was not enough to win.\nBoth sides entered this season with the sense of a fresh start having been through summers of change in the transfer market as well as the dugout.\nFarke's first Leeds line-up featured only three players who began the club's final Premier League game in May - Cooper, Luke Ayling, and Pascal Struijk - after an off-season which featured more departures than arrivals.\nOf the three new faces to come in, only Ethan Ampadu, a £7m acquisition from Chelsea, started this match, though there was a full debut for teenager Archie Gray while Daniel James was back on the left wing having been on loan at Fulham last season.\nBulut, meanwhile, handed first Cardiff appearances to four new signings - Bowler, Ugbo, Dimitrios Goutas and Karlan Grant - as well as a third Bluebirds debut for former Arsenal and Juventus midfielder Aaron Ramsey following his return to his boyhood club.\nThere was a pleasing flow to the match despite those changes, as Leeds looked to control possession and press their opponents, while Cardiff waited for opportunities to pounce on the break.\nWilfried Gnonto posed an early threat for Leeds, seeing one shot blocked and blasting another narrowly wide, before Summerville was denied by a crunching tackle from Mark McGuinness.\nCardiff were more clinical with their first chance as they took the lead midway through the first half. Left-back Callum O'Dowda cantered into space and pulled the ball back to Bowler, whose first shot was blocked before a lay-off from Ugbo allowed him to stroke a neat finish into the bottom corner.\nLeeds continued to push forward, with Summerville combining with Gnonto before seeing his curling shot well saved by Jak Alnwick - but less than two minutes later, the men in white fell further behind.\nCardiff's second goal was again as much to do with Leeds' defensive vulnerability as it was their own cutting edge.\nBowler combined with Ryan Wintle and found himself free on the right, where he passed to Ramsey. The Wales captain's shot then took a deflection and bobbled across goal, where Ugbo got in front of Ayling to slide in.\nIf a two-goal deficit was a little harsh on Leeds, they were quick to halve it in the second half as Cooper rose high to head in from Summerville's corner.\nThat was Cooper's final involvement as he appeared to injure his knee in the process of scoring, joining opposition skipper Joe Ralls on the sideline after his first-half withdrawal.\nThe goal ignited Leeds and the Elland Road crowd as the increasingly dominant home side pinned Cardiff back in their own half.\nGnonto continued to be a menace, darting into the penalty area and having a low shot helped on to the bar by Alnwick, who was later at full stretch to deny James.\nPressure from the hosts was relentless and, as the chances kept coming, Leeds eventually converted one as Summerville struck with a low shot to break Cardiff's resistance.", "url": "https://www.bbc.com/sport/football/66352124"}