{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 05:46:16", "date_modify": "2025-05-21 05:46:16", "date_publish": "2025-04-02 13:18:12", "description": "Man Utd news: Why did Utd sell Anthony Elanga?", "filename": "sport_football_articles_c05nzpqgvleo_1747806376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a00/live/33e21280-0fb0-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05nzpqgvleo_1747806376.html", "title": "Man Utd news: Why did Utd sell Anthony Elanga?", "title_page": "Man Utd news: Why did Utd sell Anthony Elanga? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Ralf Rangnick replaced Ole Gunnar Solskjaer in December 2021, he quickly concluded Anthony Elanga had a bright future.\nRangnick clearly knew Elanga had pace - and felt his direct style was a threat to opposition defences, which in turn could create space for others.\nCrucially, he also felt Elanga was aware of the space around him and did not forget his defensive duties, even if his preference was to go forward.\nThat he featured in 26 out of Rangnick's 29 games in charge says it all about the current Austria coach's view.\nSadly for Elanga, Erik ten Hag had a different outlook.\nThe Dutchman did not feel Elanga had the quality needed to be enough of an influence on his squad. That meant he was jettisoned in 2023 after a single campaign under the Dutchman.\nThe problem was the attacking players who came in the same summer – Mason Mount and Rasmus Hojlund – have failed to deliver. The wide attacking players United already had – Antony, Amad Diallo and Alejandro Garnacho – were inconsistent at best, Anthony Martial was injured and Marcus Rashford's form fell off a cliff.\nTen Hag's assessment was probably right. United were third then, as Nottingham Forest are third now. Maybe that is Elanga's level. What he really did not bargain for was the Old Trafford side hurtling backwards at such an alarming rate.\nThird to them now seems light years away.", "url": "https://www.bbc.com/sport/football/articles/c05nzpqgvleo"}