{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 04:54:18", "date_modify": "2025-05-21 04:54:18", "date_publish": "2025-04-04 15:14:03", "description": "Port Vale have the chance to turn the tables on Walsall and replace them at the top of League Two when they visit the Bescot Stadium on Saturday.", "filename": "sport_football_articles_cr4nrwzl494o_1747803258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26df/live/199e8e10-1151-11f0-87ca-a3e7c76bfb02.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4nrwzl494o_1747803258.html", "title": "Can Ben Garrity be key to Walsall-Port Vale rematch?", "title_page": "Can Ben Garrity be key to Walsall-Port Vale rematch? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Port Vale hosted Walsall in early December, their 1-0 home defeat that day cost Darren Moore's men the leadership of League Two to the Saddlers.\nVale now have the chance to return the favour when they head to Bescot for this Saturday's return fixture.\nAfter taking over on top that day, Mat Sadler's Saddlers have been there for four months since, at one point building up a 12-point lead. But that has slowly been whittled away - and, if Vale win, Walsall will be knocked off the top.\nWhat is more, if Vale's local rivals, eighth-placed Crewe Alexandra, can avoid defeat by second-placed Bradford City, then Moore's Valiants could be back on top.\nThe one key element different to the game in December is that this time Vale will have the services of their skipper, midfielder Ben Garrity, who was out injured when the first meeting of the two sides took place.\nThe effect his presence has on Vale is stark. This season, in 26 League One games with him in the side, they have lost just three. In the 14 games without him, they won just twice and slumped from top spot to outside the top six.\nThe message from both camps ahead of the return is one of solidarity and team spirit.\nSadler said that his squad are solely focused on maintaining the quality of their performances, and that the rest will take care of itself - but he added that his team now need the home fans more than ever, and that he also needs that same togetherness in his players.\nGarrity is even clearer in his plea to the Vale fans - at home games, rather than on the road - to try and cut out the groans.\nWhen Vale scored their opening goal in Tuesday night's 2-0 home win over Bradford City, it came straight on the back of Garrity playing a reverse pass backwards, for which he got some groans from the crowd - and to which he reacted.\n\"I've gone a bit mad there because I'm sick of hearing groans,\" he told BBC Radio Stoke.\n\"It happens a lot at home when players make a decision not to play the ball forward and keep it instead, but sometimes you need to slow it down and keep hold of the ball when we're under the cosh.\n\"I played it back, it then went forward and then we scored. I lost it and I'll lose it again if it happens. I thought it was only right for me to react the way I did.\"\nGarrity added: \"We want to go forward and score goals. And, when the fans are right behind us, it's brilliant. But what are the groans for?\n\"We want to keep the ball. We don't want to chase it for 90 minutes. And, if you're playing against good teams, you don't give them the ball.\n\"And what you don't need from the fans is groaning. How is that going to help the younger lads in the team. It won't affect me but it can affect the younger lads.\"\nSaturday's game will almost certainly all be about patience. And that is something Moore's Vale know all about.\nIn their past 11 games, they have scored seven goals after the 85th minute - and that is a key factor in why they have lost just twice in 17 league matches.\nWalsall, by way of comparison, have not won in eight games since beating Morecambe on 22 February. And their goal power has dried up from two per game prior to top scorer Nathan Lowe's return to parent club Stoke City in January - to their current ration of 18 goals [and just two wins] in their past 15 games.", "url": "https://www.bbc.com/sport/football/articles/cr4nrwzl494o"}