{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:53:44", "date_modify": "2025-04-26 06:53:44", "date_publish": "2025-03-01 00:00:00", "description": "Watch live coverage plus follow radio commentary as Wakefield Trinity host St Helens in the Super League.", "filename": "sport_rugby-league_live_c1jpl2n8dlpt_1745650424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2118/live/b0f2e4e0-f528-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_live_c1jpl2n8dlpt_1745650424.html", "title": "Super League LIVE: Watch Wakefield Trinity v St Helens", "title_page": "Super League LIVE: Watch Wakefield Trinity v St Helens  - stream, score and radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The story of round two\nSt Helens made it two wins out of two to begin the 2025 Super League season with a commanding victory at Castleford Tigers.\nThey ran in nine tries at the Mend-A-Hose Jungle which is enough put them top of the table on points difference ahead of Warrington Wolves and Hull KR. The Wire edged past Catalans Dragons to continue their winning start to the Super League season, whereas Hull battled to victory over promoted Wakefield Trinity but lost Man of Steel Mikey Lewis to an ankle injury.\nElsewhere, Leeds Rhinos bounced back from a disappointing opening-day defeat with a convincing Super League victory against Salford Red Devils and Wigan Warriors returned to winning ways before their trip to Las Vegas to face Warrington Wolves as they swept aside Hull FC at MKM Stadium.\nLeigh Leopards scored two late tries to finally see off the challenge of Huddersfield Giants and make it two wins out of two. Get the latest news and highlights on our dedicated rugby league page.\nHow to get into rugby league\nBBC Sport\nPlaying rugby league has many benefits, including keeping fit, meeting new people and maybe even progressing to a higher level.\nAlthough rugby league shares similarities with rugby union, it is important to see them as different games, and as such, each has its own unique set of skills. Look at the rules to get a feel for the game., external\nRugby league is a fast and dynamic game, which involves great strength, stamina and skill, and is played through the summer, so no muddy pitches, or cold, wet training nights!\nWith so many variations, you don't have to play the full version of the game to be part of it.\nWhatever your age, gender, fitness level or technical ability there is a version of rugby league that will suit you. Find your local club by using the RFL's club finder., external.", "url": "https://www.bbc.co.uk/sport/rugby-league/live/c1jpl2n8dlpt"}