{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:04", "date_modify": "2025-05-21 04:20:04", "date_publish": "2025-04-05 15:19:07", "description": "Everton 1-1 Arsenal: What David Moyes said", "filename": "sport_football_articles_cg41z4e52edo_1747801204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7f85/live/d4a1b1c0-1222-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg41z4e52edo_1747801204.html", "title": "Everton 1-1 Arsenal: What David Moyes said", "title_page": "Everton 1-1 Arsenal: What David Moyes said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton manager David Moyes has been speaking to BBC Match of the Day about the game: \"Our first-half performance was really poor - sloppy and slacking from the first moment. We gave Arsenal encouragement and that's the one thing they certainly don't need. They are a good enough team [without it].\n\"Credit to the players. They turned it around at half-time, got about it and a great reaction from the crowd that helped us get a penalty and, in the end, we got a point against a good team.\"\nOn playing Liverpool on Wednesday: \"If you're going to become a top team, you have to get used to playing midweek. We are probably not used to it here. I think it was a factor, with the early kick-off those extra hours can make a difference. We didn't start well.\"\nOn what is still to play for this season: \"I've said to the players that the challenge we've got is to prove how we get on against the better teams. We are trying to play better, we didn't do that today, so we need to find a way we can do that. Moving forward, we are trying to find how to get better against better sides.\"\nOn Iliman Ndiaye: \"We missed Iliman, he is one of our major talents. We have missed Dwight McNeil as well and we are without Dom [Calvert-Lewin], so we've had to find a way to get results.\n\"We've done a pretty good job. We are just about there, not mathematically, but just about clear of being a Premier League team.\n\"I will probably visit the stadium this week now that I'm feeling that way.\"", "url": "https://www.bbc.com/sport/football/articles/cg41z4e52edo"}