{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:08:56", "date_modify": "2025-04-26 04:08:56", "date_publish": "2025-03-02 20:04:44", "description": "Man Utd 1-1 Fulham AET (3-4 on penalties): What Ruben Amorim said", "filename": "sport_football_articles_c1kjvj0xy8po_1745640536.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2899/live/49947ee0-f78e-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1kjvj0xy8po_1745640536.html", "title": "Man Utd 1-1 Fulham AET (3-4 on penalties): What Ruben Amorim said", "title_page": "Man Utd 1-1 Fulham AET (3-4 on penalties): What Ruben Amorim said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United boss Ruben Amorim has been speaking to BBC Sport after his side were knocked out of the FA Cup: \"We managed to score in the second half after that goal near half-time. It is harder for us to go and press a little bit higher, but we managed to do it and score.\n\"I think we had the best chances in the game. In the end, the penalties can go both ways and today it wasn't our way. It is important to say that, with the substitutions, we had our chance to win the game.\n\"I think we are better with the first ball than the second ball. I think it is also sometimes the quality of the players - Bruno [Fernandes], Casemiro and Josh [Zirkzee] are improving a lot.\n\"It's really important that we recover the players now. They were really tired. We have three days now and then back here at Old Trafford against Arsenal.\"\nOn penalty shootout: \"I tried to relax the players. They know that it is something that is technical, but you have to be relaxed and confident.\"\nOn what Manchester United's goals are for the future: \"The goal is to win the Premier League. I know that we are losing games, but the goal is to win the Premier League again.\n\"I don't know how long it will take but we have a goal and we continue forward no matter what. It is impossible to know, but you start understanding the players better and we understand the league. We'll see in the future.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1kjvj0xy8po"}