{"authors": ["Scott McCarthy", "www.facebook.com"], "date_download": "2025-04-26 07:55:57", "date_modify": "2025-04-26 07:55:57", "date_publish": "2025-02-25 12:25:39", "description": "Brighton news: Opinion - Jack Hinshelwood deserves England call-up", "filename": "sport_football_articles_cp8vn2dvxljo_1745654157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a79/live/45186dc0-b628-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp8vn2dvxljo_1745654157.html", "title": "Opinion - Jack Hinshelwood deserves England call-up - BBC Sport", "title_page": "Brighton news: Opinion - Jack Hinshelwood deserves England call-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thomas Tuchel has been to the Amex twice since officially starting his new job as England manager when 2024 turned into 2025.\nHe needs to make a couple more stopovers in Brighton before naming his first Three Lions squad in March. Or pick up das Telefon and speak to compatriot Fabian Hurzeler.\nThe subject of his return visit or phone conversation with Herr Hurzeler? Jack Hinshelwood. Because he deserves to be in contention for his first senior call-up.\nWhile it was the Albion's forward foursome of Joao Pedro, Georginio Rutter, Kaoru Mitoma and Yankubu Minteh who took the headlines as they dismantled sorry Southampton 4-0 at St Mary's, it was Hinshelwood who stood out most for me.\nHaving helped Brighton dominate in midfield in their two previous wins over Chelsea, Hinshelwood was redeployed against the Saints. He took over at right-back in place of the unavailable Joel Veltman.\nSouthampton were admittedly woeful. But the one player who looked capable of causing Brighton problems was Kamaldeen Sulemana down the Saints' left.\nNot only was Sulemana expertly shackled by Hinshelwood, but the teenager born and bred in Brighton even found the time to pop up with the fourth Albion goal.\nAlready, Hinshelwood looks an absolute technician. But it is his versatility that marks him out as special enough to warrant England inclusion.\nHow many other 19-year-olds can seamlessly switch from central midfield to right-back? Or left-back, which is where Hinshelwood started the campaign?\nRoberto de Zerbi said last season Hinshelwood was the son of Pascal Gross. It is not hard to see why. Both can play multiple roles. Both score goals no matter what position they are playing in. And both glide around the pitch, making football look effortless.\nGross had to wait until he was 32 to make his Germany debut. Hinshelwood's for England will surely come much sooner. Maybe as soon as next month - if Tuchel has been paying attention.", "url": "https://www.bbc.co.uk/sport/football/articles/cp8vn2dvxljo"}