{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:36", "date_modify": "2025-05-20 12:33:36", "date_publish": "2023-08-04 09:28:13", "description": "Chelsea: Axel Disasi signs for the Blues and first interview", "filename": "sport_articles_c72rj04d4w0o_1747744416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7be8/live/50e1bd90-32a8-11ee-8412-a3db9e03faea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72rj04d4w0o_1747744416.html", "title": "Chelsea: Axel Disasi signs for the Blues and first interview", "title_page": "Chelsea: Axel Disasi signs for the Blues and first interview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Axel Disasi wants to \"achieve very big things\" with Chelsea after signing a six-year contract with the club.\nThe 25-year-old defender has been speaking about the move to West London from AS Monaco: \"It’s something I’ve been waiting for. I am so happy to be here, at this big club. I am really proud to be able to be a part of this great family, and I hope to achieve very big things here. [I want] to win titles. I will do everything I can to achieve those objectives. I am very ambitious.\n\"I can’t wait to feel the energy of the fans. This is a very good stadium, one where you have a beautiful proximity to the fans. A typical English stadium, I think. The fervour of the fans in the Premier League, the atmosphere, the intensity of the games: it's something that excites me.\"\nOn what he can bring to the team, Diasi added: \"I’m a defender who likes to properly look for the ball and win it back. I like to have the ball at my feet and play passes. I like interceptions, and I like to be aggressive with the opposition, to use my physicality.\n\"I want to bring my positive energy to this group, to be happy, to have a laugh with my teammates. I like to have fun, to joke. It’s important because it’s a young group who are very close and laugh together. I like that a lot.\"", "url": "https://www.bbc.com/sport/articles/c72rj04d4w0o"}