{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:08", "date_modify": "2025-05-20 11:41:08", "date_publish": "2023-08-06 19:18:23", "description": "Jamaica beat New Zealand to win bronze at the Netball World Cup as the Silver Ferns record their worst finish at the tournament.", "filename": "sport_netball_66422985_1747741268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14FA7/production/_130672958_jamaica_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66422985_1747741268.html", "title": "Netball World Cup 2023: Jamaica 52-45 New Zealand - Sunshine Girls secure bronze", "title_page": "Netball World Cup 2023: Jamaica 52-45 New Zealand - Sunshine Girls secure bronze - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamaica beat New Zealand to win bronze at the Netball World Cup as the Silver Ferns recorded their worst finish at the tournament.\nThe Sunshine Girls, who lost to eventual champions Australia in the semi-finals, beat New Zealand 52-45.\nIt is the first time five-time champions New Zealand have not won a medal at the event.\n\"It's really heartbreaking for us to not be able to do it for our country,\" captain Ameliaranne Ekenasio said.\n\"We're really sorry that we couldn't do it. We're just thankful for the support no matter what.\"\nNew Zealand were defending champions in Cape Town but struggled throughout, losing twice to Jamaica and to England in the semi-finals.\nThey lost star shooter Grace Nweke early in the group stages and saw wing attack Gina Crampton hobble off with an ankle injury inside the first three minutes of the semi-final.\nJamaica, however, have been one of the most consistent teams, going through the pool stages unbeaten before their last-four loss to Australia on Saturday.\nCaptain Jhaniele Fowler scored 43 goals from 44 attempts to help her side secure the bronze.", "url": "https://www.bbc.com/sport/netball/66422985"}