{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:22:21", "date_modify": "2025-05-20 14:22:21", "date_publish": "2023-07-29 08:05:57", "description": "The Saudi Pro League's financial clout has \"changed the market\" for transfers and elite clubs \"need to be aware of what is happening\", says Manchester City boss Pep Guardiola.", "filename": "sport_football_66347484_1747750941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6DE0/production/_130582182_tv084715714.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347484_1747750941.html", "title": "Saudi Pro League has 'changed transfer market' - Manchester City boss Pep Guardiola", "title_page": "Saudi Pro League has 'changed transfer market' - Manchester City boss Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Saudi Pro League's financial clout has \"changed the market\" for transfers and elite clubs \"need to be aware of what is happening\", says Manchester City boss Pep Guardiola.\nAfter luring Portugal star Cristiano Ronaldo to Saudi Arabia in December, the league has attracted several big-name players this summer.\nThat group includes Algeria's Riyad Mahez, who left City to join Al-Ahli.\n\"Saudi Arabia has changed the market,\" said Guardiola.\n\"A few months ago when Cristiano [Ronaldo] was the only one to go, no-one thought this many top, top players would play in the Saudi league.\n\"In the future there will be more and that's why clubs need to be aware of what is happening.\n\"Riyad got an incredible offer and that's why we could not say 'don't do it'.\"\nCity agreed to sell Mahrez in a deal worth up to £30m while Allan Saint-Maximin is set to become the next player to leave the Premier League for Saudi Arabia when he joins Mahrez at Al-Ahli.\nBayern Munich's Sadio Mane is in talks over a potential move, having received an offer from Al-Nassr, while reigning Ballon d'Or winner Karim Benzema has already followed former Real Madrid team-mate Ronaldo to Saudi Arabia.\nEarlier this week, Premier League chief executive Richard Masters said he \"wouldn't be too concerned at the moment\" about Saudi Arabia's growing influence in football.\n\"It is not about the threat, it is a reality,\" Guardiola added during City's pre-season tour of Asia.\n\"They want to create a strong league and so far they are the league who can do it.\n\"The Premier League spent more than the others because the organisation of the Premier League is better and the broadcasts and the sponsors are higher than the other leagues, so the clubs can spend what they have.\n\"Right now, the Saudi league, I don't know how long they will sustain it, but the feeling is that they will stay. The players want to take this experience to play in that league and they are able to do it.\"\nGuardiola added that City \"are not looking for a replacement for Riyad in terms of skill because every player is different\".\n\"We will see what happens with loan players, and which players stay here. A few things are going to happen.\"\nGermany midfielder Ilkay Gundogan has also left City this summer, on a free transfer to Barcelona, and so far last season's Treble winners have only brought in Croatia midfielder Mateo Kovacic from Chelsea.\nNetherlands defender Nathan Ake has signed a two-year contract extension at City until 2027.\nThe 28-year-old joined City in 2020 on a five-year deal from Bournemouth for £40m and he played a vital role for City last season, making 41 appearances in all competitions as City won the Treble.\n\"This is the best club in the world, I have no doubts about that. Being a Manchester City player makes me incredibly proud every single day,\" said Ake.\n\"It's a club that expects excellence in every area, which makes for the perfect environment to improve. I am at the stage of my career where I want to keep developing and I can definitely do that here.\n\"Pep is the best manager in football - a genius who has made me see the game differently - so to be able to work with him for longer is a real privilege.\n\"I am so grateful to him for everything he has done for me, both personally and professionally.\"\nAke joined Chelsea as a 15-year-old and after 17 first-team appearances made a permanent move to Bournemouth in 2017, having been on loan there during the 2016-17 season.\nHe had talks with Chelsea about re-joining them a year ago but the Blues failed to meet City's valuation.\nAke has helped City claim the Premier League title in each of his three seasons with the club, winning six trophies overall.\nBut his versatility - he can play at centre-back and left-back - helped him become a more important member of the squad last season, with his 41 appearances more than he managed in his first two seasons combined (40).\nCity's director of football Txiki Begiristain said: \"We have been delighted with Nathan's development, so it's great news for this club that he is extending his time with us.\n\"There is no doubt he was a very important part of our Treble success last season, but I believe he can be even better.\n\"Technically, tactically and physically he has everything we want in a defender - and he is so professional, dedicated and willing to learn, which for Pep is an ideal scenario.\n\"Nathan is also an incredible human being who has the respect of absolutely everybody at the club.\"", "url": "https://www.bbc.com/sport/football/66347484"}