{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 05:33:29", "date_modify": "2025-05-21 05:33:29", "date_publish": "2025-01-14 15:02:41", "description": "Wales' newest squad member Ellis Mee says pulling on the red jersey would be an \"absolute dream\".", "filename": "sport_rugby-union_articles_cr46l1perylo_1747805609.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80a4/live/0ae1e370-d274-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cr46l1perylo_1747805609.html", "title": "Ellis Mee: Playing for Wales would be 'absolute dream'", "title_page": "Ellis Mee: Playing for Wales would be 'absolute dream'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales' newest squad member Ellis Mee says pulling on the red jersey would be an \"absolute dream\".\nMee was named in Warren Gatland's 34-man squad for the Six Nations after impressing in his rookie season for Scarlets.\nThe 21-year-old signed from English Championship club Nottingham and qualifies for Wales via his Newport mother.\n\"It's unreal, it still hasn't set in,\" said Mee, who lives in his grandparent's old home in Aberdare.\n\"It came as a surprise, obviously there was stuff in the news, but I didn't think I was going to make it.\"\nMee heads into Wales camp next Monday and admits there will be some nerves.\n\"It's very nerve-wracking, even now,\" he said.\n\"It's just getting through it, getting my head down, getting along with the people around me and making it enjoyable.\"\nMee's selection did not come as a surprise to Scarlets head coach Dwayne Peel who said he has \"genuine skill in his game.\"\n\"He's obviously a good athlete, but he's got rugby ability and that's probably the reason why I haven't been overly surprised,\" said Peel.\n\"He doesn't say much, he's a quiet guy off the field, but I'm chuffed for him and his family.\"\nPeel credits James Davies for bringing Mee to Llanelli, with the former Wales flanker now in charge of Scarlets' recruitment.\n\"Cubby has a great eye for the game. He says look 'I've seen this kid, he's Welsh qualified and I think we should have a look at him',\" said Peel.\n\"We loved his intent playing for Nottingham... he had a gliding way of running and you can see that now.\"\nGatland said Mee, who has also played for Llandovery this season, was an exciting prospect for Welsh rugby.\n\"He has got a presence about him. He's quick and good aerially,\" he said.\n\"Even though he's been playing on the wing, he had a lot of games at full-back as well last year, I think he played 21 out of 22 games at full-back, so potentially he's an option for us there going forward.\n\"The back three has been a concern for us in terms of strength in depth, we've got some more options there now.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cr46l1perylo"}