{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:40", "date_modify": "2025-05-20 11:57:40", "date_publish": "2023-08-06 11:03:52", "description": "Exeter City boss Gary Caldwell says 05:00 gym sessions and surprise drills in pre-season has helped build a winning mentality for his side.", "filename": "sport_football_66421733_1747742260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16C7B/production/_130670339_jamesscottgoalwycombeaug2023rex2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66421733_1747742260.html", "title": "Exeter City's tough pre-season helped mentality says boss Gary Caldwell", "title_page": "Exeter City's tough pre-season helped mentality says boss Gary Caldwell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter City manager Gary Caldwell says pushing his side's boundaries in pre-season was a big reason behind their impressive start to the new campaign.\nThe Grecians were 3-0 winners at Wycombe, scoring twice in the first five minutes and missing a ninth-minute penalty in the League One clash.\nCaldwell had his players training at 05:00 and and doing surprise extra drills over the summer.\n\"Mentality is a big thing,\" Caldwell told BBC Radio Devon.\n\"Getting up at five o'clock in the morning to go to the gym, doing a run where they didn't know how long or how far or how fast they had to run - we've challenged them in different ways.\n\"We finished training sessions and then put on another drill at the end with press-ups and sit-ups and different things to push their mind, to push the boundaries that they have.\n\"I think we saw a team with a real aggressive mentality, but in moments we saw the quality that we can have as well.\n\"That's something that will develop over the coming weeks because this is only the second time that this group of players have played together and they still have to build those relationships within the team to get to the team we want to be.\"", "url": "https://www.bbc.com/sport/football/66421733"}