{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:45", "date_modify": "2025-05-21 06:45:45", "date_publish": "2025-03-30 16:30:49", "description": "Maeda central switch 'eases summer transfer plans' - Rodgers", "filename": "sport_articles_cd9ldzg2xy3o_1747809945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7195/live/5a6264c0-0d83-11f0-a1c5-cd0d1898b025.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd9ldzg2xy3o_1747809945.html", "title": "Maeda central switch 'eases summer transfer plans' - Rodgers", "title_page": "Maeda central switch 'eases summer transfer plans' - Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daizen Maeda's emergence as a number nine could take the pressure off Celtic's summer transfer window plans, as Brendan Rodgers admitted it would be \"easier\" to sign another winger.\nAfter Kyogo Furuhashi's departure to France in the winter window, Rodgers was criticised by some for not bringing in an immediate replacement.\nInstead, the manager relied on summer signing Adam Idah to fill the gap, with Maeda also moved into a central role.\nThe Japanese forward has now enjoyed his most prolific campaign yet, and has now scored in his last seven games.\n\"He can be,\" Rodgers said when asked if Maeda can be an out-and-out striker. \"It's one where if we were to move him back on to the side and take him out of the middle, with all due respect it's probably easier for us to bring in a top winger than it would be a top striker.\n\"But he can clearly play the position and I am so happy that he can.\"\nMaeda's double against Hearts on Saturday took his tally to 30 for the season, with half of those coming since Kyogo's exit.\n\"In my first pre-season back out in Japan, he scored a hat-trick,\" Rodgers said of Maeda. \"I could see his movement and his runs and his finishing.\n\"Of course, we had Kyogo here with Adam Idah. But I always like to have a press at the top end of the pitch who brings intensity to the game. For me, he brings that with the runs. And goals.\"", "url": "https://www.bbc.com/sport/articles/cd9ldzg2xy3o"}