{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-20 14:01:49", "date_modify": "2025-05-20 14:01:49", "date_publish": "2023-07-30 13:59:30", "description": "A look at the four Rugby Championship teams as the countdown to the World Cup in France gathers pace.", "filename": "sport_rugby-union_66349863_1747749709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1465C/production/_130584538_gettyimages-1578430304.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66349863_1747749709.html", "title": "Rugby Championship 2023: What have we learned as teams gear up for the World Cup?", "title_page": "Rugby Championship 2023: What have we learned as teams gear up for the World Cup? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The southern hemisphere sides have had their final competitive run-outs before the autumn's Rugby World Cup.\nThe 2023 Rugby Championship, shortened to accommodate the final build-up to France 2023, was won by New Zealand for the third year in a row.\nWhat have we learned about the All Blacks, Eddie Jones' Australia, reigning world champions South Africa and Argentina before rugby's biggest showpiece starts in September?\nIn 2021 there were serious doubts whether Ian Foster was the right man to lead the All Blacks into the World Cup. A home-series defeat by Ireland the following year added to the pressure before a 35-23 win over the Springboks ended a three-match losing streak and saved his job.\nBacked to see out the France 2023 cycle,, external Foster has overseen a 10-match unbeaten run and got his side playing the type of rugby that makes other nations sit up and take notice.\nThe debate if star backs Richie Mo'unga and Beauden Barrett can play together has now been ended, with the change to deploy Jordie Barrett as an inside centre seemingly offering much-needed balance to the backline. Shannon Frizell in the back row has been one of the finds of the tournament, with his power and dynamism.\nNew Zealand played their best rugby in the tournament during a 15-minute blitz of South Africa which saw them score 17 unanswered points. Former Ireland head coach Joe Schmidt joined as attack coach last August and has been a big factor in the turn in form.\nThat upturn in form will now bring a different kind of pressure, with the New Zealand media and public expecting big things at the World Cup.\"We know that we had some growing up to do as a team,\" Foster said after his side's 38-7 victory over Australia sealed the title on Saturday. \"So far we've taken three pretty strong steps forward, which we're pretty proud of, but I'm not sure it's quite enough just yet.\"\nIt was always a big ask when Eddie Jones took the Australia job in January to turn around the fortunes of the Wallabies in just a couple of months. Whereas New Zealand kept faith in Foster, Australia sacked Dave Rennie hoping for a quick fix.\nJones went on a 17-match winning streak when he took over the England job in 2015 before being sacked after a poor run of results last autumn. Australia hoped the 63-year-old could recreate his initial winning streak but instead his poor run has continued with three successive defeats with his new side.\nAustralia fell to a miserable 43-12 defeat in the opening round against a much-changed South Africa - who had sent the majority of their strongest XV to New Zealand.\nWhat followed was a crushing late defeat by Argentina before a hammering at the hands of New Zealand.\n\"It's still a work in progress,\" Jones said after the defeat by New Zealand. \"I've coached teams like this before and you can turn it around.\"\nOne thing we have learnt is that Jones will remain his usual spiky self with the media, proven by his pre-match remarks about what would happen if New Zealand lost.\n\"It's not just rugby that sinks, the country sinks,\" he said. \"The whole economy goes down. The prime minister is there with his fingers crossed hoping the All Blacks win.\"\nJones will need his talking to translate to the pitch sooner rather than later.\nTwo wins and a loss for South Africa without their inspirational leader Siya Kolisi and playmaker Handre Pollard helped prove once again the strength of South African rugby.\nManie Libbok, 26, had successful outings at fly-half against Australia and Argentina, but there was less success for Damian Willemse in the thrashing by New Zealand.\nPollard is expected to be fit for the World Cup but with his injury record the Springboks may need a fresh option at 10 and Libbok, a United Rugby Championship winner last year, proved he is capable of stepping in and running the side.\nThe Boks made nine changes for Saturday's final game against Argentina with the decision to start winger Kurt-Lee Arendse - who scored a hat-trick against Australia - ahead of Makazole Mapimpi evidence that form is being rewarded in the Springbok camp.\nPhysical forwards RG Snyman and Duane Vermeulen both came back into the South Africa side after time away.\nThey demonstrated the importance of experience on Saturday as South Africa kept Argentina try-less for 75 minutes in a 22-21 win that pleased coach Jacques Nienaber following his side's humbling by New Zealand.\n\"We had a proper defence session,\" Nienaber said. \"Our defence was quite poor in the first 17 minutes against New Zealand but there was a massive improvement.\n\"The World Cup is going to be incredibly close and you can easily become shell-shocked when the opposition has all the momentum.\"\nSouth Africa are doing what South Africa do - they will time their peak for the World Cup.\nSince taking over as head coach in 2022, Michael Cheika has beaten New Zealand, England and Australia.\nArgentina are on the opposite side of the World Cup draw to South Africa, Ireland, France and New Zealand and will be quietly confident after another solid Rugby Championship.\nDespite a tough opening round defeat by the All Blacks, the Pumas beat Australia with a last-minute Juan Martin Gonzalez try.\nArgentina then offered South Africa plenty of problems at Ellis Park in Johannesburg, losing by a point, a result which may have been different had Gloucester fly-half Santiago Carreras not missed two second-half penalties.\nArgentina have played two of their three games away from home in the 2023 Rugby Championship and have shown they can consistently compete at the top level.\nBut Cheika's side, who face England in their World Cup opener on 9 September, will need to convert possession into points if they are to match, or even improve on, their two World Cup semi-finals in 2007 and 2015.\nWinger Mateo Carreras has been catching the eye on a weekly basis in the Premiership for Newcastle and his solo effort against Australia and finish against South Africa are an indication he is ready to do the same at international level. He is certainly someone England need to keep an eye on.", "url": "https://www.bbc.com/sport/rugby-union/66349863"}