{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:16:24", "date_modify": "2025-05-19 15:16:24", "date_publish": "2015-03-05 21:08:01", "description": "The 'Eric Cantona' of racing and a 'little tank' - retiring jockey AP McCoy lists his 10 favourite horses he has ridden.", "filename": "sport_horse-racing_31737340_1747667784.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81418000/jpg/_81418375_ap_mccoy_pa5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_horse-racing_31737340_1747667784.html", "title": "AP McCoy: Jockey reveals the 10 favourite horses he has ridden", "title_page": "AP McCoy: Jockey reveals the 10 favourite horses he has ridden - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Retiring jockey AP McCoy has revealed the 10 favourite horses he has ridden as he prepares to compete at the Cheltenham Festival for the final time.\nFrom an estimated 16,000 mounts, the 19-time champion drew up a shortlist for a special programme on BBC Radio 5 live.\nFrom the best Gold Cup horse of his lifetime to the 'Eric Cantona' of racing, the 40-year-old Northern Irishman recalls his equine greats, with tears and cheers along the way.\nTrainer: Christy Roche. Big McCoy wins: Powers Gold Cup, Mildmay Novices' Chase 2005\n\"She was one of the very few horses that has won a Grade One bumper, a Grade One hurdle race and a Grade One chase. She was very big, strong and bullish for a mare. She was well able to hold her own.\n\"JP (McManus, for whom McCoy is retained rider) owned her. He was obviously a gambler in his younger days but now it's about the love of the sport. It's more about horses winning, whether that be at Plumpton on a Monday or Thurles on Thursday or Cheltenham in March.\"\n\"Cyfor Malta was the apple of Martin Pipe's eye from an early stage. I don't think I've ever seen him have that much affection for a horse.\n\"He won the Pillar Chase but sadly got injured. The horses that were second and third, See More Business and Go Ballistics, were first and second in the Cheltenham Gold Cup.\n\"He was a Gold Cup winner waiting to happen. He was a model - he had the looks, he had the talent - if he was a human being, you'd hate him. He had a little bit of the Eric Cantona about him.\"\nTrainer: Francois Doumen. Big McCoy win: Long Distance Hurdle 2004\n\"A very good staying hurdler. Really relaxed horse, a good traveller. He had a lot of class about him and found things very easy.\n\"It was like he knew where the winning post was. I don't think he was the type who would have over-stressed himself.\"\nTrainer: Martin Pipe. Big McCoy win: Arkle Chase 2004\n\"In the Arkle Chase, I took it upon myself to take my time and get him relaxed. I thought if this isn't going to work out I'm not going to be popular. At that stage I was never tied down to any riding instructions.\n\"Martin pretty much let me make the decision. Luckily he managed to race round and beat Kicking King, who went on to win the Gold Cup and a couple of King Georges.\"\nTrainer: Martin Pipe. Big McCoy win: Feltham Novices' Chase 1999\n\"We had a decision to make whether to run in the Sun Alliance Chase or the Cheltenham Gold Cup.\n\"He had been working extremely well. I agreed with the decision to run him in the Gold Cup. He was after beating seasoned chasers. Sadly he got fatally injured. If he hadn't got injured, I think he would have won. That's one of the toughest things about the sport when you see a horse like that with so much potential - horses you dream about.\n\"It's a tough thing to take. I didn't ride after that at Cheltenham that year. I can remember that night after the Gold Cup crying because I thought he was a superstar. You find it very hard to get over. I still think about Gloria Victis now and it's 15 years since I rode him.\"\n\"Ruby Walsh rode him a lot. He's probably as impressive a horse as I've ever seen. I think he won the Champion Chase by 17 lengths or something ridiculous.\n\"I rode him twice when Ruby was injured and won the Tingle Creek Chase. He was a brilliant jumper. He was a very robust horse, he had plenty of width and could almost have been a sprinter. He rode like a little tank. He was so dominant at the time.\"\nTrainer: Paul Nicholls. Big McCoy wins: Long Distance Hurdle, Long Walk Hurdle 2010\n\"I didn't ride him a lot of times but again rode him twice when Ruby was injured. He's possibly as good a staying hurdler as there's ever been.\n\"They were his horses but having been lucky enough to ride them twice, because they were so good, I don't think it would be right to leave them off the list.\"\nTrainer: Henrietta Knight. Big McCoy wins: King George VI Chase 2002\n\"Best Mate is the best Gold Cup horse I have seen in my time. He was the perfect Gold Cup horse. There's no corner given no let-up in the pace, and he was always there at the finish.\n\"Again, I only rode him twice, and won a King George , externalon him and would love to have ridden him more. Injuries as a jockey are part and parcel of the game. Injuries are not only painful, it's painful when you can't ride those good horses.\"\nTrainer: Jonjo O'Neill. Big McCoy win: Welsh National 2011, Lexus Chase 2011, Cheltenham Gold Cup 2012\n\"The mother of Synchronised, Mayasta, was my first winner for JP in 1996 and Synchronised gave me the greatest day in racing. JP spent his whole life trying to buy a Gold Cup horse, and his wife bred one for him.\n\"He was a bit like I am as a human being. He probably wasn't the greatest horse I'd ridden but he had the greatest will to win.\n\"As a jump jockey I've seen the human side of horse racing be really tough, but in equine terms what happened to Synchronised (suffered a fatal injury in the 2012 Grand National) was the worst day I've had in racing.\n\"When he fell I can distinctly remember him galloping off. I remember being in pain but thinking at least the horse is all right. Afterwards when he was loose he managed to get injured.\n\"I was very sore, but I cried for days afterwards. That affected me more than any other horse.\n\"It's personal and that's why he's number one.\"\nListen to the full interview on the 5 live Sport section of the BBC podcasts and downloads page.", "url": "https://www.bbc.com/sport/horse-racing/31737340"}