{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:23:23", "date_modify": "2025-05-21 06:23:23", "date_publish": "2025-03-31 13:41:16", "description": "Norwegian club Bryne FK give goalkeeper Jan de Boer dozens of eggs as man of the match award.", "filename": "sport_football_articles_cgenyd0q89no_1747808603.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5da4/live/a70fbc80-0e34-11f0-a4bb-6b40441fc890.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgenyd0q89no_1747808603.html", "title": "Norwegian club Bryne FK give eggs to goalkeeper as man of the match award", "title_page": "Norwegian club Bryne FK give eggs to goalkeeper as man of the match award - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was once customary for Premier League players to be gifted a bottle of champagne as reward for winning man of the match.\nTimes have moved on since then, with players now receiving a small trophy in recognition of their display.\nBut Norwegian club Bryne FK - where Manchester City forward Erling Haaland started his career - have come up with a novel approach by awarding eggs to their player of the match.\nThe club, based in the south-west of Norway close to the city of Stavanger, were promoted back to the top-flight last season for the first time since 2003.\nThey were beaten 1-0 by Europa League quarter-finalists Bodo/Glimt in their first fixture back in the top division on Sunday.\nBut they were kept in the match by goalkeeper Jan de Boer, who pulled off a string of fine stops and saved a second-half penalty.\nThe Dutchman's reward? Four trays of eggs, of course.\nThe prize is a nod to the club's ties with local agriculture, which is dominated by meat and dairy production.\nSuch is the association with farming, supporters are often heard chanting \"we are farmers and we are proud of it\" at matches, and there are 'VIP' tickets on sale for fans to watch games from a pitchside tractor.\nBut any Bryne player hoping to get their hands on eggs next week will be disappointed because the club say their player of the match against Kristiansund on 6 April will be given cartons of local milk.", "url": "https://www.bbc.com/sport/football/articles/cgenyd0q89no"}