{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-20 14:16:38", "date_modify": "2025-05-20 14:16:38", "date_publish": "2023-07-29 16:34:54", "description": "Michael Dunlop secures five wins at the Armoy road races for the second time in his career as he reclaims the feature 'Race of Legends' crown.", "filename": "sport_northern-ireland_66350461_1747750598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E8F6/production/_130583695_dunlopodium.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_northern-ireland_66350461_1747750598.html", "title": "Armoy road races: Michael Dunlop secures five-timer for second time at county Antrim circuit", "title_page": "Armoy road races: Michael Dunlop secures five-timer for second time at county Antrim circuit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Dunlop secured five wins at the Armoy road races for the second time in his career as he reclaimed the feature 'Race of Legends' crown on Saturday.\nThe 34-year-old also won five races at the 2021 meeting.\nRiding a Honda, Dunlop won the main race comprehensively by 16.9 seconds from Mike Browne, having earlier also won the Open race on his 1000cc bike.\nThe Ballymoney rider won both Supersport races and the Supertwins to take his total Armoy tally to 29 wins.\nDunlop had won the 'Race of Legends' event nine times in succession between 2011 and 2021 but did not race at the event 12 months ago following a dispute with the organisers, Davey Todd collecting four successes on that occasion.\nThe 25-times TT winner was in total command from the start of this year's six-lap race held in wet conditions, pulling out a lead of 6.45 seconds after lap one and extending that to 11.4 seconds after his second circuit of the three-mile course.\nHis win took his tally of Superbike successes at Armoy to 18 and number of triumphs in the feature race to 10.\nBy the finish, Browne was 10 seconds ahead of third-placed man Derek Sheils.\nTodd led off the line in the Open race but Dunlop hit the front on lap one and ended with a 0.7 seconds advantage over the Yorkshireman at the chequered flag.\nMilenco by Padgett's Honda pilot Todd stayed in close attendance of the leader with a lap at 108.043mph but was unable to overhaul the Ballymoney rider.\nSheils completed the rostrum in third and set the fastest lap of the race at 108.231mph, just shy of Todd's course record benchmark of 108.534 set 12 months ago.\nBrowne, Dean Harrison and Paul Jordan completed the top six leaderboard.\nDunlop won Friday's Supersport opener in lap record-breaking fashion and made it a double in the middleweight class by taking a dominant victory in Saturday's event which was re-started twice and eventually held over five laps.\nThe race was initially halted because of an incident at Acheson's Leap on the opening lap and the re-run red-flagged as rain fell around the circuit.\nMD Racing 600cc Yamaha-mounted Dunlop enjoyed an advantage of 5.7 seconds over Browne by the finish, with Todd a further 1.5 seconds in arrears in third.\nThey were followed across the line by McLean, Harrison and Jordan.", "url": "https://www.bbc.com/sport/northern-ireland/66350461"}