{"authors": ["Joe Bradshaw", "www.facebook.com"], "date_download": "2025-04-26 08:00:02", "date_modify": "2025-04-26 08:00:02", "date_publish": "2025-02-25 10:58:45", "description": "Tottenham news: Four reasons Spurs have improved", "filename": "sport_football_articles_c234v9nel0go_1745654402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93e3/live/7c06dce0-f2bd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c234v9nel0go_1745654402.html", "title": "Tottenham news: Four reasons Spurs have improved", "title_page": "Tottenham news: Four reasons Spurs have improved - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arguably the high point of a miserable season for Ange Postecoglou came in the Manchester rain in November as his Tottenham side obliterated champions Manchester City's two-year unbeaten run at Etihad Stadium.\nIn three months of subsequent struggle, Spurs won just one league game in 11 matches and plunged down the table.\nHowever, they enter Wednesday's rematch with Pep Guardiola's side in their best spot since that 4-1 victory at City after three straight Premier League wins.\nBut what's changed for Spurs? Here are four reasons life suddenly seems a bit rosier.\nSchedule\nThat Manchester City win came after a two-week international break. Since then, Tottenham played every midweek until after the FA Cup defeat at Aston Villa on Sunday, 9 February.\nThe cliche goes that constantly playing Sunday-Thursday wrecks seasons. Given Tottenham's extensive injury list, that old adage has proved accurate.\nAnd, how interesting that given two free midweeks, Spurs have cleaned up the following weekends by beating Manchester United and Ipswich Town.\nPersonnel\nKeeper Guglielmo Vicario missed 12 league games after that win at City and Spurs shipped 24 goals in that time. His calming presence has meant only one goal let in during the past two games.\nA huge positive from the injuries has been the flourishing of Djed Spence. With left-back Destiny Udogie fit again to start at Portman Road at the weekend, Spence switched to his more natural right-hand side and is keeping Pedro Porro out of the side. These are simply options Postecoglou has not had.\nIt has been a strange season for vice-captain James Maddison, starting just 16 games. But a goal and assist in the two recent wins since his comeback from injury have also helped lift Spurs.\nAnd don't underestimate the importance of Brennan Johnson. Missing since the defeat at Arsenal, he bagged two goals at Ipswich to add to his impressive 14 in 34 games this season.\nClearly, he is an important part of how Postecoglou wants his Spurs team to operate.", "url": "https://www.bbc.co.uk/sport/football/articles/c234v9nel0go"}