{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:44:11", "date_modify": "2025-05-21 03:44:11", "date_publish": "2025-04-06 15:40:26", "description": "Warrington edge out St Helens 20-12 to reach the Betfred Challenge Cup semi-finals in a pulsating clash at The Halliwell Jones Stadium.", "filename": "sport_rugby-league_articles_cvgpx747p94o_1747799051.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8bd/live/d9e688d0-12ff-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cvgpx747p94o_1747799051.html", "title": "Challenge Cup: Warrington Wolves 20-12 St Helens", "title_page": "Challenge Cup: Warrington Wolves 20-12 St Helens - Wire reach semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warrington Wolves edged out St Helens to reach the Betfred Challenge Cup semi-finals in a pulsating clash at The Halliwell Jones Stadium.\nTries from Matt Dufty and Ben Currie put the hosts in control, before player of the match George Williams crossed for the decisive try.\nTristan Sailor and Daryl Clark replied for 13-time cup winners Saints, but Warrington's quality in attack told in the end.\nThey will meet Leigh Leopards for a place in the final and chance of their first cup triumph since 2019, while Hull KR face Catalans in the other last-four tie.\nAfter a strong start from St Helens, Warrington opened the scoring against the run of play through Dufty. The full-back crossed the line after a smart pass from Williams, after a desperate pass from James Harrison kept the attack alive. Marc Sneyd converted from close range to make it 6-0.\nSaints thought they had hit back when Sailor burst through to tap down a searching kick from Jonny Lomax as the ball reached touch, initially given as a no try. It went to a review, and the video referee confirmed the referee's decision.\nJust before the break, though, the visitors levelled through a similar move. Sailor again grounded a Lomax kick, but timed it better and the video referee confirmed it. Jon Bennison ensured the scores were level at the break with the conversion after regular kicker Mark Percival went off with a head injury.\nMatty Ashton squandered a wonderful chance for a second Warrington try five minutes after the restart. After a superb break, he failed to square to Dufty and was denied by Jack Welsby. Sneyd did restore their lead minutes later with a penalty for offside, but it should have been more.\nBoth sides went close again as they traded blows. Joe Batchelor lost possession before reaching the line for Saints, confirmed by the video referee, before an Ashton try was ruled out due to a forward pass at the other end.\nBut on 55 minutes, Warrington finally scored a second try through Currie. Williams' kick bounced perfectly for him to run through and touch down under the posts. Sneyd converted to stretch their lead to eight points.\nIt took only five minutes for Saints to hit back, though. Clark crossed after a Wolves knock-on was picked up by Moses Mbye, and Bennison converted to make it 14-12.\nWith the game on a knife edge, it was fitting Williams had the final say, and in emphatic fashion. He jinked his way into space and drove down the right wing to cross, with Sneyd duly adding the extras to seal success for the nine-time Challenge Cup winners.", "url": "https://www.bbc.com/sport/rugby-league/articles/cvgpx747p94o"}