{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 07:37:31", "date_modify": "2025-05-21 07:37:31", "date_publish": "2025-03-28 12:50:48", "description": "St Mirren boss Stephen Robinson is upset by the \"double punishment\" of Toyosi Olusanya's suspension after the Scottish FA acknowledge a mistake was made issuing the striker with a second yellow card away to Motherwell.", "filename": "sport_football_articles_cx2r20jk7w2o_1747813051.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d9e/live/27cf2cb0-0bcf-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2r20jk7w2o_1747813051.html", "title": "St Mirren fume at 'double punishment' as Olusanya dismissal is deemed mistake", "title_page": "St Mirren fume at 'double punishment' as Olusanya dismissal is deemed mistake - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Mirren manager Stephen Robinson is lamenting the \"double punishment\" of Toyosi Olusanya's suspension this weekend after a \"blatantly wrong\" dismissal against Motherwell.\nRobinson revealed the Scottish FA have since acknowledged that referee Grant Irvine was wrong to issue the striker a second yellow card at Fir Park.\nSince bookings can only be challenged on grounds of mistaken identity or simulation, Olusanya misses out against Kilmarnock on Saturday.\nAnd Robinson insists this is the third time this season his side have been victims of such miscarriages of justice.\n''It shouldn't have happened, it shouldn't have led to a red card,\" he said of Olusanya's collision with opponent Dan Casey in the 2-2 draw.\n\"We had to play more than 20 minutes with 10 men, which we have done brilliantly and should have won the game.\n\"They can't review it and we get a double punishment. When it leads to a red and it's blatantly wrong then it should be reviewed. We all knew it was a mistake at the time.\"\nRobinson's side are four points behind sixth-placed Hearts with three games remaining before the split.\n\"We're not the only team this has happened to, these decisions are huge in terms of your finishing position in the league,\" he added. \"You get your apology but unfortunately, it doesn't change anything.\"\nThe St Mirren boss went on to say that Scott Tanser had twice suffered because of a similar errors from officials this season - in games against Motherwell and Ross County.\n\"That's now three times that has happened,\" he added. \"It's double punishment, which is incredible.\"", "url": "https://www.bbc.com/sport/football/articles/cx2r20jk7w2o"}