{"authors": ["Thomas Woods", "www.facebook.com"], "date_download": "2025-05-21 06:45:06", "date_modify": "2025-05-21 06:45:06", "date_publish": "2024-12-24 08:35:13", "description": "Will Boxing Day bring a reversal of fortunes for Manchester City? Thomas Woods thinks so, with three players in the team of the week including big-money Erling Haaland.", "filename": "sport_football_articles_cd607l90487o_1747809906.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94dd/live/5c7eb340-bf9e-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd607l90487o_1747809906.html", "title": "FPL tips and team of gameweek 18: Erling Haaland is in this week", "title_page": "FPL tips and team of gameweek 18: Erling Haaland is in this week - expect Manchester City to bounce back - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It looks very much like there will be a Boxing Day bonanza for Fantasy Premier League players, with the top three all at home including Liverpool against a leaky Leicester City side.\nStruggling champions Manchester City also have what would, in normal times, be a plum home game for them against Everton.\nHowever, it is also prime rotation season so who, aside from the obvious big names, should you target this week?\nBukayo Saka's injury at least makes picking between premium assets a touch easier.\nThe team of the week is selected based on current FPL prices to fit within a £100m budget, as if you were playing a Free Hit.\nLukasz Fabianski, West Ham, goalkeeper, £4.1m - away at Southampton\nWest Ham haven't been watertight at the back this season but Fabianski is as cheap as they get and faces the league's lowest scoring team.\nGiven the cost of the rest of this week's team, he makes a lot of sense.\nTrent Alexander-Arnold, Liverpool, £7.1m - home to Leicester City\nSix clean sheets and four assists is not a lot for this FPL legend with half the season gone - and he only has one double-digit week.\nThere's a slight risk he gets a rest at home to Leicester but Alexander-Arnold's upside is huge in gameweek 18.\nHe's only owned by just over one in five teams too so has become an unexpected differential.\nRico Lewis, Manchester City, £4.6m - home to Everton\nCopy, paste, updated from last week's team...\n\"Everton have failed to score in six of their past seven games so a Manchester City defensive asset is a must.\"\nLewis is the cheapest, likely to play and the best creative threat if you can't afford Josko Gvardiol.\nLewis Hall, Newcastle, £4.6m - home to Aston Villa\nBack-to-back clean sheets for Hall who has emerged as one of the best budget defenders.\nIt's hard to expect Newcastle to keep out Villa, but Hall is in the top three defenders for expected assists in the past four gameweeks (behind Alexander-Arnold and Antonee Robinson) so has that attacking potential as well.\nMohamed Salah (captain), Liverpool, £13.5m - home to Leicester City\nNo words needed - perma-captain until told otherwise.\nKevin de Bruyne, Manchester City, £9.5m - home to Everton\nI think everyone is expecting City, at some point in this awful run of defeats, to snap out of it, find form and absolutely thrash somebody.\nWell why not this week?\nDe Bruyne is a high-risk, high-upside pick in a game that could easily be 5-0 if City play like the old City.\nHe's rested and has a return every 75 minutes in his past three games.\nAntoine Semenyo, Bournemouth, £5.6m - home to Crystal Palace\nHe scored against Manchester United from one of his four shots at goal and his underlying statistics continue to be incredible.\nThe Ghana midfielder has 67 shots in 16 games this season - one away from four per game - and those kind of numbers mean you're always in with a shout of a return.\nThe home game with Palace could be one for goals - so pick Semenyo with confidence.\nMohammed Kudus, West Ham, £6.2m - away at Southampton\nThese next two midfield picks might seem a bit knee-jerk, as both scored in gameweek 17, but you'll have to take my word for it that I picked this team before they did. Honest!\nEither way, Kudus is the way into the Hammers attack if you can't afford Jarrod Bowen - or you just want to be different.\nThe Ghanaian is just slightly behind Bowen in all attacking stats this season - 43 shots to 36, expected goals (xG) of 4.02 to 3.56.\nSaints, despite a 0-0 at Fulham last time, are still a team to target with forward players.\nIsmaila Sarr, Crystal Palace, £5.7m - away at Bournemouth\nWith Eberechi Eze potentially out again, Sarr has a chance to be a central figure for Palace in a game that could turn into a thriller.\nThe Senegal winger has four returns in his past two games, and seven returns in just 10 starts this season.\nWith a very enticing run of games all the way until the start of March, Sarr presents a great budget option in midfield.", "url": "https://www.bbc.com/sport/football/articles/cd607l90487o"}