{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:45", "date_modify": "2025-05-21 03:50:45", "date_publish": "2025-04-07 10:57:34", "description": "Crystal Palace 2-1 Brighton: Fan views on Premier League game", "filename": "sport_football_articles_cqx49w83y2jo_1747799445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx49w83y2jo_1747799445.html", "title": "Crystal Palace 2-1 Brighton: Fan views on Premier League game", "title_page": "Crystal Palace 2-1 Brighton: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Saturday's Premier League game between Crystal Palace and Brighton.\nHere are some of your comments:\nPalace fans\nAndy: The Eagles clipping the Seagulls' wings this season! A great game. It's a shame we will lose Marc Guehi for the next couple of Premier League games but what a trooper Maxence Lacroix is!\nSam: What a dramatic derby! The purest form of digging in, getting your head down and defending with gritted teeth. An unbelievable climax with three early exits - I noticed the score was 2-1 on goals and red cards! An exhilarating game of football - and wonderful to have won it in the end.\nMichael: When you can grind out a win like that, when the chips are down, it says a lot about the determination and will to win from the team. We saw that in particular when we lost two players and Brighton were sensing a win. Not to mention what it says about the manager, Oliver Glasner, who has given the team the belief that if they keep going, they can win.\nBen: Palace are riding high, although we do make it hard for ourselves at times! We have quite good strength in depth for once. Though, in my opinion, Daichi Kamada is not good enough. I know he did a couple of good things in this game but he is still not good enough for the Premier League, nor is Eddie Nketiah. The rest of the team is top quality.\nBrighton fans\nClive: Three games, three losses. That defines the season and the manager's lack of tactical knowhow. The same excuses. Slow, ponderous and predictable.\nFran: After the last two defeats, you would think that we would be up for it against Palace but it seems we are having problems raising it, even against them! Really disappointing and I'm not sure what the problem is? The players, manager or system? Or all three! We really need to do it against Leicester next week, otherwise our season is over. We need to forget about Europe and just finish as high as we can.\nDavid: Hopeless. No attacking ideas at all. We couldn't even score against nine men. Since losing on penalties in the FA Cup quarter-final, they seem to have lost interest.", "url": "https://www.bbc.com/sport/football/articles/cqx49w83y2jo"}