{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:23:49", "date_modify": "2025-05-21 06:23:49", "date_publish": "2025-02-08 14:49:50", "description": "American Breezy Johnson wins the women's downhill title at the World Ski Championships after returning from a 14-month ban.", "filename": "sport_articles_cvg87nzppplo_1747808629.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6397/live/08744cc0-e626-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvg87nzppplo_1747808629.html", "title": "Alpine World Ski Championships: USA's Breezy Johnson wins women's downhill gold after 14-month ban", "title_page": "Alpine World Ski Championships: USA's Breezy Johnson wins women's downhill gold after 14-month ban - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "American Breezy Johnson won women's World Championship downhill gold - the first major title of her career - just weeks after returning from a 14-month ban.\nThe 29-year-old returned to the World Cup circuit in December after serving a suspension, external for three anti-doping whereabouts failures.\nJohnson, whose career has also been blighted by injuries, set a winning time of one minute 41.29 seconds with the opening run of the day in Saalbach, Austria.\n\"When I came across the line and I saw it was a low 41, I was like 'amazing',\" said Johnson, who became the first American to win women's downhill gold since Lindsey Vonn at Val d'Isere in 2009.\nShe faced an anxious wait to celebrate but no-one was able to match her time, with Austria's Mirjam Puchner taking silver 0.15 seconds behind and Czech Ester Ledecka bronze - a further 0.06 back.\nVonn, the 2010 Olympic champion making a championships comeback at the age of 40 after retiring in 2019, was 15th, having crashed out of the Super-G on Thursday.\n\"It's a little bit nerve-wracking to sit in the leader's chair but it's way harder to sit there at the top waiting for your run,\" Johnson told NBC Sports television. \"I was definitely grateful to run number one.\"\nJohnson was banned by the US Anti-Doping Agency in May for missing three drugs tests in a 12-month window, with her suspension backdated to October 2023.\nIn a post on her Instagram account,, external she said there had been \"an issue with drug testers being able to find me\", acknowledging her \"human error\" but adding \"all of my tests have been clean\".\nThe 2018 Olympian has never won a World Cup race, with a best finish of second, while the last of her seven podium finishes at the sport's elite level came in 2021.\nSwiss rookie Franjo von Allmen won the men's downhill title on Sunday in what was his first appearance at a major championships.\nThe 23-year-old became the youngest men's downhill champion in 36 years, knocking Austria's 2021 winner Vincent Kriechmayr into second place by 0.24 seconds.\nThree of the top five were Swiss, with Alexis Monney third and defending champion Marco Odermatt finishing fifth.", "url": "https://www.bbc.com/sport/articles/cvg87nzppplo"}