{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:06:28", "date_modify": "2025-05-21 04:06:28", "date_publish": "2024-12-29 00:00:00", "description": "Kevin Holt's 94th-minute header gives Dundee United a deserved Scottish Premiership victory and moves them to within three points of third-place opponents Aberdeen.", "filename": "sport_football_live_cgj6wpx2x4wt_1747800388.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgj6wpx2x4wt_1747800388.html", "title": "Dundee United vs Aberdeen: Scottish Premiership report, reaction & stats", "title_page": "Dundee United vs Aberdeen: Scottish Premiership report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United enjoyed \"probably the best feeling in football\" as Kevin Holt's 94th-minute header at a sold-out Tannadice and moved them to within three points of third-place Scottish Premiership opponents Aberdeen.\nIn an open, high-tempo contest, Jack Walton and Dimitar Mitov both made excellent saves to protect their respective clean sheets in a captivating first half.\nUnited's Walton showed excellent reflexes to palm away Ester Sokler's effort, while Aberdeen's Mitov kept out Glenn Middleton's low drive before getting up to claw away Kristijan Trapanovski's rebound header.\nTrapanovski and the league's top scorer Sam Dalby both went close after the break, as the home side pushed for victory, and it eventually came in the 94th minute.\nWill Ferry's long throw found Holt and the defender rose highest to find the bottom corner to send the home crowd into ecstasy.\n\"We send all the big boys up,\" Goodwin said. \"A great throw-in from Will Ferry and unbelievable desire from Kevin Holt.\n\"Over the balance of play I think we deserved to win. The players managed the game brilliantly - defensively outstanding again.\n\"It's probably the best feeling in football when you get that last-minute winner.\"\nThe result moves United closer to Aberdeen and Rangers, who are now five in front ahead of the side's respective derbies on Thursday.\nJimmy Thelin's visitors, though, missed the chance to move above the Ibrox side and are now winless in eight as their wretched run continues.\nIn contrast, Aberdeen look a shadow of the side that started the season in such electric style.\nThis was the type of match they found a way to win in the early stages of Thelin's tenure, but the confidence and grit of the autumn is nowhere to be seen.\nThey looked content with a draw here despite having good chances of their own, and it is a reflection of Rangers' woes that they remain in touch with the Ibrox side.\nAlthough Holt's header was excellently guided into the net, he found space in a crowded penalty area far too easily and questions will be asked of an Aberdeen defence that has become increasingly porous during this winless run.\nMidfielder Sivert Nilsen looks shattered having played for the vast majority of the calendar year and Kevin Nisbet has underwhelmed up front since arriving on loan from Millwall.\nThelin stressed throughout their unbeaten start that this was a long-term project, and you suspect he will look to strengthen in January in an attempt to halt this slide.\nDundee United manager Jim Goodwin: \"\"We're delighted with the result. We could have easily been satisfied with a point but that wasn't the case.\n\"As a group, we will remain level-headed. The target is still to accumulate enough points to ensure we are a Premiership club next season.\n\"It's been a great first half to the season. If we can follow that up it would be terrific, but we can't become complacent.\"\nAberdeen manager Jimmy Thelin: \"When you lose a game in the last situation, it's always difficult. A lot of emotions especially when you have the run we had.\n\"We have to try to recover now and go for the next challenge. The only thing for us is to try to stay together and try to be better.\n\"The performance today was quite good if you compare it to the last two, three, four games. We have to find a way back now, take this challenge and be brave.\"", "url": "https://www.bbc.com/sport/football/live/cgj6wpx2x4wt"}