{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:27:14", "date_modify": "2025-04-26 06:27:14", "date_publish": "2025-02-28 18:54:00", "description": "Aberdeen boss Thelin calm about losing 'good player' McGrath", "filename": "sport_articles_c204xplznneo_1745648834.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11bd/live/1a8ef2e0-f605-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c204xplznneo_1745648834.html", "title": "Thelin calm about losing 'good player' McGrath", "title_page": "Aberdeen boss Thelin calm about losing 'good player' McGrath - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aberdeen manager Jimmy Thelin is unflustered about failing to retain Hibs-bound Jamie McGrath after talks over extending his Pittodrie stay failed to \"find a solution\".\nThe Republic of Ireland midfielder, whose injury means he has played his last game for the Dons, has signed a pre-contract to move to Easter Road in the summer on a deal until 2029.\nAberdeen confirmed McGrath was happy to remain at the Pittodrie, \"but we were not prepared to offer him a four-year extension\".\nThelin, speaking before Sunday's visit of Dundee United, said: \"We have a good dialogue. It was a discussion about the contract - he was happy to stay but we didn't find a solution.\n\"He chose another thing for his future and we focus on our future.\n\"He has behaved really well and is a good player, but sometimes in this sport people go other directions. That's what it is.\"\nThelin is welcoming the pressure of the five remaining pre-split fixtures as his side aim to secure a top-six spot.\nThe Dons are third on 41 points, seven clear of St Mirren in seventh before Sunday's match against fifth-place Dundee United, who sit one point back.\n\"Every game now we have teams that are also quite close,\" Thelin said. \"It's an open race. We know what we need to do and every game is so, so important.\n\"That's also good - the pressure is there; you have to be sharp every week. We play at home, there's going to be a lot of fans there, a lot of emotions. It's going to be a really good Sunday I hope.\"", "url": "https://www.bbc.co.uk/sport/articles/c204xplznneo"}