{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:58", "date_modify": "2025-05-21 07:40:58", "date_publish": "2025-03-28 11:28:45", "description": "Batter Joe Root rules out becoming England's next limited-overs captain, saying the \"ship has sailed\".", "filename": "sport_cricket_articles_crknkn7vd8ko_1747813258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db2b/live/bbaf9fb0-0bc4-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_crknkn7vd8ko_1747813258.html", "title": "Joe Root rules out becoming England's white-ball captain", "title_page": "Joe Root rules out becoming England's white-ball captain  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Root says the \"ship has sailed\" over him becoming England's next limited-overs captain.\nEngland are looking for a new skipper of the one-day and T20 sides after Jos Buttler resigned following their early exit at the Champions Trophy.\nRoot, 34, captained the Test team between 2017 and 2022, and remains one of England's best 50-over batters, but has never led the side in a white-ball international.\n\"I've done my time as a captain in an England shirt but I'm sure whoever gets the opportunity to do it will be extremely proud and do a brilliant job,\" Root told Sky Sports.\n\"I think that ship's sailed.\"\nIt is a month since Buttler resigned after two-and-a-half years in the role, but there has been little public movement towards a replacement.\nManaging director Rob Key said England will not rush the decision and will consider Ben Stokes combining the job with his role as Test skipper among various other options.\nCoach Brendon McCullum has not ruled out naming separate 50-over and T20 captains. That could have allowed Root to take on the 50-over captaincy alongside a different T20 skipper, given Root is not currently in England's side in the shortest format.\nBatter Harry Brook was Buttler's vice-captain and remains another strong candidate, but there are concerns about his workload given he is a key player in all three formats.\nHe pulled out of the ongoing Indian Premier League to manage his schedule.\nKey and McCullum will also consider appointing a successful domestic captain from outside the current squads, with wicketkeeper Sam Billings telling BBC Sport earlier this month he would \"jump\" at the chance\".\nSince winning the 50-over World Cup in 2019 and the T20 title in 2022, England have had three poor showings at global tournaments, which led to Buttler's resignation.\n\"The Champions Trophy was disappointing,\" Root said of their winless group-stage exit.\n\"We didn't play anywhere near what we're capable of. There's so much talent and so much more to come from that team.\n\"It's a really good opportunity to reset and to move forward again as a group and get back to the heights that we know we're capable of and where we were in and around that 2015 to 2019 phase.\"", "url": "https://www.bbc.com/sport/cricket/articles/crknkn7vd8ko"}