{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:53:08", "date_modify": "2025-05-20 14:53:08", "date_publish": "2023-07-27 00:00:00", "description": "Relive the action from the second qualifying round matches including Derry City coming from behind to beat KuPS 2-1.", "filename": "sport_live_football_66301500_1747752788.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66301500_1747752788.html", "title": "Europa Conference League qualifiers - as it happened", "title_page": "Europa Conference League qualifiers - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's a wrap\nIt was mixed night for our trio of teams with the Candystripes the happiest after coming from behind to beat KuPS.\nCrusaders dug out an equaliser as they kept their tie against Rosenborg very much alive.\nBut it's not looking good for Linfield as they trail Pogon Szczecin by three goals going into the second leg in Poland.\nThat's all from us for now - thanks for your company.\nFULL-TIME\nCrusaders 2-2 Rosenborg\nCrusaders will go to Norway still with a chance of progressing.\nPhillip Lowry opened the scoring on the 10th minute before Carlo Holse and Ote Saeter put Svein Maalen's side in the lead just before the interval.\nBilly-Joe Burns hit an equaliser 17 minutes from time to set up the winner-takes-all tie in the Lerkendal stadium.\nFULL-TIME\nLinfield 2-5 Pogon Szczecin\nA chorus of boos ring out around Windsor Park as the home crowd voices its displeasure at the performance of Slovenian referee David Smajc.\nOnce that subsides there is a generous ovation for the home players, who put in a very good effort against a slick Polish outfit.\nFULL-TIME\nDerry City 2-1 KuPS\nDerry City come from behind to beat KuPS at the Brandywell!\nAxel Vidjeskog's spot kick gave the away side the lead on the 45th minute before Will Patching's powerful header levelled the tie.\nThe winner came 10 minutes later when Cian Kavanagh's close range strike found the back of the net.\nPost\nCrusaders 2-2 Rosenborg\nPaul Heatley goes so close to third Crusaders goal.\nJarlatih O'Rourke spots Heatley at the back post and the winger lets fly with a left-footed volley that is inches away from the Andre Hansen's bottom corner.\nThe second half has been largely subdued but there is a sense around Seaview that the hosts could find a winner with 10 minutes remaining.\nGOAL\nLinfield 2-4 Pogon Szczecin\nDefender Ben Hall volleys home a very good second goal for Linfield.\nKirk Millar gets a second chance to cross from the left and when the ball break 15 yards out, centre-back Hall steers home a crisp shot.\nFair play to Linfield, who have by no means given up.\nThere are 10 minutes left at Windsor Park.", "url": "https://www.bbc.com/sport/live/football/66301500"}