{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 03:51:35", "date_modify": "2025-05-21 03:51:35", "date_publish": "2025-04-07 10:28:28", "description": "Former Masters champion Angel Cabrera wins a seniors event as he prepares to return to Augusta for the first time in six years.", "filename": "sport_golf_articles_c8rgkddm63ko_1747799495.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1b8/live/457b8af0-147c-11f0-a455-cf1d5f751d2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c8rgkddm63ko_1747799495.html", "title": "The Masters 2025: Angel Cabrera wins on eve of Augusta return after prison", "title_page": "The Masters 2025: Angel Cabrera wins on eve of Augusta return after prison - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Masters champion Angel Cabrera is set to compete at Augusta National for the first time in six years following his release from prison.\nThe Argentine was found guilty in 2021 of numerous charges that included assault, theft and illegal intimidation against former girlfriends.\nHe was released in August 2023 after serving 30 months in South American prisons.\nAll Masters champions receive lifetime exemptions to play in the tournament but Cabrera, who also won the 2007 US Open, was unable to take up his playing privilege in 2024 because of visa issues.\nDespite the convictions, Masters chairman Fred Ridley, speaking before the 2024 tournament, called Cabrera \"one of our great champions\", adding: \"He has been unable to participate in the Masters the last couple of years due to legal issues.\n\"We certainly wish him the best of luck with that, and we'll definitely welcome him back if he's able to straighten out those legal issues.\"\nHowever, Jamie Klingler, co-founder of the Reclaim These Streets pressure group is against Cabrera being allowed to return.\nShe said: \"It seems as long as male athletes can excel at hitting a ball, we excuse those same men hitting women.\"\nCabrera was arrested in Rio de Janiero, Brazil, in January 2021. He had been on Interpol's Red Notice list, a worldwide request for police to arrest an individual, pending extradition.\nHe had been fugitive in Argentina since the previous August, after he failed to appear at a prosecutor's office following accusations of domestic violence by his partner, Cecilia Torres Mana.\nFollowing his arrest in Brazil, he was remanded in prison until his extradition to Argentina in June 2021.\nHe was then convicted and sentenced to two years in prison. In November 2022, he was convicted of a second assault and sentenced to an additional two years and four months in prison.\nEarlier this year, Cabrera told the Daily Mail: \"Right now, I'm fine, but I regret everything that I have done wrongly in my past, and I am also frustrated that I dumped very, very important years of my life. I made mistakes.\"\nCabrera, according to a report in Sports Illustrated,, external did not touch a golf club for three years but on his release from prison was taken a set by his long-time coach, mentor and friend Charlie Epps.\nThe 81-year-old Epps said \"golf is all he has left\".\nOn Sunday the 55-year-old won his first strokeplay title since being freed. He also triumphed in a matchplay event on the Legends Tour in England in June 2024.\n\"It's emotional after everything that I've gone through,\" said Cabrera after winning the James Hardie Pro Football Hall of Fame Invitational, a PGA Tour-sanctioned seniors event in Florida.\nCabrera, who won a play-off to win the Green Jacket in 2009 and also lost one in 2013 to Adam Scott, last played in the Masters in 2019.\nHe will also return to the annual Champions Dinner on Tuesday at Augusta National, which sees all past winners gather for a meal whose menu is chosen by the defending champion.\nHost Ben Crenshaw - who won the 1984 and 1995 Masters - said: \"I'm excited to see Angel.\n\"The focus of the dinner will be on Scottie [Scheffler, the reigning champion], but it'll be great to have Angel back.\"\nBefore last year's Masters, Cabrera told Golf Digest: \"It is my dream to return to that prestigious place.\n\"I played at Augusta for almost 20 years in a row. It is like a second home to me. It would be a great privilege to return and attend the champions dinner with so many of the world's greatest players.\"", "url": "https://www.bbc.com/sport/golf/articles/c8rgkddm63ko"}