{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 03:48:10", "date_modify": "2025-05-21 03:48:10", "date_publish": "2025-04-07 12:30:59", "description": "After what he calls a \"special day\" in La Rochelle on Saturday, Munster's head of rugby operations Ian Costello says the province are targeting three more such occasions in the Investec Champions Cup this season.", "filename": "sport_rugby-union_articles_czrvl3lp2vno_1747799290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/813a/live/db112520-130a-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_czrvl3lp2vno_1747799290.html", "title": "Champions Cup: La Rochelle win cannot be Munster's 'cup final' says Ian Costello", "title_page": "Champions Cup: La Rochelle win cannot be Munster's 'cup final' says Ian Costello - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After what he called a \"special day\" in La Rochelle on Saturday, Munster's head of rugby operations Ian Costello said the province are targeting three more such occasions in the Investec Champions Cup this season.\nThe 25-24 win over Ronan O'Gara's side in the last-16 stage set up a quarter-final away to Bordeaux-Begles this Saturday and Costello wants to ensure that the win in La Rochelle is not viewed as a \"cup final\" for the group.\n\"The reality is now we want to have three more days like this,\" he said after the dramatic win in the Stade Marcel-Deflandre.\n\"You take one game at a time, but there's no point in this being our cup final. It would nearly disrespect what the club have done.\n\"We've three matches left to have a crack at winning a trophy.\"\nCostello praised the visiting Munster supporters who travelled to La Rochelle in huge numbers\n\"I went down to meet a few friends just to get out of the hotel for an hour and it was shivers down your neck stuff,\" he said.\n\"I hadn't seen anything like that for a long, long time.\n\"That set the tone. What it means to our supporters.\n\"There was talk of 2,000 [Munster fans] here, there were way more than 2,000.\"\nWith only seven days between visits to France, it is unlikely the Munster support will travel in such numbers to the Stade Chaban-Delmas this weekend, although Costello is sure some will try.\n\"There'll be kids' piggybanks raided,\" he joked.\n\"There'll be people here, that's the magic of it.\n\"There's people that would prefer not to go on summer holidays to get two weekends like this. That's what's special about the club.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/czrvl3lp2vno"}