{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 04:58:28", "date_modify": "2025-05-21 04:58:28", "date_publish": "2025-04-04 12:28:39", "description": "Pep Guardiola press conference: Kevin de Bruyne exit", "filename": "sport_football_articles_cy5r3wng5eko_1747803508.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deec/live/405a9a50-4922-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5r3wng5eko_1747803508.html", "title": "Pep Guardiola press conference: Kevin de Bruyne exit", "title_page": "Pep Guardiola press conference: Kevin de Bruyne exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Guardiola began by reacting to the news: \"A sad day and a happy day for the fact we lived this time with him - what he gave to all of us, his humanity. It's not necessary to tell his success with us in the last decade - impossible to imagine without him. A sad day because a part of us is leaving.\"\nHe hailed the Belgian as \"one of the greatest midfielders ever to have played in this country\", whose longevity makes him \"unique\" and who will always be \"part of the family of this club\".\nHe added he will \"bet a lot of money\" the 33-year-old will have a statue built of him at the club.\nGuardiola was asked if De Bruyne will remain a City player in time to play in the Club World Cup this summer and said it is \"a good question\" but he does not know: \"I think he has to decide. We have to talk because now with the World Cup it's new, and the expiry of his contract. I think the club has to talk to him or he has to say what he wants to do.\"\nOn the circumstances around De Bruyne's exit: \"I knew it days ago. It was nice. Always we had a special relationship. Kevin is a special person, a special player. A special person and a special player should be treated in a special way, and we had a conversation with that of course.\"\nOn his feelings towards the decision: \"An emotional moment. With Sergio [Aguero] for example, it wasn't easy for me to tell him we wouldn't continue. This situation is always so difficult; emotions are there, they give us too much! We are going to enjoy the last two months here together, but of course it's emotionally tough and difficult.\"\nDoes he feel it is the right time to part ways?: \"What is important is that he feels good right now. We spoke recently that he had problems because after surgery in hamstring he had problems in other parts of the body. Now, finally, he feels ready.\"", "url": "https://www.bbc.com/sport/football/articles/cy5r3wng5eko"}