{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:45", "date_modify": "2025-05-21 05:49:45", "date_publish": "2025-02-08 19:15:00", "description": "Cardiff City: Riza disappointed by Stoke fans booing Aaron Ramsey", "filename": "sport_football_articles_cedn4v3pvw6o_1747806585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56ab/live/08c75220-e64f-11ef-b91b-8b34a7f650cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cedn4v3pvw6o_1747806585.html", "title": "Cardiff City: Riza disappointed by Stoke fans booing Aaron Ramsey", "title_page": "Cardiff City: Riza disappointed by Stoke fans booing Aaron Ramsey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City manager Omer Riza says he was disappointed by Stoke City fans booing Aaron Ramsey on his latest return from injury.\nStoke's supporters jeered the Wales captain every time he touched the ball during Cardiff's FA Cup win at the Bet365 Stadium on Saturday, his first club appearance since August.\nBut the reason for such treatment from the Potters' fans was another injury, as it was at the same ground that, in 2010, Ramsey had his leg broken by then-Stoke centre-back Ryan Shawcross.\nIt was an horrific injury that kept Ramsey out for eight months, and Stoke fans have booed the former Arsenal and Juventus midfielder whenever he has returned to play there since.\n\"I was really surprised by that and disappointed for Aaron because it's not nice,\" Riza told BBC Radio Wales.\n\"But he's got a character big enough to deal with it. He's got a lot of people around him who care for him, a lot of people who love him.\n\"So a bit of booing at Stoke will only push him to be better.\"\nRamsey, 34, was playing for the first time since injuring his hamstring while playing for Wales last September.\nHe managed 63 minutes against Stoke before being replaced, as was planned beforehand.\n\"The qualities he's got and had over the course of his career, you could see a mile away,\" Riza added.\n\"Hopefully we can ease him in slowly and see him a lot more.\"", "url": "https://www.bbc.com/sport/football/articles/cedn4v3pvw6o"}