{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:40", "date_modify": "2025-05-21 05:45:40", "date_publish": "2024-12-24 20:22:39", "description": "Premier League news: Opinion - Nedum Onuoha on Christmas football", "filename": "sport_football_articles_c5ydpn750d6o_1747806340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb06/live/ee5b2940-6e9c-11ef-8c1a-df523ba43a9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ydpn750d6o_1747806340.html", "title": "Premier League news: Opinion", "title_page": "Premier League news: Opinion - Nedum Onuoha on Christmas football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For me, wherever I played, I'd always see where the first game was, where the last game was, and where we were at Christmas.\nThere is such a big difference between being at home on Boxing Day versus being away because, depending on what your manager is like, if you've got an away game there is a chance you're training on Christmas Day.\nSome of the toughest times I had was when we had away games on Boxing Day and we had to come in to train at four or five on Christmas. That's when everything is just starting at home and everyone is really enjoying themselves and you have to leave.\nIf you lose you are sat in the hotel having walked away from friends and family all for no points. It's not the best feeling and as a consequence you bring home some of that disappointment with you.\nBut, in reality, you just know it is the busiest time of the year. The floodlights are always on for the games, the conditions get that little bit tougher, you've got games it feels like every three or four days.\nI think it's an exciting part of the season because you can gain real, significant momentum but ultimately it comes down to are you winning games.\nI think the Christmas period itself can be tough if you have got family but in reality it always feels nicer when you get that win on Boxing Day. The atmosphere in the stadiums is a little bit different, the atmosphere among the players is a bit different.\nYou're very thankful to get the chance to do what you do, but if you end up losing on Boxing Day or around that spell it is rubbish because it almost feels like it was a waste of time with all the efforts you put in.\nBut, I get it. The fans love it, there is a lot of clamour around it. You lose track of days just like everyone else does after Christmas and before New Year but it is great to play in front of those types of crowds and it just does feel different playing during that week or two.", "url": "https://www.bbc.com/sport/football/articles/c5ydpn750d6o"}