{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:44:31", "date_modify": "2025-04-26 03:44:31", "date_publish": "2025-03-05 07:15:13", "description": "Ireland scrum coach John Fogarty says the prospect of France having seven forwards on their bench on Saturday will not change their own plan much.", "filename": "sport_rugby-union_articles_c0l1460y668o_1745639071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/006f/live/722f4360-f998-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c0l1460y668o_1745639071.html", "title": "Six Nations 2025: Selecting 7-1 bench split for France game would 'spook' Ireland says scrum coach John Fogarty", "title_page": "Six Nations 2025: Selecting 7-1 bench split for France game would 'spook' Ireland says scrum coach John Fogarty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland scrum coach John Fogarty says the prospect of France choosing seven forwards on their bench in Saturday's Six Nations meeting will not change their own selection plan much.\nThe Springboks became the first tier-one side to adopt the 7-1 bench split during preparations for the 2023 World Cup, later doing so at the tournament in the pool stages against Ireland.\nFrance adopted the tactic against Italy in the Six Nations last month and could do so again in Dublin this weekend when the top two in the championship go head to head.\n\"They've a lot of faith in their backs to stay fit. We know they interchange their backs and they've got some very useful forwards, so you understand it,\" said Fogarty.\n\"Were they trying it out for us? Maybe, I don't know, we're not too sure.\n\"It doesn't change our plan a huge amount. We haven't overly discussed it.\"\nFogarty said Ireland have \"a lot of confidence\" in their own \"very fit group of forwards\" and would not consider doing similar for fear of injuries disrupting their plans.\n\"It would spook us. It's something we wouldn't do,\" he added.\n\"They feel they can cover positions. They probably feel they have some forwards who can cover the backs as well.\n\"It does happen in a game, you lose players and it becomes difficult to play your game the way you want to play it. We haven't really gone there much.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c0l1460y668o"}