{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:16", "date_modify": "2025-05-21 06:55:16", "date_publish": "2025-03-29 16:05:36", "description": "Guernsey FC draw 1-1 with Westfield in front of 2,207 fans in their first game at their new Victoria Park ground.", "filename": "sport_football_articles_cjw2wqg671yo_1747810516.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5cd9/live/93eed450-0cd7-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjw2wqg671yo_1747810516.html", "title": "Guernsey FC draw 1-1 with Westfield in first game at Victoria Park", "title_page": "Guernsey FC draw 1-1 with Westfield in first game at Victoria Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Guernsey FC drew 1-1 with Westfield in front of 2,207 fans in their first game at their new Victoria Park ground.\nThe Green Lions have left Footes Lane - their home since their formation - for the £10m facility that is the new home for Guernsey football.\nHaving seen Westfield's Manolis Gogonas go close early on, Guernsey took the lead in first-half stoppage time.\nFittingly it was record goalscorer Ross Allen - the only survivor in the side from the team that played Guernsey FC's first-ever competitive match in 2011 - that opened the scoring.\nHe converted a penalty in first-half stoppage time for his 309th goal for the club in 350 games after Sam Murray had been fouled by Westfield goalkeeper Michel Verga.\nWestfield thought they had a chance to equalise six minutes after restart when they were initially awarded a penalty, but the decision was changed after the referee consulted with his assistant.\nBut 15 minutes later Westfield did level the scores when Gogonas blasted past Josh Addison.\nMurray just missed getting on the end of a dangerous Charlton Gauvain ball with 11 minutes to go as neither side could find a winner.\nThe draw did not help Guernsey FC's relegation fight - they remain third-from-bottom of Isthmian League South Central.\nThey are seven points from safety with six games left to play as they aim to try and avoid a first relegation in the club's history.\n\"I'm obviously disappointed because we wanted to win, we need the win, there's no doubt about that,\" Guernsey manager Tony Vance told BBC Radio Guernsey.\n\"But it's also important not to lose, particularly on an occasion like this amazing day, amazing occasion,\n\"I'm really proud of the players, the way they stood up to it. We're a young team and to experience that is historical for them and it was a great day.\n\"But it was a difficult performance, a difficult situation, but I'm very proud of the players.\"\nVance was also impressed with the large crowd - their biggest of the season - who came to see their new home.\n\"It's a historic day and this is the first time Guernsey's had a home of football and you can imagine Murattis here here are going to be amazing,\" he said.\n\"Everyone can aspire to play at this level on this facility and I think the biggest thing for me is an additional 1,500 people saw what we have to deal.\n\"That's a team who are mid-table, they're not ripping up trees, they're not in the mix and we've taken four points off them this season.\n\"But I think people can see that they're physical, they're massive, they manipulate the referees - you saw that with that ridiculous penalty that they tried to get, and that happens.\n\"Sometimes you have to deal with it, and it's a really tough situation to be in and I thought the players stood up to it really well.\"", "url": "https://www.bbc.com/sport/football/articles/cjw2wqg671yo"}