{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:31", "date_modify": "2025-05-21 04:58:31", "date_publish": "2025-01-14 17:09:25", "description": "Arsenal news: Fan views on which striker Gunners should target", "filename": "sport_football_articles_cwye124ngryo_1747803511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/89a7/live/40bc8d30-d29a-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwye124ngryo_1747803511.html", "title": "Arsenal news: Fan views on which striker Gunners should target", "title_page": "Arsenal news: Fan views on which striker Gunners should target - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on who is a realistic striker Arsenal could target.\nHere are some of your comments:\nMark: Matheus Cunha. One of the most skilful players on the planet, but most importantly for Arsenal, also one of the most fast, decisive and unpredictable [in a good way ie. difficult to defend against]. Would allow Arsenal to tweak their pattern of play rather than the cumbersome change a traditional number nine would require.\nKnox: It was not long ago that fans, media and pundits were lauding Arsenal. The free-flowing football, goals galore, set-piece masters etc etc. Hit a bit of a dodgy patch and all hell breaks loose..\nMark: So-called fans are too influenced by the narrative the media spins. Arsenal played well and will give a team a spanking playing like that sooner rather than later. Let's hope it's Spurs in the north London derby. Practically, if the injury to Jesus is a season-ender then we'll need to try to bring in a striker on loan as can't see the ultimate forward we want be available in January. Jonathan David for a small fee from Lille would be a good deal but I'd love to see us bring in Kyogo from Celtic and help Tierney return to his boyhood club as part of the deal. Kyogo can play anywhere across the front three and is so sharp and would fit into our style of play superbly. Would still leave us open to bring in that expensive number nine in the summer.\nChris: Arsenal need a proper striker. Liverpool's Darwin Nunez is available and he would fit the Arsenal system better than he fits Liverpool's. Go and get Darwin, Mikel!", "url": "https://www.bbc.com/sport/football/articles/cwye124ngryo"}