{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:08", "date_modify": "2025-05-21 06:48:08", "date_publish": "2025-01-04 10:35:49", "description": "'Liverpool reject Ipswich Town & Crystal Palace bids for Ben Doak' - gossip", "filename": "sport_articles_c86wxng9dl6o_1747810088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0ce/live/791aa600-ca87-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c86wxng9dl6o_1747810088.html", "title": "'Liverpool reject Ipswich Town & Crystal Palace bids for Ben Doak'", "title_page": "'Liverpool reject Ipswich Town & Crystal Palace bids for Ben Doak' - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool have rejected a £16m offer from Ipswich Town for Ben Doak, the bid coming shortly after Crystal Palace's opening £15m offer, and the 19-year-old Scotland winger's parent club would prefer him to remain on loan to Middlesbrough for the rest of the season. (The Athletic), external\nLiverpool want £30m if they are to sell teenage winger Ben Doak. (Independent), external\nInternazionale are eyeing up a winter move for Scotland midfielder Lewis Ferguson, according to website L'Interista, which claims a £16.6m bid could be made by the Italian champions in an attempt to pry the 25-year-old away from Serie A rivals Bologna. (L'Interista via Daily Record), external\nEverton manager Sean Dyche says out-of-favour Scotland right-back Nathan Patterson will not be allowed to leave on loan unless a replacement is brought in. (Liverpool Echo), external\nSt Johnstone are keen to sign Scotland international Calvin Ramsay on loan after the right-back was recalled from his loan spell at Wigan Athletic by parent club Liverpool. (The Courier), external\nCeltic are expected to contact Arsenal to begin negotiations about taking out-of-favour Scotland defender Kieran Tierney on loan until the end of the season, with talks having already begun between Celtic and the 27-year-old's agent about a permanent return when his contract with the Premier League club ends this summer. (Sky Sports), external\nCeltic are hoping to announce the sensational return of Kieran Tierney from Arsenal on a pre-contract agreement over the next week. (Scottish Sun), external", "url": "https://www.bbc.com/sport/articles/c86wxng9dl6o"}