{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:16:19", "date_modify": "2025-05-20 12:16:19", "date_publish": "2023-08-05 00:00:00", "description": "Watch coverage from the third day of the 2023 Cycling World Championships in Glasgow.", "filename": "sport_live_cycling_65813705_1747743379.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12E4A/production/_130668377_katiearchibald.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cycling_65813705_1747743379.html", "title": "Great Britain's Katie Archibald inspires dominant team pursuit gold at 2023 Cycling World Championships", "title_page": "Great Britain's Katie Archibald inspires dominant team pursuit gold at 2023 Cycling World Championships - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight\nThat's all from me for today.\nYou can find reports, highlights and reaction to Saturday's action over on our dedicated cycling page here.\nWe'll be back tomorrow evening for more track cycling action as Great Britain look to maintain their momentum in Glasgow.\nCatch you then!\nThe best of day three\nIt's been another great day of action at the Cycling World Championships - and another filled with plenty of golden moments for Great Britain.\nHere's a selection of Saturday's best bits.\n'It was good fun' - Van Gass\nBefore that closing gold, Jaco van Gass was involved in a super British one-two in the men's C3 scratch race ahead of Finlay Graham.\n\"It was fantastic to be back and it was good fun,\" he told BBC Sport.\n\"It worked out great for us, and it turned out into a sprint which is his [Finlay Graham] strong point and not mine.\n\"I got in the slip stream and it worked in my favour.\"\n'We see ourselves as best in the world'\nHere's what Katie Archibald had to say after inspiring her team to gold:\n\"It is all coming out, this is the event,\" she said, speaking to BBC Sport.\n\"Someone was talking about imposter syndrome the other day and you almost have it the other way round, we almost see ourselves as the best in the world.\n\"But we have not been on the top step since 2014, so to have that feeling validated, it feels good!\"\nPost\nIt was all smiles for GB's women's team pursuit quartet, who brought the house down with that thrilling victory in front of a delighted home crowd.\nEveryone is leaving the Sir Chris Hoy Velodrome with a big grin on their faces after that one.\nWhat's happened on day three?\nThe medals just keep on coming for Great Britain.\nWhat a Saturday it has been - on the track this evening and beyond.\nHere are the headlines:\nGB's Charlie Hatton won gold in the men's mountain bike downhill;\nCat Ferguson took silver in the women's junior road race;\nSam Ruddock won men's C1 1km time trial gold;\nBlaine Hunt won the men's C5 1km time trial title;\nJaco van Gass won the men's C3 scratch race ahead of compatriot Finlay Graham;\nAnd in the final race of the evening on the track, Katie Archibald inspired GB's quartet to women's team pursuit gold.\nGreat Britain win women's team pursuit gold\nSensational!\nWhat a ride by the British team, taking victory by over four seconds in the end with a relentless performance after Katie Archibald's massive turn put her team in control.\nThat's some way to wrap up day three. The crowd are on their feet to applaud the world champions. What a noise!\nPost\nThe crowd are getting right behind the British team here as the time gap swings in their favour.\nIt's going to go right down to the wire...\nPost\nFrance pip Italy to women's team pursuit bronze in a really close race.\nAnd now a huge reception for the British team as they roll out on to the track.\nTime for the gold to be decided!\nPost\nKatie Archibald can expect quite the reception when she returns to the track in her home city.\nLast year was a horrendous one for the 29-year-old, losing her partner Rab Wardell after he suffered a cardiac arrest in his sleep aged just 37.\nShe told Chris Hoy in an emotional interview before the championships that she \"wasn't scared any more\".\nGB aim for team pursuit gold\nOlympic champions GB, who took world silver last year, will go for gold in the women's team pursuit final shortly - the last race on the track tonight.\nResting Katie Archibald earlier today, the British quartet of Elinor Barker, Megan Barker, Josie Knight and Anna Morris set the fastest time in four minutes 09.671 seconds.\nStanding in their way is the New Zealand team, who clocked 4:10.252 to join them in the gold medal race.\nFrance and 2022 champions Italy will first compete for the bronze.\n'Superb finish from the British duo'\nSarah Storey\nGB's most successful female Paralympian on BBC TV\nAbsolute superb finish from the British duo. It is all about Finlay Graham and Jaco van Gass.\nIt is always hard when you have a team-mate, but it was very much a man on man sprint at the end.\nAll-British battle for gold\nOnly five laps to go.\nIt will be the defending champion Finlay Graham against compatriot Jaco van Gass for the gold here and the excitement is building inside the Sir Chris Hoy Velodrome.\nA GB one-two is all but guaranteed, of course!\nWho will get the bronze from the rest of the group is anyone's guess.", "url": "https://www.bbc.com/sport/live/cycling/65813705"}