{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:57:07", "date_modify": "2025-05-21 07:57:07", "date_publish": "2025-03-27 19:21:19", "description": "Salford Red Devils fail to pay their players and staff on time for the second time this season, as their financial issues continue.", "filename": "sport_rugby-league_articles_cj4nrjqyjg4o_1747814227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/73ce/live/76c9d480-0b3b-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cj4nrjqyjg4o_1747814227.html", "title": "Salford Red Devils: Player and staff wages late for second time this season", "title_page": "Salford Red Devils: Player and staff wages late for second time this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Salford Red Devils have failed to pay players and staff on time for the second occcasion this season, as their financial issues continue.\nThe club had a tumultuous off-season and were granted an early payment of their 2025 revenue share before the current campaign had begun.\nThe Red Devils were taken over by a consortium led by Swiss investment banker Dario Berta on the eve of the season, but their issues have continued, leading to the RFL imposing a sustainability cap on the club which has affected team selection.\n\"As many will already know, our payroll wasn't delivered this morning as scheduled, despite assurances,\" the statement said., external\n\"It remains a difficult situation for everyone at Salford Red Devils.\n\"Irrespective of this, we, as players and staff have continued to uphold our commitments with professionalism, ensuring the club remains competitive on and off the field. Now, we await the same level of commitment from those responsible for ensuring the stability of our organisation.\n\"The unwavering support of our fans and partners during this challenging time, is both humbling and inspiring, it makes all the difference to players and staff.\"\nIn his pre-match media commitments for Sunday's game against Wigan Warriors, boss Paul Rowley was defiant and said his squad's resolve would be unchanged by matters happening off the field.\nRowley admitted, however, that he would only have 15 players at his disposal for the fixture due to injuries and cap restrictions.", "url": "https://www.bbc.com/sport/rugby-league/articles/cj4nrjqyjg4o"}