{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:02", "date_modify": "2025-05-21 05:37:02", "date_publish": "2025-04-01 07:40:20", "description": "Nottingham Forest vs Man Utd predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_c9vepk4vej3o_1747805822.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9vepk4vej3o_1747805822.html", "title": "Nottingham Forest vs Man Utd predictions: Chris Sutton on Premier League game", "title_page": "Nottingham Forest vs Man Utd predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I am concerned how Nottingham Forest will cope without Chris Wood up front if he is out injured. At the moment, it is not clear how serious his problem is.\nForest made quite a few changes against Brighton in the FA Cup over the weekend, and still got through without 'the Wood-chopper', but they really need him back as soon as possible.\nSpeaking as a Forest fan, it is especially annoying that he has picked up this injury while on international duty.\nNew Zealand have got an excellent cricket and rugby union team and I wish them every success at football, but do they really need Wood to get through their World Cup qualification campaign against the likes of Fiji and New Caledonia?\nI'd argue they don't need him, and that Wood is better than that. If I was from New Zealand, I'd probably have won about 700 caps, and there are greater priorities for Wood, which are to win the FA Cup and get Forest into next season's Champions League.\nIt will be harder for Forest without him, but I still think they can repeat their win at Old Trafford in December.\nSaturday's FA Cup win over Brighton was not exactly a thriller, but as we have seen plenty of times from Forest already this season, they are not here to entertain - they are here to get the job done.\nAs for Manchester United, it is a big end to the season for their boss Ruben Amorim.\nBruno Fernandes has carried them a bit recently in the league, and he is their best hope of getting a positive result here.\nI am not sure either side will be too bothered about having the ball, but Forest fans are happy for them to sit deep and play on the counter, even when they are at home, and they are really good at it.\nSutton's prediction: 1-0", "url": "https://www.bbc.com/sport/football/articles/c9vepk4vej3o"}