{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:36", "date_modify": "2025-05-21 05:13:36", "date_publish": "2025-04-05 00:00:00", "description": "Nahki Wells scores one and makes another as Bristol City move into the top six with victory over play-off rivals Watford.", "filename": "sport_football_live_c4g25evq4dpt_1747804416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a832/live/f3be7f80-1235-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g25evq4dpt_1747804416.html", "title": "Bristol City 2-1 Watford: Nahki Wells stars as Robins beat Hornets", "title_page": "Bristol City 2-1 Watford: Nahki Wells stars as Robins beat Hornets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nahki Wells scored one goal and made another as Bristol City scored twice in four first-half minutes to move into the Championship play-off places and seemingly end Watford's hopes of a top-six finish.\nThe Hornets, who have now not won in three games and are 10th with just six games remaining, had early chances - notably when City's Jason Knight was forced to make a fine sliding challenge to stop Edo Kayembe scoring from close range.\nBut an injury to the lively Kwadwo Baah affected Watford's rhythm and the hosts took full advantage soon after, scoring with their first chance on the way to an eighth win in 10 at Ashton Gate.\nMax Bird pounced on a slip from James Abankwah and, after Wells was tackled, the ball fell kindly to Ross McCrorie who scored with an angled shot.\nWells made it 2-0 in controversial fashion, the striker smashing a low effort past keeper Egil Selvik for his ninth goal of the season, while Watford were claiming the ball had gone out of play in the build-up.\nThe visitors barely threatened to get back in the game until substitute Mamadou Doumbia's neat turn and finish gave his side hope with 10 minutes left.\nBristol City manager Liam Manning told BBC Radio Bristol:\n\"At this stage of the season the most important thing is winning matches. I love working with the lads, delighted for them, proud of them.\n\"When you look at how they performed and just the fact they turn up and consistently give absolutely everything for the shirt, you can't ever take that for granted.\n\"I thought the lads were outstanding so [I'm] delighted to get the three points and so many positive aspects from the performance as well.\n\"You look at the profile of [Watford], you know it's going to be a really physical tough game and especially they've got some talented individuals that can change it in a really quick moment.\n\"You have to manage that by taking care of the ball and I think first-half was excellent as to how we did that, we kept them penned in.\n\"Second half was one of those where they had a lot of the ball but didn't carry as much threat as we did on the counter. It's that stage of the season where it's about finding a way to win and we did it.\"\nWatford boss Tom Cleverley told BBC Three Counties Radio:\n\"The start of the game was excellent. We had a gameplan to get our wide players in dangerous positions and we looked a real threat in the first 15 minutes. We really started on the front foot.\nIt was disappointing when KB [Kwadwo Baah] had to come off. We lost some attacking output when he had to come off. They smelt a change in the game then.\n\"James Abankwah hasn't put a foot wrong since he's been at the club but he made a mistake [for the first goal] and that will happen with young players. We'll have to rally around him. We can teach him that it can go to row Z at times.\n\"The second goal was hugely disappointing; you don't like poor refereeing decisions to decide big games. It's definitely out of play - there's not much more I can say about that.\n\"They are a good side. Liam [Manning] has done a terrific job with them. It was a stalemate of a game, but I was pleased about how we continued to try to test them and knock down the door. But it was too much of a mountain to climb at 2-0 down.\"", "url": "https://www.bbc.com/sport/football/live/c4g25evq4dpt"}