{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:01", "date_modify": "2025-05-21 03:56:01", "date_publish": "2025-04-07 13:20:11", "description": "Chelsea news: 'It feels like Maresca is going to be Chelsea's downfall'", "filename": "sport_football_articles_cwyqjyyzqnno_1747799761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7163/live/dfe505d0-1382-11f0-8958-21736b2c9c9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwyqjyyzqnno_1747799761.html", "title": "Chelsea news: 'It feels like Maresca is going to be Chelsea's downfall'", "title_page": "Chelsea news: 'It feels like Maresca is going to be Chelsea's downfall' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Premier League striker Clinton Morrison says he was left questioning what Enzo Maresca was thinking when the Chelsea line-up was announced for their game at Brentford on Sunday.\nMaresca rested Nicolas Jackson, Cole Palmer, Marc Cucurella and an in-form Pedro Neto against their west London rivals. In came Malo Gusto, Kiernan Dewsbury-Hall, Christopher Nkunku and Noni Madueke, who all struggled to make an impact.\n\"I don't get what Maresca is doing,\" said Morrison on BBC Radio 5 Live's Football Daily podcast. \"It is like when they were second in the league and he kept playing down that they could challenge for the title, now they are in a position to finish in the Champions League places and he makes all of those changes.\n\"I know they have a European game [against Legia Warsaw on Thursday] but they could play their second team and win that Conference game. That is without a shadow of a doubt.\n\"Do not rest your players in the Premier League. I think it will go right down to the wire with them and I am not so confident in them.\n\"I know there are a lot of games to go but it feels like Maresca is going to be their downfall.\n\"How can you not play Cole Palmer and Nicolas Jackson? I was shocked.\"", "url": "https://www.bbc.com/sport/football/articles/cwyqjyyzqnno"}