{"authors": ["Ben Ashton", "www.facebook.com"], "date_download": "2025-05-21 07:44:59", "date_modify": "2025-05-21 07:44:59", "date_publish": "2025-03-28 08:52:56", "description": "BBC Sport takes a look at the 10 teams vying for promotion to League One with eight of those struggling for form.", "filename": "sport_football_articles_c8rk7lz1vxeo_1747813499.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a86b/live/75889510-0a42-11f0-88b7-5556e7b55c5e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rk7lz1vxeo_1747813499.html", "title": "League Two: The promotion race nobody wants to win", "title_page": "League Two: The promotion race nobody wants to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For quite some time, Walsall's march to the League Two title seemed almost inevitable.\nBut this is football after all - and the predictably unpredictable EFL, no less - with the Saddlers' form having nosedived since January.\nYet they remain on top, as many of the chasing pack have also stuttered in recent weeks, leaving us no closer to knowing who will go up, who will make the play-offs and who will miss out altogether.\nBBC Sport has taken a look at the fourth tier's race for promotion with four spots in League One up for grabs.\nBy Saturday, Walsall will have been top of League Two for 112 days.\nBut for the first time since early December, they could be toppled if they fail to beat AFC Wimbledon and second-placed Bradford City win at Accrington Stanley.\nShould that happen, it will also mark the first time the Bantams have ended a day on top of a league table for more than 16 years - last doing so in League Two on 19 September 2008, according to Opta.\nThe Saddlers held a 12-point advantage at the summit with a game in hand and a 15-point cushion in the automatic promotion places when they extended their winning run to nine games by beating MK Dons 4-2 on 18 January.\nThat day also marked the first game after top goalscorer Nathan Lowe was recalled by parent club Stoke City.\nDespite coping well against MK Dons, the 19-year-old's exit appears to have been a turning point for when Walsall's drop-off in results began.\nIn the 13 games that have followed, Walsall have only won twice (D6 L5) and seen their lead at the top cut to just one point by the Bantams, while the gap to fourth is now six points.\nTheir performance at both ends of the pitch has tailed off, scoring just 15 goals in that time at a rate of 1.15 per game, compared to 52 goals in 25 matches previously at 2.08 per game.\nLowe is still Walsall's leading goalscorer after he netted 15 times in 22 appearances, ahead of Jamille Matt who has scored 12 goals in 35 games.\nThe 20 goals Walsall have conceded in their past 13 games at a rate of 1.53 is also higher than the 23 they allowed in their first 25 matches at a rate of 0.92.\nOnly bottom side Morecambe (10) and Salford (11) have picked up fewer points than Walsall's return of 12 in that run.\nBoss Mat Sadler said he was happy to \"keep the scoreboard ticking over\" following their goalless draw at Gillingham last Saturday, despite ceding yet further ground at the top.\n\"I have to be pleased with that point,\" Sadler told BBC Radio WM. \"It moves us into the 70s and we now look forward to attacking the end.\n\"Everyone is fighting hard for the cause. We've got a very good squad. We've always said that. Everyone is chomping at the bit to do well.\"\nThese are tense times for Sadler's side with eight games remaining and the finishing line almost in sight. The only real question that remains to be answered is whether they can get over it.\nWalsall aren't the only team wobbling at the top of League Two with eight of the sides in promotion contention struggling for consistency.\nOnly three teams in the race to go up or make the play-offs are in the form table's top 10 based on the past six matches - Bradford, Colchester and Doncaster, although Rovers, who are fifth, are winless in their past three (D2 L1).\nSixth-placed Notts County have taken just five points from their past six games, winning only one of those (D2 L3).\nAFC Wimbledon, who are third, have won just two of their past eight (D3 L3), collecting nine points in that time.\nPort Vale missed the opportunity to move into the automatic promotion spots with defeat at home to Barrow on Tuesday night, meaning they've now recorded just two wins from seven (D3 L2).\nGrimsby Town in seventh have eight points from their past six games (W2 D2 L2), while Crewe Alexandra have slipped to ninth after a run of four without a win (D3 L1).\nSalford City were in promotion contention after six straight wins took them second at the start of January, but just two victories from their past 13 games (D5 L6) has left them six points adrift of the top seven in 10th, albeit with a game in hand.\nAside from Bradford, who also had a mini-blip of their own by losing to Gillingham and Tranmere before thrashing Colchester 4-1, it was the U's who had been in the best form prior to that heavy defeat.\nColchester's 13-game unbeaten run, which included five consecutive victories, was ended at Valley Parade on Saturday but they are still only one point outside the play-off spots.\nGraham Alexander has guided his Bradford side to an impressive 14 wins from their past 20 games (D2 L4) and said the win over Colchester was the \"best performance\" he's seen since taking over as boss 16 months ago.\n\"It's coming into a really important stage of the season,\" he told BBC Radio Leeds, with 23,381 in attendance at Valley Parade.\n\"We were obviously hurting from the previous two results but we responded again and that's us.\n\"We're not perfect but we keep going.\"\nJudging by the recent tumultuous form of those chasing promotion, perfection might not be necessary to make it out of League Two.\nOne thing we can probably predict, though, is that the race will go right to the wire.", "url": "https://www.bbc.com/sport/football/articles/c8rk7lz1vxeo"}