{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:34:04", "date_modify": "2025-05-21 06:34:04", "date_publish": "2024-12-24 12:49:17", "description": "Rangers contact the Scottish Football Association \"to express serious concerns\" after the League Cup final VAR officials are reinstated.", "filename": "sport_football_articles_c05p0erey1ro_1747809244.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e20/live/ec26c700-c1f4-11ef-bea1-2bd9ff79844f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05p0erey1ro_1747809244.html", "title": "Rangers 'express concern' after Hampden VAR officials are reinstated", "title_page": "Rangers 'express concern' after Hampden VAR officials are reinstated - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers say they have contacted the Scottish FA \"to express serious concerns and ask several questions\" after the two VAR officials from the League Cup final were appointed to oversee festive fixtures.\nScottish FA head of referee operations Willie Collum had said Frank Connor and Alan Muir made a ''really, really poor'' and \"unacceptable\" decision not to award Rangers a penalty in the final against Celtic on 15 December.\nThe incident in question was a pull by Liam Scales on Vaclav Cerny. A free-kick was awarded and Celtic went on to win the final on penalties after a 3-3 draw.\nNeither Connor or Muir featured in the subsequent round of top-flight games.\nHowever, Connor will be one of the assistant referees for Kilmarnock v Aberdeen on Thursday and Celtic v St Johnstone on Sunday, while Muir will be on VAR duty for St Mirren v Dundee on Sunday.\n\"The Scottish FA's actions raise questions about their commitment to improving officiating standards and fostering accountability,\" Rangers said in a statement.\n\"We also note one of the officials has been appointed to a match involving the club that benefited from the error.\n\"While Rangers FC fully respects the independence of officiating appointments and the need for referees to operate without interference, how the Scottish FA handles such high-profile failures directly affects its credibility and public confidence.\n\"The decision to reinstate the officials so quickly, and in particular for a fixture involving the club which benefited from the mistake in question, has drawn widespread media scrutiny on the officiating failure and officials concerned.\n\"This was both predictable and avoidable, and contradicts any stated duty of care from the Scottish FA towards their match officials.\"\nRangers said \"mistakes do happen in football\", but added: \"How they are addressed matters enormously.\n\"We would urge the Scottish FA to demonstrate its desire to improve the quality and consistency of officiating and to do so in a transparent manner.\n\"We are not seeking to challenge the authority of the Scottish FA or the integrity or independence of match officials, but to encourage improved standards and accountability. This is not about influence. It is about good governance.\n\"Rangers FC expects tangible steps to be taken and remains committed to holding the Scottish FA accountable in the interests of the game.\"\nThe Scottish FA has been approached for a response.", "url": "https://www.bbc.com/sport/football/articles/c05p0erey1ro"}