{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:17", "date_modify": "2025-05-21 07:48:17", "date_publish": "2025-03-28 07:18:17", "description": "Josh Giddey stuns the Los Angeles Lakers with a buzzer-beater from his own half in a 119-117 victory for the Chicago Bulls.", "filename": "sport_basketball_articles_cly4ykk3gnzo_1747813697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/968d/live/a605eea0-0bb8-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cly4ykk3gnzo_1747813697.html", "title": "Josh Giddey buzzer-beater helps Chicago Bulls stun Los Angeles Lakers", "title_page": "Josh Giddey buzzer-beater helps Chicago Bulls stun Los Angeles Lakers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh Giddey hit a brilliant half-court buzzer-beater to help the Chicago Bulls complete an exceptional 119-117 comeback against the Los Angeles Lakers.\nThe Bulls were trailing by five points with less than 13 seconds remaining at the United Center on Thursday, but they hit three three-pointers in the last 10 seconds of the match.\nWith time expiring, Giddey let fly from within his own half and walked off with remarkable calm as his shot found the hoop.\nWith 25 points, 14 rebounds and 11 assists, Giddey hit his fifth triple-double of the season - the only Bulls player with more in one campaign is the 15 Michael Jordan managed in 1988-89.\n\"Special moment to do it with these guys, this team,\" Giddey said.\nLeBron James, who was guilty of giving away possession when his side were 115-113 up with 9.8 seconds left, said the Lakers should have seen the game out.\n\"We put ourselves in position to win, gave up a lot of threes in the fourth quarter, still put ourselves in position to win,\" James said.\n\"Horrible turnover by myself, miscommunication the play before that. AR (Austin Reaves) tried to save us. Tip your hats.\"\nLakers coach JJ Redick said there was a mood of \"devastation\" in the dressing room afterwards, adding \"it's a hell of a way to lose a basketball game\".", "url": "https://www.bbc.com/sport/basketball/articles/cly4ykk3gnzo"}