{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-05-21 05:47:43", "date_modify": "2025-05-21 05:47:43", "date_publish": "2025-04-02 12:03:38", "description": "Liam McLeod column: 'Jimmy Thelin's fresh formula could end rollercoaster season on high'", "filename": "sport_articles_cn80g581jy1o_1747806463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65a2/live/ece62ec0-0fb9-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn80g581jy1o_1747806463.html", "title": "Liam McLeod column: 'Jimmy Thelin's fresh formula could end rollercoaster season on high'", "title_page": "Liam McLeod column: 'Jimmy Thelin's fresh formula could end rollercoaster season on high' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen turned in their best display since October to hammer Motherwell at a sell-out Pittodrie and seal a top-six place, the 16th time they've achieved that since the inception of the split in 2000.\nIt was an impressive performance and probably the Dons' best since the win over Rangers that had them nine points clear of the Ibrox side and level with Celtic.\nThis was just their fourth Premiership win since then, but Jimmy Thelin believes they will kick on from here and the formula he has struck with Leighton Clarkson and Ante Palaversa in the engine room, with captain Graeme Shinnie at left-back, is paying dividends.\nWith Sivert Heltne Nilsen out for an extended period, Thelin will surely stick with this set-up now after altering it for the St Johnstone stalemate last time out.\nClarkson was superb and the 'quarter-back' role seems to suit him. His goal was outstanding and he was involved in just about everything.\nKevin Nisbet has also been reborn and his recall to the Scotland squad will have given him a further boost. He could yet be the difference between success and failure for Thelin this season. It is now seven goals in eight games for the forward.\nWith Hibernian going to Rangers on Saturday, where they haven't won since 2018, the Dons potentially have a chance to reclaim third place when they travel to face Ross County before a visit from Barry Ferguson's side, who go to Pittodrie between the two legs of their Europa League quarter-final against Athletic Bilbao.\nThe club also deserve praise for their ticket initiative which ensured a full house with an excellent travelling support up from Lanarkshire for the game.\nThe win over the Steelmen was also notable as being the first time this season that Aberdeen have come from behind to win a league game, and that in itself points to an improvement in character with much still to play for.\nMore performances like this will give the Dons fans belief that this rollercoaster of a season could yet end on a maximum high.", "url": "https://www.bbc.com/sport/articles/cn80g581jy1o"}