{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:00:35", "date_modify": "2025-05-19 15:00:35", "date_publish": "2017-07-03 19:32:30", "description": "Five months after Serena Williams won the Australian Open, another tennis player has appeared at a Grand Slam tournament while pregnant.", "filename": "sport_tennis_40486706_1747666835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B5B7/production/_96791564_minella_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40486706_1747666835.html", "title": "Wimbledon 2017: Mandy Minella competes in singles and doubles while pregnant", "title_page": "Wimbledon 2017: Mandy Minella competes in singles and doubles while pregnant - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n3 July 2017\nFive months after Serena Williams won the Australian Open, another tennis player has appeared at a Grand Slam tournament while pregnant.\nMandy Minella revealed after her first-round defeat at Wimbledon that she is four and a half months pregnant.\nWearing a loose-fitting smock dress, and with a small bump just about visible, the 31-year-old lost 6-1 6-1 to Italian veteran Francesca Schiavone.\nThe world number 82 from Luxembourg is also due to play in the doubles.\nOn the day Williams posted Instagram footage, external of her practising with her racquet while seven months pregnant, Minella is preparing to team up with Anastasija Sevastova.\nThey will face Ipek Soylu and Varatchaya Wongteanchai in the first round of the women's doubles.\nMinella, who lost in the first round of the French Open in May, married her coach Tim Sommer in 2014.\nHer baby is due at the end of the year.\nHighlights, clips and funnies - check out our Wimbledon video wall\nRelated internet links\nWimbledon\nATP\nWTA\nLTA\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/tennis/40486706"}