{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-05-21 05:15:39", "date_modify": "2025-05-21 05:15:39", "date_publish": "2025-04-03 17:49:01", "description": "Seven-time winner Ronnie O'Sullivan will give himself \"as much time as possible\" to decide whether to compete at the World Snooker Championship.", "filename": "sport_snooker_articles_c5ypxn15z8qo_1747804539.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0e5/live/7b2678a0-10b1-11f0-a687-87f1851e5d51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_c5ypxn15z8qo_1747804539.html", "title": "O'Sullivan to make late decision on World Championship appearance", "title_page": "O'Sullivan to make late decision on World Championship appearance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Seven-time winner Ronnie O'Sullivan will give himself \"as much time as possible\" to decide whether to compete at the World Snooker Championship.\nThe Englishman, 49, has been an ever-present at the Crucible since turning professional in 1992 and would be going for a record eighth world title in the modern era.\nHowever, he has not played on the World Snooker Tour (WST) since January, when he withdrew from his Championship League group - and was so frustrated with his game that he snapped his cue after losing four of his five matches.\nO'Sullivan subsequently pulled out of the Masters at Alexandra Palace on medical grounds, missed the German Masters in Berlin and apologised to fans after electing not to play at the Welsh Open.\nHe also withdrew from the World Grand Prix in Hong Kong in March, increasing speculation he may not return to action in Sheffield, where he is one of the seeds.\n\"I don't know yet. I haven't made my mind up, I'll probably make a decision on maybe 17 or 18 April,\" O'Sullivan said on TNT Sports.\n\"I don't know when I'm due to play my first match, so I'm going to try and leave myself as much time as possible.\n\"I'd love to be able to go there and play. I'd love to be able to have the confidence to be able to get my cue out and go and play snooker.\n\"I just need to give myself as much time as possible to see where I'm at with it, and see whether it's something I'm going to be able to do.\"\nThe World Championship, which is regarded as the sport's toughest test, begins on 19 April and runs for 17 days until 5 May.\nQualification for the event ends on 16 April and if 'The Rocket' were to withdraw on the eve of the tournament, it would mean a qualifier receiving a bye to the second round.", "url": "https://www.bbc.com/sport/snooker/articles/c5ypxn15z8qo"}