{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:52", "date_modify": "2025-05-21 07:47:52", "date_publish": "2025-01-30 21:08:18", "description": "UFC president Dana White condemns comments by fighter Bryce Mitchell about Adolf Hitler as \"beyond disgusting\".", "filename": "sport_mixed-martial-arts_articles_c8xqdqyyr0do_1747813672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8025/live/72fc8ac0-df47-11ef-a966-f7e4eae5fb03.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_c8xqdqyyr0do_1747813672.html", "title": "UFC: Bryce Mitchell comments about Adolf Hitler 'beyond disgusting', says UFC president Dana White", "title_page": "UFC: Bryce Mitchell comments about Adolf Hitler 'beyond disgusting', says UFC president Dana White - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "UFC president Dana White has condemned comments by fighter Bryce Mitchell about Adolf Hitler as \"beyond disgusting\".\nMitchell said the German dictator was a \"good guy\" and that \"the Holocaust ain't real\".\nThe 30-year-old American, ranked 13th in the featherweight division, made a range of antisemitic, homophobic and transphobic comments during the first episode of his podcast.\nWhite said: \"We reached out to Bryce immediately when we read what he said, and let him know exactly how we felt about it.\n\"But what he said was beyond disgusting and he needs a real education on the facts surrounding Hitler and World War Two.\"\nDespite White's condemnation, Mitchell, who last fought in December, has as yet faced no further action for his comments.\nWhite added: \"Hitler is one of the most disgusting and evil human beings to ever walk the earth, and anyone that even tries to take an opposing position is a moron.\n\"That's the problem with the internet and social media. You provide a platform to a lot of dumb and ignorant people.\"\nAs leader of the Nazi party, Hitler led Germany into World War Two and ordered the Holocaust genocide, in which six million Jews were murdered.", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/c8xqdqyyr0do"}