{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-21 04:47:20", "date_modify": "2025-05-21 04:47:20", "date_publish": "2025-01-14 23:31:01", "description": "Bournemouth are having a superb season and a draw at Chelsea, as frustrating as it may feel in the circumstances, is still a fine result writes Joe Rindl.", "filename": "sport_football_articles_c9w5r902gjeo_1747802840.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c522/live/5bc6e780-d2cf-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9w5r902gjeo_1747802840.html", "title": "Chelsea 2-2 Bournemouth analysis: David Brooks lucky not to see red", "title_page": "Chelsea 2-2 Bournemouth analysis: David Brooks lucky not to see red - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth are having a superb season and a draw at Chelsea, as frustrating as it may feel in the circumstances, extended their club record Premier League unbeaten run to nine matches.\nAndoni Iraola's side are firmly in the hunt for a European place and were seconds away from moving up to fifth and level on points with their opponents.\nThe visitors even had opportunities to extend their 2-1 lead late on, before Reece James levelled up. Lewis Cook had a shot from a corner routine saved and defender Tosin Adarabioyo did well to block when Justin Kluivert had a chance.\nThat said, Bournemouth rode their luck at times and, on another day they could have been reduced to 10 men.\nDavid Brooks caught Marc Cucurella's face with his arm as the Chelsea full-back tried to run past him and, although the move was not initially spotted, the Bournemouth man might have been sent off after the VAR intervention.\nDuring the game, the Premier League Match Centre account clarified on X that referee Rob Jones deemed Brooks' foul a \"reckless action\" and \"not violent conduct\".", "url": "https://www.bbc.com/sport/football/articles/c9w5r902gjeo"}