{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:47:16", "date_modify": "2025-05-20 12:47:16", "date_publish": "2023-08-03 07:58:47", "description": "Arsenal: Mikel Arteta says Gunners looked 'leggy' in Emirates Cup win", "filename": "sport_articles_c4n0691ng18o_1747745236.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/85ca/live/552d96f0-31ca-11ee-a926-3bd293b10d74.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4n0691ng18o_1747745236.html", "title": "Arsenal: Mikel Arteta says Gunners looked 'leggy' in Emirates Cup win", "title_page": "Arsenal: Mikel Arteta says Gunners looked 'leggy' in Emirates Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal manager Mikel Arteta said his squad \"struggled\" in their friendly against Monaco on Wednesday, before going on to win on penalties and lift the Emirates Cup.\nYoussouf Fofana gave the French side the lead at Emirates Stadium after half an hour, but Eddie Nketiah - who was captain on the night - levelled shortly before the break.\nThe teams could not be separated in the second half and the Gunners converted all five spot-kicks in the shootout to win, after former Liverpool forward Takumi Minamino had missed Monaco's fourth penalty.\nSpeaking to the club's media team after the game, Arteta said: \"It’s true that we struggled, especially in the first half, to control the game better.\n\"I felt that we were bit leggy after coming back from the west coast [of the United States]. We tried to prepare really hard for the last two days, but we were a bit late in everything that we were doing.\n\"We picked it up in the second half. We had better moments but it wasn’t enough to win the game. At least we won it on penalties.\"\nArteta's starting XI included William Saliba and Takehiro Tomiyasu, who missed the end of last season because of injury.\n\"There are players who haven’t played a lot of football in the past five months and they got some minutes, especially in the past two weeks, so that’s really good to see,\" added Arteta.\n\"I think the new players are fitting in really well. We have to still fix a few things, which is normal because they’re coming from different environments - but they’re looking good.\"", "url": "https://www.bbc.com/sport/articles/c4n0691ng18o"}