{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 07:34:26", "date_modify": "2025-05-21 07:34:26", "date_publish": "2025-05-20 14:06:01", "description": "Ireland captain Paul Stirling expects his side to meet a \"very strong\" West Indies team in their one-day series in Dublin this week.", "filename": "sport_cricket_articles_c15nnz2j05vo_1747812866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd74/live/0fa2dfe0-357a-11f0-8a3d-319afdf0f64c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c15nnz2j05vo_1747812866.html", "title": "Ireland v West Indies: Irish captain Paul Stirling says there will be 'nothing held back' in ODIs", "title_page": "Ireland v West Indies: Irish captain Paul Stirling says there will be 'nothing held back' in ODIs  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland captain Paul Stirling says there will be \"nothing held back\" in his side's one-day international series against West Indies in Dublin this week.\nThe Irish will host West Indies in Clontarf on Wednesday, Friday and Sunday before three T20 contests against the same opponents in Bready next month.\nThe two white-ball series will be West Indies' first games in Ireland since 2019, and Stirling expects a full-throttle challenge from the tourists, who face England in between their two trips to Ireland.\n\"I think when they bookend a tour against us and England, they always bring their strongest side and that's very pleasing,\" the 34-year-old opener told BBC Sport NI.\n\"It's not just a series against us, where teams can play a few new faces or slightly less strong. They're playing England in five ODIs next week, so they've brought their full squad and that's the big challenge.\n\"We've got the West Indies squad that will face England so there will be nothing held back.\"\nIreland secured a 2-1 ODI series win over West Indies in June 2022 before an eye-catching T20 World Cup victory over the same opponents in Hobart later that year, which was their most recent meeting.\nStirling is hoping his side can get off to a good start in Dublin on Wednesday as they chase another big win.\n\"They always bring a flavour to the games and usually some big-hitting, so hopefully we can negate that and start well,\" he said.\n\"That's the case for us when you get a touring side coming over into these conditions, which they're not necessarily used to from the Caribbean, to start well and put them under pressure early and see if we can maintain that throughout the day.\"\nDespite being one of the older members of the squad, Stirling says that ODIs against the West Indies still excite him and he is not yet contemplating retirement.\n\"I think I realised when I have a month off, I find myself going into the shed and picking up the cricket bat and I think that is a really good sign for me personally,\" he said.\n\"I know if I wasn't batting in front of the mirror at home that would be a sign that maybe I'm not as keen, but I'm still hungry and fixtures like this are brilliant.\"\nAs captain, Stirling will be tasked with helping the uncapped trio of Cade Carmichael, Tom Mayes and Liam McCarthy settled into the squad.\nThey have been included alongside Jordan Neill and Stephen Doheny, who were late call-ups for the injured Craig Young and Curtis Campher, with Mark Adair, Graham Hume and Fionn Hand also ruled out.\nBelfast native Stirling hopes that Ireland can compete despite their spate of injures and that the injection of new players can help develop squad depth.\n\"You have to look at the positive side of it, new faces and fresh energy and see what's underneath the first team itself and put some pressure on old faces like me,\" he said.\n\"There's no reason why we shouldn't be competing throughout the 50 overs in both innings. There's no pressure on anyone coming in. If you're on your debut, you've got the freedom to play your own game.\n\"You are slight underdogs for most games you play, but not as much so as in the past and our depth is improving each year, so this is always the challenge to play a side like the West Indies to see where you are.\"", "url": "https://www.bbc.com/sport/cricket/articles/c15nnz2j05vo"}