{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:40", "date_modify": "2025-05-21 05:44:40", "date_publish": "2025-01-31 16:54:13", "description": "Dundee ready for 'huge' 10-game stretch", "filename": "sport_articles_cr46d5qxv29o_1747806280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/808c/live/2d5b41a0-dfd8-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr46d5qxv29o_1747806280.html", "title": "Dundee ready for 'huge' 10-game stretch", "title_page": "Dundee ready for 'huge' 10-game stretch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trevor Carson says Dundee face a \"huge\" 10-game run to the Premiership split as they look to climb clear of relegation worries and back into the top six.\nThe Dark Blues sit eighth but are just two points clear of Kilmarnock, who occupy the relegation play-off spot.\nDundee host Hearts on Saturday and goalkeeper Carson said: \"It's a massive game. I think our next 10 games are before the split, every single one of them is going to be huge.\n\"I can guarantee you in 10 games' time we'll look back and it'll be the odd goal in every game. Every game is going to be tight.\n\"I think at the start of the season, if someone had said after 23 games you'd have been on the same points as Hearts, we probably would have took that.\n\"But then you look at the table now, you'd be expecting to be third or fourth in the league. But the way the league is, it's so congested.\n\"We're really confident and looking forward to the next stretch of games.\"\nCarson insists a settled back three has been key in Dundee's fine recent form.\nTony Docherty's men are four games unbeaten, including draws with Celtic and Rangers plus a derby win over Dundee United.\n\"We've had that settled back three now for the last four games and you learn each other's games, little traits you've got, and more than anything it breeds confidence and it can only be good for the squad,\" Carson added.\n\"You see the lads coming back in training and that just lifts the levels, so we're in a good place, we've had that little run of injuries but we're over the other side of it now and we've got a really competitive squad.\"", "url": "https://www.bbc.com/sport/articles/cr46d5qxv29o"}