{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:01:17", "date_modify": "2025-05-20 13:01:17", "date_publish": "2023-08-01 11:12:13", "description": "Beale's had the board's backing, but are Rangers still light in defence?", "filename": "sport_articles_cnlyz8x94vko_1747746077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d8e9/live/f8c78800-305a-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cnlyz8x94vko_1747746077.html", "title": "Beale's had the board's backing, but are Rangers still light in defence?", "title_page": "Beale's had the board's backing, but are Rangers still light in defence? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamie Currie, Rangers fan, external\nIt's been a summer of much-needed change. A refresh, a re-build, call it whatever you like, but for Michael Beale it had to happen.\nHe had to try and turn things around from last season and build a team that he thought could compete. He's added eight new faces and closing in on a ninth and that’s before you mention those who left the club.\nRangers needed a change of direction; they had to get away from relying on Alfredo Morelos and Ryan Kent in the attacking areas and try something new.\nIn terms of the new signings, Danilo is the one who will grab the attention and the headlines because of his fee and purely due to the fact he's a Brazilian coming into Scottish football. But in pre-season, it's been Sam Lammers who has stood out and he looks like someone who has the technical ability to thrive in our league.\nThe manager certainly cannot turn around and suggest he hasn't had the backing of the board, there can be no excuses on that front, none at all.\nI feel, however, that we could be a few players short, especially in the centre-back position and that will have to be rectified if there is to be a sustained title challenge on our part.\nTo sum up the window so far, with a few days to go before the start of the campaign, on paper, it looks like we have had a good window.\nYou can see why each player has been brought in and which role they are destined to play, but football isn't played on paper and there has to be a victory and a noticeable style of play at Rugby Park, so we can see positive signs from this new-look Rangers side going forward.", "url": "https://www.bbc.com/sport/articles/cnlyz8x94vko"}