{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:25", "date_modify": "2025-05-21 03:52:25", "date_publish": "2025-02-01 08:36:19", "description": "Swansea City: Luke Williams challenges Swans to fill Matt Grimes void", "filename": "sport_football_articles_cgq0zk20ejwo_1747799545.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/178e/live/47c361f0-dfe0-11ef-9e55-bfd035967447.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgq0zk20ejwo_1747799545.html", "title": "Swansea City: Luke Williams challenges Swans to fill Matt Grimes void", "title_page": "Swansea City: Luke Williams challenges Swans to fill Matt Grimes void - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams has challenged Swansea City to \"fill the void\" left by Matt Grimes when they take on Coventry City on Saturday (15:00 GMT).\nWilliams goes into a game without Grimes in his squad for the first time since taking charge at Swansea almost 13 months ago after the midfielder's departure for Coventry.\nGrimes, who had been Swansea's captain since 2019, has played in all but four of the club's league games since relegation from the top flight seven years ago.\nBut with Ben Cabango now wearing the armband, Williams says his squad must quickly get used to life without Grimes' reliable presence in midfield.\n\"Tough moments are opportunities or they are threats,\" the Swansea head coach said.\n\"Certain people in life see moments as threats and react like a victim. Other people see opportunities and react like a warrior, where this a moment to do something good.\n\"We need the warriors to step up now and fill the void.\"\nSwansea are hunting midfield reinforcements ahead of Monday night's transfer deadline, with the club known to be looking at the Premier League loan market.\nThey are also believed to have shown interest in Peterborough United captain Hector Kyprianou and are understood to have at least one more target in League One.\nAs far as the Coventry game is concerned, Jay Fulton looks the most likely option to replace Grimes - who will not feature for Coventry because his move was not completed before the registration deadline - given that Joe Allen missed last weekend's defeat at Norwich City through injury.\nOllie Cooper has returned to training having been out since October thanks to a stress fracture in his foot, though Williams has suggested he needs some time to build his fitness.", "url": "https://www.bbc.com/sport/football/articles/cgq0zk20ejwo"}