{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:58:26", "date_modify": "2025-05-21 05:58:26", "date_publish": "2025-02-01 00:00:00", "description": "Watch live coverage of the Men's Free Skate at the European Figure Skating Championships in Tallinn, Estonia.", "filename": "sport_winter-sports_live_cd7d835ez95t_1747807106.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_winter-sports_live_cd7d835ez95t_1747807106.html", "title": "European Figure Skating Championships LIVE: Men's Free Skate from Tallinn, Estonia", "title_page": "European Figure Skating Championships LIVE:  Men's Free Skate from Tallinn, Estonia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "US and Russian figure skaters were on board crashed plane\nBBC News\nA pair of 16-year-old skaters, their mothers, and two Russian coaches were among the passengers on board an aeroplane that hit a helicopter above Washington DC on Wednesday evening, the group's club in Boston says.\nThey were named as teenagers Spencer Lane and Jinna Hahn, their mothers Christine Lane and Jin Hahn, and their Russian coaches Yevgenia Shishkova and Vadim Naumov - who are former world-champion skaters.\nUS officials say they do not expect any survivors from the crash, and that at least 28 bodies have been recovered from scene.\nThe plane was carrying 64 passengers and crew when it collided in mid-air with a US Army helicopter just after 21:00 local time on Wednesday (02:00 GMT).\nIt then fell into the ice-cold Potomac River.\nAs many as 15 people on the flight may have been involved in figure skating in total, an unnamed source told the Reuters news agency.Read this story in full on the BBC News website and app.\nUS Figure Skating confirms \"several members of skating community\" on board plane crash in Washington\nBBC News\nUS Figure Skating - the American governing body for the sport - has confirmed in a statement that several members of its skating community were on board the American Airlines Flight 5342 that collided in mid-air with a Black Hawk helicopter in Washington DC, with both crashing in the Potomac River.\n\"These athletes, coaches, and family members were returning home from the National Development Camp held in conjunction with the U.S. Figure Skating Championships in Wichita, Kansas,\" the statement reads.\n\"We are devastated by this unspeakable tragedy and hold the victims’ families closely in our hearts. We will continue to monitor the situation and will release more information as it becomes available.\"\nThe 2025 Prevagen US Figure Skating Championships were held in Wichita, Kansas between 20-26 January.\nA minute's silence was held before the ISU Figure Skating Championships in Tallinn, Estonia on Thursday as a mark of respect for those involved in the crash.\nGet the latest on this breaking story here.Read more on this story here\nWho will be representing Team GB?\nBBC Sport\nWomen's Singles: Kristen Spours\nKristen Spours comes into the European Championships off the back of a gold medal in the women's singles event at the 2024 British figure skating championships. A five time British Championship medalist, (one gold, two sliver, two bronze) Spours will be looking for her first European podium finish.\nMen's Singles: Edward Appleby\nAt only twenty years of age, Appleby comes into the European Championships having successfully defended his Men's Singles title at the British Figure Skating Championship in Sheffield in November. Like Spours, Appleby will be looking for his first European Championship medal.\nPairs: Anastasia Vaipan-Law & Luke Digby\nThe formidable duo of Anastasia Vaipan-Law and Luke Digby will head to Talinn, Estonia after winning the British Pairs title for a fourth consecutive year. With their dominance at the national level, Vaipan-Law and Digby will be hoping to replicate their fine form to earn their first podium finish on the European stage.\nIce Dance: Lilah Fear & Lewis Gibson/Phebe Bekker & James Hernandez\nTeam GB will have two pairs taking part in the Ice Dance event. First, the duo of Lilah Fear and Lewis Gibson who have won the last four Ice Dance titles at the British Championships. Former European Championship silver medalists, Fear and Gibson will be hoping to go one step further in Talinn to win Ice Dance gold for the first time.\nMeanwhile, Phebe Bekker and James Hernandez come into the tournament following back to back Ice Dance silver medals at the British Championships - the duo will be hoping to translate their recent success into European silverware as the pair aim for their first ever podium finish at the European Championships.\nHow to get into figure skating\nBBC Sport\nHow do I start?\nIf you're a beginner you can check out Skate UK, external - a 10-stage programme to help get you started.\nBut what is it?\nThere's figure skating and speed skating - sports you may have seen at the Winter Olympics. But skating doesn't have to be competitive. You can put on a pair of skates (which you can hire at rinks) and start gliding across the ice. It's best to make sure you can skate in a straight line before you attempt jumps and turns.\nIs it for me?\nIce skating is for anybody and easy to learn, whether you just want a bit of fun with friends or are serious about joining a team.\nWhat to expect when I get there?\nIf you haven't skated before, you might be scared of taking a fall on the ice. But don't worry, most people will take a tumble at some point and you'll be surprised at how quickly your balance will improve.\nThere's an emphasis on quick foot movement and supple knees, so you'll also improve your flexibility.\nThe focus on lower-body movement will help build leg muscles.\nConcentration is key, so ice skating can be mentally stimulating.\nYou can start young - Skate Tots , externalis a training programme for pre-school children to enjoy.\nInclusive Skating, external is an organisation that is striving to make ice skating accessible, and they have devised a scoring system that allows disadvantaged skaters to compete alongside able-bodied competitors.", "url": "https://www.bbc.com/sport/winter-sports/live/cd7d835ez95t"}