{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:16:44", "date_modify": "2025-05-20 13:16:44", "date_publish": "2023-08-02 13:08:27", "description": "Manager David Martindale hopes Joel Nouble gets the transfer \"he deserves\" this summer so Livingston do not lose the striker for nothing next year.", "filename": "sport_football_66377946_1747747004.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/858E/production/_130609143_nouble.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66377946_1747747004.html", "title": "Joel Nouble: Livingston's David Martindale says striker's 'done enough' to earn transfer", "title_page": "Joel Nouble: Livingston's David Martindale says striker's 'done enough' to earn transfer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager David Martindale hopes Joel Nouble gets the transfer \"he deserves\" this summer so Livingston do not lose the striker for nothing next year.\nAnd Martindale does not want to face the dilemma of whether to let the 27-year-old go should an offer arrive at the end of the transfer window.\nLivingston have had \"no direct contact\" from interested clubs.\n\"I think he's done enough to earn a bigger contract elsewhere,\" Martindale said of the Englishman.\n\"I'd like to see Livingston release some value in that player. Joel's in the last year of his contract and every player with a year left on his contract is for sale.\"\nNouble, who joined Livingston in 2021 after leaving Aldershot Town, scored seven times in 36 appearances last season and once in four at the start of his campaign.\n\"I'm not in the business of recruiting, developing, progressing and losing players at the end of their contracts for nothing,\" Martindale said. \"I don't think that business model's sustainable.\n\"I would like to see Joel move on, for Joel personally, for the club also. I just hope it's not the end of August and an offer we have to accept. The deal has to be beneficial to the club.\"\nMartindale would prefer to be in the same position as Motherwell, who sold top marksman Kevin van Veen to Groningen at the start of the transfer window but fears it could more resemble Livingston's sale of Lyndon Dykes to Queens Park Rangers in 2020.\n\"Ideally, you want a Kevin van Veen scenario, where he's away before the season starts and you can use that money to recruit elsewhere,\" he said. \"There's been enough interest in the last six months to suggest that there's a good chance Joel might not be here.\n\"He's similar to big Lyndon - Lyndon started the first game that season and it was late in the August before he moved. But the longer the window goes on, the more likely he's going to be here, because I can't afford to lose him.\"", "url": "https://www.bbc.com/sport/football/66377946"}