{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-21 06:51:28", "date_modify": "2025-05-21 06:51:28", "date_publish": "2025-03-29 21:48:24", "description": "Only one side left in the FA Cup has won it since the 1950s, so will we see a fresh face on the old trophy?", "filename": "sport_football_articles_c9q4q881511o_1747810288.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae11/live/67e99510-0cc4-11f0-bc3f-7189b99ed678.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9q4q881511o_1747810288.html", "title": "FA Cup: Time for a new winner, or a first since the 1950s?", "title_page": "FA Cup: Time for a new winner, or a first since the 1950s? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Could the FA Cup have a new winner this season?\nThe way the draw is shaping up, either an original name or one without a win in generations could well be etched on the famous old trophy.\nCrystal Palace are one of those looking to lift it for the first time after they breezed into the semi-finals by beating Fulham 3-0 on Saturday.\nNottingham Forest are also into the final four, beating Brighton on penalties in the quarter-finals, having last won the competition in 1959.\nMeanwhile, Bournemouth are eyeing a maiden FA Cup win, although they face a tough task against last year's Premier League champions and seven-time winners Manchester City on Sunday.\nMeanwhile, Championship side Preston North End and Aston Villa - who play each other on Sunday - are looking to clinch the trophy for the first time since 1938 and 1957, respectively.\n\"I think every team left in the draw will fancy their chances,\" former Middlesbrough and Fulham goalkeeper Mark Schwarzer said on BBC Radio 5 Live.\n\"Manchester City will be a really tough one for Bournemouth, but if that does go in Bournemouth's favour then all of a sudden the draw looks very different.\n\"It would be a draw where a team could potentially win their first-ever major trophy and certainly the FA Cup. I am excited to see that.\"\nOf course, there could well be a familiar winner of the FA Cup this season, with seven-time champions Manchester City still very much in contention - three of those coming since 2011.\nBut should they be upset by Bournemouth on Sunday then the final four would be absent of City, Arsenal, Chelsea, Liverpool and Manchester United - the sides who have hogged the FA Cup trophy in recent decades.\nThe table above shows how such sides have dominated in the modern era, with only Aston Villa of the remaining clubs in the competition able to compete in terms of wins, although all seven of theirs came before 1958.\nIt isn't actually that long ago since a side who hasn't lifted the FA Cup before - or won it for the first time in a long time - last clinched it.\nThat happened just four years ago, when Leicester City triumphed over Chelsea.\nHowever, that Foxes win is just the third time since Everton won the FA Cup 30 years ago that a side other than Arsenal, Chelsea, Liverpool, Manchester City and Manchester United won it.\nThe others were surprise triumphs for Wigan in 2013 and Portsmouth five years earlier.\nThat 2008 showpiece was also the last time a final did not include one of the aforementioned five Premier League sides, with Harry Redknapp's Portsmouth beating Cardiff.\n\"I think it could happen this season,\" former Everton midfielder Fara Williams said on Football Focus.\n\"If you look how the Premier League has unfolded this season, there have been some real surprise packages.\n\"This may be the year we have two teams in the final we haven't seen in recent seasons.\"\n\"It will be a huge ask,\" former Liverpool and Aston Villa full-back Stephen Warnock said on Football Focus.\n\"The only thing is if you can be very difficult to play against, very organised and maybe score a wonder goal or a set piece. I just don't see it happening.\"\nSchwarzer added: \"This is what the FA Cup is about - being able to dream.\n\"[It is a chance for] clubs who may not necessarily think they have a chance to win the FA Cup but are now in a great position to probably rewrite history.\"", "url": "https://www.bbc.com/sport/football/articles/c9q4q881511o"}