{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:41", "date_modify": "2025-05-21 06:01:41", "date_publish": "2025-04-01 22:00:47", "description": "Arsenal 2-1 Fulham: Marco Silva reacts to defeat", "filename": "sport_football_articles_c93gpe8kl3zo_1747807301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0456/live/bdab7ec0-0f3d-11f0-801a-296f2b6075c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93gpe8kl3zo_1747807301.html", "title": "Arsenal 2-1 Fulham: Marco Silva reacts to defeat", "title_page": "Arsenal 2-1 Fulham: Marco Silva reacts to defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham boss Marco Silva, speaking toBBC MOTD: \"Wasn't a good game from us. Arsenal deserved to win, not a good first half. Difficult when they took control. Even in the first 10 minutes we looked like we were not aggressive enough, not doing the right moves.\n\"We had the ball but not with the attacking aggression we have to have. The second goal makes a massive impact, it's clear we have to try to stop that. Reaction after that was good, subs had impact on the game but it was a bit too late. Rodrigo [Muniz] had a chance to score around 79 minutes but overall not a good performance.\n\"They fought until the end but not the best one.\"\nOn if it was a hangover from the FA Cup defeat: \"No. Something that was done last Saturday and we have to move on. It's not an excuse, what we showed then was that and we have to show different things. Arsenal much fresher than us in some moments, we tried fresh legs and to be more aggressive. Second half better than first, more chances. Our first half - not good.\n\"The schedule is what it is. Some players have played more minutes. It's been tough for Alex [Iwobi], he's been playing week in week out. He's played lots of minutes. We have to manage the players because of the international break.\n\"Premier League doesn't allow you to switch off or allow you to be sloppy in moments when you are attacking or defending. It's clear we have to be consistent.\"", "url": "https://www.bbc.com/sport/football/articles/c93gpe8kl3zo"}