{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:48", "date_modify": "2025-05-21 03:41:48", "date_publish": "2025-04-06 18:42:24", "description": "Tottenham 3-1 Southampton: What Jack Stephens said", "filename": "sport_football_articles_czjn3w1dn2ko_1747798908.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bfcf/live/9b9077f0-1316-11f0-a8f7-59659b31eb3f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjn3w1dn2ko_1747798908.html", "title": "Tottenham 3-1 Southampton: What Jack Stephens said", "title_page": "Tottenham 3-1 Southampton: What Jack Stephens said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton captain Jack Stephens says the club's relegation from the Premier League is \"humiliating\", with Ivan Juric's side still rooted to the bottom of the table on 10 points after a 3-1 loss to Tottenham.\nSpeaking to BBC Radio Solent after the game, Stephens said: \"It's obviously still fresh, but this season has been a massive disappointment. We are really disappointed in the dressing room. The lads are obviously really down. We are just gutted that we couldn't give the fans what they deserve, not only today but also this season as a whole.\"\nOn what he would say to the club's supporters about this season: \"First thing's first, we have to look at ourselves. That is what we will do and what we have spoken about already. We have to look in the mirror and ask ourselves whether we did everything we could and whether we have been good enough.\n\"Ultimately, the answer to the second question is that we have been nowhere near good enough.\n\"We can say that the gap between the Championship and the Premier League is getting bigger - which it is - but we shouldn't be relegated with seven games to go.\"\nOn what the mood has been like in Southampton's dressing room: \"I won't accept anyone not giving 100% and I can stand here and say that hasn't been the case this season.\n\"This group of lads have given everything, have really worked hard at it and have stuck together. I would be the first person to tell you if the dressing room wasn't in a good place.\n\"We are low - we have been for a few months - but we have stuck together and stuck at it. I just hope that has reflected on the pitch. The bottom line is that we haven't been good enough, as individuals and as a team.\n\"I just genuinely believe we have fallen short. We haven't been good enough from day one and, once you get into that rut of losing games and conceding goals, it is very difficult to get out of it.\"", "url": "https://www.bbc.com/sport/football/articles/czjn3w1dn2ko"}