{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:15:39", "date_modify": "2025-04-26 06:15:39", "date_publish": "2025-03-01 21:42:10", "description": "Alexander Isak might cost Liverpool more than £120m, Lamine Camara is attracting Premier League interest, Arsenal and Chelsea are linked with Benjamin Sesko, plus more.", "filename": "sport_football_articles_cwyd7rg6q5eo_1745648139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/731f/live/83e64900-f6dc-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyd7rg6q5eo_1745648139.html", "title": "Football gossip: Isak, Camara, Sesko, Wirtz, Antony, Garnacho", "title_page": "Football gossip: Isak, Camara, Sesko, Wirtz, Antony, Garnacho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alexander Isak might cost Liverpool £120m or more, Senegal midfielder Lamine Camara is attracting Premier League interest, Arsenal and Chelsea are linked with RB Leipzig's Benjamin Sesko.\nLiverpool might have to pay £120m or more to sign Sweden striker Alexander Isak, 25, from Newcastle United - and face competition from Chelsea and Arsenal. (Give Me Sport), external\nTottenham, Liverpool, Manchester City and Chelsea have joined a list of Europe's top clubs chasing Monaco's 21-year-old Senegal midfielder Lamine Camara. (TBR Football), external\nArsenal and Chelsea have also been linked with a possible move for RB Leipzig's Slovenia striker Benjamin Sesko, with the 21-year-old unlikely to stay at the fourth-placed Bundesliga club if they fail to qualify for next season's Champions League. (Mirror), external\nChelsea and Liverpool, meanwhile, could battle it out for RB Leipzig's highly rated France centre-back Castello Lukeba, although Real Madrid are also among the 22-year-old's long list of admirers. (Mirror), external\nBayern Munich chief Karl-Heinz Rummenigge says the Bundesliga leaders want to compete for the signing of Bayer Leverkusen's 21-year-old Germany forward Florian Wirtz, who has been linked with a summer move to Manchester City. (AZ via Mail), external\nArsenal could be left to rue selling striker Mika Biereth, 22, to Sturm Graz for £4m in the summer - the Danish youth international went on to score 11 goals in 16 games for the Austrian Bundesliga side before netting 10 goals in seven league matches for Monaco after moving for £10.7m in January. (Mirror) , external\nReal Betis are exploring a longer-term deal for on-loan Brazil winger Antony but are unlikely to be able to afford the Manchester United player's wages or fee, which is expected to be £41m. (Fichajes - in Spanish), external\nLiverpool are keeping tabs on Brighton's Carlos Baleba before a potential summer move for the 21-year-old defensive midfielder from Cameroon. (Football Insider), external\nBarcelona are closely monitoring Manchester United winger Alejandro Garnacho, 20, with a view to completing a move for the Argentina international in the summer. (Fichajes - in Spanish), external\nChelsea are preparing to complete a deal worth £12.4m plus add-ons for Corinthians' 17-year-old Brazilian full-back Denner Evangelista, who would join the west London club in 2026. (Fabrizio Romano), external\nChelsea's potential new recruit - whose full name is Denner Alves Evangelista Pereira but is known simply as Denner - is the cousin of Arsenal's Brazil defender Gabriel Magalhaes. (Metro), external", "url": "https://www.bbc.co.uk/sport/football/articles/cwyd7rg6q5eo"}