{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:22", "date_modify": "2025-05-21 05:27:22", "date_publish": "2025-01-15 09:57:33", "description": "Chris Eubank Jr is set to fight Conor Benn in their long-awaited showdown in April in London.", "filename": "sport_boxing_articles_cvge4e7l53vo_1747805242.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2a4/live/ca255290-d1c9-11ef-a00c-b776b3393886.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cvge4e7l53vo_1747805242.html", "title": "Eubank vs Benn: Chris Eubank Jr to fight Conor Benn in London in April", "title_page": "Eubank vs Benn: Chris Eubank Jr to fight Conor Benn in London in April - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Eubank Jr will fight Conor Benn in their long-awaited showdown in April in London, according to Saudi boxing organiser Turki Alalshikh.\nTottenham Hotspur Stadium is a possible venue for the all-British fight which could take place on 26 April.\nThe bitter rivals were scheduled to meet in October 2022, which would have been 29 years after their revered fathers Nigel Benn and Chris Eubank Sr fought for a second time.\nHowever, the contest was called off after Conor Benn failed a voluntary drug test, which sparked a two-year battle with anti-doping authorities that culminated in his suspension being lifted last November.\nBenn has posted a picture of himself signing a contract alongside his promoter Eddie Hearn and Alalshikh, who has organised some of the biggest fights in recent years as chairman of Saudi Arabia's general entertainment authority.\nPosting the same picture, Hearn wrote: \"The biggest fight in British boxing has been made.\"\nIn a post on X on Wednesday, Alalshikh wrote: \"Eubank Jr vs Benn done in April, London.\"\nThe 35-year-old will be the favourite against 28-year-old Benn, who steps up from the welterweight limit of 10st 7lb (147lb) for the bout.\nBenn has not fought in the UK since 2022, but he competed twice in the United States during his provisional suspension.\nThe Briton has always denied intentionally doping and will again be subject to Voluntary Anti-Doping Association (Vada) testing for the Eubank bout.\nEubank, who usually fights at middleweight, has one loss in his last nine outings but avenged that 2023 defeat to Liam Smith later that year.\nBenn has not fought at an elite level but has an unbeaten record of 23 wins with 14 knockouts.", "url": "https://www.bbc.com/sport/boxing/articles/cvge4e7l53vo"}