{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:26", "date_modify": "2025-05-20 12:33:26", "date_publish": "2023-08-04 09:30:45", "description": "Glamorgan all-rounder Andrew Salter is to retire at the end of the season after 11 years in the first-team squad.", "filename": "sport_cricket_66325043_1747744406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2DA4/production/_130548611_gettyimages-1234770917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66325043_1747744406.html", "title": "Andrew Salter: Glamorgan all-rounder to retire after 11 years at Welsh county", "title_page": "Andrew Salter: Glamorgan all-rounder to retire after 11 years at Welsh county - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan all-rounder Andrew Salter is to retire from professional cricket at the end of his contract, after 11 years in the first-team squad.\nThe Pembrokeshire-born spinner was man of the match in Glamorgan's One-Day Cup final victory over Durham in 2021.\nSalter has been a regular member of Glamorgan's limited-overs sides for most of his time at the club.\nThe 30-year-old has scored 2,220 first-class runs for Glamorgan and taken 127 wickets.\n\"I am walking away from the game after a decade with memories to last a lifetime,\" said Salter.\n\"Coming to the realisation my career is drawing to a close, the overriding emotion is one of gratitude.\n\"I would like to thank the club for giving a young off-spinner from Pembrokeshire the chance to play around the world, to team-mates for sharing the adventure.\n\"Ever since those backyard matches with my brother it was my dream to play for Glamorgan and I have many people to thank for making that a reality.\n\"None of this would've been possible without my parents' unselfish sacrifice and dedication. From the financial demand of travelling the country to the emotional stress of sharing all the tough days.\n\"What cricket demands both mentally and physically it repays in friendships and life opportunities which can't be replicated anywhere else.\"\nSalter came through the Cardiff MCCU university system, making his debut for them in 2012 and playing limited-overs cricket for Glamorgan.\nThe following year, he took a wicket with his first ball in four-day county cricket at Swansea, and was part of the side who reached the Lord's final of the YB40 competition.\nSalter also grew into a key member of the T20 side, reaching Finals Day in 2017.\nSeveral of his key performances have come in recent years against Durham, including his best red-ball score of 90 in the 2021 season and best bowling figures of 7-45 in 2022.", "url": "https://www.bbc.com/sport/cricket/66325043"}