{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:02:51", "date_modify": "2025-05-21 07:02:51", "date_publish": "2024-12-27 00:00:00", "description": "Follow live text commentary, score updates and match stats from Brighton & Hove Albion vs Brentford in the Premier League", "filename": "sport_football_live_cjdnrrmpl03t_1747810971.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cjdnrrmpl03t_1747810971.html", "title": "Brighton 0-0 Brentford: Seagulls' winless run continues after dull goalless draw", "title_page": "Brighton 0-0 Brentford: Seagulls' winless run continues after dull goalless draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton's winless run stretched to six Premier League games as a resolute Brentford side held them to a goalless draw to gain only their second away point of the season.\nThe hosts nearly took a fifth-minute lead when Joao Pedro, with his back to goal, laid the ball off for Julio Enciso, but his first-time curling effort bounced off the right upright.\nThat proved to be as close as either side would come on a cold and misty evening at the Amex Stadium.\nBrentford, with the worst away record in the league, thought they had taken the lead in the 14th minute against the run of play.\nYoane Wissa raced through the middle of the home defence and finished well, only for the video assistant referee (VAR) to rule he was narrowly offside when he collected possession.\nBrighton midfielder Solly March received a standing ovation from the home fans near the end of the match when he came on as a substitute.\nHe had missed 14 months of action with a serious knee injury sustained late on during Brighton's 2-1 away loss to Manchester City in October 2023.\nBut he was unable to be the match winner, shooting over from the edge of the penalty area in the 94th minute, as it ended in a draw.\nIn a bizarre incident in the second half, Pedro was fortunate to not make contact with Yehor Yarmoliuk after swinging an elbow at the substitute who had been pulling his shirt.\nThe Brentford man received a yellow card and the incident was checked by VAR, but no action was taken against Pedro.\nSpeaking on Amazon Prime, former Premier League referee Mark Clattenburg said there would only have been a sending off for violent conduct if there had been contact, but it would have been an \"easy\" red card if Pedro had connected with Yarmoliuk.\nBrighton have finished in the top 11 in each of the past three seasons and there were some boos from the home supporters at the end.\n\"The team doesn't deserve that,\" said boss Fabian Hurzeler who only took over in the summer. \"All the games we've had in the last few weeks it has been the case where we thought we deserved more.\n\"We tried to work hard to satisfy the supporters and give them what they deserve and make them proud of us.\n\"The Premier League is tough and we know there will be periods where we have to go through, especially with a young squad. We try to find the positives and keep going.\"\nBrighton will be left wondering how they failed to secure all three points.\nTheir football in the first half, led by the talented Kaoru Mitoma and Enciso, was a joy to watch.\nAs well as hitting the post, Enciso also missed three other good chances. Matt O'Riley had two decent attempts and Mitoma fired into the side netting, with those on the other side of the ground thinking the ball had gone into the net.\nBrentford suffered a blow midway through the first half when first-choice goalkeeper Mark Flekken suffered an injury to his right thigh after he had to twist quickly to keep out Mitoma's deflected cross.\nThat handed a Premier League debut to 23-year-old Hakon Valdimarsson.\nThe Iceland international joined the club in a £2.6m deal from Swedish side Elfsborg in the summer and had only made two appearances - against Colchester United and Leyton Orient in the Carabao Cup\nHowever, Brighton could not test the back-up keeper in a tame second half.\nThe Seagulls played in European competition for the first time last season, reaching the last 16 of the Europa League with Roberto de Zerbi in charge.\nA month ago it looked like Brighton, now coached by Fabian Hurzeler, would be pushing for European qualification again for the 2025-26 campaign.\nA 2-1 win at Bournemouth on 23 November left Brighton fifth, level on points with Chelsea and Arsenal and dreaming of making a push for a Champions League place.\nThey have not won since.\nA win could have taken them seventh, but they remain 10th and have only got four points from six matches - draws against Southampton, Leicester, West Ham and now Brentford along with 3-1 losses to both Fulham and Crystal Palace.\nMeanwhile, Brentford moved up to 11th, above Tottenham, despite picking up 22 of their 24 points at home and they had to work hard to gain only their second point on their travels.", "url": "https://www.bbc.com/sport/football/live/cjdnrrmpl03t"}