{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:53:17", "date_modify": "2025-04-26 06:53:17", "date_publish": "2025-02-28 16:36:48", "description": "Critchley has 'brought everyone together' - Gordon", "filename": "sport_articles_cvgp94343djo_1745650397.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d7e/live/0f5871c0-f5f2-11ef-8134-89f6ea5f25cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvgp94343djo_1745650397.html", "title": "Critchley has 'brought everyone together'", "title_page": "Critchley has 'brought everyone together' - Gordon  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Craig Gordon says \"methodical\" head coach Neil Critchley has shaped Hearts into a \"good unit\" who can continue to improve under his stewardship.\nCritchley was appointed in October when the side were two points adrift at the bottom of the top flight with just two points from their opening eight matches.\nAfter a shaky start to the 46-year-old Englishman's tenure, the Jambos have lost just one game in 11 and are now in the top half of the table as Critchley eyes a first Edinburgh derby win in Sunday's showdown at Easter Road.\n\"There was probably only one way things could go, we had to start climbing the table,\" said goalkeeper Gordon.\n\"He's really come in and brought everyone together. He's tried a few different things. He's tried different formations, different people to find out what worked.\n\"He's slowly built us into a good unit that's winning matches. You've got to give him great credit for the way he's gone about it. It's been a work in progress, I'm sure he would admit that.\n\"Throughout the season he's been trying to add things in as we go. I can see us continuing to improve under him and continuing to push up towards the top end of the league and going into next season with high hopes for that one as well.\n\"Tactically and on the pitch he's very methodical about what he wants everybody to do. He's just building on that as every training session goes by. He's trying to give the players more and more information.\"\nShould Hearts continue their stellar form, a fourth successive season in Europe could well be attainable.\nGordon added: \"It's games like this between now and the end of the season that are going to determine where we finish.\n\"It's a good turnaround. We need to keep winning games to make sure we complete it. It would be an absolutely incredible achievement to have come from where we have to finish the season with any kind of European football.\"", "url": "https://www.bbc.co.uk/sport/articles/cvgp94343djo"}