{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-21 07:16:59", "date_modify": "2025-05-21 07:16:59", "date_publish": "2025-03-29 06:12:36", "description": "Rugby union should consider banning head coaches from matches if their players are repeatedly involved in head-on-head tackles, says former England women's boss Simon Middleton.", "filename": "sport_rugby-union_articles_cm2djrjy84eo_1747811819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4876/live/709cb3b0-0b37-11f0-85cb-f3d56479460b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cm2djrjy84eo_1747811819.html", "title": "Six Nations: Simon Middleton, ex-England head coach, says coaching bans would prevent head-on-head tackles", "title_page": "Six Nations: Simon Middleton, ex-England head coach, says coaching bans would prevent head-on-head tackles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rugby union should consider banning head coaches from matches if their players are repeatedly involved in head-on-head tackles, says former England women's boss Simon Middleton.\nIn the Women's Six Nations opening round, France centre Gabrielle Vernier was sent off for a head-on-head hit in their win over Ireland, followed by Wales' Georgia Evans receiving a second yellow card for a similar tackle in their defeat by Scotland.\nIn this year's men's Six Nations, Ireland centre Garry Ringrose received a red card for a head-on-head tackle on Wales' Ben Thomas.\nMiddleton - England head coach from 2015 to 2023 - suggests that three illegal head-on-head tackles in a game should result in a one-match touchline ban for that team's head coach.\n\"You want to make it impactful and resonate,\" Middleton told BBC Sport.\n\"If I am a defence coach and I know the action of my player is going to impact the availability of the head coach then I am probably going to be more diligent and aware of the consequences of what I am coaching.\n\"As a head coach you are charged with overseeing your coaching group so ultimately the buck stops with the head coach.\n\"I do think reducing head contact in rugby is moving in the right direction, but there has been a notable change in terms of the nature of incidents now being more head-on-head than shoulder-to-head.\"\nMiddleton coached the Red Roses to the World Cup final in 2022, where his side lost to New Zealand after playing the majority of the game with 14 players following a high, head-on-head tackle by wing Lydia Thompson.\nThe 59-year-old says more detail around tackle height from his coaching team could have prevented the red card.\n\"We paid a huge price for it in the World Cup and rightly so as that was the correct decision and we have to live with that,\" he said.\n\"I look back on the build-up to the World Cup and think 'what was our part in that?' We clearly played a part.\n\"We have to be accountable as it is never just about the players, it is about why the player has actioned in that way. There are some things you can't control but most of the actions are a product of what they are coached.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cm2djrjy84eo"}