{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:03", "date_modify": "2025-05-21 04:10:03", "date_publish": "2024-12-29 00:00:00", "description": "Celtic end what manager Brendan Rodgers described as one of the most \"exceptional years\" in their history with a 4-0 thrashing of St Johnstone.", "filename": "sport_football_live_clygnp9e8l0t_1747800603.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_clygnp9e8l0t_1747800603.html", "title": "Celtic vs St Johnstone: Scottish Premiership report, reaction & stats", "title_page": "Celtic vs St Johnstone: Scottish Premiership report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic ended what manager Brendan Rodgers described as one of the most \"exceptional years\" in their history with a 4-0 thrashing of St Johnstone.\nThe win extends their domestic unbeaten run this season, having dropped points just twice as they approach the halfway stage of the Scottish Premiership campaign.\n\"When you look at all the numbers and stats, this will be one of the exceptional years in the history of Celtic,\" the manager said.\n\"It's great for the supporters, they can see how hard the team is working.\"\nThis outcome widens Celtic's lead over closest rivals Rangers to 14 points before a trip to Ibrox on Thursday.\n\"We're not even at the halfway point but I can only give a huge testament to the players because of the work and the mindset,\" Rodgers added.\n\"They know they're in a safe place because they know they can lose games. We ask the players to take risks and if they do we know we can lose games in the right way.\"\nBottom side St Johnstone drop further behind those above, and are now without a win in their past five matches.\nIt was one-way almost throughout, with Simo Valakari's visitors initially offering stiff resistance with Cameron Carter-Vickers, Kyogo and Arne Engels all going close.\nThe opener arrived from a familiar source. Nicolas Kuhn gathered from Reo Hatate then cut inside and, with the goal gaping, he made no mistake.\nThe German's return of decisive moments in front of goal has been outstanding this season.\nMoments later, Kuhn brought out a wonderful save from Josh Rae as his curling effort sailed towards the top far corner.\nSt Johnstone made changes at the break and got a response but nothing that would ultimately impact the result. They were pinned back ruthlessly.\nKuhn came close again before Kyogo benefitted from a well-worked corner to nod home from a yard after Rae parried Paulo Bernardo's flick towards goal.\nThat was Celtic's 50th of the league campaign in just 18 games.\nAnother arrived for the Japanese striker thanks to a beautifully whipped low cross from Engels that left Rae completely exposed as St Johnstone's fight evaporated.\nAt that stage they were fighting to keep the score down but substitute Maeda came on and finished after a piercing Bernardo through ball.\nRuthless, once again, from the champions.\nAnother win for Celtic as their domestic dominance shows absolutely no sign of relenting.\nWith captain Callum McGregor rested along with Maeda it did little to affect the outcome such is the armoury Brendan Rodgers can utilise.\nTo have breached a half century of goals at the halfway stage of the Premiership really says it all.\nThey carry such threat and even if, as in this game, there is initial resistance from their opponents, they nearly always find a way.\nA trip to play Rangers on 2 January follows and on this form, with the strength of squad they possess, that could be defining.\nThey are in a fantastic place with everything seemingly going their way.\nIt proved another thankless afternoon for Valakari's side, who find themselves further adrift at the foot of the table.\nNot unexpected and perhaps this fixture came at a bad time given confidence is clearly low right now.\nFor the first third, they produced a stoic, structured performance that restricted Celtic but as they began to tire, their opponents mercilessly overran them.\nThey were chasing shadows come the end.\nThey hold the worst defensive record in the Premiership and can take some positives from this but not too many.\nWith a resurgent Hibernian the visitors next, they need to find some way, any way, to take something from that fixture to avoid becoming detached.\nCeltic manager Brendan Rodgers: \"You have to always give credit to the other team, but I thought from minute one we were outstanding.\n\"From the first to the 94th minute I was so pleased with the level, purely from a mentality perspective. We kept going right to the very end.\"\nSt Johnstone manager Simo Valakari: \"The opponent was very good. From the first minute until the very last they pushed us. It was very, very difficult.\n\"The biggest thing we learned is the attitude of these top players. It doesn't matter who they play, is it the first half or the second half, is the game already won? They keep pushing. If we can learn that it will help us a lot.\"", "url": "https://www.bbc.com/sport/football/live/clygnp9e8l0t"}