{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 03:46:45", "date_modify": "2025-05-21 03:46:45", "date_publish": "2025-01-23 16:50:49", "description": "International Cricket Council chair Jay Shah joins a new Marylebone Cricket Club global advisory board as its world cricket committee is scrapped.", "filename": "sport_cricket_articles_cm27mne4902o_1747799205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/937d/live/1bc417a0-d9a2-11ef-941c-57ca5bda0a5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cm27mne4902o_1747799205.html", "title": "ICC chair Jay Shah joins new MCC global advisory board as world cricket committee scrapped", "title_page": "ICC chair Jay Shah joins new MCC global advisory board as world cricket committee scrapped - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "International Cricket Council chair Jay Shah has joined the Marylebone Cricket Club's new global advisory board, which will replace its world cricket committee.\nThe board was spawned out of the World Cricket Connects forum hosted by the MCC at Lord's in 2024 when 120 of the leading voices in the sport gathered to discuss the game.\nThe MCC said it wants the board, which will meet virtually in the main, to be a \"leading symposium\" in the sport \"to ensure cricket's future success\".\nIndian Shah, 36, became the youngest ever chairman of the ICC when he succeeded New Zealander Greg Barclay in December 2024.\nHe is the former secretary of the Board of Control for Cricket in India and one of the most powerful figures in the world game.\nThe advisory board will be chaired by former Sri Lanka captain Kumar Sangakkara, who served as MCC president from October 2019 to September 2021 and was the first non-British person to hold the role.\nFormer international captains Sir Andrew Strauss and Graeme Smith as well as current England women's captain Heather Knight have also accepted offers to join the advisory board.\nMCC chair Mark Nicholas said: \"We have assembled an impressive group of the best minds in cricket across several different areas relevant to our sport.\n\"I am delighted to be working with this experienced group and excited about what we can collectively achieve for the benefit of the global game.\"\nBased at Lord's, which it owns, the MCC acts as custodian and arbiter of the laws and spirit of cricket.\nThe MCC world cricket committee, established in 2006, did not have any formal power as such but was frequently consulted on significant cricket issues and its ideas implemented by the ICC.\nThe Decision Review System (DRS) and the World Test Championship were both among the recommendations made by the committee and subsequently adopted by cricket's world governing body.", "url": "https://www.bbc.com/sport/cricket/articles/cm27mne4902o"}