{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-19 14:41:40", "date_modify": "2025-05-19 14:41:40", "date_publish": "2017-08-13 23:06:01", "description": "American Justin Thomas wins his first major with a thrilling two-shot victory at the US PGA Championship at Quail Hollow.", "filename": "sport_golf_40918914_1747665700.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C08B/production/_97319294_hi041085853.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_40918914_1747665700.html", "title": "US PGA Championship: Justin Thomas wins maiden major at Quail Hollow", "title_page": "US PGA Championship: Justin Thomas wins maiden major at Quail Hollow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Justin Thomas won his first major with a thrilling two-shot victory at the US PGA Championship at Quail Hollow.\nThe American, 24, trailed leader Kevin Kisner by two shots going into the final round but hit a three-under-par 68 to win on eight under.\nFrancesco Molinari (67), Patrick Reed (67) and Louis Oosthuizen (70) tied for second.\n\"I can't put it into words right now. I'm glad to have a trophy now,\" an emotional Thomas said.\nThomas made six birdies in his round, including spectacular efforts on the 10th and 13th holes.\nRickie Fowler carded a four-under-par 67 to tie for fifth on five under alongside Japan's Hideki Matsuyama, who went round in 72.\nAt one stage on the back nine, Thomas, Molinari, Matsuyama, Kisner and Chris Stroud were tied for the lead.\nKisner, who led after each of the opening three rounds and for much of the early part of his final round, fell away late on as a one-over 72 left him four under for the tournament.\nThomas, from Kentucky, is the eighth first-time major winner in the last nine majors.\nThomas started the round on five under but he slipped to three shots behind leader Kisner with two bogeys in his opening three holes.\nThe world number 14 picked up birdies at seven and nine while Kisner slipped back after finding the water on the seventh.\nAt that point, Thomas' playing partner Matsuyama - bidding to become Japan's first male major champion - took the outright lead thanks to back-to-back birdies before faltering on the back nine.\nThomas' round gained momentum on the 10th, when a birdie putt clung to the lip of the hole for 15 seconds before dropping.\n\"It was funny because it snuck up on the hole. We read it going left and then a bit right and it never came back right,\" Thomas said.\n\"Once it got there I felt it would go in but it didn't so I acted like a child and had a tantrum. Suddenly it went in and I didn't look so dumb.\"\nThomas moved two shots clear of the field on the 13th when he chipped in from the edge of the green as the crowd erupted.\nHe made another birdie on 17 and, despite a bogey on the last, led with one pairing left on the course.\nKisner had to eagle the 18th to force a play-off, but he found the water and double-bogeyed.\nIain Carter, BBC golf correspondent\nThis was an outstanding performance from Justin Thomas, taking the initiative, seizing the moment. The birdie at the 17th meant he could drop a shot at the last.\nIt was Thomas' fourth victory of the year. He really kicked on this week. The way he finished this off was very impressive and now he rises to number six in the world.\nJay Townsend, BBC golf pundit\nThe strength of Justin Thomas is everything. He hits it a mile, he can hit it high. He is a more talented hitter of the ball than Jordan Spieth, although I don't think there's a more talented all-round golfer at making scores than Spieth at the moment.\nIf you think about Spieth, Thomas, Patrick Reed, Brooks Koepka, Dustin Johnson - these are young guys that are going to carry the US Ryder Cup team for probably the next five matches. The tide has probably turned.\nEngland's Jordan Smith, competing in his first major, was the highest-placed British player on one under after a three-under 68.\nCompatriot Paul Casey hit a 71 to tie for 13th at level par for the tournament.\nEnglishman Ian Poulter's two-under final round of 69 gave him a top-25 finish at one over.\nFurther down the leaderboard, Chris Wood carded a final-round 73 to end three over, Tommy Fleetwood finished eight over thanks to a final-round 74, while Lee Westwood hit a four-over-par 75 for 11 over.", "url": "https://www.bbc.com/sport/golf/40918914"}