{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:48:37", "date_modify": "2025-04-26 06:48:37", "date_publish": "2025-03-01 11:06:38", "description": "England's Charley Hull goes into the final round of the Women's World Championship in Singapore one shot off the lead despite struggling with illness.", "filename": "sport_golf_articles_cnvz5ej0564o_1745650117.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d34/live/84644be0-f68a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cnvz5ej0564o_1745650117.html", "title": "LPGA: Charley Hull one shot off lead at Women's World Championship", "title_page": "LPGA: Charley Hull one shot off lead at Women's World Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England's Charley Hull goes into the final round of the Women's World Championship in Singapore one shot off the lead despite struggling with illness.\nThe 28-year-old, who has won twice on the LPGA tour but is searching for her first win since 2022, carded a four-under 68 in the third round to move to nine under par for the tournament at Sentosa Golf Club.\nHer preparations were hampered by an overnight bug, but Hull made light of that with a bogey-free round that included two birdies on the front nine and two more on the 10th and 13th holes as she kept pace with leader Lydia Ko.\n\"I woke up this morning and threw up. It was just a little bit of a bug but I'm fine,\" said Hull, who will go off in the final pairing with New Zealand's Olympic champion Ko.\nThailand's Atthaya 'Jeeno' Thitikul showed the form that saw her win the Saudi Ladies International last month to produce the day's lowest score of 66 as she moved into third place on seven under.\nSouth Korea's Kim A-lim, who topped the leaderboard at the halfway stage, carded a 73 to fall into a three-way tie for fourth on six under, alongside Australia's Minjee Lee and Pajaree Anannarukarn, of Thailand.", "url": "https://www.bbc.co.uk/sport/golf/articles/cnvz5ej0564o"}