{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:25", "date_modify": "2025-05-21 04:16:25", "date_publish": "2025-04-06 00:00:00", "description": "Relive day three of the opening round of the 2025 County Championship as Hampshire, Kent, Derbyshire and Leicestershire all win.", "filename": "sport_cricket_live_cj673z6wp93t_1747800985.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cj673z6wp93t_1747800985.html", "title": "County Championship as it happened: Wins for Hants, Kent, Derbyshire and Leicestershire", "title_page": "County Championship as it happened: Wins for Hants, Kent, Derbyshire and Leicestershire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's it for day three\n#bbccricket\nAnother sun-kissed day draws to a close - is this really the new cricket season?\nIt's four matches down leaving five to go on the final day after Hampshire, Kent, Derbyshire and Leicestershire made winning starts to their campaigns.\nSurrey will have to resist Essex to avoid defeat in Chelmsford, and Somerset will be pushing hard for a big victory against Worcestershire on a final day which has plenty at stake.\nThanks for your company - we'll be back right here at 10.30am tomorrow to see what develops.\nLEICS BEAT GLAMORGAN BY 10 WICKETS\nGlamorgan 229 & 248 v Leicestershire 427 & 53-0\nRehan Ahmed square cuts Sam Northeast for four and Leicestershire have an added-time win at Sophia Gardens.\nIt took them just six overs to reach their target after bowling out Glamorgan for 248, with Ahmed 13 not out and Sol Budinger on 32.\nThe Foxes were on course for an innings win when Glamorgan were 133-7, but Kiran Carlson (113) and Andy Gorvin (50 not out) staved off that possibility with a stand of 99.\nA good start to the season by Leicestershire, for whom Ian Holland took seven wickets in the game.\nPost\nGlamorgan 44-0 - target 51\nIt's all happening.\nSpinner Ben Kellaway sends one down which is called a no-ball on height, Sol Budinger miscues and is caught at deep mid-wicket but it doesn't count.\nAntooer Kellaway no-ball means he has to be taken off off and Sam Northeast has to finish the over.\nHis first ball is a long hop and Budinger smashes it for six.\n'All things are possible'\nWarks 454 v Sussex 528 & 126-3 - close\nClive Eakin\nBBC CWR Sport\nThe lead is exactly 200 for Sussex with seven wickets left.\nAll things are possible, it could just peter out and there'll be handshakes all around at 5 o'clock or we could have one team getting into trouble and a close finish. Who knows?\nWe will find out tomorrow.\nClose of play\nNotts 579 v Durham 378 & 114-3\nJosh Tongue in for the final over of the day.\nYet another ball stays low, but Colin Ackermann keeps it out, prompting more stifled yelps.\nHe pokes the next ball down the ground for a single before Ollie Robinson pushes into the offside for two. And that's that for day three.\nThree evening session wickets have given Nottinghamshire a sniff of an opening-season victory.\nLyndon James’ century and Josh Tongue’s maiden half-century helped Notts rattle up a 201-run lead and rule out the prospect of a home defeat.\nOn a good batting strip, Fergus O’Neill conjured up two wickets in three balls to open up the game before Josh Tongue picked up Ben McKinney late on.\nDurham are 87 runs away from wiping out the first-innings deficit.\nThe challenge in the morning will be to remove the wily campaigner Ackermann (45*), not to mention the prolific Robinson (6*).\nAn early breakthrough and anything could happen, but Notts will need to make things happen relatively quickly if they are to force a win.\nPost\nNotts 579 v Durham 378 & 111-3\nFarhan Ahmed gives Ollie Robinson a little width and he whips it through the offside for another single.\nWith three close catchers for company Colin Ackermann latches on a ball which strays down leg and helps it on its way to add another run to bring up nelson.\nHe goes over the wicket for his final ball of the day but Robinson reaches forward to block.\nPost\nLeics 11-0 - target 51\nIn theory, that is the day's allocation completed at Sophia Gardens. Except that it isn't.\nLeicestershire want to be on the road home this evening and have called for the extra half hour.\nFive runs from the latest Timm van der Gugten over as Sol Budinger has a mow at the final delivery and fails to make contact.\nEight more to be bowled - 40 runs needed by the Foxes.\nClose of play at Edgbaston\nWarks 454 v Sussex 528 & 126-3\nSussex have got themselves into a position where they could make it an uncomfortable final day for Warwickshire but the home side may still harbour hopes of forcing a result.\nJack Carson's 4-92 helped Sussex take a 74-run first innings lead and they have gradually built on that.\nThe late dismissal of Tom Clark to one from Taz Ali which turned a long way also keeps things in the balance.\nThe draw remains the more likely result but you never know.\nSussex lead by 200 runs.\nClose of play at Lord's\nMiddlesex 260 & 288-6 v Lancashire 359\nWhen Tom Bailey has Leus du Plooy caught behind to leave Middlesex 7-3 in their second innings, it looked like Lancashire might be on their way to victory at Lord's with a day to spare.\nBut a superb century by Max Holden has turned things around for the home side, who lead by 189, playing out a maiden from George Balderson to end the third day's play.\nHolden has batted for over six hours, faced 274 balls and hit 15 fours, sharing a fifth-wicket stand of 163 with Ben Geddes (74).\nBailey has 3-47, with Balderson picking up the other two wickets to fall after Marcus Harris was out for 138 in Lancashire's first innings early in the day.\n'Clark's problem was he didn't play a shot'\nWarks 454 v Sussex 528 & 126-3\nClive Eakin\nBBC CWR Sport\nI think the problem for Tom Clark there was that he didn't play a shot.\nThe umpire had a long think about it but ruled him out. Even though it probably hit out him outside stump, he can still be out because he hadn't played a shot.\nFour wickets in the match now for Taz Ali, a decent enough debut.\n'A good catch from Clarke'\nNotts 579 v Durham 378 & 106-3\nDave Bracegirdle\nBBC Radio Nottingham commentator\nJoe Clarke takes a good catch and Josh Tongue is able to celebrate a wicket.\nWith just over six overs to go we might find out if a nightwatchman is to be deployed or not.\nIt was a good catch from Clarke, diving to his left.\nFinal half hour in Nottingham\nDurham 378 & 106-3 v Notts 579\nMartin Emmerson\nBBC Radio Newcastle\nWe're into the final few overs of day three at Trent Bridge and Notts are in a good position to push for a win tomorrow.\nAfter a wobbly start Durham recovered for a period but have now just lost Ben McKinney for 37. He was caught by keeper Joe Clarke off the bowling of Josh Tongue.\nIt came an over after Tongue thought he had the batsman caught at first slip, only to see Lyndon James put him down.\nEarlier they were 29-2 when Fergus O'Neill had Alex Lees lbw and then bowled Emilio Gay two balls later, to leave him with a pair.\nColin Ackermann then joined McKinney in the middle and the two added 71 runs in 15 overs before the latter was out.", "url": "https://www.bbc.com/sport/cricket/live/cj673z6wp93t"}