{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 07:11:15", "date_modify": "2025-05-21 07:11:15", "date_publish": "2025-03-30 09:11:05", "description": "Wrexham took another step closer to an historic third successive promotion courtesy of victory over Exeter City in League One.", "filename": "sport_football_articles_ce821dxd03zo_1747811475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6114/live/6b419e10-0ce2-11f0-ae5b-bf3834356f20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce821dxd03zo_1747811475.html", "title": "Are 'relentless' Wrexham closing in on promotion history?", "title_page": "Are 'relentless' Wrexham closing in on promotion history? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After the promotion and its sequel, Wrexham are working towards making it a trilogy.\nNo club has ever won three successive promotions in the top five tiers of English football.\nAnd yet, with seven games of the season to go, the north Wales club remain on course to do just that.\nFollowing Saturday's 2-0 win at Exeter, Phil Parkinson's side are still in the automatic promotion spots and building up a head of steam for the Championship, two years on from playing in non-league.\nWith just three points separating Wrexham from third-placed Wycombe – who have a game in hand and a marginally better goal difference – it is too tight and too early for scripting Hollywood finishes for the club owned by Ryan Reynolds and Rob McElhenney.\nBut, as the final five weeks approach, Parkinson's side are sticking to the same lines that have served so successfully before.\nAnd it is keeping an unprecedented prospect in sight.\n\"We're aware of it but it can't be a daunting thing, it has to be something that we rise to, something we are excited by and fuelled by,\" says midfielder Ollie Rathbone. \"We know it could be very, very special.\"\nThere have already been special times under Parkinson.\nA promotion winner three times before being tempted into the National League and subsequently masterminding Wrexham's journey to the third tier for the first time in 20 years, there has been a glint in the 57-year-old's eye and excitement in his voice in recent weeks as the possibility of another comes into view.\nWhen others might feel pressure, Parkinson simply feels the need to repeat his mantra.\n\"All we can do is what we've done today,\" Parkinson said at St James park after a fifth win in six games, acknowledging that it is at the stage of the season where every round of fixtures appears significant.\n\"It's 'let's get out of here, get back up the road, get rested, and get ready for another game' because we have got to be relentless in our pursuit of being in that top two.\"\nIt is a calm voice of experience, of someone who has been there and done it.\nWrexham have plenty of that in the dressing room, including six players with Premier League experience. Jay Rodriguez – who at Exeter scored his second goal since his January window move from Burnley – joined Steven Fletcher and James McClean as players in a squad who have all more than 100 games at Premier League level.\nAnd of course there are those who have not only won promotions before, but have done them in the same dressing room.\n\"Winning breeds winning and when you come into an environment where people are used to it, it makes a huge difference,\" says Rathbone, a summer signing from Rotherham United.\n\"You can sense it after a game when some of the senior players and coaching staff are simply 'well done, onto the next one'. There's no over celebrating, there's no pats on the back, it's 'well done – but that's what we came here to do, now let's go'.\"\nThe message will be the same seven more times, with five of Wrexham's remaining fixtures against sides currently in 12th or lower. The only team from the top six they face is Charlton Athletic who head to the Racecourse on the penultimate weekend of the season. By contrast, six of Wycombe's opponents are chasing the play-offs.\nMidfielder George Dobson admits that impressive Wycombe have shown the ability to churn out results with equal consistency as Wrexham, and that rivals will pay little attention to Wrexham's promotion past.\n\"We can use that experience to our advantage, but we know unless we turn up it doesn't matter if you've done it before, you have to do it again,\" says the former Charlton man. \"We have to deliver in the here and now.\n\"But we know, we have to be on it in every game, keep grinding them out. This is such a hard-working honest group that is relentless in everything they do.\"\nAnd relentless is what Wrexham are. With undoubted talent in the squad, capable of eye-catching football – as shown in the build-up to Rathbone's opener – it is all underpinned by a disciplined shape and a determined willingness to work.\nA depth to a squad well crafted – and, right now, dispassionately excluding past promotion heroes Paul Mullin and Ollie Palmer on matchdays – means players running themselves empty is not an issue.\nRelentless on the pitch, relentless in picking up the results to keep in-form Charlton eight points away in fourth.\n\"It (relentless) is a word we talk about because there's no let up,\" admitted Parkinson of the adjective he and his squad are using.\n\"In any division, but this level in particular, if you feel you can win a game at 75% you're going to come unstuck.\n\"Everybody's got to be focused, flat out, prepared to run the hard yards on the football pitch, put the bodies on the line when it matters most in both boxes, and when you do that we have the quality to win games.\n\"We've got a team ready to fight tooth and nail, to win headers and tackles, the things that give you a platform to win football games.\"\nWrexham have shown that in spades this season.\nDobson's nod to being able to grind out results is proven with 16 of their 23 wins by a one-goal margin – the most in the English Football League. There have been a club record 10 examples of '1-0 to the Wrexham'.\nWhere home form has long been a strength – with only superb runaway leaders Birmingham City boasting more points on their own patch – Wrexham have picked a perfect time to get it right on the road.\nUp until February, Wrexham had won just three away games. They have since picked up six wins out of seven trips since, with the next on Tuesday against relegation-threatened Cambridge United.\nAnd with some robust set-piece and aerial defending coupled with Arthur Okonkwo's agility keeping Exeter at bay at the weekend, they have now kept 20 clean sheets from 39 games.\nSuch numbers will not add up to promotion if not continued over the next month, of course.\nBut the combination of experience, excitement and an unrelenting attitude has positioned Wrexham just nicely when it matters most.\n\"These are the times where you can create history and get promoted and have those unbelievable moments,\" added Dobson. \"We really want that and we know we're the ones who can make it happen.\"", "url": "https://www.bbc.com/sport/football/articles/ce821dxd03zo"}