{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 04:56:11", "date_modify": "2025-05-21 04:56:11", "date_publish": "2025-01-23 14:20:21", "description": "Ivan Juric press conference: Southampton vs Newcastle", "filename": "sport_football_articles_cy8pd8xx450o_1747803371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a33/live/a2f7f080-c9bb-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8pd8xx450o_1747803371.html", "title": "Ivan Juric press conference: Southampton vs Newcastle", "title_page": "Ivan Juric press conference: Southampton vs Newcastle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aaron Ramsdale \"did something yesterday on the training pitch\" so will be assessed on Friday.\nKamaldeen Sulemana \"has a little hamstring injury\" and is unavailable for Saturday's game. Juric said the \"medical staff are scared as he's had problems [with his hamstring] in the past\". However, Juric \"hopes it's nothing\" and that Sulemana will return to training on Monday.\nFollowing his initial verdict that Tyler Dibling would be sidelined for four to six weeks, Juric said Saints are \"now a little bit more optimistic\" on the timeline for his return but they cannot confirm until they know more.\nOn transfer speculation around Dibling: \"There are no assurances in football but I am pretty sure I will be coaching him for the remainder of this year.\"\nMidfielder Albert Gronbaek, who joined Saints on loan this week, only started training with the group today so is not likely to feature.\nHe said his side have put in \"some good moments\" in recent games but they \"have to work on doing it for 90 minutes.\"\nOn the progress being made: \"Every day that we work, we are getting better. They understand more and I understand more of them. The players like it because they have noticed they are getting better. They are really working hard.\"", "url": "https://www.bbc.com/sport/football/articles/cy8pd8xx450o"}