{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:50:41", "date_modify": "2025-04-26 06:50:41", "date_publish": "2025-02-28 18:12:04", "description": "Bournemouth news: Andoni Iraola criticises recent refereeing decisions", "filename": "sport_football_articles_cx2r0lj4jx8o_1745650241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd21/live/7e5f38d0-f5ff-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2r0lj4jx8o_1745650241.html", "title": "Bournemouth news: Andoni Iraola criticises recent refereeing decisions", "title_page": "Bournemouth news: Andoni Iraola criticises recent refereeing decisions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Andoni Iraola is unimpressed by the standard of refereeing Bournemouth have experienced this season, saying it \"has been a very difficult week and season\".\nReflecting on Illia Zabarnyi being sent off against Wolves in controversial circumstances and how such decisions are impacting his preferred style of play, he told BBC Radio Solent: \"It has been a very difficult week with the referees, and I would say a very difficult season. We have lost a lot of points because of refereeing decisions.\n\"Even the other day, I watched all the commentators and pundits talking about Zaba's red card. If not everyone, 90% of people, said they didn't think it should have been. So it definitely makes you think about why there is VAR, in this case.\n\"The referee goes over and deals with it, then someone starts refereeing from the outside. The consequences of that decision I'm not so sure about because I don't know how many points we would have got if Zaba didn't receive that red card against Wolves.\n\"I really don't think we would have got zero points if this decision didn't happen, so it affects you massively.\n\"I've said it a lot of times, we have been very unlucky in all of the decisions. I don't want to say all of them but in a large majority of decisions this season, it hasn't gone for us. So it's very clear for me.\"\n\"It's a shame that I have to talk like this.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2r0lj4jx8o"}