{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 06:13:30", "date_modify": "2025-05-21 06:13:30", "date_publish": "2025-01-04 17:25:58", "description": "Leicester need two late tries to beat a spirited Exeter 28-15 in the Premiership.", "filename": "sport_rugby-union_articles_c86wnpg49p4o_1747808010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/be7c/live/88c52aa0-cabc-11ef-8449-159a99d87232.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c86wnpg49p4o_1747808010.html", "title": "Premiership: Leicester 28-15 Exeter: Tigers need two late tries to beat Chiefs", "title_page": "Premiership: Leicester 28-15 Exeter: Tigers need two late tries to beat Chiefs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester needed two late tries to beat a spirited Exeter in the Premiership.\nClose-range scores from Olly Cracknell and Cameron Henderson saw the Tigers lead 14-3 at the break.\nBut Tommy Wyatt scored an impressive try soon after the restart to get Exeter within six points.\nThe winger got a second with 21 minutes to go to see Exeter lead by a point as they took control of the game after the break.\nBut having had Will Rigg sin-binned in the 67th minute, Exeter went behind as Ollie Hassell-Collins took advantage of Leicester's extra player after a quick break.\nExperienced replacement Ben Youngs darted over with four minutes to go to secure a bonus-point win just before Rigg's yellow card ended.\nThe win moved Leicester up to third in the Premiership, while Exeter remain second-from-bottom and went away with nothing despite impressing for long periods.\nTigers returned home for the first time since their 54-24 drubbing at the hands of Bristol just before Christmas and at times it looked like their fans might be watching another defeat - Exeter's front-footed defence caused Leicester early problems as Henry Slade put over a third-minute penalty for the Chiefs.\nBut it was breached 10 minutes later. Having repelled 12 phases on their line, Exeter gave away a penalty and from the resulting scrum under the posts Cracknell powered through three tacklers to score.\nTigers continued to have the better of the territory and got a second try eight minutes from the interval when Handre Pollard broke through Exeter's defence to set up the onrushing Henderson for his first try in almost two years.\nBut Tigers suffered a big blow right on half-time when Harno Liebenberg limped off after turning his ankle as he landed awkwardly at a lineout and was replaced by Matt Rogerson for the second half.\nExeter came out of the changing rooms flying as an excellent passage of play ended with Slade's perfectly-weight cross-field kick finding Wyatt on the right wing to gallop over.\nThey continued to have the better of the game as the half wore on and Wyatt dropped the ball as he went over from close range under pressure from Cracknell.\nBut he made no mistake a minute later from a second close-range scrum as Slade found the winger on the short side and he went over in the left corner - Josh Hodge's touchline conversion giving Exeter a one-point lead.\nHaving been in control, Exeter had replacement centre Rigg sin-binned after leaving Freddie Steward on his face as they competed for a high ball - and it was a moment that was to prove crucial.\nA minute later, Tigers were back in front.\nTamati Tua's effort for the big tackle on halfway was beaten by an offload to Dan Kelly, who broke to within five metres and a few phases later Hassell-Collins walked over in the left corner as an short-handed defence Exeter could not cover.\nYoungs put the result beyond doubt when he threw a superb dummy to cut through the Chiefs defence and go in under the posts from 20 metres out.\nLeicester Tigers head coach Michael Chieka told BBC Radio Leicester:\n\"It was not a free-flowing game to say the least. It was always going to be a big, physical encounter - they're a big team.\n\"I thought for three quarters of the game we dominated that part of it, the physicality, so the first half and then the back end of the second half.\n\"But I thought we had a really good mentality to fight back and get ourselves into a match-winning position, and then to get the bonus was a bonus.\"\nExeter director of rugby Rob Baxter told BBC Radio Devon:\n\"I'm a bit frustrated, a little disappointed. When you work that hard, you're that competitive in a game, you desperately want to get something out of it.\n\"You've got to feel for the lads when they work that hard and ultimately we end up with no points from the game.\n\"But there's some moments in there where you can go 'We're finding our way, we're getting there' and we're becoming more and more competitive.\n\"The yellow card clearly hurt us, which has got to be a frustration.\n\"My view is we're trying to talk about we want, an aerial contest, so we're trying to talk about not having blockers and decoy runners and all this type of stuff.\n\"Then you create an aerial contest and the first thing that happens is if you get it slightly wrong, and that's very slightly wrong, it's a yellow card. Why can't it be something in between?\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c86wnpg49p4o"}