{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:36:53", "date_modify": "2025-04-26 03:36:53", "date_publish": "2025-03-08 00:00:00", "description": "West Bromwich Albion hang on against QPR to secure an important three points despite playing the second half with 10 men.", "filename": "sport_football_live_c80yk009jy4t_1745638613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0741/live/917432c0-fc41-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c80yk009jy4t_1745638613.html", "title": "West Bromwich Albion 1-0 Queens Park Rangers: Ten-man Baggies secure win", "title_page": "West Bromwich Albion 1-0 Queens Park Rangers: Ten-man Baggies secure win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Play-off chasing West Bromwich Albion hung on against QPR to secure an important three points despite playing the second half with 10 men.\nDefender Darnell Furlong, playing against his former club, was dismissed by referee Adam Herczeg in stoppage time at the end of the first half for elbowing Koki Saito.\nThe incident occurred shortly after Adam Armstrong converted a penalty for the hosts in an action-packed spell before half-time.\nQPR boss Marti Cifuentes had urged his side to learn from last weekend's defeat by Sheffield United, having accumulated 16 shots against the promotion chasers, with just one goal to show for it.\nBut, despite spending more than half the match with a man advantage, the R's clearly had not learnt enough from their struggles in front of goal.\nAs they did against the Blades, the London club started competitively, with the centre-back pairing of Steve Cook and Ronnie Edwards largely keeping the energetic trio of Tom Fellows, Mikey Johnston and Armstrong at bay.\nTony Mowbray's side's dominated the opening 20 minutes, buoyed by a vociferous home crowd, but were unable to create any clear-cut opportunities and QPR grew into the game, with talisman Ilias Chair's 17th-minute corner met by the head of the unmarked Cook, only for the captain's effort to be blocked.\nThe visitors' threat from set-pieces was shown again in the 31st minute, when both Jimmy Dunne and Kieran Morgan had near-miss attempts.\nFellows, who caused plenty of problems for QPR's defence, was clearly pulled by veteran midfielder Jack Colback inside the box to bring a penalty.\nKeeper Paul Nardi guessed correctly from Armstrong's spot-kick but the striker put just enough power to sweep the ball into the bottom left corner.\nThen Furlong was sent off when he was deemed to have elbowed Japanese winger Saito during a free-kick delivery.\nBut QPR failed to make the most of their numerical advanatge and wear down their stubborn opponents.\nSaito had the best chance for an equaliser in the dying moments of the match, dragging his left-footed shot from close range agonisingly wide.\nWest Brom manager Tony Mowbray:\n\"It was a huge win in the context of the points missed if we'd have lost or drawn.\n\"It was a Herculean effort by everyone. There are certain games you target and with all due respect to QPR and Hull, these are two of them.\n\"It means we can go to Burnley on Tuesday night with the same confidence we showed at Leeds United and look to pick up something.\"\nOn Furlong's sending-off: \"It happened right in front of me. Darnell tried to block the guy, there was no elbow, but the lad tried to duck under his shoulder to avoid the block and caught his face on the top of Darnell's arm.\n\"I'm not sure any of the officials saw it. I would suggest it was really harsh and I'm sure we will look to appeal it.\"\nQPR boss Marti Cifuentes:\n\"In the first half neither team created big chances, but there were two big situations with the penalty we should not have conceded, and the red card.\n\"We expected them to be in a low block and they were, but it was a pity we could not beat that and create more.\n\"I was not happy with the lack of clear chances, but they defended really well and were very compact.\n\"They didn't create anything on the counter, so credit to the players to not concede any more, because in those situations you can concede a second goal and it's game over.\"", "url": "https://www.bbc.co.uk/sport/football/live/c80yk009jy4t"}