{"authors": ["Matthew Kenyon", "www.facebook.com"], "date_download": "2025-05-20 11:46:29", "date_modify": "2025-05-20 11:46:29", "date_publish": "2023-08-07 12:05:26", "description": "Ten Para-sports have combined to stage the first European Para Championships, which starts in Rotterdam on Tuesday.", "filename": "sport_disability-sport_66401376_1747741589.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/826B/production/_130678333_joy_haizelden_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66401376_1747741589.html", "title": "European Para Championships: New multi-sports event set to start in Rotterdam", "title_page": "European Para Championships: New multi-sports event set to start in Rotterdam - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new multi-sport event gets under way in the Netherlands on Tuesday with 10 Para-sports combining to stage their European championships together for the first time.\nAs well as the honour of being champion of the continent, qualification spots for next year's Paris Paralympics will be on offer in some sports at the European Para Championships (EPC) in Rotterdam.\nThe sports featuring are Para-archery, Para-badminton, boccia, Para-cycling, goalball, Para-judo, Para-shooting, Para-taekwondo, wheelchair basketball and wheelchair tennis. The aim is to maximise attention on them all between 8 and 20 August.\nThe event is modelled on the European Championships, which began in Glasgow in 2018.\n\"If you combine it, it will be bigger - so one plus one is three,\" says EPC founder Eric Kersten. \"The whole is bigger than the sum of all parts.\n\"It makes more sense for media to send over reporters to one city to host 10 events at one time if you compare it with a one-off, and [it can] generate extra public attention.\"\nThere's no shortage of ambition. The main venue is the city's premier indoor arena - the Ahoy Centre, which hosted the 2021 Eurovision Song Contest - and several of the sports will take place in high-profile city centre locations.\nKersten and his team were starting from scratch.\n\"It was very hard,\" he says. \"We had to convince international federations to give their European championships to us.\n\"We had to do separate bids for all these events, and tell them: 'You're not the only sport, you're together with nine others'.\n\"The same goes for the European Paralympic Committee and the national government. Everybody thought it was a great idea, but I think a lot of people doubted whether it would happen or not.\"\nNot every sport they approached decided to go with the plan - wheelchair rugby was on the initial list, but eventually held its European Championship in Wales earlier this year.\nBut enough bought into the concept to get it off the ground - including Para-archery, which has adjusted its calendar to be able to take part.\nArnoud Strijbis, board member at World Archery Europe and director of the Royal Dutch Archery Federation, says: \"I said directly: 'Archery has to be included.'\n\"Events are good for showing ambition, for visibility and for giving possibilities for our archers… especially a multi-sport event, which gives another experience.\"\nThe opportunity of more publicity for sports that often struggle to earn attention was another plus.\n\"Getting on TV or in the Dutch media is really difficult, so this is really a big chance for us to get Para-archery more in the picture,\" says Strijbis.\nGetting sports on board was one part of the puzzle; another was to raise the finance.\nKersten and his team were working with a budget of about 30m euros (£26m), with about half of that via the Dutch government and other public sources. That required negotiations with a succession of different ministers.\nBut the biggest challenge was securing the private funding which would cover the other half of the budget.\nWhen he spoke to the BBC in May, Kersten did not have a headline sponsor, but T-Mobile Netherlands was later unveiled as the EPC's major backer.\nThe Dutch telecoms company already supports the Netherlands' Olympic and Paralympic team, but the European Para Championships still had to sell its concept and ability to deliver.\n\"You always look at if it's impactful,\" says Tisha van Lammeren, T-Mobile Netherlands' chief commercial officer.\n\"So if you choose the Ahoy versus a very small venue, that makes a difference; if you choose 10 sports versus one, that makes a difference.\n\"How it looks, how professional the event is organised, how much exposure it has, how can we portray our brand. All these things matter in deciding: 'OK, let's go for this event.'\"\nWith funding in place, the organisers have to deliver on the experience for the athletes and in attracting media attention and visitors over 13 days of action in Rotterdam.\nThey did consider making the whole thing free to enter, but decided charging a small fee would show the value of the event.\nAnd what of the future?\nThe plan is the EPC will return in four years' time, in a different venue. Some potential host cities will be in Rotterdam as part of an observer programme.\nAnd while the sports federations have all signed long-term contracts, they will get the chance to step away after Rotterdam.\n\"If they don't like it, they are free to go,\" says Kersten. \"But we are very confident we will put on a good show.\"\nBBC Sport disability sport reporter Elizabeth Hudson\nThe Great Britain men's and women's wheelchair basketball team know that reaching the European final in Rotterdam will guarantee their place at the Paralympics next year.\nThe men are chasing a fifth European title since 2011 and finished runners-up to the United States at June's World Championships in Dubai but hosts Netherlands are defending champions after being awarded the title in 2021 when GB forfeited the final because of a Covid-19 case.\nGB face Turkey, Austria, Italy, Israel and France in the group stages before the knockout stages start on 16 August.\nThe women face a tougher challenge with the Netherlands, who won gold in Dubai, and Germany, who reached the semi-finals, the favourites to take the two Paris qualification spots.\nIn boccia, in addition to European titles, Paris qualifying slots are up for grabs in the team and pairs events.\nThe GB BC1/2 team of David Smith, Claire Taggart and Will Hipwell won world silver last year and will be strong contenders to land European gold.\nUnlike some sports where qualification goes to the nation and not the individual, the winners of the men's and women's wheelchair tennis singles will earn a named place for 2024.\nAlthough Alfie Hewett and Gordon Reid will not be in the Netherlands, British number three and four Ben Bartram and Dahnon Ward will be competing, along with Lucy Shuker and Cornelia Oosthuizen in the women's event.", "url": "https://www.bbc.com/sport/disability-sport/66401376"}