{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:50:08", "date_modify": "2025-05-20 13:50:08", "date_publish": "2023-07-31 19:04:52", "description": "Australia captain Pat Cummins says his side \"fell a little short of the goal\" despite being proud of his players for retaining the Ashes.", "filename": "sport_cricket_66365650_1747749008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FAB3/production/_130597146_gettyimages-1583356053.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66365650_1747749008.html", "title": "The Ashes 2023: Australia fell short of their goal with series draw, says captain Pat Cummins", "title_page": "The Ashes 2023: Australia fell short of their goal with series draw, says captain Pat Cummins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia captain Pat Cummins says his side \"fell a little short of the goal\" despite being proud of his players for retaining the Ashes.\nEngland won the fifth Test at The Oval by 49 runs to draw the series 2-2 and deny Australia a first series win in England since 2001.\nCummins' side had led the series 2-0 before England fought back with wins at Headingley and The Oval.\n\"Two-two seems fair and it was a wonderful series,\" said Cummins.\n\"It was two high-quality teams. It seemed like every session we shared the honours.\n\"From the start we said we were over here to win the Ashes.\n\"We can be hugely proud of retaining the Ashes - it's no easy feat against a high-quality England in their own conditions - but of course we wanted to come over here and win.\n\"It is a similar group to 2019 [when the series also finished 2-2] and we just fell a little bit short of the goal.\"\nAustralia beat India in the World Test Championship final in the week before the Ashes, before playing five Tests that ebbed and flowed from one side to the other in six weeks.\nBoth sides were on top on multiple occasions, but were unable to hammer home their advantage.\n\"There were so many moments throughout this series,\" said Cummins.\n\"That is what makes playing in an Ashes, particularly away from home, so difficult.\n\"It is not just what happens on the field but the crowd and the media. You get everything thrown at you. It's great, you wouldn't want it any other way.\n\"Going one further would have been nice but we can be really proud of retaining the Ashes and the way we have played and also winning the World Test Championship too.\n\"It's been a great tour and it's good to retain and have something to show for it.\"", "url": "https://www.bbc.com/sport/cricket/66365650"}