{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:32:20", "date_modify": "2025-05-21 05:32:20", "date_publish": "2025-01-23 06:18:53", "description": "Irishman Paul Hughes says he is ready to take Usman Nurmagomedov \"to the depths of hell\" in their Bellator Lightweight Championship title fight on 25 January.", "filename": "sport_mixed-martial-arts_articles_c1ln3eg0206o_1747805540.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c34f/live/9a2d08f0-d992-11ef-a7d7-813810cd836f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_c1ln3eg0206o_1747805540.html", "title": "Usman Nurmagomedov: MMA star Paul Hughes says 2025 will be his \"superstardom\" year'", "title_page": "Usman Nurmagomedov: MMA star Paul Hughes says 2025 will be his \"superstardom\" year' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irishman Paul Hughes says he is ready to take Usman Nurmagomedov \"to the depths of hell\" in their Bellator lightweight title fight on 25 January.\nThe Derry man earned the biggest win of his career in October last year when he overcame America's AJ McKee by split decision in Riyadh, Saudi Arabia.\nNow, Hughes faces his toughest challenge in taking on unbeaten Bellator champion Usman but it is one he insists he will relish.\n\"He is a fantastic fighter, he is going to get me down at some points in this fight I have no doubt, but you give me five rounds against anyone on this planet at 155lb, I win,\" he told BBC Sport NI.\n\"This is only the start. 2024 was my breakout year, 2025 is for superstardom.\"\nThe 27-year-old has split his time training for the fight between Belfast, Florida and Dubai, where the bout will be staged.\nHe spent Christmas and New Year's Eve in Florida which he admits was a challenge, but something he felt was necessary to fully focus on the fight.\n\"The training camp has been 10 out of 10. There are definitely worse places to spend your Christmas, it was 27 degrees every day, but obviously it is a big sacrifice to miss seeing family and friends who have flown in from around the world to come home,\" he explained.\n\"If I'm being truthful, I enjoy the fact I've sacrificed, because it gives me that extra mental edge going to Dubai because everything has been given to this camp.\"\nHughes also detailed how his life has been altered since he beat McKee, with the media attention surrounding his fight against Usman having intensified significantly.\nThis was exacerbated after comments made by Nurmagomedov's cousin and former UFC lightweight champion Khabib Nurmagomedov who claimed that Ireland doesn't have MMA fighters.\n\"It's different and busier, but it's the life I asked for and I'm grateful for this experience and this is what I need to do to become the best and keep building the brand I have been building.\"\nHughes accepts that he is the underdog going into this fight, a role he thrives on given his own self-belief.\n\"People were doubting me [against McKee] and they had reason to doubt. You compare my record to his, I really shouldn't have beaten him,\" he added\n\"There was no reason to go take such a big step so early in my career, but there were zero doubts in my mind, and it is the same with Usman.\n\"I am the best in the world 155lb MMA fighter, and I'm prepared for absolutely everything.\"\nNurmagomedov was given a six-month suspension from MMA in 2023 after testing positive for a banned substance, but Hughes insists that it is \"not something I'm thinking about\".\nThe Bellator lightweight champion denied taking steroids, saying at the time that it was \"medication\".\nDetails of Nurmagomedov's failed test were never released publicly, and he was not stripped of the organisation's title.\n\"It will take more than steroids to beat me, especially over five rounds,\" Hughes said.\n\"That is where you get tested and that is where I will take him to the depths of hell.\"\nHughes is bidding to become a two-time champion, having previously held the Cage Warriors featherweight title in 2022.\n\"I don't know what will be more important, getting the belt or beating Usman. I haven't thought that far ahead yet, I've been focused on the task at hand.\"\nHe has, however, made a clear prediction for how the fight is going to pan out.\n\"I'm expecting me to clip him early and for him to shoot for takedowns as if his life depended on it.\n\"That is exactly what is going to happen and I'm going to use that to his demise. Knockout second round.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/c1ln3eg0206o"}