{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:48", "date_modify": "2025-05-21 05:49:48", "date_publish": "2024-12-24 18:38:50", "description": "Everton are preparing a new deal for Jordan Pickford, Paris St-Germain could offer Arsenal chance to sign Kolo Muani, and Club Brugge's Maxim De Cuyper attracts Premier League interest, plus more.", "filename": "sport_football_articles_ce8eg37gvzlo_1747806588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/be38/live/483b20e0-c20e-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8eg37gvzlo_1747806588.html", "title": "Football gossip: Pickford, Muani, Cuyper, Butler-Oyedeji, Osimhen, Wirtz", "title_page": "Football gossip: Pickford, Muani, Cuyper, Butler-Oyedeji, Osimhen, Wirtz - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton prepare new deal for Jordan Pickford, Paris St-Germain could offer Arsenal chance to sign Randal Kolo Muani, Club Brugge's Maxim de Cuyper attracts Premier League interest.\nEverton are preparing to offer 30-year-old England goalkeeper Jordan Pickford a new deal which will keep him at the club for the remainder of his career. (TBR Football), external\nParis St-Germain are likely to offer Arsenal the chance to sign their out-of-favour France forward Randal Kolo Muani, 26. (Standard) , external\nChelsea, Arsenal and Tottenham have all sent scouts to watch Club Brugge and Belgium full-back Maxim de Cuyper, 24. (Caughtoffside) , external\nFC Zurich have approached Arsenal to enquire about the availability of 21-year-old English forward Nathan Butler-Oyedeji in January. (Football Insider), external\nManchester United have been offered the chance to sign Nigeria striker Victor Osimhen in January, with Napoli open to a player-exchange deal for the 25-year-old, who is currently on loan at Galatasaray. (TBR Football) , external\nBrighton Under-18s boss Inigo Calderon, 42, is in advanced talks to become Bristol Rovers manager. (Sky Sports), external\nBayern Munich remain hopeful of a summer move for 21-year-old Germany attacking midfielder Florian Wirtz, who is in discussions with Bayer Leverkusen over a new deal. (Sky Germany), external\nLeicester City boss Ruud van Nistelrooy could lean on his Manchester United connections to land a suitable loan signing in January. (Football Insider), external", "url": "https://www.bbc.com/sport/football/articles/ce8eg37gvzlo"}