{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 04:59:04", "date_modify": "2025-05-21 04:59:04", "date_publish": "2025-04-04 12:14:26", "description": "Ballymena United manager Jim Ervin says he has been encouraging forward Success Edogun to get into more positions where he can score goals.", "filename": "sport_articles_cgrg0vz2jn0o_1747803544.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d08b/live/c6a0f8f0-10a2-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgrg0vz2jn0o_1747803544.html", "title": "Forward Edogun 'has been a big plus for us' - Ervin", "title_page": "Irish Premiership: Forward Edogun 'has been a big plus for us' - Ervin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ballymena United manager Jim Ervin says he has been pleased with the impact made by January transfer window recruit Success Edogun but has been encouraging the forward to get himself into more goalscoring positions.\nThe 23-year-old joined the Sky Blues from Finn Harps at the end of January and has scored three goals in 10 league outings, including two in Tuesday's 5-2 win over Loughgall at the Showgrounds.\nErvin, who signed a new full-time contract with the club until 2028 on Friday, said Edogun's physical presence had made him \"very effective\" for the side.\n\"We'd spoken to him before about getting in the right areas as he does so much hard work outside of the box,\" Ervin said.\n\"He's a big powerful runner but in order for him to score goals we want him to stay closer to the goal and in and around the penalty area where he's going to score his goals.\"\nThe striker's double against the league's basement side in midweek keeps his club in contention for the seventh place which could book them a berth in the end-of-season European play-offs.\nThe Braidmen lie ninth in the table, three points behind Cliftonville and one adrift of Portadown above them in the race to top the bottom half of the table.\n\"His [Edogun's] two goals that he scored the other evening weren't spectacular but with his presence and his pace and his power he frightened the defenders and forced them into mistakes. He was in the right areas at the right times.\n\"No-one really cares what sort of goals you score as long as you score, especially when you are a centre forward.\n\"I'm frustrated that he hasn't scored more goals than he has but he's looking to add more in the four remaining league games. He's been a big plus for us and he's done extremely well since he came in.\"\nErvin hailed the impact made by Kian Corbally, Patrick McEleney and on-loan Conor Barr, who were also added to the Ballymena ranks in January.\n\"I'm really pleased with how they have all done but it has also driven the other boys in the squad to make sure that they're on the ball.\n\"The training levels have gone through the roof, everyone is competing not just for a place on the starting XI but also to get onto the bench. As a manager it gives you a headache but it's a nice headache to have.\"", "url": "https://www.bbc.com/sport/articles/cgrg0vz2jn0o"}