{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:58:22", "date_modify": "2025-05-21 03:58:22", "date_publish": "2025-04-07 08:27:34", "description": "Brentford 0-0 Chelsea: Fan views", "filename": "sport_football_articles_c30qm364648o_1747799902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c30qm364648o_1747799902.html", "title": "Brentford 0-0 Chelsea: Fan views", "title_page": "Brentford 0-0 Chelsea: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Following Chelsea's goalless draw away at Brentford on Sunday, we asked you to have your say on the result that leaves their Champions League qualification hopes in the balance.\nHere are some of your comments:\nTony: I hope they don't finish in the top five. They're not good enough for Champions League anyway. I'd like to see them slip out of all European places just to send a message to the clueless owners.\nJohn: To save players for the potential to win the Europa Conference League and therefore qualify for next season's Europa League rather than go for a Champions League place is utter madness and shows how much Enzo Maresca is out of his depth.\nNick: Another disappointing performance with Christopher Nkunku and Jadon Sancho proving once again they are B team at best. Strategic error to play an attacking formation without a goal threat. We need top five and these are not the levels that will deliver the Champions League place this club and recent investments demand.\nDuncan: The golden rule of football is to never change a winning team. Maresca killed the momentum built on Thursday in the win against Spurs. We won't win anything with him in charge.\nDazza: Despite the huge financial outlay, we are a boring team to watch. Maresca's style of possession-based football resembles Sarri-ball, which was also turgid. Players are so afraid of losing the ball in transition that they always put the brakes on and pass back. There's no risk taking. So many players are now anonymous. Would Kiernan Dewsbury-Hall be in any top-10 side? We are so far away from being a title winning side. The positive - Moises Caicedo always great.", "url": "https://www.bbc.com/sport/football/articles/c30qm364648o"}