{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:33:30", "date_modify": "2025-05-21 06:33:30", "date_publish": "2025-01-31 11:02:51", "description": "Bayern Munich say any deal for Mathys Tel before the transfer window closes must be \"right for all parties\".", "filename": "sport_football_articles_cx2pee5yn42o_1747809210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfcc/live/730527c0-dfbf-11ef-abda-2fd5234899ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2pee5yn42o_1747809210.html", "title": "Mathys Tel: Bayern Munich want move that is right for all parties", "title_page": "Mathys Tel: Bayern Munich want move that is right for all parties - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bayern Munich sporting director Max Eberl says any move for forward Mathys Tel before the transfer window closes on Monday must be \"right for all parties\".\nThe Frenchman has been linked with a move away from Allianz Arena and Premier League clubs Tottenham Hotspur, Arsenal, Manchester United, Chelsea and Aston Villa are said to be interested in the 19-year-old.\nTel joined Bayern Munich from French club Rennes in 2022 and has scored 16 times in 82 appearances.\nBut he has faced reduced playing time under manager Vincent Kompany this season and has told the club he wants to leave.\n\"Mathys can imagine a move away. We need to come to terms with the facts,\" said Eberl.\n\"Whether it's a loan or a sale, we'll see. It needs to be right for all parties. Will we do it? Our squad is very well set up.\"\nTel has made eight Bundesliga appearances this season but only two of those were starts.\nBayern, who have a six-point lead in the league over defending champions Bayer Leverkusen, face Holstein Kiel in their next league match on Saturday (14:30 GMT).\n\"What's important is that the player is still a Bayern player,\" said Kompany.\n\"Every player can be selected until the last moment. My role here is always to use the players available.\"", "url": "https://www.bbc.com/sport/football/articles/cx2pee5yn42o"}