{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:36", "date_modify": "2025-05-21 07:31:36", "date_publish": "2025-01-03 22:22:47", "description": "Liverpool reject two bids for Ben Doak, Arsenal want Matheus Cunha, Manchester City eye Lens defender Abdukodir Khusanov, plus more.", "filename": "sport_football_articles_cgm9r80vedzo_1747812696.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a91/live/06600ae0-ca1b-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgm9r80vedzo_1747812696.html", "title": "Football gossip: Doak, Cunha, Chukwuemeka, Lewis-Potter", "title_page": "Football gossip: Doak, Cunha, Chukwuemeka, Lewis-Potter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool reject bids from two Premier League clubs, Manchester City target a Ligue 1 defender and Arsenal want Wolves' in-form striker.\nManchester City have entered the race for Lens' 20-year-old Uzbekistan defender Abdukodir Khusanov. (Telegraph - subscription required), external\nLiverpool have rejected a £15m bid from Crystal Palace for Ben Doak. The 19-year-old Scotland midfielder is on loan at Middlesbrough. (Times - subscription required), external\nThe Reds have also rejected a £16m bid from Ipswich for Doak and would prefer him to stay at Middlesbrough until the end of the season. (Athletic - subscription required), external\nLiverpool want £30m if they are to sell teenager Doak. (Independent), external\nArsenal are exploring a January move for Wolves' Brazil striker Matheus Cunha, 25. (Football Insider), external\nWolves are working on a new contract for Cunha to try to keep him at the club. (Mail), external\nCrystal Palace have had a £12.4m bid for Slavia Prague's 20-year-old Senegal full-back El Hadji Malick Diouf rejected. (Foot Mercato), external\nNapoli have expressed an interest in signing Chelsea's 18-year-old English winger Carney Chukwuemeka, who is valued at about £30m. (Teamtalk), external\nSaudi Pro League club Al-Shabab are confident of agreeing a deal for Wolves' 31-year-old Gabon midfielder Mario Lemina. (Rudy Galetti), external\nNewcastle are set to record a profit for the first time in five years but still have to sell before they can buy this month if they are to comply with Premier League financial rules. (The i - subscription required) , external\nWolves hope to complete the £15m signing of Reims' 27-year-old Ivory Coast centre-back Emmanuel Agbadou early next week. (Telegraph), external\nBrentford's 23-year-old English winger Keane Lewis-Potter is close to agreeing a new contract. (Athletic - subscription required), external\nTurkish club Trabzonspor want Southampton striker Paul Onuachu but are only willing to pay £4.2m. The Saints want £8.3m for the 30-year-old Nigerian. (61medya - in Turkish), external\nSt Johnstone want to sign Liverpool and Scotland right-back Calvin Ramsay, 21, on loan after his loan spell at Wigan was cut short. (Courier), external", "url": "https://www.bbc.com/sport/football/articles/cgm9r80vedzo"}