{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 15:12:43", "date_modify": "2025-05-19 15:12:43", "date_publish": "2015-02-27 19:04:49", "description": "A leading neurosurgeon explains the dangers of concussion following Fernando Alonso's crash in testing.", "filename": "sport_formula1_31654193_1747667563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81276000/jpg/_81276933_alonso.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_31654193_1747667563.html", "title": "Fernando Alonso: The dangers of concussion explained", "title_page": "Fernando Alonso: The dangers of concussion explained - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McLaren chairman Ron Dennis said on Thursday he \"cannot foresee any reason why\" Fernando Alonso won't be fit to race in the season-opening Australian Grand Prix on 15 March.\nBut after spending three days in hospital with concussion following a testing accident, what are the possible ramifications for the Spaniard's season - or his career?\nChief F1 writer Andrew Benson spoke to a leading neurosurgeon and head injury expert, Professor Steve Olvey about concussion.\nProfessor Olvey: \"If he's had concussion, he could completely recover within that period but it could also take longer than that.\n\"There is really no test that will tell you. You have to wait for it to run its course.\"\nOlvey made it clear he could not offer a precise diagnostic assessment of Alonso as he had not seen him since the accident.\nBut he is arguably the world's leading figure in this field, has treated several world-class drivers with concussion, and is able to talk with authority in general terms about what can be expected in concussion injuries in motor racing.\nFollowing his crash, Alonso was flown straight to hospital in Barcelona and was kept there for three days before being allowed home to Oviedo to continue his recovery.\nProfessor Olvey said that the 33-year-old's time under observation was towards the upper limit of what is typical in such injuries.\n\"Concussion is really a spectrum from very mild to more severe, and anywhere along that spectrum you could be required to be in the hospital,\" Professor Olvey said.\n\"The majority of concussions actually don't require staying in the hospital, but some that are more severe could go as long as three days.\n\"It could be longer than that but that would be quite unusual.\"\nMcLaren chief executive Ron Dennis said in a news conference on Thursday that Alonso was \"not even concussed\", which contradicted earlier statements made by the team and Alonso's management.\nDennis was mistaken. Alonso was concussed in the accident, in which his head first hit one side of the cockpit and then the other, and after which he was unconscious for an unspecified period of time, which Dennis says the doctors say was \"seconds\".\nDennis did admit Alonso had suffered retrograde amnesia following the accident - where a patient cannot remember the incident that caused the injury and perhaps other aspects of his life.\nOlvey said this was not unusual in concussion injuries and was not in itself a cause for concern.\n\"It may or may not mean the concussion was more severe than a minor one that clears up in a day or two.\"\n\"People with retrograde amnesia have a little more serious concussion than the most minor type, but it does not necessarily mean it will not completely recover. In fact, it would be expected to completely recover.\"\nThere has been a heightened focus on concussion injuries in sport in recent times, particularly in contact sports such as rugby and the NFL.\nMotorsport, in which drivers control high-speed projectiles and in which any accident can lead to very high G-forces, is an area where this is a major concern.\nDennis said that Alonso was \"pushing very hard to get in the car\" and that he \"will appear in Australia\" and go through the official test to ensure he was safe to drive.\nHowever, he added that the timing of Alonso's return to the cockpit would be defined by the doctors treating him.\nAnd Olvey said doctors would be acutely aware of the risks inherent in Alonso suffering another head injury.\n\"We know it is risky to get into a situation where you could very possibly have another concussion,\" Professor Olvey said. \"You do not want to have a second concussion if you have had a first concussion until the first one has completely healed.\n\"It's different for each individual but the bottom line is too many concussions too close together are thought to cause long-term effects that could have an effect on a person later in life, so it is not worth the risk.\"\nAlonso is already showing progress in his recovery from the concussion he suffered in the accident.\nHowever, the causes of the crash have not yet been fully explained.\nMcLaren say there is no evidence of a car failure and have said that they believe Alonso ran wide, perhaps as a result of strong gusting winds, the car was destabilised on the Astroturf on the outside of the corner and was spat back towards the inside of the track, where it hit the wall.\nThey say their telemetry read-outs prove Alonso was conscious up to the impact as he was braking at maximum force and changing gear.\nBut Ferrari's Sebastian Vettel, who was following the McLaren, said the car appeared to steer right towards the wall. It has not yet been explained why Alonso was braking but apparently did not try to avoid crashing.\nIf doctors believe he suffered some form of cerebral malfunction in the run up to the accident, then that could make a difference in whether he is allowed to return to the cockpit.", "url": "https://www.bbc.com/sport/formula1/31654193"}