{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-20 11:58:32", "date_modify": "2025-05-20 11:58:32", "date_publish": "2023-08-06 08:40:44", "description": "Rugby union correspondent Chris Jones examines the decisions facing England coach Steve Borthwick as he prepares to name his World Cup squad.", "filename": "sport_rugby-union_66403527_1747742312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ABE5/production/_130650044_steveborthwick.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66403527_1747742312.html", "title": "England World Cup squad: Steve Borthwick left with plenty to ponder", "title_page": "England World Cup squad: Steve Borthwick left with plenty to ponder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While Steve Borthwick said he knew the majority of his World Cup squad before the summer opener in Cardiff, the England head coach will still have had plenty to ponder after a chastening evening at the Principality Stadium.\nDespite an encouraging first half, England were familiarly profligate in their 20-9 defeat by Wales - 12 entries to the 22 for no try - and dropped off a cliff in the second half; again, a familiar tale.\nBut it's early days, and by naming his final 33-man squad as early as Monday morning, Borthwick has prioritised building cohesion and combinations through August rather than any selectorial jeopardy.\nUnlike his predecessor Eddie Jones, who took only two tighthead props, two scrum-halves and two fly-halves to Japan in 2019, Borthwick has said he won't be gambling in specialist positions, meaning he will take nine front-row forwards and six half-backs.\nIt means his only decision at prop is whether Mako Vunipola is fit enough for selection, while at hooker - with Jamie George inked in - he will take two of Jamie Blamire, the rookie Theo Dan and Jack Walker, another player carrying an injury. At tighthead prop, Kyle Sinckler, Will Stuart and Dan Cole are all set to make the Eurostar.\nThe back five of the scrum is the main area of contention with plenty of competition. Maro Itoje is a shoo-in, as is Ollie Chessum if fit enough. George Martin can play lock or flanker and should make it. Jonny Hill and David Ribbans will face an anxious wait on Sunday.\nOn the flank, Courtney Lawes, who can offer cover at lock, and Tom Curry - despite a dodgy ankle - are certainties, while the versatile Lewis Ludlam is a near-certainty for the tournament in France, which starts on 8 September.\nJack Willis offers a point of difference at the breakdown and excelled for champions Toulouse in the Top 14. Ben Earl is touch-and-go, but could be someone who benefited from not being involved in Cardiff. On the contrary, Tom Pearson started well against Wales but faded, and was outplayed by Jac Morgan.\nAt number eight Billy Vunipola will almost certainly go, although he is another player carrying a niggle. It then comes down to a shootout between Tom Willis and Alex Dombrandt.\nDespite a raft of options at scrum-half, Borthwick has kept only three nines in camp for the bulk of the summer. So Ben Youngs, Jack van Poortvliet and Danny Care are all set to make the squad.\nOutside them, captain Owen Farrell, George Ford and Marcus Smith will all be named, although Saturday was further evidence of how the England gameplan does not play to Smith's strengths.\nIn the midfield, Ollie Lawrence and Manu Tuilagi will both go as power options, while it would be a big surprise if Henry Slade doesn't make it. Joe Marchant was one of England's brighter performers in Cardiff and can also play wing. Elliot Daly is a near-definite, with Guy Porter likely to miss out.\nThe back three is a difficult selection as Borthwick balances form, experience and X-factor. The starting wingers from 2019 - Jonny May and Anthony Watson - are both in the mix after an up-and-down few years. Joe Cokanasiga is big and powerful but made mistakes at the Principality.\nMax Malins is a lovely player but plays on the wing when perhaps more suited to full-back. Henry Arundell is raw but offers unique speed; can Borthwick afford to leave him at home, given England's try-scoring travails? Full-back Freddie Steward is inked in.\nBorthwick met with his assistants on Saturday evening in Cardiff before speaking to the players on Sunday morning as 43 players are whittled down to 33.\nThe overall squad could include as many as 20 men who were part of the 2019 squad, so, on paper, there is certainly the quality and experience to go deep into the tournament.\nBut there are concerns over how many of these players are better than they were four years ago, given England's patchy form throughout the World Cup cycle.\nAnd, on the evidence of Cardiff, when it comes to sharpness and slickness, there is still so much to improve.", "url": "https://www.bbc.com/sport/rugby-union/66403527"}