{"authors": ["Jordan Chamberlain", "www.facebook.com"], "date_download": "2025-04-26 04:24:40", "date_modify": "2025-04-26 04:24:40", "date_publish": "2025-03-03 12:35:41", "description": "Liverpool news: Opinion - Virgil van Dijk could captain Reds for next five years", "filename": "sport_football_articles_cjev71yepz2o_1745641480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b81/live/3beedc30-b62c-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cjev71yepz2o_1745641480.html", "title": "Opinion - Virgil van Dijk could captain Reds for next five years - BBC Sport", "title_page": "Liverpool news: Opinion - Virgil van Dijk could captain Reds for next five years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool's players enjoyed a well-earned weekend off as FA Cup action took place, which means they will be raring to go against Paris St-Germain in the Champions League last 16 on Wednesday.\nThe Reds exited the FA Cup in the fourth round at Plymouth, which was a reminder that no team can perform without their best players...\nWithout Virgil van Dijk marshalling the side, the Reds looked lost defensively that afternoon, but he has been completely imperious in the Premier League in helping Liverpool to two clean sheets against Manchester City and Newcastle United that moved us 13 points clear at the top.\nMo Salah has been the best player in the country this season, but Van Dijk is second. Then third place is a long, long way back. While Salah is getting the plaudits and could win a Ballon d'Or, Van Dijk's brilliance is under-appreciated.\nIn terms of ability, he is the best centre-back in modern football history.\nThe only defenders to have played in the Premier League who could tie his boots were John Terry and Rio Ferdinand. Van Dijk is faster than both, stronger than both, a better passer, as good positionally and more composed. And all while playing in a line about 25 yards higher than those two had to.\nAgainst City and Newcastle, when Liverpool were 2-0 up, the Reds dropped their line and defended like a side in the mid-noughties. They did not park the bus, but they just shut up shop and ended the game as a contest.\nVan Dijk morphed into that old-style centre-back, heading everything away, making the occasional block and generally looking virtually impenetrable.\nPay him what he wants, Liverpool. He could captain the side for five more years at least.", "url": "https://www.bbc.co.uk/sport/football/articles/cjev71yepz2o"}