{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:01:11", "date_modify": "2025-04-26 08:01:11", "date_publish": "2025-02-25 10:34:19", "description": "Stoke City missed out on a \"massive\" opportunity to back-up their win against Swansea with another at Norwich, says midfielder Andrew Moran.", "filename": "sport_football_articles_cx2gqdz8y7jo_1745654471.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/902b/live/611ebd40-f35c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2gqdz8y7jo_1745654471.html", "title": "Andrew Moran: Stoke disappointed to miss 'massive' chance of second successive win", "title_page": "Andrew Moran: Stoke disappointed to miss 'massive' chance of second successive win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stoke City midfielder Andrew Moran says the squad were \"really disappointed\" to miss out on a \"massive\" opportunity for a second straight win against Norwich as they prepare for tonight's home game against Middlesbrough.\nThe Potters travelled to Carrow Road buoyed by an impressive 3-1 victory over Swansea City but came unstuck as Josh Sargent scored twice in the Canaries' 4-2 victory.\n\"To get two wins in a row in this league is massive,\" Moran, on-loan from Brighton, told BBC Radio Stoke.\n\"We really wanted that and it was disappointing we didn't do everything we could've. We felt really good after that [Swansea] win and wanted to capitalise on that.\"\nStoke are five points clear of the relegation zone as Boro visit the Potteries - the first of two games against sides with play-off ambitions, with Watford arriving on Saturday.\nHead coach Mark Robins is slowly getting more options at his disposal, with the likes of Ben Pearson, Sam Gallagher, Million Manhoef and Ben Wilmot all returning to full fitness.\nMoran is adamant that is a \"really good thing\" as they prepare to try and put Saturday's setback behind them against Middlesbrough.\n\"We've got two home games coming up now. That's the best part about Championship football - you've games every two days so when you have a tough result, you've got the chance to bounce back and give a better account of ourselves.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2gqdz8y7jo"}