{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:08:24", "date_modify": "2025-05-19 15:08:24", "date_publish": "2015-03-06 09:35:24", "description": "Arsenal's Gabriel Paulista will miss the FA Cup tie at Manchester United after being ruled out for two to three weeks.", "filename": "sport_football_31763315_1747667304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81439000/jpg/_81439987_hi025888327.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31763315_1747667304.html", "title": "Gabriel: Arsenal defender out of Man Utd tie with hamstring injury", "title_page": "Gabriel: Arsenal defender out of Man Utd tie with hamstring injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal defender Gabriel Paulista has been ruled out for two to three weeks with a hamstring problem.\nThe Brazilian, a £16m signing from Villareal, was injured in Wednesday's 2-1 Premier League win at QPR.\nArsenal travel to Manchester United on Monday in the FA Cup quarter-final.\n\"It's a special intensity because it's between two teams with a chance of winning,\" said Gunners boss Arsene Wenger. \"We are the holders of the FA Cup and we want to keep it.\"\nThe two sides are separated by one point in the Premier League, with Arsenal in third and United fourth.\nGoalkeeper Wojciech Szczesny (illness) and defender Nacho Monreal (back) face fitness tests on Friday but Wenger is hopeful both will be fit.\nThe Frenchman said it was a \"wrong statement\", adding: \"I think a player like Paul Scholes would have loved to play with Mesut Ozil.\n\"He puts a lot of effort in to help the team and he works much harder than his style shows.\n\"You can be cheated a little bit by his style of play, because he is fluent, easy, subtle and he does not look like he puts the effort in, but he does.\"\nWenger also said former United forward Danny Welbeck has a \"great future\" at Arsenal.\nThe 24-year-old has recently played on the right of a front three featuring Olivier Giroud and Alexis Sanchez, rather than through the middle.\nWelbeck, a late substitute in Arsenal's last two league matches, could face his former club at Old Trafford on Monday, live on BBC One and the BBC Sport website (kick-off 19:45 GMT).\n\"I am very, very happy that I bought him and I think this guy has a great future.\n\"Welbeck is very important and has played many, many games since the start of the season. His position is one of the three up front - central, left or right. He can play anywhere.\"", "url": "https://www.bbc.com/sport/football/31763315"}