{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 06:31:05", "date_modify": "2025-05-21 06:31:05", "date_publish": "2025-01-14 04:59:19", "description": "Emma Raducanu overcomes serving wobbles to begin her 2025 season with a scrappy first-round Australian Open win.", "filename": "sport_tennis_articles_c360pkw5jr1o_1747809065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e3b9/live/1479c6d0-d226-11ef-b7c6-6f9748631442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c360pkw5jr1o_1747809065.html", "title": "Australian Open 2025 results: Emma Raducanu begins her season with scrappy first-round win over Ekaterina Alexandrova", "title_page": "Australian Open 2025 results: Emma Raducanu begins her season with scrappy first-round win over Ekaterina Alexandrova - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emma Raducanu overcame second-serve wobbles to start her 2025 season with a scrappy win in the Australian Open first round.\nThe British number two, whose preparations were disrupted by a back injury, won 7-6 (7-4) 7-6 (7-2) against Russian 26th seed Ekaterina Alexandrova.\nWhile hitting well from the baseline, Raducanu was hampered by double faults and lost serve six times.\nThe 2021 US Open champion hit 15 double faults, including a particularly-deflating one on break point when she looked to close out a straight-set victory from a 5-4 30-0 lead.\nHowever, the way she regrouped and dominated another tie-break to get over the line was impressive.\nThe 22-year-old had a sheepish grin as she walked to the net and said afterwards: \"I think my serve had a mind of its own.\"\nWorld number 61 Raducanu will face another higher-ranked player next in Amanda Anisimova.\nThe 23-year-old American, who is ranked 35th having returned from a nine-month mental health break in 2023, beat Argentina's Maria Lourdes Carle 6-2 6-3 to set up Thursday's match.\nRaducanu insisted she was \"ready to go\" in Melbourne after recovering from the back spasm - suffered when she bent down to tie a shoelace - that ruled her out of a season-opening event in Auckland.\nPlaying her first match since November, it was never likely to be plain-sailing for Raducanu on her Grand Slam return against a seeded player.\nMost of the problems were caused by her second serve.\nAt the BJK Cup in Malaga, Raducanu spoke about tweaking her service motion and elongating the takeback in a search for extra power.\nIn Malaga, it produced plenty of aces - but that was countered by double faults. A similar pattern followed in Melbourne.\n\"The amount of double faults is uncomfortable, for sure,\" Raducanu said.\n\"But it is something I had to accept. I'm working on my serve and part of it came with first-round nerves.\"", "url": "https://www.bbc.com/sport/tennis/articles/c360pkw5jr1o"}