{"authors": ["Mike Whalley", "www.facebook.com"], "date_download": "2025-04-26 04:41:56", "date_modify": "2025-04-26 04:41:56", "date_publish": "2025-03-02 06:32:07", "description": "England's record 90-4 defeat by Australia in Las Vegas was an experience akin to being in a washing machine, according to Amy Hardcastle - and laid bare the gulf between the teams.", "filename": "sport_rugby-league_articles_c74kz49j8rwo_1745642516.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b9cc/live/e78978f0-f72d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_c74kz49j8rwo_1745642516.html", "title": "Australia 90-4 England: Amy Hardcastle compares tough night to being in washing machine", "title_page": "Australia 90-4 England: Amy Hardcastle compares tough night to being in washing machine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Amy Hardcastle compared the experience to being in a washing machine. Jodie Cunningham said it was evidence of the work English women's rugby league still has to do.\nEngland's experience in Las Vegas could hardly have been more chastening. A 90-4 defeat by Australia was the biggest the Lionesses - either as England or Great Britain - have ever suffered.\nBoth captain Cunningham and centre Hardcastle, interviewed on the pitch moments after a shattering result, were quick to pinpoint the reasons for it: they couldn't get enough of the ball, and so ended up spending much of the 70 minutes trying to defend against the best team in the world.\nHow to use that as a learning experience to avoid a repeat is a tougher question - and one that goes to the heart of the structure of women's rugby league in England.\nThe effort from Stuart Barrow's team never wavered, even as hopes of running their opponents close were shredded. The fact they scored the final try of the match, having conceded 17 before that, spoke volumes of their capacity to keep going.\nThat, in itself, required huge reserves of character.\n\"I think we know what we need to do when we go back home,\" Hardcastle said. \"You can't take anything away from the Jillaroos.\n\"They're absolute athletes and what they get to do in Australia, and how professional they are, and the backing that they get is incredible. And to face them at a top level, it's a privilege to be here.\n\"We've lost, but to be able to be here and give it a go and know what it's like in that battle, in that washing machine, it's been worth that 70 minutes.\"\nThe size of the defeat clearly hurt.\n\"There are always positives to take,\" Cunningham said. \"Right now, it's tough to focus on them, but I think the heart was there, the effort was there, we didn't give up.\n\"I think Georgia Roche getting a try for us right at the end shows that we didn't give up. The effort was there. It was just that they were too good for us.\n\"But I'm proud of the girls. I'm proud of how they kept going and sometimes that's what you've got to take at international rugby.\"\nIn an interview with Sky Sports before the match, Cunningham had highlighted the gulf in investment between the women's domestic game in Australia and England.\nShe had pointed out how the players in the NRL Women's Premiership (NRLW) were either full-time or semi-professional, while those in England's Women's Super League play for expenses or nothing at all.\nThat gulf was on show at the Allegiant Stadium, as a ruthless Australia side kept on punishing their opponents.\nAnd it provided a significant reality check as England start building towards next year's World Cup.\n\"It shows where women's rugby league's at,\" Cunningham said. \"The growth that's happened over recent years, the investment that's gone into the NRLW is there to see, with the athletes they have and what you can see on show today.\n\"We've got a lot of work to do. But we've got a great squad, we've got a great group of staff and we're willing to put that hard work in to get better.\"\nIn a recent interview with BBC Sport, former Great Britain head coach Jackie Sheldon highlighted the investment Australia have put into their women's game over the past two decades as a key factor in their international dominance - they have won the past three World Cups, and lost just once since 2016.\nShe suggested England have to find a way to compete physically with Australia and New Zealand in order to be able to challenge them.\nGiven the disparity in investment between the domestic game in England and Australia, that may not be a quick process. It may be helped, though, by the experience gained by English players who have moved to the NRLW: Roche plays her club rugby for Newcastle Knights, and Hollie-Mae Dodd for Canberra Raiders, while Paige Travis will start the coming season with Parramatta Eels, having switched from St Helens.\nPerhaps, in time, the painful memories of Vegas will make England better too. As Hardcastle put it: \"The result's hard, but there's a lot we can look at individually, and think: what do we need to do to be better?\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/c74kz49j8rwo"}