{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:54:28", "date_modify": "2025-05-21 03:54:28", "date_publish": "2025-01-15 11:25:25", "description": "MK Dons pay an undisclosed fee to League Two rivals Notts County for midfielder Dan Crowley.", "filename": "sport_football_articles_c334d7z5ez1o_1747799668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38eb/live/89a3f790-d330-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c334d7z5ez1o_1747799668.html", "title": "Dan Crowley: MK Dons sign Notts County midfielder", "title_page": "Dan Crowley: MK Dons sign Notts County midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "MK Dons have signed Notts County midfielder Dan Crowley for an undisclosed fee.\nThe 27-year-old, who scored four times in 19 appearances for County this season, is the second arrival at Stadium MK during the current transfer window.\nLast week they brought in fellow midfielder Jay Williams from boss Scott Lindsey's former club, Crawley Town.\n\"Dan's quality at this level is very clear. He's a wonderful footballer with a great work ethic and fantastic ability on the ball,\" Lindsey said.\n\"For us, it'll be about integrating him into the environment as quickly as possible to get the best out of him. I'm excited to see him link up with the other players and show what he can do.\"\nThe Dons are 11th in League Two, five places and six points below Crowley's former club.\nCounty had offered him a new contract with his deal set to expire this summer.\n\"Unfortunately, however, Dan's expectations exceeded what we were prepared to offer,\" said a club statement.\n\"We nevertheless maintained a good relationship and rejected several substantial bids this month and last summer, with us prepared to retain Dan's services up until the conclusion of his contract should our high valuation of him not be met in this transfer window.\n\"This latest offer, however, was acceptable to us and, with Dan informing us that he wanted the move to happen, we have sanctioned it.\"\nCrowley could make his Dons debut in Saturday's game away at leaders Walsall.", "url": "https://www.bbc.com/sport/football/articles/c334d7z5ez1o"}