{"authors": ["Seb Brown", "www.facebook.com"], "date_download": "2025-05-21 05:45:06", "date_modify": "2025-05-21 05:45:06", "date_publish": "2025-01-14 12:36:43", "description": "Ipswich news: Opinion - Fan on Town's recruitment strategy", "filename": "sport_football_articles_c0e4nrvxjl2o_1747806306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed4c/live/b5390d40-54ba-11ef-b2d2-cdb23d5d7c5b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0e4nrvxjl2o_1747806306.html", "title": "Opinion - Fan on Town's recruitment strategy - BBC Sport", "title_page": "Ipswich news: Opinion - Fan on Town's recruitment strategy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Brave, bold but never reckless\".\nThat has been the message from Ipswich Town chief executive Mark Ashton before the past couple of transfer windows. With three weeks left of the January window, what do Ipswich need before it 'slams shut'?\nOne early arrival looks another shrewd acquisition. Ben Godfrey joined on loan from Atalanta and provides Premier League experience, physicality and pace. His arrival solves a problem position for Town given the injury woes of Axel Tuanzebe.\nThe attention must now shift to the forward line. Twenty goals scored so far is the third-fewest in the league, as is an average of just 10 shots per game. Ipswich need to improve these numbers in the attacking third if they are to stay up.\nAt the time of writing a deal for Jaden Philogene remains in limbo. Many fans were expecting the transfer to be completed by now and assuming it goes through then Philogene will provide pace, trickery, ball-carrying ability and will improve the chance creation statistics.\nThe key position in need of improvement before the window opened was centre-forward. Liam Delap has proven to be a revelation this season and his eight league goals show how dependent Town are on him staying fit.\nHis natural back-up George Hirst has only managed 180 minutes this season as two separate injuries have disrupted his campaign. It is vital Ipswich can secure another striker to help Delap and Hirst share the workload before the season ends. Delap's all-action playing style takes its toll and the drop in quality when he is substituted is apparent.\nThe past two January windows have proved masterstrokes from the Ipswich owners and management, providing the springboard for remarkable second halves of the respective seasons.\nThe recent upturn in league form has given hope that Ipswich can stay in the Premier League, so it is time to be brave and bold again.", "url": "https://www.bbc.com/sport/football/articles/c0e4nrvxjl2o"}