{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:07:58", "date_modify": "2025-04-26 04:07:58", "date_publish": "2025-03-02 20:31:56", "description": "Ilona Maher has not ruled out a return to the Premiership Women's Rugby in the future after playing her final game for Bristol.", "filename": "sport_rugby-union_articles_c3371znp2gvo_1745640478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8061/live/12ce0a30-f797-11ef-bf79-99cefaeadcd6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c3371znp2gvo_1745640478.html", "title": "Ilona Maher: American says 'never say never' on playing in the PWR again", "title_page": "Ilona Maher: American says 'never say never' on playing in the PWR again - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ilona Maher has not ruled out a return to the Premiership Women's Rugby (PWR) in the future after playing her final game for Bristol Bears as they were defeated by Gloucester-Hartpury in the semi-final.\nThe versatile American back featured in seven games for the Bears since signing in January and scored four tries, including one in the 36-20 loss at Queensholm.\nThe 28-year-old is the most followed rugby union player in the world on social media and her arrival has had a significant impact on the PWR, with three clubs seeing record attendances and online followers skyrocketing.\n\"I never say never, I think it was amazing that even I got to come and play here for two and a half months,\" Maher said.\n\"What I was hopefully able to do and learn in two and a half months was amazing but I hope that even if I'm not playing this league continues to grow and we can get these numbers out to games even when I'm not there.\"\nMaher won bronze at the Paris Olympics last summer as part of the USA side and joined Bristol to switch back to playing XVs ahead of the World Cup in August.\nShe said her focus now for the next few months will be to continue playing, with the American Eagles facing Australia and New Zealand in May as part of the Pacific Four Series.\n\"We start with the Pac Four with USA 15s and I hope I've proven myself in this space to vie for a roster spot in the USA team and I hope I'll be selected for that,\" Maher said.\n\"It'll be a lot of continuing to learn the game and put myself in the position to make a roster for the World Cup but also be the best player I can be in the World Cup.\"\nBristol head coach Dave Ward and assistant coach Tom Luke were instrumental in bringing Maher to England and she said she was now a \"Bear for life\".\n\"I'm proud to have been part of this team, a special programme they have here,\" Maher said.\n\"The girls were so welcoming and made me part of the team and I got to play with some of England's best players and Wales and Scottish, so it just set me up to be more successful at the World Cup.\n\"I'll be playing against them - I wish I was playing with them but it was amazing.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c3371znp2gvo"}