{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:56:39", "date_modify": "2025-05-21 06:56:39", "date_publish": "2025-03-30 00:00:00", "description": "Watch live coverage as Wigan Warriors host Salford Red Devils plus local BBC radio commentaries from Sunday's action in the Super League and Championship.", "filename": "sport_rugby-league_live_cgkm60m2jx8t_1747810599.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_live_cgkm60m2jx8t_1747810599.html", "title": "Super League LIVE: Watch Wigan Warriors v Salford Red Devils, plus follow radio commentaries from the Super League and Championship", "title_page": "Super League LIVE: Watch Wigan Warriors v Salford Red Devils, plus follow radio commentaries from the Super League and Championship - scores & radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who's in action?\nWigan Warriors v Salford Red Devils (15:00 GMT)\nDefending champions Wigan Warriors welcome Salford Red Devils after suffering consecutive defeats for the first time this season.\nLeeds Rhinos edged past the Warriors in a gripping contest at AMT Headingley to inflict a second straight loss to the visitors - after they exited out of the Challenge Cup the week prior.\nRiley Lumb's early try gave the Rhinos the lead, before Liam Marshall's score reduced the deficit to two points at the break. A typical piece of magic from Bevan French put Wigan in front for the first time, but Jack Sinfield's late try and Jake Connor's conversion turned the game back in the Rhinos' favour.\nSalford Red Devils put their off-field issues behind them as they comfortably beat fellow strugglers Huddersfield Giants for their first Super League win of the season and a much needed respite for the Red Devils who have been plagued with financial issues of late.\nEsan Marsters battered his way over to send Salford ahead and Harvey Wilson did well to barge in for Salford's second try within 20 minutes.\nIn a stunning Salford move, Jayden Nikorima touched down for their third of the half and he added a second after the break with ease as the hosts took control and never looked back.\nRyan Brierley added an audacious drop-goal in between Adam Swift and Tui Lolohea managing to spare winless Huddersfield's blushes with a pair of tries before the hooter.\nHow to get into rugby league\nBBC Sport\nRugby league is a fast and dynamic game, which involves great strength, stamina and skill, and is played through the summer, so no muddy pitches, or cold, wet training nights!\nWith so many variations, you don't have to play the full version of the game to be part of it.\nWhatever your age, gender, fitness level or technical ability there is a version of rugby league that will suit you. Playing rugby league has many benefits, including keeping fit, meeting new people and maybe even progressing to a higher level.\nAlthough rugby league shares similarities with rugby union, it is important to see them as different games, and as such, each has its own unique set of skills. Look at the rules to get a feel for the game., externalFancy getting involved with a team locally? Find your local club by using the RFL's club finder., external", "url": "https://www.bbc.com/sport/rugby-league/live/cgkm60m2jx8t"}