{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:45:51", "date_modify": "2025-05-20 13:45:51", "date_publish": "2023-07-24 13:42:50", "description": "Former England international Trevor Francis, who was Britain's first ever £1m footballer, dies at the age of 69.", "filename": "sport_football_66287307_1747748751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F258/production/_130504026_gettyimages-1388604863.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66287307_1747748751.html", "title": "Trevor Francis: Ex-England player and Britain's first £1m footballer dies aged 69", "title_page": "Trevor Francis: Ex-England player and Britain's first £1m footballer dies aged 69 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England forward Trevor Francis has died aged 69 after suffering a heart attack in Spain.\nIn 1979 he became Britain's first £1m footballer when he moved from Birmingham City to Brian Clough's Nottingham Forest.\nHe won two European Cups with Forest - in 1979, when he scored the winner against Malmo, and 1980.\nFrancis also won 52 England caps, scoring 12 goals, before embarking on a managerial career.\nA statement released on behalf of his family said: \"This has come as a huge shock to everybody. We are all very upset.\n\"He was a legendary footballer but he was also an extremely nice person.\"\nFrancis spent half the year in Spain and the rest in Solihull. He suffered a heart attack 11 years ago and had kept himself fit since with daily power walks.\nHe had an annual health check through the League Managers' Association and, according to his spokesman, was \"enjoying life very much\".\nFrancis lost wife Helen in 2017, when she died after being diagnosed with cancer. They had married in 1974 and had sons Matthew and James together.\nBorn in Plymouth, Francis joined Birmingham as a schoolboy and was the Blues' then-youngest debutant in 1970 aged 16 - a record only beaten by current England and Real Madrid midfielder Jude Bellingham in August 2019.\nFrancis went on to score 119 goals in 280 league appearances before his history-making switch to link up with Clough at Nottingham Forest.\nAfter Forest's two European Cup wins, he joined Manchester City before having spells with Italian clubs Sampdoria and Atalanta.\nA season in Scotland with Rangers followed before he joined QPR, where he also became player-manager.\nHe later performed a similar role at Sheffield Wednesday and helped lead them to both the FA Cup and League Cup finals in 1993, losing both to Arsenal.\nFrancis retired as a player in 1994, shortly before his 40th birthday, having made 632 appearances and scored 235 goals.\nHe then returned to Birmingham as manager between 1996 and 2001 and guided the Blues to the 2001 League Cup final where they lost to Liverpool on penalties.\nAfter leaving St Andrew's, his final managerial post was at Crystal Palace where he spent two years.\nHe also worked as a media pundit with Sky Sports and BT Sport.\nFond tributes were paid to Francis by his former clubs, team-mates and colleagues from within the media.\nNottingham Forest said they were \"deeply saddened\" and Francis was \"a true Forest legend who will never be forgotten\". Birmingham City said Francis will \"forever be revered as a giant of the club\" and he was \"the player everyone wanted to see\".\nSheffield Wednesday said they were also \"deeply saddened by the passing of Francis\" and said their \"thoughts are with Trevor's family and friends at this incredibly difficult time\".\nSampdoria posted a simple \"Rest in peace, Trevor Francis\" while Rangers said they were \"saddened to hear of his passing\".\nThe Football Association tweeted: \"We are deeply saddened by the news that Trevor Francis has passed away aged 69. He won 52 caps and scored 12 goals - including two at the 1982 at the World Cup - for the Three Lions between 1977 and 1986. All of our thoughts are with his family, friends and former clubs.\" The EFL added that Francis was \"one of the best English football has ever seen\".\nViv Anderson, who played with Francis at Forest, posted a tribute on Instagram: \"Just heard the unbelievable news regarding Trevor Francis, he was such a wonderful person and fabulous teammate he will be sadly missed, my condolences go to his family and friends RIP.\"\nReal Madrid and England midfielder Jude Bellingham, who began his career at Birmingham, posted a photo of of himself as a child meeting Francis. Bellingham wrote: \"A very sad day for BCFC and all of football. Beyond legendary, a trailblazer, a great and an icon of the game. The only thing that could exceed his quality and accolades on the pitch was his class off it. Thank you for all the guidance and the benchmarks you set. Rest in peace, King Trevor!\"\nFormer England and Rangers team-mate Terry Butcher told BBC Radio 5 Live that Francis would not have looked out of place in the modern game: \"He was sophisticated, elegant; modern football would have suited him down to the ground.\n\"He was just class, he really was. He was smooth, he was silky, scored some great goals, a phenomenal player and a very, very nice guy, as everybody says.\"\nMatch of the Day presenter Gary Lineker, who won 80 caps for England, tweeted: \"Deeply saddened to hear that Trevor Francis has died. A wonderful footballer and lovely man. Was a pleasure to work alongside him both on the pitch and on the telly. RIP Trevor.\"\nEx-England goalkeeper Peter Shilton said on Twitter he was \"absolutely devastated\" to hear about Francis' passing and added he was \"such a wonderful gentleman a friend\".\nFormer Forest striker Stan Collymore claimed Francis was \"the loveliest of men, humble, humorous, always giving of his time and advice\" before adding \"they say never meet your heroes, well, I met mine and he was an absolute gentleman\".\nChris Kamara, who worked alongside Francis at Sky Sports, also said he \"was a gentleman\" and \"the first million pound player who always looked a million dollars\".\nFormer Crystal Palace striker Mark Bright, who played under Francis' management at Wednesday, added: \"The club experienced some great times in the early 1990s, both Trev his wife Helen, were very kind in helping me to settle in at the club, I greatly appreciated it then and now. Love to sons Matthew and James.\"", "url": "https://www.bbc.com/sport/football/66287307"}