{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:24:10", "date_modify": "2025-04-26 06:24:10", "date_publish": "2025-03-04 00:00:00", "description": "Burnley's remarkable 12-match clean sheet run was ended but they still secured an away victory over Cardiff City in the Championship.", "filename": "sport_football_live_cwyddw72221t_1745648650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2dd3/live/61f28950-f941-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cwyddw72221t_1745648650.html", "title": "Cardiff City 1-2 Burnley: Clarets claim win despite end of clean sheet run", "title_page": "Cardiff City 1-2 Burnley: Clarets claim win despite end of clean sheet run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Burnley moved to within two points of the Championship automatic promotion spots despite conceding their first league goal in 2025 as they won at Cardiff City Stadium.\nScott Parker's side took control of the contest as Josh Brownhill volleyed them into the lead and Maxime Esteve's first Burnley goal made it 2-0 before the interval.\nCardiff ended the Clarets' magnificent 12-game clean-sheet streak in the league as Yousef Salech headed home as Burnley conceded for the first time in 1,132 minutes.\nSalech also headed against the crossbar as Cardiff chased an unlikely point, but Burnley held firm to secure an important win in their bid for a quick return to the Premier League.\nGoals scored against Burnley in the Championship have become the stuff of myth and legend in 2025 as winter has come for all who have tried to penetrate the Lancashire side's defensive wall.\nThe visitors were looking to move into record territory as they sought a 13th successive clean sheet, with only Manchester United between November 2008 and February 2009 having kept more successive shutouts in English football league history.\nHowever, the Clarets remarkable run without conceding was ended after 1,132 minutes as Salech headed home Joel Bagan's cross to give Cardiff hope in a game where Burnley dominated for long spells, with Salech's 42nd-minute strike just the 10th they have conceded in the Championship.\nThe Clarets have looked like a well-oiled machine for months and they underlined their promotion credentials on 19 minutes as they took the lead with the first significant chance of the contest.\nSlick passing culminated in Hannibal Mejbri's cross being volleyed home by Brownhill who guided the ball in via a deflection from home defender Perry Ng.\nCardiff did come close to an equaliser on 28 minutes as Callum O'Dowda's teasing cross found Salech unmarked on the penalty spot and goalkeeper James Trafford could only watch as the ball bounced off the post.\nThat was against the run of play and Zian Flemming might have scored with a header as Burnley continued to attack with purpose and Jaidon Anthony also fired over.\nIt arrived on 40 minutes as Flemming and Anthony combined and Esteve was able to finish from close range as Cardiff looked down and out against a side with more clean sheets than a luxury hotel.\nBurnley were unbeaten across their past eight league games against the Welsh side and they continued to look the more likely scorers after the break as Brownhill and Marcus Edwards both saw penalty claims turned down by referee James Linnington.\nCardiff's first real attempt of the second period saw Callum Robinson try an audacious lob from 50 yards that Trafford saved and Salech clipped the crossbar.\nHowever, Burnley have kept 25 clean sheets in the Championship this term and their defence held firm again, with Cardiff left to rue a late missed chance for substitute Will Fish, who could only poke wide from close range in a crowded penalty area.\nCardiff City boss Omer Riza told BBC Sport Wales:\n\"We are disappointed. You can't give goals away like they did, they weren't outstanding goals, we were poor at dealing with the ball in the box, we didn't get tight enough or pick up men well enough.\n\"To go 2-0 down to a team like Burnley, you make it very hard for yourself. We scored the goal and got a lifeline… I thought second half we were better than them if I am being honest.\n\"Will Fish will score that late chance nine times out of 10. Yousef Salech hit the post and crossbar, we had our chances, but the bottom line is we didn't pick up any points.\n\"But the second half was a lot more pleasing. I thought we were worth a point, but we left ourselves too much to do.\"\nBurnley boss Scott Parker said:\n\"I am pleased with the three points. We started superbly for 35 minutes, dominated and got our noses in front.\n\"We started the second half brightly but my only complaint is we probably should have put more daylight between us.\n\"At the end you need resilience and the ability to dig in and we had that. I thought the energy was impressive. We looked like a proper team who understood their roles.\n\"It's a shame we conceded tonight but I'm more pleased that we won. I was a little bit surprised we conceded, we will have to review it.\"", "url": "https://www.bbc.co.uk/sport/football/live/cwyddw72221t"}