{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:24:14", "date_modify": "2025-05-21 06:24:14", "date_publish": "2025-03-31 13:01:50", "description": "Ruben Amorim press conference: Nottingham Forest vs Man Utd preview", "filename": "sport_football_articles_cp319d222lzo_1747808654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp319d222lzo_1747808654.html", "title": "Ruben Amorim press conference: Nottingham Forest vs Man Utd preview", "title_page": "Ruben Amorim press conference: Nottingham Forest vs Man Utd preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Centre-backs Harry Maguire and Leny Yoro are available.\nAyden Heaven, who was carried off on a stretcher in the match before the international break at Leicester, \"is not yet ready to play\" but Amorim is hopeful he could return before the end of the season as his injury \"is not so serious\" as initially feared.\nJonny Evans is \"recovering\", Luke Shaw \"is not ready yet\" while Kobbie Mainoo \"is almost ready.\"\nOn the team picking up where they left off before the break: \"I feel the players are more confident and the energy is different. But I also know that can change with results. Even winning the games, we can acknowledge we have a lot to improve and are ready for the final two months of the season.\"\nHe said United \"are looking up\" the table to see how high they can finish, but their main focus is to just win games.\nOn the busy fixture schedule: \"It is really exciting but really tough matches. Different characteristics give us different opportunities to win matches.\"\nOn Marcus Rashford, who scored twice for Aston Villa in the FA Cup on Sunday: \"We have a lot of games to play and I am focused on my team and my players. Rashford is not my player at the moment but every player that performs well on loan is good news for my club, so I am happy with that.\"", "url": "https://www.bbc.com/sport/football/articles/cp319d222lzo"}