{"authors": ["Andrew Southwick", "www.facebook.com"], "date_download": "2025-05-19 14:31:33", "date_modify": "2025-05-19 14:31:33", "date_publish": "2017-08-20 19:02:05", "description": "Glasgow City, Hamilton Accies and Forfar all stroll into the Scottish Cup quarter-finals with respective 7-0 wins.", "filename": "sport_football_40994706_1747665093.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CFB7/production/_97457135_katiemccabeinaction.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40994706_1747665093.html", "title": "Glasgow City, Hamilton and Forfar score seven goals in Scottish Cup routs", "title_page": "Glasgow City, Hamilton and Forfar score seven goals in Scottish Cup routs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glasgow City, Hamilton Accies and Forfar all strolled into the Scottish Cup quarter-finals with 7-0 wins.\nRangers found it much tougher, having to come from behind before eventually beating Stirling University 4-2.\nCumbernauld Colts won a seven-goal thriller against Boroughmuir, Melissa Porter scoring three minutes into time added on at the end of extra-time.\nGlasgow Girls and Jeanfield Swifts both won by a single goal to join them in the last-eight draw.\nThe quarter-final line-up with be completed when holders Hibernian play Celtic on 3 September.\nHearts were up against it from the very beginning against Glasgow City with only eight first team players to pick from, relying on their development players to make up the numbers.\nThey were undone after just six minutes when Leanne Ross picked out Abbi Grant to put the visitors ahead at Kings Park.\nBut after that Hearts deserve credit for a defensive masterclass.\nCity camped in their opponents' half, but the Jambos defended in numbers - swarming all over their opposite numbers with Leanne Crichton at one point finding herself with five maroon shirts surrounding her as she tried to get a shot away.\nJust when they thought they had done enough to survive until half-time with only a one-goal deficit, City scored twice in a minute.\nRoss showed her set-piece prowess by sending a direct free-kick into the bottom corner, before Joanne Paton celebrated her debut with her first goal for the club when she rolled Ross' cut-back into the net.\nAs heads went down in the home side, Sam Kerr volleyed off the bar for City right on the half-time whistle.\nThere was controversy over City's fourth when Noelle Murray's shot hit the bar and bounced down. Hearts protested that it had not gone over the line, but the referee awarded the goal.\nOn the hour mark Paton chested the ball down for Hayley Lauder who easily picked her spot beyond the goalkeeper.\nThe sixth was a moment of magic from Brogan Hay, who skipped past three players before adding the finishing touches with a low strike.\nAnd Ross made it seven with a late penalty after Katie McCabe, who has recently joined the club on loan from Arsenal, was tripped in the box.\nGlasgow City captain Leanne Ross: \"The first game back after the summer break there were always going to be teething problems; getting ourselves settled back in and also getting the new players bedded in as well, but all in all I think we can be pleased with the performance and the result.\n\"They came out and pressed us a wee bit higher than we had expected. Their work rate was really good, they made us work for the goals that we got.\n\"We've got big games coming thick and fast and it's just a case of being prepared and ready for them.\"", "url": "https://www.bbc.com/sport/football/40994706"}