{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:28:38", "date_modify": "2025-05-20 12:28:38", "date_publish": "2023-08-04 06:35:52", "description": "After a breakthrough year for Bristol City, Tommy Conway says he wants to improve \"everything\" this season.", "filename": "sport_football_66323267_1747744118.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D6D3/production/_130559945_shutterstock_editorial_13865164cx.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66323267_1747744118.html", "title": "Tommy Conway: Bristol City forward ready to lead Robins after breakthrough year", "title_page": "Tommy Conway: Bristol City forward ready to lead Robins after breakthrough year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After a breakthrough year for Bristol City, Tommy Conway said he wants to improve on \"everything\" this season and lead the team from the front.\nThe 20-year-old is one of the Robins' homegrown successes having been part of the club since the age of seven.\nBorn in nearby Taunton, Somerset, Conway graduated into a regular first-team slot in 2022-23, making 50 appearances in all competitions.\nHe scored 13 goals to end the season as the team's top scorer.\n\"When I look at my game, everything I can improve on, there were still chances that I could have scored, I could have scored more goals,\" Conway told BBC Points West.\n\"And my overall game - my link-up play, my hold-up play, my work-rate - there's stuff I can improve on so I'm never going to say I'm going to work on one thing and not the other because no one's perfect in football.\n\"I want to work on everything and try and improve on the figures I got last year but most importantly help the team, be the focal point for the team, lead from the front, score some goals and assists and hopefully we can have a positive year.\"\nConway made his Bristol City senior debut in May 2021 while still a teenager but became a permanent fixture of Nigel Pearson's attacking set up from the first game of last season.\nHe was only absent from the starting line-up due to a hamstring injury that kept him out for two months in January.\n\"Last season when I think about it now it's still a bit of a rollercoaster,\" Conway said.\n\"This time last year I was saying 'this year has got to be my year' and now a year later, the difference in mindset and where I am is unbelievable really.\n\"On and off the pitch I just felt comfortable. I settled in with the boys, being a young lad coming through the academy and with senior players every day to have their respect that gave me confidence on the pitch.\n\"Living with Scotty (Alex Scott) that played a part, so I think it all just clicked.\n\"As I got onto the pitch and started scoring goals I think naturally you just get confidence from that as well, I think all of it just mixed together played a part.\"\nThis season Conway's ambitions are to keep doing what he has been doing behind the scenes knowing where it has already got him in his career.\n\"I've set targets. I know where I want to get to this year and how I need to get there and it's just down to me,\" he added.\n\"I need to work hard every day, it sounds cliche but for me I've only got to where I've got to today by working hard.\"", "url": "https://www.bbc.com/sport/football/66323267"}