{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:57", "date_modify": "2025-05-21 07:29:57", "date_publish": "2025-05-20 16:53:59", "description": "Non-league Kettering Town part company with boss Richard Lavery after failing to win promotion this season.", "filename": "sport_football_articles_crljjjjyjrzo_1747812597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d80e/live/26ce0630-3599-11f0-a9d1-9382f03c2c54.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crljjjjyjrzo_1747812597.html", "title": "Richard Lavery: Non-league Kettering Town part company with manager", "title_page": "Richard Lavery: Non-league Kettering Town part company with manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kettering Town have parted company with manager Richard Lavery after failing to win promotion to step two of non-league football.\nLavery guided the Poppies to a memorable FA Cup first-round win over county rivals Northampton Town, from League One.\nBut they were pipped to the Southern League Premier Central title by Bedford Town and then lost to AFC Telford United in the play-off final.\nLavery was appointed in February 2024, their third manager in four months, having previously been assistant to Marcus Law when Kettering won promotion to National League North in 2019.\n\"I want to genuinely thank Lav for everything that he, and his hardworking management team, have done for KTFC,\" said owner George Akhtar, who bought the club three months after Lavery took charge and has set a target of reaching the English Football League.\n\"The long hours, professional dedication and inspiration have been the hallmark of his tenure, and Richard will be remembered with great affection as the man who put the club back on the map.\"\nHe was in charge for 62 games, achieving a win rate of 52%, and a club statement said the figure was \"a testament to the ambition and tactical clarity Lavery brought to the dugout\".", "url": "https://www.bbc.com/sport/football/articles/crljjjjyjrzo"}