{"authors": ["Jay Freeman", "www.facebook.com"], "date_download": "2025-05-21 04:36:53", "date_modify": "2025-05-21 04:36:53", "date_publish": "2025-04-04 16:50:33", "description": "Warrington Wolves will not change their approach against St Helens in the Challenge Cup this weekend, says boss Sam Burgess.", "filename": "sport_rugby-league_articles_c9qw7y5z8rqo_1747802213.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/284c/live/15caf530-116f-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c9qw7y5z8rqo_1747802213.html", "title": "Warrington v St Helens: Wire boss Sam Burgess says they understand weight of result", "title_page": "Warrington v St Helens: Wire boss Sam Burgess says they understand weight of result - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warrington Wolves will not change their approach against St Helens in the Challenge Cup quarter-final having beaten them in Super League only two weeks ago, boss Sam Burgess says.\nThe Wire will take on Saints on Sunday for the second time in as many weeks, the second of three meetings in a month, as they meet again on 24 April.\nBurgess' side edged out St Helens 14-12 in a thrilling league encounter on 21 March.\n\"There's a bit more on the line because it's the quarter-final of the cup. We understand the weight of the result,\" Burgess told BBC Radio Merseyside.\n\"The approach is the same. The game was two weeks ago, we've taken our lessons from that and I'm sure they have.\"\nSince their last meeting, Warrington went on to beat Leeds while St Helens pulled off a thrilling 14-13 win at Catalans last week.\nA path to reaching the final for the second successive season rests on beating St Helens, and Burgess believes his side will be well prepared when they take to the field on Sunday.\nBurgess added: \"There's been a game in between where we've learned a few more lessons so we try and we're just constantly trying to grow.\n\"The moments on the field will define the result. The cup has got a brilliant way of making moments happen. Those moments will come and in our preparations it's just whether we take them or not.\"\nSt Helens come into the game after they brought home two points from a thriller in Perpignan, during which Jonny Lomax scored the winning drop-goal.\nPaul Wellens' side have come off second best against the Wire in recent times, but he believes they will have learned from their experiences.\n\"We know they're a quality side who are very well coached and we're going to have to play well,\" he told BBC Radio Merseyside.\n\"We've been on the wrong end of the results recently but when you look at the last two times we've played them, one was a golden point victory for them in the play-offs last year.\n\"The other one a couple of weeks ago was a 14-12 victory which indicates that there's not a lot between the two teams.\n\"Quite often these games are decided by fine margins. We're prepared for what will be an extremely tough game but also they're a team where we believe we can go there and win.\"\nAs for whether he will radically alter his plans for Sunday's cup tie, Wellens was more reserved.\n\"You learn lessons from every game but in particular when you play teams repeatedly in a short space of time which ourselves and Warrington have, you try and find little ways where you feel you can get joy,\" he added.\n\"They will be no different. Not a lot will change from both teams in terms of personnel but no doubt there will be a few tactical tweaks here and there because teams get a good look at what you're doing and see how they can exploit that.\n\"You need to be adaptable and do things a bit different and you might get some results from it.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/c9qw7y5z8rqo"}