{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:02:17", "date_modify": "2025-05-20 15:02:17", "date_publish": "2023-07-27 11:32:33", "description": "Former England attack coach Scott Bemand is appointed head coach of the Ireland women's team on a three-year deal.", "filename": "sport_rugby-union_66325797_1747753337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C2E6/production/_130549894_gettyimages-1252384269.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66325797_1747753337.html", "title": "Scott Bemand: Former England attack coach becomes Ireland women's head coach", "title_page": "Scott Bemand: Former England attack coach becomes Ireland women's head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England attack coach Scott Bemand has been appointed head coach of the Ireland women's team.\nBemand joins on a three-year deal, replacing Greg McWilliams, who left after this year's Women's Six Nations.\nFormer Harlequins, Leicester and Bath scrum-half Bemand won five Six Nations titles and four Grand Slams in eight years with the England women's side.\n\"I am proud to join the IRFU [Irish Rugby Football Union] at this exciting time for the game in Ireland,\" he said.\nJohn McKee had taken up the position on an interim basis following McWilliams' departure.\nBemand added: \"It is clear speaking to the IRFU across the course of the interview process how ambitious they are to grow the women's game and I believe that there is a promising talent pool of players who will help create a new chapter for the game here.\n\"I look forward to working with the players and coaches and shaping a new path.\"\nBemand, 44, was involved in England's record-breaking winning run of 30 Tests and the World Cup final defeats in 2017 and 2022.\nHe left his position as England attack coach following this year's Women's Six Nations campaign, with head coach Simon Middleton stepping down at the same time.\nHe joins an Ireland team who finished bottom of the Six Nations table.\nBemand will officially start his role on 21 August ahead of Ireland's WXV3 campaign in Dubai, with matches on 14, 21 and 28 October. He will be joined by the existing coaching panel for the coming campaign.", "url": "https://www.bbc.com/sport/rugby-union/66325797"}