{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 04:26:46", "date_modify": "2025-05-21 04:26:46", "date_publish": "2025-04-05 23:08:04", "description": "US Open champion Bryson DeChambeau leads LIV Miami by two shots heading into Sunday's final round at Trump Doral.", "filename": "sport_golf_articles_cj9e1nmk37vo_1747801606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5c85/live/9a73cc50-1271-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cj9e1nmk37vo_1747801606.html", "title": "LIV Miami: Bryson DeChambeau leads as Masters winners gather", "title_page": "LIV Miami: Bryson DeChambeau leads as Masters winners gather - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "LIV Miami leaderboard\n-5 B DeChambeau (US); -3 S Garcia (Spa); -2 P Reed (US), P Mickelson (US), M Leishman (Aus)\nSelected: -1 J Rahm (Spa); E D Johnson (US); +6 J Niemann (Chi); +11 T Hatton (Eng)\nFull leaderboard\nUS Open champion Bryson DeChambeau will take a two-shot lead into the final round of LIV Miami after a hitting a two-under-par 70 in round two.\nThe American improved his overall score to five under, with Sergio Garcia in second after he carded a 71.\nGarcia's fellow Masters champions Patrick Reed and Phil Mickelson are alongside Australian Marc Leishman on two under, while 2023 Augusta winner Jon Rahm is on one under.\nDustin Johnson, who claimed the Green Jacket in 2020, reached four under with two to play but dropped a shot on the 17th and then had a triple-bogey seven on the last as he posted a 75 to drop to level par.\nA dozen LIV golfers will head to Georgia after this event for next week's first major of the season.\nAmong them will be Chile's Joaquin Niemann, who has won two of the four LIV events held this year. He followed an opening 78 with a level-par 72 to remain at six over.\nEngland's Tyrrell Hatton, who will also be at Augusta, added a 77 to his first-round 78 and is way off the pace on 11 over par.", "url": "https://www.bbc.com/sport/golf/articles/cj9e1nmk37vo"}