{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:45:52", "date_modify": "2025-05-20 13:45:52", "date_publish": "2023-07-25 11:03:10", "description": "Crystal Palace: Wilfried Zaha leaves - your views", "filename": "sport_articles_cj7j1k5pm1jo_1747748752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68e3/live/46a53f30-2ac6-11ee-b1d7-8fdc93c2782e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cj7j1k5pm1jo_1747748752.html", "title": "Crystal Palace: Wilfried Zaha leaves", "title_page": "Crystal Palace: Wilfried Zaha leaves - your views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked how you are feeling after Crystal Palace talisman Wilfried Zaha's move to Galatasaray was confirmed.\nHere are some of your thoughts:\nSimon: It's a great move for Wilf and I fully understand it. He wants Champions League football and to be at a club that can win domestic titles. He will shine in Turkey as he should post better numbers for goals and assists. He is at his peak. Palace have already replaced him, as we have three players who can play his position. His influence was fading.\nKeith: Wilf was only ever going to leave for a club in Europe. Its a shame he’s gone, but fully understand why. He only has a few years left and doesn’t want to be sitting on his sofa in 10 years wondering 'what if?'. If Galatasaray can get to the knockout stages of the Champions League, he may yet become a god at a second club. Good luck, Wilf!\nRailton: It's obviously sad to see Wilf go, but is right for him and the club. However, I can’t see this as ‘the end’. He will be back to finish his playing days at Palace, it is inevitable.\nPete: Galatasaray seems a strange destination, but possibly easier for fans to take than seeing him come back to haunt us for another Premier League team. It's vital now that we don't let Olise go, and keep our fingers crossed that Rak-Sakyi can step it up. There's life after Wilf - but it needs to be planned, not just hoped for. Look what happened to Leicester.\nColin: I'm very conflicted about Zaha. He is the best player ever to play for Palace. I am disappointed for him that he isn't joining a bigger club with better European credentials as he deserves it. He was always going to leave Palace at some point, so it's now about how Parish and the other owners spend the money that they are saving from Zaha's salary.", "url": "https://www.bbc.com/sport/articles/cj7j1k5pm1jo"}