{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:50:33", "date_modify": "2025-05-20 12:50:33", "date_publish": "2023-08-04 00:00:00", "description": "The BBC's network of local radio reporters predict how all 72 EFL clubs may fare, with the new season starting later on Friday.", "filename": "sport_live_football_66364139_1747745433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3D2D/production/_130616651_30b643786fc0f7426453dfe972693ba294f5c8cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66364139_1747745433.html", "title": "EFL: Championship, League One & League Two clubs assessed before new season", "title_page": "EFL: Championship, League One & League Two clubs assessed before new season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Time to play\n#bbcefl\nIf you weren't already feeling ready for the start of the new EFL season, I hope you are now.\nChampionship, League One, League Two. All 72 clubs - 'big' or 'small', given equal coverage by our band of BBC local radio reporters as we try to guess how they'll all get on this season.\nIf you want to find your team, scroll down or flick between the pages. We started with League Two and worked our way up.\nBut now we cross to Hillsborough for live text coverage of the Championship curtain-raiser between Sheffield Wednesday and Southampton.\nI hope you enjoy this weekend's football.\nChampionship - Dark horses and relegation candidates\n#bbcefl\nAaron Paul and Jobi McAnuff\n72+ podcast hosts on BBC Radio 5 Live\nNow Alex Neil has had a full pre-season, expect Stoke to surprise one or two people. They’ve had a decent window so far – getting in good Championship experience in Johnson Stevens, Pearson, Rose, and Mark Travers. They were one of the biggest underachievers of the last few years, so we should definitely see an improvement this time.\nIpswich are the definitely of upwardly mobile after their swashbuckling promotion. We know the football Kieran McKenna’s side can play and they shouldn’t be ruled out.\nIn terms of relegation, Rotherham could struggle again after losing Chiedozie Ogebene and leader Richard Wood. Sheffield Wednesday sadly look a bit of a mess after coming up – with Darren Moore leaving and mixed messages off the field. QPR have had a ropey pre-season and look short of depth and quality, while Swansea and Huddersfield also could be in for long seasons.\nA few weeks ago maybe Plymouth might’ve been considered relegation candidates, but after signing Morgan Whittaker and Bali Mumba on permanent deals they may just have enough.\nChampionship - The other big boys\n#bbcefl\nAaron Paul and Jobi McAnuff\n72+ podcast hosts on BBC Radio 5 Live\nMidddlesbrough should be right up there this season after Michael Carrick’s brilliant job last time. Expect Chuba Akpom and Hayden Hackney to be star performers for them again.\nThen there are the recent Premier League teams. At Norwich, David Wagner has bit of a rebuild job with Teemu Pukki, Kieran Dowell going – possibly Max Aarons possibly as well. But Ashley Barnes is a shrewd signing.\nWest Brom are obviously struggling financially but Carlos Corberan will get the absolute most out of that squad, and they certainly still have enough quality to be competitive – so wouldn’t be surprised to see them vying for play-offs.\nAs for Watford, there’s no point trying to predict them. They could be anything!\nChampionship - The teams who have come down\n#bbcefl\nAaron Paul and Jobi McAnuff\n72+ podcast hosts on BBC Radio 5 Live\nThe Championship looks absolutely stacked this season with the three sides that came down, plus three big clubs that came up from League One.\nOf the relegated Premier League sides Leeds seem to be playing catch-up. The takeover and new manager news is positive but they’re suffering from previous poor recruitment, so will have to see who they manage to keep and bring in to get a better idea. But regardless, fans will expect promotion.\nHow quickly will Russell Martin be able to impose his philosophy at Southampton? Surely they’ll lose the likes of James Ward-Prowse and Romeo Lavia before the window closes. Leicester look best equipped to go straight back up – they’ve obviously lost key players but moved early in the window to secure top quality in Harry Winks and Conor Coady, plus added a keeper – which was much needed as they never really replaced Kasper Schmeichel.\nThey all have new managers, so don’t think it will be as straight forward for those any of them. Leicester’s Enzo Maresca is unproven, Russell Martin is still to show he can play his brand and win games consistently, while Daniel Farke does have good pedigree at the level.\nBirmingham City - Can Brady bring winning mentality?\nChampionship (2022-23: 17th)\nRichard Wilford\nBBC Radio WM sports editor\nNew ownership has brought fresh optimism to St Andrew’s, with American Tom Wagner and his Knighthead group in control – and now the added excitement of a global superstar like Tom Brady, the NFL’s GOAT, getting on board too.\nThe lingering stadium repairs are also close to completion. Full capacity is set to be restored by the end of November, a factor that could be a significant boost to Blues’ home form.\nTechnical director Craig Gardner has again operated within a tight budget to replenish the squad, with the excesses of the previous owners still being felt when it comes to Financial Fair Play.\nFull-backs Ethan Laird and Lee Buchanan feel like an upgrade and the permanent signing of loanees Dion Sanderson and Krystian Bielik give John Eustace’s side a solid spine, while Tyler Roberts and Siriki Dembele add to the attacking threat.\nJapanese attacking midfielder Koji Miyoshi is something of a wildcard, while talented teenager George Hall had a breakout season last time out and could just be the most gifted player in the group.\nExpectations may need to be calmed initially. Another season of Championship safety remains the main on-field priority while all the off-field adjustments are made to rejuvenate the club and re-engage supporters.\nYou can hear live commentary on Birmingham City throughout the season on BBC Radio WM on 95.6FM and DAB.\nBlackburn Rovers - Tomasson's concern seeping through to fans\nChampionship (2022-23: 7th)\nAndy Bayes\nBBC Radio Lancashire sports editor\nA summer with high-profile departures and a head coach stating that the \"project has changed\" has left Rovers supporters concerned about the upcoming season.\nA lack of goals plus some very late lapses saw them miss out on the play-offs on goal difference last season and it’s hard to see them being as close again, unless they’re able to further strengthen their squad - which has seen two arrive on a free and one on loan.\nSam Gallagher and Sam Szmodics will carry a large burden in terms of goals and much will be expected of exciting talent Adam Wharton, who had a terrific breakthrough season last time around.\nJoe Rankin-Costello and Dom Hyam were big performers last season too, and a repeat of their level is needed again.\nBristol City - 'Plenty of positives - even without Scott'\nChampionship (2022-23: 14th)\nRichard Hoskin\nBBC Radio Bristol sports editor\nWhisper it quietly, but I sense Bristol City fans are generally positive about their prospects this season.\nSince switching to a 4-3-3 formation at the start of January results and performances have been encouraging, and it’ll be a surprise if Nigel Pearson’s side don’t improve on last season’s 14th-placed finish.\nAt the time of writing – the future of Alex Scott remains uncertain. With him in their side, Bristol City have an EFL gem. Without him – there’s still plenty to be positive about.\nFrom numerous attacking options provided by the likes of Tommy Conway, Mark Sykes, Nahki Wells, Andi Weimann and Sam Bell – to a stronger defence with summer signings Haydon Roberts, Ross McCrorie and Rob Dickie.\nYou can listen to ‘Sound of the City’ – every Monday on BBC Radio Bristol at 6pm.\nCardiff City - Ramsey heads eye-catching signings\nChampionship (2022-23: 21st)\nDafydd Pritchard\nBBC Sport Wales\nThe more things change at Cardiff, the more they stay the same. A new season means another new manager and another new era.\nAfter a wretched 2022-23 campaign, in which three bosses came and went as the Bluebirds narrowly avoided relegation, Erol Bulut is the latest man to take the reins.\nThe former Turkey Under-21 international may not be a household name, having never coached outside his homeland, but, having worked at Fenerbahce among others, Bulut boasts considerable managerial experience.\nAlthough a transfer embargo means Cardiff cannot pay fees for players, the club have made some shrewd free and loan signings such as Yakou Meite, Josh Bowler and Karlan Grant.\nAnd in returning Wales captain Aaron Ramsey, they have one of the most eye-catching acquisitions in Championship history.\nMaking any prediction in this division runs the risk of making you look foolish but, with their transfer dealings and Bulut's appointment in mind, it would seem fair to expect that Cardiff will improve on last season's dismal display.\nListen to coverage of Cardiff City across the BBC on Radio Wales, Radio Cymru, online and on Sounds.\nCoventry City - 'Don't expect too much too soon'\nChampionship (2022-23: 5th)\nSteve Ogrizovic\nBBC CWR pundit and ex-Coventry goalkeeper\nLast season was brilliant, full of excitement and expectation right up until the last penalty kick, but having lost Viktor Gyokeres and formed a completely new defence, don’t expect too much too soon.\nThey’ll need time to gel and get used to the exciting brand of football Mark Robins produces so, while I don’t expect a rapid start, I do think they’ll get better as the season goes.\nIt’s difficult to tell who’ll be key, but I’m excited by the new signings and the club has been clever to shop in undervalued markets. The question people have is whether they can keep hold of Gustavo Hamer - I’m keeping my fingers crossed but, with only a year left on his contract, he may have to leave.\nOverall, we’d love promotion but don’t expect them to go one better just because of Wembley, the league is tougher, but with a few more signings possibly on the way they’ve got potential.\nHuddersfield Town - Can Warnock bring more magic?\nChampionship (2022-23: 18th)\nPaul Ogden\nBBC Radio Leeds' Huddersfield commentator\nAt Huddersfield Town, Mr Fixit - Neil Warnock - is back for more, starting the season much earlier than usual by his recent standards, and few fans are complaining.\nWarnock has created his own personal brand of steering relegation-bound teams to safety from February until May, and The Terriers were the latest beneficiaries of his motivational skills last season.\nJob done, and apparently heading for a summer of cycling, fishing, and family, the 72-year-old was persuaded to circle back to Huddersfield by the clearly-impressed new owner, American Kevin Nagle. The final phase of Nagle's takeover ran parallel to the team's great escape last season - fans' relief at both events is still driving anticipation for the new season.\nPlayer recruitment has been low-key but notably Josh Koroma and Josh Ruffels, re-inspired by The Warnock Spring, have decided to stay on with fresh deals. Wales international Sorba Thomas, exiled on loan at Blackburn during the crucial survival period, has returned, and might yet be rejuvenated at Huddersfield by the \"uncle-boss\" his old team-mates have grown to love.\nWarnock has been branding his return \"just one more season\", but why pretend to know what he's really thinking behind the avuncular smile?\nAt least half of his opposing managers failed to read him last term, when he engineered seven wins and four draws out of his 15-match salvage operation.\nHowever this season turns out, Terriers fans can be expected to savour every single Championship fixture - without Warnock, there wouldn’t be any taking place in Huddersfield.\nHull City - 'A season too soon for play-offs?'\nChampionship (2022-23: 15th)\nMike White\nBBC Radio Humberside sports editor\nIt's difficult to nail down exactly what Liam Rosenior’s first full season in charge of the Tigers will look like.\nHe tightened them up defensively last season and the nucleus of the squad looks decent, but needs further additions.\nHowever, ‘where are the goals coming from?’ will be the question of choice. Can Oscar Estupinan match or improve on his tally of 13 from his first year in English football?\nRosenior’s preferred style of play has sometimes left those watching feel nervous, and it's not been without its sticky spots, but he remains steadfast that with the right players and continued hard work it will reap rewards.\nThe key man could be Turkey international midfielder Ozan Tufan, who has the ability to play a big part this season if he can find consistency in his performances.\nPlay-offs will obviously be the hope but it might be a season too soon. An improved top-half finish might be more realistic in an often unpredictable league.\nBBC Radio Humberside will have full commentary of every Hull City game this season. Pre & post-match coverage also available online.\nListen to EFL special 606\n#bbcefl\nWith the Premier League not returning until next weekend, there is room for a special EFL-themed 606 phone-in on BBC Radio 5 Live from 18:00 BST on Saturday.\nHost Aaron Paul and former Reading and Leyton Orient winger Jobi McAnuff will be taking your calls after the first round of Saturday games, with emotions bound to be running high.\nYou'll be able to phone 08085 909693 free from mobiles and landlines, or text 85058 at your standard message rate - this will be the link to listen in.\nTeam news\nSheff Wed v Southampton (20:00 BST)\nWe're less than an hour away from the start of the new EFL season at Hillsbrough, and the line-ups are out.\nXisco Munoz sticks with the core of last season's promotion-winning Sheffield Wednesday side, with Barry Bannan, Josh Windass and Lee Gregory providing threat going forward.\nChile international full-back Juan Delgado makes his debut.\nThe standout Southampton news is that captain James Ward-Prowse starts. The England midfielder has been linked with a move back to the Premier League but wears the armband.\nFull-back Ryan Manning is the only new face in a starting XI which includes Kyle Walker-Peters and Nathan Tella - Romeo Lavia, who's been heavily linked with Liverpool, is on the bench.\nSheff Wed: Dawson, Paterson, Iorfa, Ihiekwe, Famewo, Delgado, Bakinson, Vaulks, Bannan, Windass, Gregory.\nSouthampton: Bazunu, Walker-Peters, Bednarek, Stephens, Manning, Smallbone, Ward-Prowse, Alcaraz, Edozie, Tella, Armstrong.\nIpswich Town - 'Serious momentum' for Tractor Boys\nChampionship (2022-23: 2nd in League One)\nBrenner Woolley\nBBC Radio Suffolk's Ipswich commentator\nAfter four years in League One Ipswich return to the second tier with serious momentum and a fair proportion of their fans believing they can mount a challenge for back-to-back promotions.\nHaving ended last season on a 19-game unbeaten run, Town have strengthened over the summer with the permanent signings of Peterborough midfielder Jack Taylor and Leicester striker George Hirst, while Chelsea attacker Omari Hutchinson looks an exciting loan addition.\nThere’ll undoubtedly be more new faces before the transfer window closes, with the club’s financial situation significantly healthier than it was when they were relegated.\nAlthough boss Kieran McKenna’s a rookie when it comes to Championship football, he’s barely put a foot wrong since arriving from Manchester United.\nAs well as bringing his Premier League methods and standards to Suffolk he’s also helped generate a terrific spirit within the squad – all factors which should serve them very well again.\nBBC Radio Suffolk will have full match commentary of every Ipswich Town game - starting with Sunday's trip to Sunderland.\nLeeds United - 'Many feel another striker a must'\nChampionship (2022-23: 19th in Premier League)\nJonny Buchan\nBBC Radio Leeds sports editor\nPromotion back to the Premier League is the aim and expectation, but not everyone is convinced that is possible just yet. The summer has seen five first-team regulars from last season head out on loan, and just two new arrivals. Ethan Ampadu has been deployed in midfield since arriving from Chelsea and goalkeeper Karl Darlow has been brought in to push, or maybe even replace, Illan Meslier.\nOne of the most exciting prospects for the season ahead is the rise of midfielder Archie Gray (great-nephew to club legend Eddie Gray). The 17-year-old has featured heavily in pre-season and will be an exciting watch in the Championship.\nThere is a lot of attacking threat out wide but the final game of the summer schedule saw both Patrick Bamford and Georginio Rutter pick up injuries, threatening to keep them out of the season-opener against Cardiff. Many feel another striker is a must if the Whites are to be title contenders.\nYou can hear full match commentary of every single game on BBC Radio Leeds and remember to subscribe to our Leeds United podcast ‘Don’t Go To Bed Just Yet’ on BBC Sounds.\nNew laws to cause 'chaos' in EFL, says QPR boss\n#bbcefl\nNew laws introduced for the 2023-24 season will cause \"chaos\", according to QPR manager Gareth Ainsworth.\nThe EFL will use a more \"accurate\" way to calculate added-on time during matches.\nMeanwhile, injured players who leave the field for treatment will have to wait at least 30 seconds before being allowed back onto the pitch.\n\"People who have probably never played the game have made some of these rules,\" Ainsworth told BBC Sport.\n\"I've really challenged some of them.\n\"We were the kings of time management at Wycombe. God knows what they will put on, but let's suck it and see.\n\"I think that there will be some in-season reviews on some of these rules. I really do, because I can't see them working.\"\nFootball's law makers - the International Football Association Board (Ifab) - announced its wish to \"create fairer conditions for both teams in terms of the amount of time available in a match\" at the start of the year.\nThose guidelines have formed the basis for the EFL's initiative to add the exact time taken to deal with goals, substitutions, injuries, penalties and sendings-off, as well as implement a multi-ball system.\nLeicester City - 'Turning point in club's path'\nChampionship (2022-23: 18th in Premier League)\nOwynn Palmer-Atkin\nLeicester City correspondent for BBC Radio Leicester\nFor the first time in nearly a decade, a season back in English football’s second tier dawns on the Foxes. The triumphs of Premier League title glory, FA Cup-winning screamers and adventures across Europe are not parts of history that can be relied on in the Championship.\nThe Foxes have taken a risk and the new man in the dugout, Enzo Maresca, takes the helm on what feels like a turning point in the club's path. The Italian has learnt from the best, working under Pep Guardiola as assistant manager at Manchester City last campaign - and he’s tasked with guiding the Foxes back into the top flight at the first time of asking.\nThe sales of James Maddison and Harvey Barnes for combined fees of £78m has given the club vital cash to reinvest into a squad in desperate need of an injection of fresh energy and ideas. They have reinvested well so far, but there’s still a number of positions in need of attention.\nThe first M69 derby in more than 10 years, against Coventry City, kicks off the campaign on Sunday, on home turf at the King Power Stadium.\nMiddlesbrough - Akpom could hold key to another promotion push\nChampionship (2022-23: 4th)\nMark Drury\nBBC Tees' Middlesbrough commentator\nHopes are once again high at Middlesbrough after last season’s near miss in the play-offs.\nThe drastic turnaround in form, engineered by managerial rookie Michael Carrick (from relegation strugglers on arrival in October to promotion contenders), has Boro fans licking their lips at the thought of what he may be able to do with a whole season’s worth of games.\nThere are issues to sort though. Boro were prolific scorers under Carrick but Cameron Archer, Aaron Ramsey and assist king Ryan Giles have returned to their parent clubs, while Championship top scorer Chuba Akpom is entering the final year of his contract - with a new deal yet to be agreed.\nWill he still be in Middlesbrough red come September and, if so, can he replicate his astounding goalscoring feat of last season?\nIf the answer to both those questions is 'yes' then another promotion push could be on the cards.\nBBC Radio Tees Sport brings you commentary of every Boro game on 95FM and Freeview channel 722.\nMillwall - 'Den can produce magical moments'\nChampionship (2022-23: 8th)\nAaron Paul\nHost of BBC Radio 5 Live's 72+ podcast\nA new season, but a whole lot of change.\nThe passing of owner John Berylson came as a huge shock to the Millwall family. A man who poured his heart, soul and generosity into a corner of South London, his presence will be sorely missed. But his legacy will remain, with his son James at the helm - assisted by the erudite Steve Kavanagh - the Lions move forward in safe hands in the boardroom.\nOn the pitch however, questions remain. Gary Rowett’s side were creators of their own downfall last season. A lack of goals, plus a disappointing January transfer window, saw the Lions crash out of the play-off picture as they finished the season with two wins from their last eight games. Questions were inevitably asked of the future of the manager. However Rowett looks refreshed, and there are some new faces in at the Den.\nJoe Bryan adds quality at full-back, whilst Wes Harding offers EFL experience and versatility across the pitch. A bonafide finisher was always needed and Kevin Nisbett’s goals could also be crucial to where Millwall finish. Romain Esse is one of the most gifted prospects to come out of the Millwall academy in recent years, while Aidomo Emakhu will prove a handful if given the opportunity to shine. Zian Flemming has his suitors, and it will be fascinating to see if offers from other clubs continue to be rebuffed. While there is a fear that the youthful exuberance of Charlie Cresswell will be missed in the Lions' backline.\nThe Championship will certainly be a tougher division this season, and so making an accurate prediction as to where Millwall will finish is extremely difficult. What is for certain however is, that on its day, the Den can produce some magical moments.\nListen to BBC Radio 5 Live's 72+ podcast EFL season preview here.\nget involved\nGet Involved - Grand returns and fresh beginnings\nUse #bbcefl, text 81111 (UK only - standard message rates apply) or WhatsApp on 03301231826\nIf you're anything like us you'll have spent every day checking to see which clubs have been making what moves in the EFL since the transfer window opened at the end of last season.\nThat being said, that's quite literally our job so maybe you've been doing other things...\nAs ever it's been an incredibly busy few months for club secretaries and fax machines up and down the land.\nWe'd like to know who you think could prove to be your club's or even your division's best bit of business?\nThink Wales skipper Aaron Ramsey can lead Cardiff to a successful season after his return to his boyhood club or maybe you think Stockport's swoop for former Manchester United forward Nick Powell might just be inspired business.\nYou can get in touch with us using #bbcefl on Twitter, text 81111 (UK only - standard message rates apply) or WhatsApp on 03301231826.\nAnd if you want to refresh your mind before sticking your neck on the line why not check out our bumper transfers pages from the past few months:\nMay\nJune\nJuly\nAugust", "url": "https://www.bbc.com/sport/live/football/66364139"}