{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:40", "date_modify": "2025-05-20 14:02:40", "date_publish": "2023-07-30 14:27:37", "description": "Man Utd: Erik ten Hag - 'Something will change' with Onana", "filename": "sport_articles_c4n33577k14o_1747749760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff22/live/0deb58a0-2ee5-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4n33577k14o_1747749760.html", "title": "'Something will change' with Onana", "title_page": "Man Utd: Erik ten Hag - 'Something will change' with Onana - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Erik ten Hag spoke with the media before his side’s final US tour game against Borussia Dortmund in Las Vegas.\nTen Hag addressed a number of topics, answering questions on Harry Maguire and the lure of Saudi Arabia for several players this summer.\nOn how far he thinks the team has to progress\n\"Last season proved we can beat any opponent and don't have to fear anyone. But it also proved we can't do it on a consistent basis. That is the step we have to make.\nOn replacing David de Gea with Andre Onana\n\"He's a great goalkeeper and has a different profile. That's why we wanted to sign him. With him, something will change in our game.\"\nOn whether this is 'his' squad now\n\"I wouldn't call it an Erik ten Hag squad. It's the demands of top football. We either have to find players or increase the levels from those who are already there.\n\"Tours are good for team building, for new players to get the knowledge about the values and standards, on and off the field. It's helpful that the players we have signed are already here, integrating in the team and getting the social connections. Football is a team sport and you need partnerships.\"\nRead more of Ten Hag's answers here", "url": "https://www.bbc.com/sport/articles/c4n33577k14o"}