{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:48", "date_modify": "2025-05-21 08:00:48", "date_publish": "2025-01-03 15:44:21", "description": "Hibs fan views on draw at 10-man St Johnstone", "filename": "sport_articles_cx2nzepg28ko_1747814448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28e3/live/0ab829f0-c9e5-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2nzepg28ko_1747814448.html", "title": "Hibs fan views on draw at 10-man St Johnstone", "title_page": "Hibs fan views on draw at 10-man St Johnstone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Hibernian's 1-1 draw with 10-man St Johnstone in Perth.\nHere's what some of you said:\nWilliam: The result basically highlighted our weaknesses at both ends of the park. Rocky Bushiri is still a bombscare, we would have had three clean sheets in a row. Junior Hoilett up front with Martin Boyle is not really working. Nectar Triantis' yellow cards are mounting up. Hopefully Rangers will make a few changes to give us hope.\nScott: Poor result against the bottom side after a reasonable run of positive results, definitely two points dropped. Next up the real litmus test against one of the Old Firm. Still not convinced this is a decent squad and hope we strengthen during the transfer window and get shot of the dross.\nMark: Another poor result, more vital points dropped. David Gray's tactics are too negative, making it hard to break teams down and finish them off. Hopefully his tactics will change if we get better players in this window. Hibs need to get their signings in early, though, rather than the usual last-minute English lower-league loans who almost always flop.\nMartin: Can't be too critical. Look where we were only a few weeks ago. St Johnstone are fighting for points, a point away is good considering we were one down, three points became harder when they went to 10 men as they went full defence and we lack the quality to unlock that.\nTom: Two points dropped against 10 but probably a good draw away against a side who have been our bogey team over the years. The last five games we have been much better, so let's take it up to Rangers in the next game.", "url": "https://www.bbc.com/sport/articles/cx2nzepg28ko"}