{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:37:26", "date_modify": "2025-05-19 15:37:26", "date_publish": "2017-08-21 12:37:10", "description": "Carl Frampton confirms his partnership with manager Barry McGuigan and Cyclone Promotions has come to an end.", "filename": "sport_boxing_41002445_1747669046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2A80/production/_97408801_pe_00662259.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_41002445_1747669046.html", "title": "Carl Frampton confirms split from manager Barry McGuigan", "title_page": "Carl Frampton confirms split from manager Barry McGuigan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Irish boxer Carl Frampton has confirmed his long-standing partnership with manager Barry McGuigan's Cyclone Promotions has come to an end.\nFrampton has been managed by McGuigan since turning professional in 2009, winning world titles at two weights.\nThe 30-year-old said he was \"confident now is the right time to move forward and take my career into my own hands\".\nFrampton was scheduled to fight Mexican Andres Gutierrez on 29 July but the contest was postponed at the 11th hour.\nThe Belfast man was one pound overweight but his first bout since his defeat by Leo Santa Cruz last January was still scheduled to go ahead until his Mexican opponent was injured after slipping in the shower.\nFrampton and McGuigan, a former world featherweight champion, both apologised to the public, but behind the scenes it is understood their relationship was beginning to unravel.\nLess than 10 days before Frampton's scheduled contest with Gutierrez, the Belfast boxer had resigned as a director of Cyclone Promotions.\n\"I would like to thank Barry, the McGuigan family and Cyclone Promotions for our time together,\" read Frampton's statement on Monday.\n\"I still believe that I'm the best featherweight in the world and I promise my fans that I am continuing with my efforts to get my homecoming fight rescheduled in the very near future.\"\nCyclone Promotions have confirmed that they will not be making any statement on Monday about Frampton's departure from the fold.", "url": "https://www.bbc.com/sport/boxing/41002445"}