{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:37:52", "date_modify": "2025-05-20 14:37:52", "date_publish": "2023-07-28 14:05:43", "description": "Ukrainian fencer Olga Kharlan is handed a spot in the Olympics and has her World Championships ban lifted following her refusal to shake hands with Russian Anna Smirnova.", "filename": "sport_fencing_66339461_1747751872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8973/production/_130578153_gettyimages-1556779634.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_fencing_66339461_1747751872.html", "title": "Russia-Ukraine conflict: Fencer Olga Kharlan ban lifted as she is handed Olympic spot", "title_page": "Russia-Ukraine conflict: Fencer Olga Kharlan ban lifted as she is handed Olympic spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ukrainian fencer Olga Kharlan has been handed a spot in the Olympics and had her World Championships ban lifted following her refusal to shake hands with Russian Anna Smirnova.\nShe was disqualified after offering her sabre to tap blades instead of shaking hands following her 15-7 win in Milan.\nInternational Olympic Committee president Thomas Bach wrote a letter to Kharlan saying the body would \"allocate an additional quota place\" to her if she could not qualify because of her \"unique situation\".\nMeanwhile, the International Fencing Federation reinstated Kharlan at the championships, which will allow her to take part in the team competition.\nBefore the two announcements, Kharlan said: \"Today is kind of better because of all the support that I have.\n\"Rules must be changed. For Ukrainians, during this war we just can't do handshakes, and you have to change, and you have to have some respect for us.\n\"When I have a choice... where I shake hands I will never shake hands with her. I'm sorry but there is something bigger than Olympic Games or license or fencing and finally I understood that, there is something more. The support for the Ukrainian people, it's incredible.\"\nBefore the IOC's decision, the president of Russia's Olympic Committee said the body had \"picked a side\" in the Russia-Ukraine dispute.\nThat was because the IOC had responded to Kharlan's initial suspension by encouraging sports federations to handle Ukrainian athletes with sensitivity.\nBut Stanislav Pozdnyakov said the IOC advice \"clearly showed duplicity\".\n\"The statement in question indicates that the IOC determined for itself and picked a side in the political conflict, [and] began to act in the interests of this side,\" he said on Telegram.\nAfter Russia launched a full-scale invasion of Ukraine, the IOC imposed sporting sanctions on Russia and its ally Belarus but earlier this year recommended that Russian and Belarusian athletes could compete as individuals under a neutral flag and with no anthem.\nKharlan became the first fencer to face a Russian or Belarusian since the invasion.\nAfter the snub, Smirnova staged a 45-minute sit-down protest, resulting in Kharlan, a four-time individual world champion and four-time Olympic medallist, being shown a black card.\nThat ruled her out of the women's sabre individual event and it appeared she would miss the team competition as well before the federation lifted her suspension.", "url": "https://www.bbc.com/sport/fencing/66339461"}