{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-04-26 04:25:47", "date_modify": "2025-04-26 04:25:47", "date_publish": "2025-03-03 12:00:03", "description": "Alan Sheehan says he would be \"interested in having a conversation\" about becoming Swansea City boss on a long-term basis having been asked to lead the club for at least four more games.", "filename": "sport_football_articles_cx2eqlgn743o_1745641547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3260/live/2c4ab570-f815-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2eqlgn743o_1745641547.html", "title": "Alan Sheehan: Swansea City caretaker 'interested in conversation' over job", "title_page": "Alan Sheehan: Swansea City caretaker 'interested in conversation' over job  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alan Sheehan says he would be \"interested in having a conversation\" about becoming Swansea City boss on a long-term basis having been asked to lead the club for at least four more games.\nSheehan has been Swansea's caretaker head coach since Luke Williams left the Championship club a fortnight ago.\nSheehan says he has now been told by director of football Richard Montague that he will remain at the helm until at least the March international break.\nThat means the Irishman will take charge of Tuesday's fixture at Preston North End as well as Saturday's home game against Middlesbrough, the trip to Watford on 12 March and Burnley's visit to south Wales three days later.\n\"It's a really tough period. We have got to find that consistent place where we know what we are going to get,\" Sheehan said.\n\"Then in the international break we will reassess and see where we are at.\"\nSheehan says it would be \"silly\" for Swansea to rush a decision over Williams' permanent successor.\nWilliams' 13-month reign came to an end after a run of seven defeats in nine league games left Swansea glancing nervously towards the relegation places.\nAn emphatic victory over Blackburn Rovers in Sheehan's one fixture so far has eased pressure before the trip to Preston, with Swansea nine points clear of the drop zone in 16th.\nSwansea are assessing managerial candidates at home and abroad for what Montague called an \"incredibly attractive\" vacancy.\nSheehan has the opportunity to stake a claim for the job – but insists it is not a foregone conclusion that he would accept it.\n\"If they (the club) want me to be that guy and they believe that I am the guy, then we'll have a conversation,\" he said.\n\"I think it's important the football club gets the right person, that they believe and understand that there needs to be changes to be successful. I think everybody's got to be on the same page - there has to be nobody pulling against the current in any way.\"\n\" I think it's important that if we can build that positive energy – and we can do that together – then you have positive conversations.\n\"But it's not just 'do you want it?', 'oh yes please'. We need to know exactly how that looks and then we move on from there, if that makes sense.\"\nSheehan, an assistant head coach at Swansea since the summer of 2023, admitted prior to the Blackburn game that his goal is to become a manager in his own right.\nWhen pushed on whether he wants the chance to continue at Swansea, he added: \"I'd be interested definitely in having a conversation. But you need to speak to them and see how it looks, to be on the same wavelength.\n\"This is how so many things can break down. We have to be on the same page, everybody, in how we want to do things and what way we want to do it.\n\"We have four games. If this goes well, then we'll have a conversation. But I'd imagine they'll be having conversations with a lot of potential managers.\n\"They have just got to make sure they find the right match for this football club to move it forward.\"\nHaving been relegated from the Premier League in 2018, Swansea made the Championship play-offs in 2020 and 2021.\nSince then, they have had finishes of 15th, 10th and 14th in the second tier.\nSheehan believes Swansea's next managerial appointment must be part of a rebuilding process if the club are to re-establish themselves as promotion contenders.\n\"Get it right, that's all I would say,\" the former Luton and Southampton coach added.\n\"Let's do it right now and however that looks, whoever it is, the club has got to start building to be successful, to start laying foundations for where it should be and where it needs to be, because there are a good few levels in the Championship.\n\"It's important you get to a place where you are a top-10 team, then a play-off-challenging team, because then you have a couple of teams like last year and this year who are potentially in a league of their own.\n\"That's where we need to go and as long as we are on the same page, everything is good.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2eqlgn743o"}