{"authors": ["Ciaran Varley", "www.facebook.com"], "date_download": "2025-04-26 07:59:54", "date_modify": "2025-04-26 07:59:54", "date_publish": "2025-02-25 11:11:44", "description": "Burnley have kept 12 consecutive clean sheets in the Championship since they last conceded a goal on 21 December. Here are a list of six things that have happened in that time.", "filename": "sport_football_articles_c5yr7mpxzpvo_1745654394.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76dd/live/1899b790-f35d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5yr7mpxzpvo_1745654394.html", "title": "Burnley: Six things that have happened since Clarets last conceded a Championship goal", "title_page": "Burnley: Six things that have happened since Clarets last conceded a Championship goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Since Burnley last conceded a league goal, eight Championship clubs have changed managers, Manchester United have conceded 18 Premier League goals and the US has a new President.\nThe Clarets haven't been breached in the Championship since the 80th minute of a 2-1 win over Watford on 21 December. The promotion-chasing club's 4-0 win over Sheffield Wednesday on Friday was the team's 12th consecutive clean sheet in the league and left them third in the table.\nIn the entire history of the Football League since 1888, only one side has had a longer run of league games without conceding in the top four tiers, with Manchester United going 14 in a row during the 2008-09 season.\nThat record is now in sight for Scott Parker's team, who are unbeaten across their past 21 league games (W12 D9), the club's longest run since a 22-match run between November 2022 and April 2023.\nAcross 34 league games so far this season, the Clarets have conceded only nine goals and the 24 clean sheets kept so far by goalkeeper James Trafford equals the Championship's best by Wolves' John Ruddy and QPR's Paddy Kenny. They haven't conceded a single goal in any competition since beating Reading 3-1 in the FA Cup on 11 January.\nIt is a far cry from the team who were sometimes accused of being naive as they shipped 78 goals in the Premier League last season.\nFor any Championship managers hoping to end Burnley's record, stats from Opta show that six of the nine goals they have conceded have come from open play, with only two coming from crosses. They are also more vulnerable in the first half, with six of their nine goals conceded coming before the break.\nBBC Sport pulled together a list of six things that have happened since Burnley last shipped a league goal.", "url": "https://www.bbc.co.uk/sport/football/articles/c5yr7mpxzpvo"}