{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 07:08:06", "date_modify": "2025-05-21 07:08:06", "date_publish": "2025-03-28 00:00:18", "description": "Chelsea's quadruple dream remains on course after they swept aside Man City in the Women's Champions League - and holders Barcelona await in the semi-finals.", "filename": "sport_football_articles_cpdew546y4eo_1747811286.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/712e/live/91245640-0bb1-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdew546y4eo_1747811286.html", "title": "2): Blues keep quadruple hopes on course", "title_page": "Chelsea 3-0 Man City (agg 3-2):  Blues keep quadruple hopes on course - but face Barcelona next - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona next? \"Bring it on.\"\nThat was the response from Chelsea captain Millie Bright after her side booked a third successive semi-final meeting with the Spanish giants in the Women's Champions League.\nBelief is rife in the Chelsea squad and it was on show in abundance as they swept aside Manchester City in a ruthless display at Stamford Bridge to overturn a first-leg deficit.\nSonia Bompastor's side had work to do having come away from Manchester trailing 2-0 in the tie - but one thing this Chelsea side know how to do is win.\n\"We were never in doubt. We had full confidence in ourselves. We could have had way more than three goals,\" said Bright.\n\"[We have an] unbelievable mentality and desire to come back. It was a true Chelsea performance.\n\"We are a new team, we are on a new journey, we are in a new era. Bring it on.\"\nChelsea's hunt for European glory has been halted by Barcelona in successive seasons - but this year the Blues have an added incentive.\nA quadruple is on the cards with Chelsea having already won the Women's League Cup, while they are eight points clear at the top of the Women's Super League and into the Women's FA Cup semi-finals.\n\"The quadruple mentality is back on,\" former Chelsea midfielder Karen Carney said on TNT Sports.\n\"They are not stopping, they are a train and when they are on it, you can't stop them. They will be thinking 'we want that quadruple and we are not going to stop'.\"\nBompastor says she is not allowing herself to think about a four-trophy haul, but Chelsea's ambitions are clear - and the way they dispatched City on Thursday suggests they are up to the challenge.\n\"We had all the belief coming into this game that we were capable of turning it around,\" Bright told BBC Sport.\n\"We were fully confident and [knew we] just needed to be ruthless. It was a true Chelsea performance. The fans were incredible.\n\"It's all about the mentality and belief and everyone stepping up and delivering.\"\nChelsea were far superior in every department, with Sandy Baltimore, Nathalie Bjorn and Mayra Ramirez on the scoresheet in an explosive first-half display.\nThey pressed City intensely and finished clinically to take an aggregate lead, but could have added more to their tally with Bjorn and Erin Cuthbert hitting the woodwork, while Johanna Rytting Kaneryd and Ramirez missed further chances.\n\"This is the Chelsea we know, this is the Chelsea that just get it done. It was about energy, hunger, desire,\" said former Blues striker Eni Aluko.\n\"The quadruple is important, but the Champions League is the one that has eluded them.\n\"Even if they don't do the quadruple, if they win the Champions League, that will be the one the players have tried to do for years.\n\"The owners brought Bompastor in because she has done it.\"", "url": "https://www.bbc.com/sport/football/articles/cpdew546y4eo"}