{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:21", "date_modify": "2025-05-21 07:49:21", "date_publish": "2024-12-23 16:10:26", "description": "Hull City boss Ruben Selles says he was \"hard\" on his side during half-time on Saturday in the Tigers' 2-1 victory over Swansea.", "filename": "sport_football_articles_cwydpvl052ko_1747813761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/603e/live/f4e0a1b0-c13e-11ef-a8c2-37ad53d91ed7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwydpvl052ko_1747813761.html", "title": "Ruben Selles: Hull City boss reveals details of half-time team talk against Swansea", "title_page": "Ruben Selles: Hull City boss reveals details of half-time team talk against Swansea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City boss Ruben Selles has admitted he was \"hard\" on his side during half-time on Saturday in the Tigers' 2-1 victory over Swansea City.\nMason Burstow's goal 10 minutes from time gave Hull their first win in 13 matches and lifted Selles' new side out of the relegation zone.\n\"I think I was pretty hard on them, but we are learning to cope with each other and the way we navigate through situations,\" Selles told BBC Radio Humberside ahead of Hull's Boxing Day fixture at Preston North End.\n\"But they know now that there are some non-negotiables that we need to do and we need to do no matter what is the score, we need to be ourselves - that is the most important thing for me.\"\nThe 41-year-old also hinted that the Tigers would be looking to sign a new midfielder in January after Kasey Palmer limped off during Hull's defeat at Coventry on 14 December with an injury which looks likely to keep him out for the foreseeable future.\n\"When we know what we are looking for, if it is going to be more than six weeks, I think that can be something to consider in the market, yes,\" Selles added.", "url": "https://www.bbc.com/sport/football/articles/cwydpvl052ko"}