{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-04-26 06:39:50", "date_modify": "2025-04-26 06:39:50", "date_publish": "2025-03-02 15:36:56", "description": "Hibs 2-1 Hearts: Analysis", "filename": "sport_articles_c7573lvx159o_1745649590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16c2/live/130fe970-f77c-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c7573lvx159o_1745649590.html", "title": "Hibs 2-1 Hearts: Analysis", "title_page": "Hibs 2-1 Hearts: Analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hearts will understandably be down after losing their second derby match of the season, but when head coach Neil Critchley reflects on the performance, he will find some positives.\nThe way they responded to going a goal behind showed excellent character and Grant's technique for the equaliser was superb.\nElton Kabangu again looked a threat with his pace and movement up front and was only denied an eighth Hearts goal by the offside flag.\nHowever, the way their levels dropped in the second half was alarming.\nHearts had just three shots, none of them on target, and never truly threatened Jordan Smith in the Hibs goal. The calm build-up play and intricate passing that was on show at times in the opening 45 was nowhere to be seen.\nShankland was beaten to the ball for Iredale's winner and there will also be questions asked about Boyle's opening goal.\nOne long ball unpicked the entire defence. Taylor was eased off the ball far too easily and Gordon was rooted to his line. The ball was inside the Scotland goalkeeper's six-yard box by the time Boyle came to shoot - and yet he stayed put.\nYes, Taylor must be stronger, but Gordon must also be more decisive.\nStill, Hearts have lost only two of their past 12 matches in all competitions and remain in the mix for a top-six spot.\nAttentions now turn to the cup and Dundee's visit to Tynecastle on Friday.", "url": "https://www.bbc.co.uk/sport/articles/c7573lvx159o"}