{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:39:16", "date_modify": "2025-05-21 05:39:16", "date_publish": "2025-01-14 12:07:11", "description": "Arsenal manager Mikel Arteta says the online abuse of striker Kai Havertz and his wife has \"terrible consequences\" and needs to be \"eradicated from the game\".", "filename": "sport_football_articles_c1dgp6ey7p7o_1747805956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6b0b/live/7991ef10-d26d-11ef-8926-89a9332957ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1dgp6ey7p7o_1747805956.html", "title": "Kai Havertz abuse has terrible consequences", "title_page": "Kai Havertz abuse has terrible consequences - Mikel Arteta  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal manager Mikel Arteta says the online abuse of striker Kai Havertz and his wife has \"terrible consequences\" and needs to be \"eradicated from the game\".\nHavertz was criticised for his performance in Sunday's FA Cup defeat by Manchester United, after he missed a glorious chance to win the game in normal time and then had his penalty saved in the shootout as United won 5-3 on penalties following the 1-1 draw.\nThe German's wife Sophia shared screenshots of the \"shocking\" abuse she received on social media amid the game, including threats to the couple's unborn child.\nArsenal have reported the abuse to the police and are working with a specialist data firm to identify the culprits, but Arteta says more must be done as he spoke before Wednesday's north London derby against Tottenham.\n\"It's incredible, honestly,\" he said. \"We really have to do something about it, because accepting that and hiding this has terrible consequences.\n\"It's something we have to eradicate from the game because it's so cynical and dependent to a result of an action.\n\"There is no other industry like this. When we played Ipswich on December 27, we won 1-0 and Kai Havertz scored. The whole stadium after that is singing the 'Waka, Waka' (his chant). That was 20 days ago. Where is the perspective?\n\"We are all responsible. That's a really serious matter. It affects me. It affects him and everybody that is in the industry.\n\"We can accept it and say 'that's our job', but there are certain limits and the line has to be drawn. We put a lot of attention on technology and what is next in football.\n\"What is next in football is that this should be prohibited. It cannot happen. That's it.\"\nMeta, who own Instagram, removed the content for violating its policies.", "url": "https://www.bbc.com/sport/football/articles/c1dgp6ey7p7o"}