{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:12", "date_modify": "2025-05-21 03:59:12", "date_publish": "2025-04-07 07:40:30", "description": "Greg Taylor: 'Rangers keen on Celtic's exiting Scotland left-back' - gossip", "filename": "sport_articles_cr4n20lgq6go_1747799952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6003/live/7ca50b40-1383-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr4n20lgq6go_1747799952.html", "title": "Greg Taylor: 'Rangers keen on Celtic's exiting Scotland left-back'", "title_page": "Greg Taylor: 'Rangers keen on Celtic's exiting Scotland left-back' - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers hope to persuade Greg Taylor to switch from Celtic this summer, but with Dinamo Zagreb, who failed in a January bid, still keen and Major League Soccer clubs also interested, the 27-year-old Scotland left-back will assess all other options before even considering such a controversial move. (Football Insider), external\nAgent Bill McMurdo says there is a possibility Lewis Ferguson will continue playing in Serie A with a club other than Bologna next season and believes that the 25-year-old Scotland midfielder would have joined Napoli last year had he not got injured. (Telecapri via Tutto Mercato), external\nLewis Ferguson's agent, Bill McMurdo, does not know if Napoli are still interested in the Scotland midfielder but says the Bologna 25-year-old would be interested in playing for Napoli. (The Herald), external\nA mistake that led to a goal in Sunday's defeat by Fulham has renewed calls for Liverpool to find a left-back to replace 31-year-old Scotland captain Andy Robertson, with the Premier League leaders well placed to sign Bournemouth's Milos Kerkez this summer. (TeamTalk), external\nBournemouth will demand £40m for 21-year-old Hungary left-back Milos Kerkez, who is on Liverpool's radar along with £50m-rated 27-year-old Fulham and United States defender Antonee Robinson despite Scotland captain Andy Robertson insisting he will not be leaving the Anfield club. (Mirror), external", "url": "https://www.bbc.com/sport/articles/cr4n20lgq6go"}