{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-20 13:45:04", "date_modify": "2025-05-20 13:45:04", "date_publish": "2023-07-26 06:27:52", "description": "Wrexham beat 10-man Manchester United 3-1 but the newly-promoted League Two club's victory is overshadowed by a punctured lung suffered by talisman Paul Mullin.", "filename": "sport_football_66309735_1747748704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1893/production/_130519260_gettyimages-1555312309.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66309735_1747748704.html", "title": "Manchester United 1-3 Wrexham: League Two side earn win but talisman Paul Mullin suffers punctured lung", "title_page": "Manchester United 1-3 Wrexham: League Two side earn win but talisman Paul Mullin suffers punctured lung - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham beat 10-man Manchester United 3-1 but the newly promoted League Two club's victory was overshadowed by an injury to talisman Paul Mullin.\nMullin, 28, suffered a punctured lung in a collision with goalkeeper Nathan Bishop, part of a United side mostly comprised of Under-21 players.\nBoss Phil Parkinson subsequently warned Bishop to \"steer clear\" of Wrexham following the \"reckless\" challenge.\nGoals from Elliot Lee, Aaron Hayden and Sam Dalby sealed Wrexham's victory.\nSpanish 19-year-old Marc Jurado scored in first-half injury time for United, who had Dan Gore, 18, sent-off shortly after the restart.\nRyan Reynolds was unable to attend but Wrexham co-owner Rob McElhenney was present to see his side earned a memorable win in front of a sold-out 34,248 crowd at Snapdragon Stadium in California.\nUnited boss Erik ten Hag, whose senior players have travelled on to Texas before tomorrow's match against Real Madrid, watched his youthful side's performance from the bench.\nThe Premier League club's starting line-up also featured the experienced Jonny Evans, who has returned on a short-term deal after leaving Leicester City at the end of last season.\nMullin required lengthy treatment before walking off the field with an oxygen mask around his neck early in the first half.\nManager Parkinson expressed his anger after the match: \"It is a real blow for us, you can't hide away from that. I thought it was a clumsy challenge from the goalkeeper and it should have been a straight red.\"\nHe added: \"It was a dangerous challenge and Mulls is our talisman. I'm fuming with it, I have to be honest about that. It was a clumsy, reckless challenge in a pre-season game.\n\"I haven't seen the goalie and he's probably best steering clear of us for the time being because we're not very happy.\"\nBishop sent an apology to Mullin on Twitter: \"Just wanted to share my sincerest apologies to Paul Mullin. A complete misjudgement and a genuine accident with no malicious intent at all!\n\"Wishing you the speediest recovery and hope to see you back scoring goals as soon as possible!\"\nLee opened the scoring after 29 minutes and Hayden headed in a second seven minutes later - but Jurado's side-footed finish halved the deficit.\nUnited's Gore was dismissed after receiving a straight red for a tackle on Andy Cannon early in the second half, before Dalby headed in Wrexham's third from close range.", "url": "https://www.bbc.com/sport/football/66309735"}