{"authors": ["Rob Stevens", "www.facebook.com"], "date_download": "2025-05-20 12:25:13", "date_modify": "2025-05-20 12:25:13", "date_publish": "2023-08-04 12:22:30", "description": "Gareth Ainsworth believes he is making progress in improving QPR's fortunes after joining a \"crazy\" Championship club in February.", "filename": "sport_football_66401076_1747743913.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12876/production/_130649857_gettyimages-1486327814.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66401076_1747743913.html", "title": "Gareth Ainsworth: QPR situation was 'crazy' after joining from Wycombe", "title_page": "Gareth Ainsworth: QPR situation was 'crazy' after joining from Wycombe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "QPR manager Gareth Ainsworth believes he is making progress in improving the fortunes of the Championship club.\nThe 50-year-old only won three of 13 games in charge after his appointment in February as the R's finished six points clear of the relegation zone.\n\"The club was lower morale-wise and more chaotic than I could believe when I walked in,\" he told BBC Sport.\n\"I didn't expect it to be quite as crazy. But we've addressed a lot of that and it is slowly turning around.\"\nAinsworth lost six of his first seven games after moving from Wycombe Wanderers into the Loftus Road dugout, but two wins from their final three games ensured a place in the second tier after both Reading and Wigan Athletic were deducted points.\n\"The last quarter of the season was very, very tough and I was frazzled at the end of the year,\" he said.\n\"For the first time in football management I thought 'I need this summer', and I am usually the biggest energiser.\n\"It was a big wake-up call for me, for QPR, what we need, what the club is and the state of the place. I wanted to change a lot.\"\nThe free-spending days of QPR's spell in the Premier League a decade ago, when the west London club paid £8m for Loic Remy and £12.5m for Christopher Samba, are long gone, with Ainsworth hunting for bargains instead.\nGoalkeeper Seny Dieng and centre-back Rob Dickie have been sold to Middlesbrough and Bristol City respectively, with keeper Asmir Begovic, defender Morgan Fox and midfielder Jack Colback all joining on free transfers,\nThis summer has also seen the departure of Les Ferdinand as director of football, with the former England striker stepping down from the role.\n\"The board have backed me in trying to bring one or two in,\" Ainsworth, who had a seven-year spell as a player at QPR, said.\n\"We can't afford the top, top players and the club has got to adhere to rules.\n\"I thought experience and leadership were lacking last year. I still intend to bring some quality players to the club and that is what is needed.\"\nRangers begin the Championship campaign away to Watford - another former Premier League club going through a transition - on Saturday (15:00 BST).\nAinsworth spent almost a decade and a half in charge at Wycombe and is hoping to build the R's \"in the same vein\" as he did the Chairboys at Adams Park.\n\"It takes a while to get your message across. It took me 10 years at Wycombe, to have it running itself,\" he said.\n\"This will only be my 14th game, at Watford. It's not a lot of games in charge.\n\"I've got belief in my team and what they do, but it is going to have to be different to what it was last season.\"\nAinsworth has concentrated on bolstering his defence given QPR had the second-worst defensive record in the division last season, conceding 71 goals, and only kept two clean sheets during his time at Loftus Road.\n\"We shipped so many goals last year and I had to address that problem. We will need to be more solid and organised on the pitch,\" he said.\n\"If we can just get a little bit of patience and expectation levels tempered a little bit, because we're not the club we were, but we will be again one day. Just give us a chance to build.\"\nMany pundits are tipping QPR to be in another relegation battle this season, but Ainsworth is upbeat about his chances of avoiding the drop into the third tier for the first time since 2003-04.\n\"Pundits are not often wrong,\" Ainsworth conceded.\n\"They were wrong at Wycombe when they put us down for relegation the year we got promoted to the Championship [2019-20].\n\"I'm not promising that at QPR - no way. It is going to be a tough season as there is a whole array of fantastic teams added to the Championship.\n\"But I am to upset the odds as I have done throughout my life. Hopefully we'll have enough to be a competitive Championship side.\"", "url": "https://www.bbc.com/sport/football/66401076"}