{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-21 03:54:45", "date_modify": "2025-05-21 03:54:45", "date_publish": "2025-02-01 16:48:07", "description": "Player to watch: Jota", "filename": "sport_articles_cx2plpkn5zdo_1747799685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f128/live/41b7a230-e094-11ef-b5a3-1f3f58db284c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2plpkn5zdo_1747799685.html", "title": "Player to watch: Jota", "title_page": "Player to watch: Jota - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is that time of year when debuts are being handed out right, left and centre as signings are made in the final days of the January transfer window.\nOn-loan Lille centre-back Rafael Fernandes will be itching for his Rangers debut after the Portuguese was an unused substitute against Dundee United, who have just signed Allan Campbell from Luton Town, while Victor Lopez has yet to feature for Dundee after his arrival from Queretaro in his native Mexico.\nFellow midfielder and Gambia international Alasana Manneh only joined Hibernian from Odense Boldklub in midweek and is still waiting on a visa, but Heart of Midlothian and St Johnstone both have two new arrivals to consider for selection.\nGiven Craig Halkett's latest injury blow, Michael Steinwender could be handed a quick introduction by Hearts after the Austrian centre-half's arrival from Swedish club Varnamo, while Norwegian Sander Kartum has been brought in from Brann to bolster the midfield.\nSwedish former Halmstad midfielder Jonathan Svedberg and, should he receive a work permit, Latvia defender Daniels Balodis, previously of RFS, will be keen to start their bid to steer Saints off the bottom of the table.\nHowever, it is probably Jota's return to Scottish football that will be most keenly anticipated by neutral observers.\nThe 25-year-old Portuguese lit up the Premiership during his first two seasons with Celtic after arriving from Benfica but was unable to live up to his £25m price tag during a miserable time with both Al-Ittihad and Rennes since leaving Glasgow in summer 2023.\nNow he is back with the Scottish champions, where he will compete with in-form Nicolas Kuhn and Daizen Maeda for a place on the wings as they visit managerless Motherwell, against whom he has scored twice previously, on Sunday.", "url": "https://www.bbc.com/sport/articles/cx2plpkn5zdo"}