{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:43", "date_modify": "2025-05-20 13:47:43", "date_publish": "2023-07-31 13:05:57", "description": "Three-times North West 200 Supersport race winner Davey Todd parts company with the Milenco by Padgett's team.", "filename": "sport_northern-ireland_66363238_1747748863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1139F/production/_130595507_daveytodd3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_northern-ireland_66363238_1747748863.html", "title": "Davey Todd: Yorkshire road racer parts company with Padgett's team", "title_page": "Davey Todd: Yorkshire road racer parts company with Padgett's team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three-times North West 200 Supersport race winner Davey Todd has parted company with the Milenco by Padgett's Honda team after the Armoy road races.\nTodd finished his association with the team by taking three podium finishes at the county Antrim meeting last weekend.\nThe Saltburn rider won the National Superstock 1000cc series with the Batley-based team in 2022.\nThe 27-year-old also secured his first rostrum at the Isle of Man TT last year with Padgett's on a Superstock Honda.\nHis efforts at this year's TT were hampered by illness but the Yorkshireman still managed a best finish of fourth.\nHe also set his fastest ever lap of the Mountain Course at a speed of 132.982mph.\nAmong his other achievements to date are winning the Southern 100 Solo Championship in 2022 and a four-timer at Armoy 12 months ago.\n\"For now anyway, we're going our own separate ways. I've had a fantastic time with the team and loved every second of it, achieved a lot together, becoming 'Stock 1000 champions last year in BSB and having a lot of amazing results along the way,\" commented Todd.\n\"I had great times and great laughs with all the boys, all the team - they're like a family to me. They're an awesome group of guys but we just feel like now's the time to go our separate ways,\" he added.\n\"We have enjoyed working with Davey since 2019, and we are delighted for him to leave the team and pursue opportunities elsewhere,\" said Padgett's Racing team principal Clive Padgett.", "url": "https://www.bbc.com/sport/northern-ireland/66363238"}