{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:46:26", "date_modify": "2025-05-21 07:46:26", "date_publish": "2025-05-20 11:32:28", "description": "Man Utd news: Squad can't complain about Asia trip - Maguire", "filename": "sport_football_articles_cz9yyg4w8glo_1747813586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8aa2/live/772a1fe0-355f-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz9yyg4w8glo_1747813586.html", "title": "Man Utd news: Squad can't complain about Asia trip", "title_page": "Man Utd news: Squad can't complain about Asia trip - Maguire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry Maguire says the Manchester United dressing room can have no arguments against the club's post-season trip to Asia.\nIf it feels strange knowing the Europa League final with Tottenham will immediately be followed by the final Premier League game of the campaign against Champions League-chasing Aston Villa, yet United's players know they have even more work ahead of them.\nAs soon as the Villa game is over, they will be heading to Malaysia and then flying onto Hong Kong for two matches against local opposition next week that is likely to generate around £7.8m.\nAfter a domestic campaign that will almost certainly result in the club's worst finish since their 1973-74 relegation season, and knowing Premier League prize money alone is worth £3m a place, Maguire accepts the United squad cannot complain.\n\"It is the club's decision and we don't have any right to argue against it after the performances we have put on,\" he said.\n\"As players, we have to take responsibility for the position in the Premier League and the money we have generated this season through that finish, which is nowhere near good enough.\n\"It shouldn't be like that. Two months ago, we should have been in a better position, fighting for a Europa League position or the Champions League positions.\n\"We don't have a right to stand here and criticise the club for trying to generate some money that will hopefully help us next season with signings.\"", "url": "https://www.bbc.com/sport/football/articles/cz9yyg4w8glo"}