{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:38:06", "date_modify": "2025-05-21 05:38:06", "date_publish": "2025-04-01 06:25:22", "description": "Premiership may be reduced, Rangers takeover could be resolved by the end of April and Celtic could be set for talks over a new deal for Brendan Rodgers.", "filename": "sport_football_articles_cpdzqq272zjo_1747805886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/821c/live/fb7a6bd0-0f06-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdzqq272zjo_1747805886.html", "title": "SPFL consider 10-team Premiership and end of split", "title_page": "SPFL consider 10-team Premiership and end of split - Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The SPFL are considering reducing the size of the Premiership to 10 and thus lose the division's split. (Herald - subscription required), external\nRed tape around 49ers Enterprises' proposed takeover for Rangers could be resolved by the end of April. (Record), external\nCeltic are set to sit down for showdown talks with Brendan Rodgers over his future in the off-season (Football Insider), external.\nKasper Hjulmand, Sean Dyche and David Wagner are the latest names linked with the Rangers manager's job. (Scotsman - subscription required), external\nKris Boyd suggests former club Rangers should sign Celtic's Greg Taylor when the Scotland left-back, 27, becomes a free agent this summer. (Sun), external\nPolice Scotland has ended its investigation after Rangers winger Vaclav Cerny was filmed squirting water towards home supporters as he celebrated his side's winning goal at Celtic Park last month. (Herald - subscription required), external\nCerny, 27, will not face any police action. (Record), external\nCeltic could lose out on a major transfer windfall this summer after weekend reports claimed Liverpool could turn their attention to an in-demand European right-back as an alternative to Jeremie Frimpong (Scotsman - subscription required)., external\nRangers chief executive Patrick Stewart is expected to hold a forum with supporters. (Glasgow Times), external\nMeanwhile, Arsenal's Jason Ayto has been linked with a recruitment role at Rangers. (Record), external\nAndy Halliday, 33, backs Motherwell team-mate Lennon Miller, 18, to reach the top in football. (Sun), external\nManager Jim Goodwin urges Dundee United to finish the season with a flourish after they returned to winning ways away to Ross County on Sunday. (Herald - subscription required), external", "url": "https://www.bbc.com/sport/football/articles/cpdzqq272zjo"}