{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:56:21", "date_modify": "2025-05-19 14:56:21", "date_publish": "2017-07-04 13:10:57", "description": "Stephen O'Donnell secures a three-year contract with Kilmarnock after the right-back's summer release by Luton Town.", "filename": "sport_football_40494464_1747666581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/100F3/production/_96797756_rexfeatures_8467579at.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40494464_1747666581.html", "title": "Stephen O'Donnell signs for Kilmarnock after release by Luton Town", "title_page": "Stephen O'Donnell signs for Kilmarnock after release by Luton Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Right-back Stephen O'Donnell has joined Kilmarnock on a three-year contract after leaving Luton Town.\nThe 25-year-old has spent the last two years with Luton Town after rejecting a new contract with Partick Thistle.\nBut he was released at the end of the season after Luton finished fourth in England's League Two and missed out on promotion via the play-offs.\n\"Totally delighted,\" Kilmarnock manager Lee McCulloch told his club website: \"I see this as a real coup for the club.\"\nO'Donnell, capped at under-21 level for Scotland, was on the books of Aberdeen and Celtic as a youth before joining Thistle and making 121 appearances for the Firhill club.\n\"He has shown that he can play very well in this league and has gained invaluable experience down in England and will fit in well with the club's playing style,\" said McCulloch.\n\"He's an athletic player that wants to get better every day.\"\nO'Donnell played 39 times for Luton last season, 33 in the starting line-up, but was released by the Hatters along with former Brighton and Scotland striker Craig Mackail-Smith.\nThe defender, who had turned down a move to Blackpool before joining Luton, said he was \"very excited for the start of the season\".\n\"I'll give 100% for the club and will be looking to get forward at every opportunity,\" added O'Donnell.\n\"I want to play every week and play good, entertaining football.\"", "url": "https://www.bbc.com/sport/football/40494464"}