{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-20 14:16:52", "date_modify": "2025-05-20 14:16:52", "date_publish": "2023-07-29 16:22:14", "description": "Darcy Graham scores two of Scotland's three tries in a World Cup warm-up win over Italy at Murrayfield.", "filename": "sport_rugby-union_66349901_1747750612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1A52/production/_130583760_20804334.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66349901_1747750612.html", "title": "Scotland 25-13 Italy: Graham scores two tries in World Cup warm-up", "title_page": "Scotland 25-13 Italy: Graham scores two tries in World Cup warm-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Scotland side missing several key players began their World Cup preparations with victory over Italy.\nThe likes of Finn Russell, Duhan van der Merwe and captain Jamie Ritchie were rested before back-to-back matches against France.\nDarcy Graham scored either side of the break and Josh Bayliss crossed at the death, with Ben Healy kicking 10 points at Murrayfield.\nMonty Ioane crossed for Italy's only try in a largely scruffy affair.\nVisiting fly-half Tommaso Allan added eight points with the boot.\nWhen these sides met in March in the final round of the Six Nations, Italy gave the Scots an almighty scare, peppering the Scottish line for what would have been a match-winning try before Blair Kinghorn's breakaway score in the final play added some gloss to the scoreline.\nA torrential downpour before kick-off made for a scrappy opening 10 minutes, the highlight of which was perhaps the sight of a seagull on the Murrayfield pitch, with the interloping bird seemingly unperturbed as play raged on around it.\nScotland passed up a couple of promising overlaps but a clever cross-field kick from Healy, on his first Test start, set up Graham to go over for the opening score.\nItaly took the unusual decision, given this was essentially a pre-season friendly, to kick at goal rather than test out the Scottish defence in pursuit of a try, Tommaso Allan bringing them back within two points.\nMatt Fagerson and then George Turner put in monstrous hits as the Scots looked to find a spark, but there was little rhythm to the match in the first half and Allan banged over a penalty from long-range to give the visitors the lead at the break.\nScotland came out with renewed vigour at the start of the second half, only to spill the ball when presented with the opportunity of a tap-penalty five metres from the Italian line.\nIt was perhaps a reflection of the way the game was going that the Scots elected to kick their next penalty at goal, Healy making no mistake to regain the lead.\nHow Scotland could be doing with another try and when it came it was, almost inevitably, from that man Graham.\nSome strong midfield carries took the Scots deep into Italian territory and, when the ball was recycled, Graham arrived like a train to slice straight through and under the posts and take his Test tally to 18 tries in 34 matches.\nAny hopes that Scotland might pull away disappeared soon after when Allan put Ioane over in the corner and the fly-half's brilliant touchline conversion brought the Azzurri back within two.\nHealy's penalty eased Scottish nerves and substitute Bayliss ended the contest when he ploughed over in the corner in the final play.\nNext up for the Scots are home and away meetings with France. Head coach Gregor Townsend will name stronger sides for those Tests, and performances will need to improve significantly to compete with the World Cup hosts.", "url": "https://www.bbc.com/sport/rugby-union/66349901"}