{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:16", "date_modify": "2025-05-21 04:15:16", "date_publish": "2025-02-01 12:33:52", "description": "Australia take 15 wickets on day four of the first Test in Galle to send Sri Lanka to defeat by an innings and 242 runs.", "filename": "sport_cricket_articles_cvglpld245go_1747800916.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4485/live/c70cdd40-e096-11ef-a007-f3ccc874f456.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvglpld245go_1747800916.html", "title": "Sri Lanka vs Australia: Tourists complete huge win on day four", "title_page": "Sri Lanka vs Australia: Tourists complete huge win on day four - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia took 15 wickets on day four of the first Test in Galle to condemn Sri Lanka to their biggest Test defeat by an innings and 242 runs.\nLeft-arm spinner Matt Kuhnemann took nine wickets in his first Test for nearly two years in a match dominated by the turning ball.\nKuhnemann and Nathan Lyon, who took seven wickets in the match, took the last five wickets of the hosts' first innings for only nine runs before captain Steve Smith enforced the follow-on.\nTrailing by 489 runs, Sri Lanka were dismissed for 247 with tailender Jeffrey Vandersay providing the main resistance with a brisk 53.\nResuming at 136-5 after the final two sessions of day three had been lost to rain, Sri Lanka collapsed to Kuhnemann and Lyon by losing their last five wickets in just over four overs. Dinesh Chandimal fell to Lyon for 72, while Kuhnemann, 28, completed his second five-wicket haul in his four Tests to date to finish with 5-63.\nSri Lanka quickly lost both openers at the start of their second innings, with Mitchell Starc trapping Oshada Fernando LBW in the third over while off-spinner Todd Murphy, opening the attack, bowled Dimuth Karunaratne for nought.\nChandimal, Angelo Mathews, Kamindu Mendis, captain Dhananjaya de Silva and Kusal Mendis all made at least 30 but could not go on to bigger scores.\nKuhnemann and Lyon worked their way through Sri Lanka's batting order, while keeper Alex Carey continued his good display behind the wickets with his third stumping of the match.\nVandersay delayed Australia's victory with an entertaining innings off 47 deliveries before he sliced Kuhnemann to Starc at point to complete Australia's huge victory.\nThe second of the two-Test series starts at the Galle International Stadium on 6 February.", "url": "https://www.bbc.com/sport/cricket/articles/cvglpld245go"}