{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-20 11:54:42", "date_modify": "2025-05-20 11:54:42", "date_publish": "2023-08-05 10:27:09", "description": "Hearts kicked off their Scottish Premiership with a narrow win over St Johnstone at McDiarmid Park in Frank McAvoy's first competitive game in charge.", "filename": "sport_football_66194502_1747742082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DF58/production/_130667175_20811992.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194502_1747742082.html", "title": "St Johnstone 0-2 Heart of Midlothian: Visitors start campaign with win", "title_page": "St Johnstone 0-2 Heart of Midlothian: Visitors start campaign with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts kicked off their Scottish Premiership campaign at McDiarmid Park as they eventually overcame St Johnstone in Frank McAvoy's first competitive game as head coach.\nYutaro Oda's clinical finish came towards the end of the match as he sent a precise strike on the turn and into the bottom left-hand corner.\nHearts were relatively comfortable after taking the lead before Lawrence Shankland tapped in a second to double his side's lead at the death.\nThe game was delayed due to VAR-related issues with misses from Liam Gordon and Peter Haring coming before the interval as both sides struggled to find any rhythm in their attacking play.\nThe hosts were desperate to make amends for their League Cup campaign that ended in ignominy, but they failed to find an effective route to goal throughout the afternoon.\nGraham Carey's free-kick dropped invitingly on the edge of the six-yard box for St Johnstone captain Gordon, but his side-footed shot was mishit and sliced wide of the right-hand post.\nSummer signing for Hearts Frankie Kent sent a glancing header wide off the far post, before a fortuitous deflection gave Peter Haring a chance to nod it goalward. However, he ultimately sent it wide from inside the area.\nThe visitors' next went close through Nathaniel Atkinson after some smart play from Oda out wide led to the winger sliding through a precise through ball.\nAfter the interval, Stephen Kingsley's cross was met by Shankland on the edge of the six-yard box but the Scotland cap failed to convert, forcing Dimitar Mitov into a heroic double save to deny his strike before diving at the feet of Oda to block his follow-up attempt.\nSt Johnstone enjoyed a flurry of chances from corners after Oda's clinical finish with Max Kucheriavyi also appealing for a penalty, but nothing was given.\nMitov kept the score down for the hosts with a string of impressive late saves denying Liam Boyce and Kent from close range, only for Shankland to roll the ball into an empty net at the death on a quick break.\nHearts were routinely on the front foot and also found decent success playing on the break when needed, with Shankland showing his capabilities of spinning defenders on the half turn and launching effective counterattacks.\nOda was a threat throughout with second-half substitute Kyosuke Tagawa also looking like a smart acquisition.\nFor St Johnstone, their strongest chances came from set-pieces with their strength allowing them to dominate in the box.\nMore traditional build-up play wasn't their best option this afternoon, but that's also due to Hearts' defensive play.\nUltimately, they really need to find a win from somewhere to restore some confidence around the club at the moment.\nHearts head coach Frank McAvoy: \"We knew they were a wounded animal, I call them a wounded lion I think it was, so we what it would be like in terms of coming here.\n\"Obviously, getting the two goals in the second half just puts the icing on the cake and the clean sheet is massive for us, that's really important and great for the goalkeeping and the back four.\n\"I thought we defended well at times and the wee quality we bring off the bench told in the end and that was pleasing.\"\nSt Johnstone manager MacLean: \"First half I thought we were the better side, I think our shape was good and I think we should have scored one or two goals.\n\"I think against a top side in Hearts you need to take your chances and albeit we didn't, but as in performance wise I thought we were better, I thought we competed.\n\"The first goals changes the game as well, we lose the second because we're chasing the game, but the first goal was a long ball into the box and we don't deal with the first contact and they score with ther second phase.\n\"Listen, I'm happy with my team, there are a lot of positives there and we'll be fine, I just said that to them there, if they give me that every week then I'll be happy.", "url": "https://www.bbc.com/sport/football/66194502"}