{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-20 13:59:34", "date_modify": "2025-05-20 13:59:34", "date_publish": "2023-07-31 07:34:27", "description": "BBC Sport NI assesses the prospects for the new Irish Premiership season as Larne begin the defence of their title.", "filename": "sport_football_66348609_1747749574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/165CE/production/_130589519_bbc-sport-index-imagery-3-split-images-gradient-3aa61278-e440-4867-963f-4ef504d9d7a9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66348609_1747749574.html", "title": "Irish Premiership: Club-by-club guide to the new campaign - focus on last season's top six", "title_page": "Irish Premiership: Club-by-club guide to the new campaign - focus on last season's top six - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A compelling 2022-23 Irish Premiership season saw history made as Larne marked their ascent to the pinnacle of the Northern Ireland domestic game by winning the league title for the very first time.\nThere were storylines aplenty to soak up on the way to that maiden championship success for the east Antrim club, and the forthcoming campaign promises more drama and excitement across the division.\nA number of teams have realistic ambitions of challenging for the top prize, with all-important places in European football also at stake, and survival in the top flight the primary target for other clubs.\nWith the new term about to kick off, we take a look at the prospects for each of clubs who finished in the top six last season, in the order they finished, with last term's bottom six to follow on Tuesday.\nLarne realised their dream of lifting the Gibson Cup in April as they were crowned champions on the back of an accomplished campaign which was constructed on the firm foundations of strong defence, with only 22 goals conceded.\nThe challenge for the Invermen will be to build on the progress made in the past 12 months and replicate that success.\nConsistency was the hallmark of their championship win as Tiernan Lynch's side added a pragmatic approach to achieving results to the attractive brand of passing football that has become their hallmark.\nLynch has moved to strengthen his squad with the addition of goalkeeper Aidan Dowling, defenders Levi Ives, Craig Farquhar and Ali Omar, winger Corey Smith and ex-Newcastle United striker Isaac Westendorf.\nRetaining the services of frontman Lee Bonis on a three-year deal represents another boost for the champions in their ambition to pick up more silverware,\nLarne should be encouraged by impressive performances against HJK Helsinki in the Champions League and will aim to make an impact in the Irish Cup and League Cup, in addition to their hopes of retaining the title.\nLinfield's undoubted priority and motivation will be to regain the league title they had made their own for the previous four seasons.\nTo that end, manager David Healy has freshened up his squad by making Daniel Finlayson's loan spell permanent, and also drafting in full-back Jack Scott, Scottish forward John Robertson, Dungannon winger Darragh McBrien and Matthew Fitzpatrick, who enjoyed a prolific season with Glenavon last time out.\nLongstanding servants Jimmy Callacher and Niall Quinn have left the club in the close season, with Eetu Vertainen, Sam Roscoe, Cammy Palmer and Kyle Lafferty also exiting.\nThe Blues' 2022-23 championship bid faltered on a failure to pick up enough points against other teams in the top half of the division - 34 dropped in total - so that is something Healy and his charges will look to rectify in the forthcoming campaign.\nHaving picked up silverware in the form of the League Cup in March, the south Belfast outfit will be keen to retain that trophy, as well as progressing further in the Irish Cup.\nWith their scheduled fixture against Cliftonville postponed from the opening weekend because of European commitments, the Blues must wait until 12 August to open their campaign with an away game against Dungannon Swifts.\nIn a summer of managerial merry-go-rounds, Warren Feeney was appointed as the new Glentoran boss in June in succession to Rodney McAree.\nGlens fans will hope the former Northern Ireland international can become the man to help the east Belfast club realise their potential of securing a first league title since 2012.\nThe departures of Conor McMenamin and Terry Devlin are significant, but Feeney has moved to put his own stamp on the club with the acquisitions of ex-Larne midfielder Fuad Sule, former Linfield midfielder Cameron Palmer, winger Daire O'Connor and midfielder Josh Kelly.\nEqually significant from Feeney's perspective has been ensuring that Bobby Burns extended his stay at the club and Patrick McClean returned after stepping away from the game in February.\nThe east Belfast team will also seek to make an impact in the cup competitions, having failed to add to their trophy cabinet since collecting the Irish Cup in July 2020.\nConsistency will be the aim for the Glens, something they failed to achieve last term as they failed to build on a fantastic start to the season in which they had the early look of champions elect, their form subsequently dipping to a level which culminated in Mick McDermott vacating his role as manager.\nThe appointment of McAree restored the fortunes of the side somewhat and ensured European football returned to the Oval after a year's absence on the back of a third place league finish.\nCliftonville are another club who begin the upcoming season with a new manager, former Ipswich Town and QPR boss Jim Magilton having taken over the reins at Solitude in the summer after a period of negotiation.\nThe Reds showed promise that they may be serious contenders for the league title last season but in the end their form deserted them and their campaign ran out of steam.\nThey conceded the most goals of any of the top-six sides and their previously impressive home results went on a downward spiral.\nWith defensive frailties exposed too often, disappointing 2-1 home defeats by Dungannon Swifts ended any hopes of a title bid and hopes of a first Irish Cup triumph since 1979.\nStriker Ben Wilson has been acquired from Brighton's Academy and keeper David Odumosu joins on loan from St Patrick's Athletic as the north Belfast club aim to improve on their fourth placing last term.\nMissing out on reported transfer targets Ryan McLaughlin and Patrick McClean may have come as a disappointment so Magilton will likely be keen to add to his panel before the transfer window closes at the end of August.\nHighly-rated defender Levi Ives left to join Larne in July, just weeks after teenager Sean Moore moved to further his career with Premier league outfit West Ham.\nColeraine consolidated their position as a top-half-of-the-table club by finishing sixth last time out.\nBridging the gap to the top teams in the league is difficult for the Bannsiders given their continued part-time status and disparity in financial clout, so the knockout competitions probably offer their best opportunity to get their hands on some silverware.\nAppearances in the last two League Cup finals have ended in disappointing defeats for the Ballycastle Club.\nManager Oran Kearney still has a potent attacking weapon at his disposal in the form of last season's top league goalscorer Matthew Shevlin and has added defender Graham Kelly and forward David McDaid to his squad during the close season.\nDays before the start of the new campaign the club also announced the captures of former Rangers, Derry City and Glentoran defender Darren Cole and Portstewart teenager Jake Wallace, who was most recently on the books of League One side Fleetwood Town.\nAn opening derby match against A26 neighbours Ballymena United should see the Ballycastle Road Showgrounds packed.", "url": "https://www.bbc.com/sport/football/66348609"}