{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:46:43", "date_modify": "2025-05-21 04:46:43", "date_publish": "2025-01-14 23:32:07", "description": "Brentford 2-2 Man City: 'We went toe-to-toe with a top-three club' - Thomas Franks reacts to draw", "filename": "sport_football_articles_cnvqj4n40dno_1747802803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c88/live/a6aacf50-d2cf-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cnvqj4n40dno_1747802803.html", "title": "'We went toe-to-toe with a top-three club'", "title_page": "Brentford 2-2 Man City: 'We went toe-to-toe with a top-three club' - Thomas Franks reacts to draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brentford boss Thomas Frank, speaking to TNT Sports: \"I just said to the players in there that I was extremely happy and proud of the performance.\n\"I think this is the first time in four years that over the 90 minutes, we go toe-to-toe with a top-three club. I think Manchester City, Liverpool and Arsenal have been the best three clubs in the four years we have been in the Premier League so the ability and the mindset to do that, the bravery throughout the game, extremely proud of that and of course coming back from 2-0 down is a fantastic mentality.\n\"Very happy. I would have been happy with the performance still but the feeling is a little bit better after you get something out of it.\"\nOn this being the seventh time Brentford have scored after 90 minutes: \"We've got a very good group of players, we have created a great culture together. The staff, the players, everyone has very good characters so we just try to keep pushing that group and they do it for themselves.\"\nOn Yoane Wissa surpassing Ivan Toney to become Brentford's all-time top goalscorer in the Premier League: \"I think that's extremely impressive, I'm very pleased on Wissa's behalf. He probably should have scored two if I'm a little bit after him but he has been very good for us and the way he has taken over from Ivan, not only him but Bryan [Mbeumo] as well, the partnership between the two of them is quite unique. We are just Brentford. Extremely proud.\"", "url": "https://www.bbc.com/sport/football/articles/cnvqj4n40dno"}