{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-04-26 08:09:36", "date_modify": "2025-04-26 08:09:36", "date_publish": "2025-02-26 13:03:37", "description": "How The Wire taps into Dons failings", "filename": "sport_articles_cm2d3g86244o_1745654976.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/011c/live/7a635830-f440-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cm2d3g86244o_1745654976.html", "title": "How The Wire taps into Dons failings", "title_page": "How The Wire taps into Dons failings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"If you come for the king, you best not miss.\" That quote, from award-winning TV show The Wire, was apt when reviewing Aberdeen's latest game against Celtic.\nThe Dons had numerous opportunities to score at Parkhead but failed to take those that came at the crucial moments in the match, with Shayden Morris' late goal barely denting what was another ultimately embarrassing defeat in Glasgow.\nUnfortunately for the visitors, Celtic were utterly ruthless up the other end. But having watched a lot of both teams this season, this was not a vintage performance from the champions, who were unusually careless in that first half in particular, yet still strolled in at the break 3-0 up.\nOday Dabbagh, Kevin Nisbet and Jeppe Okkels all spurned huge chances and the major frustration for Jimmy Thelin will be two-fold: It was a lesson against profligacy and a reminder there remains work to do at the back.\nTo get a result at Celtic Park requires lots of facets of the game to go your way, as Aberdeen experienced the last time they were there in October, but the Dons boss will be disappointed with the manner that most of the goals were conceded.\nIt was actually a positive performance in many ways by Aberdeen. They have played worse at Parkhead and not conceded five times.\nHowever, it is now 29 games against Celtic without a victory. Before this sequence, the longest Aberdeen had waited for win over them was 18. It also leaves their aggregate scoreline from four visits to Glasgow this season at 16-3.\nIn truth, the fixture came at the worst possible time given the Dons had looked as though they were beginning to get a foothold on their season again after 14 league games without a victory. Sunday's clash with Dundee United at Pittodrie is probably their biggest Premiership game of the campaign with the split looming into view.\nUnfortunately, Aberdeen's battle, like nine other top-flight clubs, is not with Celtic and to a certain extent, matches in Glasgow's east end can be written off in that regard.\nBut Thelin will be hoping the result does not have an adverse effect on the next few weeks of what has been one of the strangest seasons in the club's history and with so much still in play.", "url": "https://www.bbc.co.uk/sport/articles/cm2d3g86244o"}