{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:42:13", "date_modify": "2025-05-20 11:42:13", "date_publish": "2023-08-07 00:00:00", "description": "Who made England's final 33-man squad for the 2023 Rugby World Cup?", "filename": "sport_live_rugby-union_66399050_1747741333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12725/production/_130675557_4730d00203db8447e56b6e8cd20f19a206ee67c7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_rugby-union_66399050_1747741333.html", "title": "England World Cup squad announcement LIVE: Henry Slade and Alex Dombrandt left out of Steve Borthwick's squad", "title_page": "England World Cup squad announcement LIVE: Henry Slade and Alex Dombrandt left out of Steve Borthwick's squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks all!\nA big thanks for following the live this morning.\nIf you want to read more - England World Cup squad: Henry Slade & Alex Dombrandt miss out, Joe Marchant & Theo Dan in\nRemember there could still be changes yet due to injuries before the squad head to France.\nStay tuned later for more reaction from the Rugby Union Weekly.\nget involved\nGet Involved\n#bbcrugby on Twitter or 81111 on (UK only – texts will be charged at your standard message rate)\nA nice way to finish is Paul's team to play Argentina in the opener.\nPaul: England have to pick their strongest team against Argentina: Steward; Malins, Marchant, Lawrence, Watson; Farrell, Youngs; Genge, George, Sinckler; Chessum, Itoje; Lawes, Curry, Vunipola.\nPost\nOkay we are going to wrap up at 11:30 BST so here is a recap of the main headlines.\nIn - Billy Vunipola, Joe Marchant, Theo Dan.\nOut - Henry Slade, Alex Dombrandt and Jonny May.\nget involved\nGet Involved - 'bring back Eddie'\n#bbcrugby on Twitter or 81111 on (UK only – texts will be charged at your standard message rate)\nThe first 'bring back Eddie' shout.\nThe sides could well meet in the quarter-finals with both coaches knowing each other very well.\nSteve Borthwick was one of Eddie Jones' assistant coaches from 2015-2020.\nFor all the clarity that Borthwick said he was going to bring, this feels like a very confused squad. Bring back Eddie.\nRich\nget involved\nGet Involved\n#bbcrugby on Twitter or 81111 on (UK only – texts will be charged at your standard message rate)\nNow we have the full squad, how is England's starting XV to face Argentina in their opener on 9 September shaping up?\nI can get you started with Billy Vunipola at number eight. The more I think about it I can see a real Saracens spine in his team.\nget involved\nGet Involved\n#bbcrugby on Twitter or 81111 on (UK only – texts will be charged at your standard message rate)\nJanice: To include Dan Cole who hasn't played his best for a while but exclude Dombrandt seems wrong. Also having one number eight who gets injured and red carded seems a risk.\nDo we agree with Janice that Billy Vunipola is a liability?\nOften forgotten he is still only 30.\nMurley misses out\nThe back three was one of the most competitive positions in the squad and Harlequins wing Cadan Murley is one of the unlucky players to miss out.\nMurley had a prolific season for Harlequins scoring 18 Premiership tries to finish as the competition's top scorer.\nStill yet to be capped it may come as no surprise he didn’t make the squad, with Murley’s lack of versatility potentially hindering him.\nBorthwick said in the week that position flexibility is \"incredibly valuable\".\nSmith back-up or part of the main plan?\nIt may not come as a surprise that fly-half Marcus Smith is in the World Cup squad after Steve Borthwick said it was \"pretty clear\" he would take six half-backs to France.\nWith George Ford and Owen Farrell more in the mould of a classic Borthwick kicking and controlling 10, just what will Smith's role be at this World Cup?\nThe wildcard if things go wrong? Or did the Harlequin prove in the early stages against Wales on Saturday he has grown into a genuine starting option?\nWhatever the answer, he is a very useful option to have.\nArundell the youngest player\nHenry Arundell, 20, is the youngest player in the squad and he already has seven caps for England.\nAfter an up and down season due to injury, is it time for Arundell to be one of the young stars of the tournament?\nSlade magic in 2019\nAnyone remember that bit of Henry Slade magic for Jonny May's try during the quarter-final against Australia in 2019?\nBroke clear and put in an excellent grubber for May to score in the corner.\nWho else has got that in the locker?", "url": "https://www.bbc.com/sport/live/rugby-union/66399050"}