{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-04-26 08:15:23", "date_modify": "2025-04-26 08:15:23", "date_publish": "2025-02-26 10:51:01", "description": "Exeter boss Rob Baxter says clubs must have talks with England over how injured centrally-contracted players are dealt with.", "filename": "sport_rugby-union_articles_cx2041047e3o_1745655323.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/282f/live/3e2a6320-f424-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cx2041047e3o_1745655323.html", "title": "Immanuel Feyi-Waboso: Exeter boss calls for RFU talks after England winger's injury", "title_page": "Immanuel Feyi-Waboso: Exeter boss calls for RFU talks after England winger's injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter boss Rob Baxter says clubs must have talks with England to discuss how injured centrally-contracted players are dealt with.\nBaxter has lost winger Immanuel Feyi-Waboso for the rest of the season after the 22-year-old re-injured his shoulder while training with England.\nFeyi-Waboso had been ready for surgery in early January after he dislocated his shoulder just before Christmas.\nBut England have the final say on medical issues with centrally contracted players under the new Professional Game Partnership agreement and delays with the RFU's involvement in the management of the injury led to surgery being postponed.\nFeyi-Waboso had been reacting well to non-surgical treatment until he was hurt last week.\n\"Everyone's agreed that the whole scenario around how things have worked needs to be discussed post Six Nations on how things should happen and how they should work going forward,\" Baxter told BBC Sport.\n\"If someone gets injured before Christmas and he's only having an operation now, then somewhere in the process something's gone wrong hasn't it?\"\nEngland head coach Steve Borthwick insisted \"player welfare is our top priority\" and there had been \"regular communication\" with Exeter about Feyi-Waboso.\n\"England Rugby has a world-class medical team that cares deeply about the players they look after,\" he added.\n\"We are lucky to have, without doubt, some of the hardest working and most compassionate individuals I have had the privilege of working with.\n\"England medics in fact maintained regular communication with Exeter regarding Immanuel Feyi-Waboso, immediately after his injury, through the Christmas period, and further into the new year.\n\"As you would expect, this is all documented. It would therefore be unfair to question their work ethic, or the level of care provided to the player.\n\"We would have loved to have had Manny with us during this campaign, and we're eager to see him back on the field as soon possible.\"\nBaxter said it was \"50-50\" whether or not the injury required surgery and added it was a difficult first test case for the new agreement.\nAs part of England getting control of the country's best 25 players, the RFU agreed a deal to up their funding to the 10 Premiership clubs.\n\"He had two scans and an operation was decided upon initially 10 days post the injury, which would make him fit now,\" he added.\n\"I think that's the frustration - I think everyone can understand the various bits and pieces which led to some of the delays and that ended up being the rehab decision being the more sensible one.\n\"Ultimately now it doesn't look like the sensible one because the shoulder clearly needed an operation.\"\nBut Baxter said Feyi-Waboso still had a chance of being a \"wildcard\" to make the British and Irish Lions squad this summer.\nThe medical student burst onto the scene at the beginning of last season and opted to play for England rather than his native Wales.\nHe won his first cap in last year's Six Nations and has gone on to play eight times, scoring five tries including in each of England's two summer Tests in New Zealand.\n\"There often seems to be in a Lions year someone that comes in a little bit out of nowhere, they've either been injured or not quite broken through,\" said Baxter, who saw Jack Nowell make the 2017 Lions tour to New Zealand.\n\"He's going to be there or thereabouts with a shot of getting in there at some stage, but all we can do is work hard with him now.\n\"He'll be very focused on giving himself the best opportunity - bigger picture and longer term he's probably having the right treatment now that will look after him for a longer period of time rather than potentially leaving him with a grumbling shoulder that can last two or three years.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cx2041047e3o"}