{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-04-26 03:49:16", "date_modify": "2025-04-26 03:49:16", "date_publish": "2025-03-05 13:42:39", "description": "Making the Premiership Rugby Cup final would showcase Newcastle Falcons' potential according to Steve Diamond.", "filename": "sport_rugby-union_articles_c4g7ddvwykro_1745639356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d133/live/72df1c50-f9a1-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c4g7ddvwykro_1745639356.html", "title": "Newcastle Falcons: Making cup final would be 'ray of hope'", "title_page": "Newcastle Falcons: Making cup final would be 'ray of hope' - Diamond - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Reaching the Premiership Rugby Cup final would offer a \"ray of hope\" for Newcastle Falcons in their ongoing search to attract new investment, according to boss Steve Diamond.\nThe Falcons face Bath at Kingston Park on Friday, knowing that victory would secure a spot in the final at their own ground seven days later.\nThey have not won a trophy of any kind for 21 years and after their recent struggles in the Premiership, it could transform the club's perception.\n\"This is an opportunity to get to a final,\" consultant director of rugby Diamond said.\n\"And with the seasons that Newcastle have had, it's a ray of hope in our search for an investor.\"\nNewcastle owner Semore Kurdi is actively looking for new investment or for a takeover of the Premiership's most northerly club.\nThey have finished bottom of the Premiership in the last two seasons and did not win a league game between March 2023 and October 2024 - a run of 25 matches.\nFalcons are once again bottom this campaign with two wins from their 11 matches.\nOperating with a smaller squad and with a smaller budget than the rest, their place in the top league has been called into question.\nBut this season's Premiership Rugby Cup has offered respite with the Falcons winning six of their seven games.\nAnd this run to the last four has provided welcome respite from some of the other negativity.\n\"It shows what we can do and it shows we're organised behind the scenes,\" Diamond added.\n\"We're a fully functional club, we're probably the club nearest to breaking even and if there are potential people watching, it shows a modicum of ability that we could get the club to a final.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c4g7ddvwykro"}