{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:37:01", "date_modify": "2025-05-20 12:37:01", "date_publish": "2023-08-03 20:05:13", "description": "Derry City make it through to the third qualifying round of the Europa Conference League as Larne, Crusaders and Linfield bow out.", "filename": "sport_football_66401494_1747744621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D7CC/production/_130644255_inpho_02303290.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66401494_1747744621.html", "title": "Europa Conference League: Derry through as 10-man Crusaders lose after extra time", "title_page": "Europa Conference League: Derry through as 10-man Crusaders lose after extra time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry City secured a major financial boost as a 3-3 away draw with KuPS sent them through to the third qualifying round of the Europa Conference League.\nA Michael Duffy header gave the Candystripes a 5-4 aggregate win in Finland that guarantees a prize fund of just less than £500,000.\nTen-man Crusaders put up a brave effort away to Rosenborg but lost 5-4 on aggregate after extra time.\nIrish Premiership champions Larne and Linfield also bowed out.\nThe Blues lost 3-2 to Pogon Szczecin in Poland, making it a 8-4 aggregate defeat, while Larne were beaten 4-1 at Solitude as Kosovan side FC Ballkani ran out 7-1 winners over the two legs.\nIn Finland, Derry made it to the third round of a European competition for the first time since 2006.\nThe Candystripes took the lead in the 13th minute when Paul McMullan played a dangerous pass to Cian Kavanagh, who nodded the ball into the back of the net at the back post.\nThe home side levelled when Brian Maher tried to clear Anton Popovitch's corner but failed to do so, with Jasse Tuominen's header finding the net.\nThe hosts took the lead when Tete Yengi nodded the ball into a dangerous position for Saku Savolainen, who scored with a deflected effort.\nThe Candystripes reacted through Sadou Diallo, who scored on the rebound after a well-timed pass from Duffy. The hosts levelled the score on aggregate again after clever play in midfield left Savolainen one-on-one with Maher, who failed to clear the danger, leaving the central midfielder to finish into an empty net.\nRuaidhri Higgins' men dominated proceedings after that and scored the final goal of the game when Duffy nodded home Diallo's inch-perfect pass from close range to send the Premier Division outfit into the third round, where they will face Tobol from Kazakhstan.\nIrish Cup winners Crusaders travelled to Norway to face Rosenborg, who have reached the Champions League group stages in the past, on the back of a hugely-impressive 2-2 draw in the first leg at their Seaview home last week.\nThey should have taken an early lead in Trondheim when Jarlath O'Rourke's left-wing cross found Ben Kennedy at the back post but he headed straight at goalkeeper Andre Hansen from close range.\nJayden Nelson opened the scoring for Rosenborg on 33 minutes, collecting a beautiful Sverre Halseth Nypan pass inside BJ Burns and opening his body to curl a lovely right-foot shot low into the bottom corner.\nCrusaders equalised on the stroke of half time through Philip Lowry, who finished from close range after Kennedy had tried his luck with a back-heel.\nNelson hit the crossbar in the second half but the match went into extra time after a 1-1 finish, with the hosts regaining the lead in what was a dramatic final few minutes at the end of the first period.\nIsac Thorsvalsson scored with a header that was a equalised by a deflected Paul Heatley shot but the Crues winger was then sent off after being shown a second yellow card for time wasting.\nRosenborg made the most of their extra man in the second half to win the match 5-4 on aggregate, with Leo Cornic lashing home off the underside of the crossbar from a rebound after Jonny Tuffey had saved superbly from Magnus Holte.\nChampions Larne's European campaign came to an end after a 4-1 defeat by Kosovan side F.C Ballkani at Solitude saw them lose 7-1 on aggregate.\nLarne started the brighter of the two sides but it was the visitors who opened the scoring in the 27th minute after Nazmi Gripshi played a neat one-two in the Larne penalty area with Albion Rrahmani before Gripshi slotted home at Rohan Ferguson's near post.\nThings went from bad to worse nine minutes later when Rrahmani again was the provider, this time playing a defence-splitting pass for Gripshi who made no mistake in doubling the visitors' lead from just inside the area.\nBallkani ended any hopes of a second-half fightback from Larne less than 30 seconds after the restart when Almi Kryeziu spotted Albion Rrahmani unmarked 10 yards from goal and the substitute made no mistake from close range to give his side a third.\nLarne were awarded a penalty and a chance to pull one back on 59 minute after a handball in the Ballkani penalty area which Lee Bonis fired home to reduce the deficit to two on the evening.\nBallkani restored their three-goal cushion seven minutes later when winger Almir Kryeziu was found just outside the area and made no mistake when he fired first time past a helpless Ferguson.", "url": "https://www.bbc.com/sport/football/66401494"}