{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:34", "date_modify": "2025-05-21 06:53:34", "date_publish": "2025-03-29 18:09:30", "description": "St Mirren 5-1 Kilmarnock: What the manager said", "filename": "sport_articles_c5ymyn9162mo_1747810414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/431c/live/a6756150-0cc0-11f0-bffd-fb98b4c4f9e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5ymyn9162mo_1747810414.html", "title": "St Mirren 5-1 Kilmarnock: What the manager said", "title_page": "St Mirren 5-1 Kilmarnock: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock manager Derek McInnes: \"To be honest, I thought the conditions in the early part of the game we didn't deal with it, two mistakes for the goal, the initial two goals from St Mirren.\n\"I think we've got to be putting more pressure on the ball but I think we should be saving that first shot and then the second goal was just a mistake.\n\"Lewis [Mayo] probably dives in and gives the referee a decision to make, so we find ourselves 2-0 down, I think, nine, ten minutes into the game. We needed to play forward more, I thought we kept putting ourselves in a wee bit of bother.\n\"But in terms of actually responding to going 2-0 down, I actually thought we were alright in the first half and we spoke half-time about trying to... It's a different type of game with the wind and it's more going to come across the pitch.\n\"And I thought we actually started the second half alright, I thought we were good in the game, you see the difference [of] St Mirren, where in the second half they just played forward, the goalkeeper kicked everything, played percentages and in Scottish football sometimes in those sort of conditions that's what you've got to do. And I don't think we'd quite done that well enough in the first half so we had a mountain to climb but I still felt if we could get the next goal there was an opportunity to get something to the game.\n\"Just at that stage, at 3-0, you're starting to think, do we just try and make sure we don't lose any more [goals] because obviously goal difference can be pivotal and we lose another one which was again a mistake.\n\"So a really disappointing afternoon, I apologise to the supporters for that, it's not good enough, they should expect better from the team. We expect better.\n\"There shouldn't have been that difference and for that we can only apologise, we have to own that and there is a tinge of embarrassment and humiliation about it but in the big scheme of things we've got to double down now and just make sure that we're better next week because there's another opportunity next week to get three points.\"", "url": "https://www.bbc.com/sport/articles/c5ymyn9162mo"}