{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 07:39:09", "date_modify": "2025-05-21 07:39:09", "date_publish": "2025-01-13 16:02:26", "description": "Arsenal news: Opinion - Alex Howell on fears of another trophyless season", "filename": "sport_football_articles_cp8q1qlmm55o_1747813149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4742/live/9ba73520-477f-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8q1qlmm55o_1747813149.html", "title": "Opinion - Alex Howell on fears of another trophyless season - BBC Sport", "title_page": "Arsenal news: Opinion - Alex Howell on fears of another trophyless season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is not in question that Mikel Arteta has transformed Arsenal since taking over as manager in 2019.\nArteta has got Arsenal back into the Champions League after a seven-year absence and led the Gunners to two second-placed finishes in a row in the Premier League.\nThat progress renewed optimism in north London and, after pushing Manchester City to the final day of the Premier League season in the last campaign, many thought this would be the year that Arsenal finally lifted silverware.\nHowever, Arteta has been dealt a number of blows throughout this season with injuries to key players such as Martin Odegaard, Bukayo Saka and Ben White.\nWhen any Arsenal player speaks about winning trophies in interviews, they say that they are 'desperate' to win silverware and captain Odegaard used that phrase in his pre-match programme notes against Manchester United.\nReaching the semi-final of the Carabao Cup is not Arsenal's main objective but it did give them the hope of a trip to Wembley and also gives Arteta the chance to lift a trophy which is what those who criticise his side point to.\nThat feeling of desperation of wanting to win a trophy and the frustration of missed chances against Newcastle, spilled into the Manchester United game, as Arsenal missed opportunities and failed to break down a side that played with 10 men for nearly an hour.\nIt is by no means a season that has completely derailed. Those at the club would point to Arsenal being on the same points in the league as they were last season.\nHowever, two losses back-to-back at home in cup competitions has started to create a feeling that it may be another campaign where Arsenal miss out on the top prizes.", "url": "https://www.bbc.com/sport/football/articles/cp8q1qlmm55o"}