{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:54:44", "date_modify": "2025-04-26 07:54:44", "date_publish": "2025-02-25 13:00:47", "description": "Pep Guardiola press conference: Man City vs Tottenham preview", "filename": "sport_football_articles_cddy99rj5ndo_1745654084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deec/live/405a9a50-4922-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cddy99rj5ndo_1745654084.html", "title": "Pep Guardiola press conference: Man City vs Tottenham preview", "title_page": "Pep Guardiola press conference: Man City vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Guardiola \"hopes\" Erling Haaland will return for Wednesday's game, stating: \"Tonight we will know after training. I hope so, but we don't know yet. He feels better but we will see tomorrow.\"\nOn whether Kevin De Bruyne has a future at the club: \"He is an exceptional player. He was and still is. What is going to happen is mainly between him and the club.\"\nGuardiola said this City rebuild is not the biggest challenge of his career: \"No. We have done it already - after nine years it's not the same team that we started with nine years ago. We have done it two or three times already. The challenge I had was when I started my managerial career and with my staff and a lot of tasks when we were together and proving myself and as a staff that we can do it.\"\nHe is pleased with the impact of the January signings: \"Really good, for the time of training they've had. [Abdukodir] Khusanov - tough and difficult schedules coming from where he came from, lack of communication in terms of not speaking fluent English. His impact has been really good. Omar [Marmoush] as well. Nico [Gonzalez] played less, but they've been really good. We're satisfied with the impact. And of course Vitor [Reis], when he has minutes will be in a good level.\"\nOn the challenge posed by Spurs: \"A fantastic team, individual quality that they've always had, the rhythm they play with, the intensity, incredible runners in transition. Results dictate one thing, but my opinion of the team is completely the opposite.\"\nOn Ange Postecoglou: \"I have a high opinion about him. I try to not judge results, you have to see the ideas. Sometimes it's going well, sometimes not much but I have a high, high opinion.\"\nOn Rico Lewis' season: \"Since he arrived in the first-team he has been really, really good. He's a guy that people could think is not a good defender but he's an exceptional defender, so smart, intelligent. Of course his physicality is not like a typical defender in this country, but he's really good, especially with the ball he gives us a lot, a lot of good things.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cddy99rj5ndo"}