{"authors": ["John Haughey", "www.facebook.com"], "date_download": "2025-05-20 14:40:10", "date_modify": "2025-05-20 14:40:10", "date_publish": "2023-07-28 10:28:43", "description": "World Championship medal contender Rhasidat Adeleke joins Ciara Mageean in withdrawing from this weekend's Irish Championships.", "filename": "sport_athletics_66328267_1747752010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/040B/production/_130553010_mageeanadeleke.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66328267_1747752010.html", "title": "Irish Championships: Rhasidat Adeleke and Ciara Mageean pull out of Santry event", "title_page": "Irish Championships: Rhasidat Adeleke and Ciara Mageean pull out of Santry event - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World Championship medal contender Rhasidat Adeleke has joined Ciara Mageean in withdrawing from from this weekend's Irish Championships.\nAdeleke, who is back home after a stunning US collegiate campaign, was scheduled race in Saturday's women's 200m.\nAthletics Ireland said Adeleke is pulling out \"on medical advice\".\nMageean withdrew earlier on Friday as a precaution ahead of next month's World Championships in Budapest.\nIt comes after the Portaferry athlete broke Sonia O'Sullivan's Irish mile record in Monaco a week ago.\nIt is the 150th anniversary of the first Championships in Santry that took place at College Park in 1873.\nThe men's 1500m sees Andrew Coscoran against Nick Griggs, with Luke McCann having withdrawn.\nTyrone runner Griggs may need to upset 3:30.42 Irish record man Coscoran to keep alive his hopes of snatching a World Championships spot.\nGriggs has been moving up this season's world 1500m rankings after some brilliant runs but still remains some way off the top-56 position he needs to make the plane for Budapest.\nBonus ranking points are available at this weekend's championships and Cathal Doyle will be another 1500m contender after triumphing over McCann and Griggs last year when Coscoran was an absentee.\nRecent European Under-23 gold medallist Sophie O'Sullivan is entered in both the 800m and 1500m.\nEven with Mageean absent, the women's 1500m should produce excitement with O'Sullivan and Tokyo Olympian Sarah Healy going head-to-head once more after finishing first and second respectively at the European Under-23 Championships earlier this month.\nThe strong supporting cast at Santry will include Sarah Lavin, Brian Fay and Thomas Barr.\nLavin has been edging ever closer to Derval O'Rourke's Irish 100m hurdles record in recent weeks and is entered in her specialist event plus the 100m.\nAfter smashing the record two weeks ago with a 13:01.40 clocking, Brian Fay will be back in action over the 5,000m distance, but will need to perform well to secure victory with Efrem Gidey also among the entries.\nSunday evening's programme of finals will begin with the men's 5,000m at 18:05 BST and also includes the men's 800m where Letterkenny man Mark English, after a few below-par runs on the European circuit, will face tough opposition in the shapes of John Fitzsimons, Cian McPhillips, Harry Purcell, Paul Robinson and Roland Surlis.\nAfter his disappointing summer campaign following his European Championship heroics last year, Israel Olatunde will hope for better in the men's 100m where he will be aiming for a third successive title.", "url": "https://www.bbc.com/sport/athletics/66328267"}