{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 08:02:53", "date_modify": "2025-05-21 08:02:53", "date_publish": "2025-01-22 07:25:57", "description": "Ireland captain Caelan Doris says the chance to earn selection for the summer's British and Irish Lions tour to Australia will be a factor in this year's Six Nations.", "filename": "sport_rugby-union_articles_cz7e9x4exzpo_1747814573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1527/live/be183150-d829-11ef-90a6-415e92196211.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cz7e9x4exzpo_1747814573.html", "title": "Ireland v England: Lions selection brings extra Six Nations factor", "title_page": "Ireland v England: Lions selection brings extra Six Nations factor - Caelan Doris - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland captain Caelan Doris has asserted that the chance to earn selection for the British and Irish Lions' tour to Australia in the summer adds an extra dimension to this year's Six Nations Championship.\nIreland will begin their bid to secure an unprecedented third consecutive outright victory in the competition when they host England at Aviva Stadium in Dublin on 1 February.\nWith places on the plane to face the Wallabies very much up for grabs, Doris says that while team success is most important, individual rivalries will also play a part in the forthcoming 2025 tournament.\n\"As regards selection criteria [for the Lions], the Six Nations is probably a big factor in how you go,\" said Doris.\n\"I set my aspirations at the start of the season and then once the season kicks off it's week by week, game by game, which works for me.\n\"But of course there is that awareness that it is a Lions season and performances do carry a little bit of weight in terms of that extra factor.\"\nIreland's opening encounter against England offers up a chance to avenge last year's defeat by Steve Borthwick's side at Twickenham, which denied the Irish a second consecutive Grand Slam.\n\"We've got England at home first which sharpens the mind definitely so it's hard to look too far beyond them,\" explained the Leinster back-rower.\n\"Momentum is so big in this competition that if you don't get the first game right you're kind of trying to play catch-up. So it's all about England and preparing as best as possible for that game.\n\"There's a lot of belief within the group but there's also the feeling that we can improve a tonne still.\"\nDoris is eager to atone for the disappointment of the agonising 23-22 reverse suffered against England last March.\n\"I don't think we were quite there defensively. They've got very dangerous ball carriers, but the number of missed tackles for us, for me personally, wasn't where we are capable of being definitely,\" Doris said.\n\"Our attack, it felt like in the first half we didn't fire a whole lot of shots, then we started the second half well, ended up leading.\n\"Even though some of England's results hadn't gone too well prior to that game we were aware that they were a quality team. You rewind only six months from that game and they were in a semi-final of the World Cup.\"\nIreland won three of their four matches during the international window in November, a defeat by New Zealand the exception as they went on to defeat Argentina, Fiji and Australia.\n\"If you look at the autumn, some results good, some not so good, the same with performances. So it feels like there's a tonne of room for growth and we want to chase that down together,\" added Easterby.\n\"If we can play to our potential I'm sure we can beat the other teams for sure.\"\nIreland will have Simon Easterby in interim charge for the duration of the Six Nations as regular head coach Andy Farrell prepares for his role leading the Lions this summer.\nEasterby has been an assistant coach with Ireland since 2014.\n\"I think it will be a seamless transition and there's a lot of faith in him [Easterby] to do a great job,\" said an enthusiastic Doris. \"There's a lot of continuity within the squad, within the management, within the environment, within the plans, and the way we want to play.\n\"I don't think much will change. Si has been unbelievable for us, has been around as a forwards coach and more recently as a defensive one, and has a lot of respect in the group and is very well liked by the players.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cz7e9x4exzpo"}