{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:39", "date_modify": "2025-05-19 15:27:39", "date_publish": "2017-08-01 10:32:35", "description": "An independent investigation is launched into \"failings\" at British Canoeing following claims of abuse.", "filename": "sport_canoeing_40790969_1747668459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11111/production/_97150996_gettyimages-588189006.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_canoeing_40790969_1747668459.html", "title": "British Canoeing: Independent investigation launched into abuse 'failings'", "title_page": "British Canoeing: Independent investigation launched into abuse 'failings' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An independent investigation has been launched into \"failings\" at British Canoeing following claims of abuse.\nA coach at the organisation, who the BBC revealed had been suspended since December, resigned last week following abuse allegations.\nBritish Canoeing began an investigation in December but in April, after further allegations emerged, a second probe was launched with UK Sport.\nNow they have jointly commissioned an independent investigation.\nJust last week, British Canoeing said the resignation of the performance team coach \"brings the disciplinary process to an end\".\nThey said the second probe had been completed and a disciplinary hearing had begun, but it was abandoned when the coach resigned.\nBut now, in a joint statement, external, British Canoeing and UK Sport said: \"In April 2017 several allegations were brought to the attention of British Canoeing, including a number of concerns about past failings of the organisation to deal appropriately with matters that had been raised previously.\n\"British Canoeing acknowledges the seriousness of these allegations and has agreed with UK Sport to jointly commission an independent investigation into these allegations.\n\"The panel will aim to provide a report for British Canoeing and UK Sport by the end of October 2017.\"\nTeam GB enjoyed its most successful Olympic Games in Brazil last year, with competitors winning two gold medals and two silvers.\nBritain then claimed three gold and two bronze medals at the Rio Paralympics, where they topped the medal table.", "url": "https://www.bbc.com/sport/canoeing/40790969"}