{"authors": ["Andrew Aloia", "www.facebook.com"], "date_download": "2025-05-21 05:23:01", "date_modify": "2025-05-21 05:23:01", "date_publish": "2025-04-03 15:34:04", "description": "Mitch Fossier is the singing winger hitting all the right notes for Nottingham Panthers in their Elite Ice Hockey League title tilt.", "filename": "sport_ice-hockey_articles_c0qnz9p37llo_1747804981.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6f8/live/6343f0b0-0f07-11f0-9021-b1661f716c64.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_articles_c0qnz9p37llo_1747804981.html", "title": "Mitch Fossier: How a singing winger has helped Nottingham Panthers", "title_page": "Mitch Fossier: How a singing winger has helped Nottingham Panthers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mitch Fossier is the singing winger hitting all the right notes for Nottingham Panthers in their Elite Ice Hockey League title tilt.\nThe 27-year-old American is Panthers' top points scorer with 15 goals and 35 assists in 38 appearances since arriving in November.\nFossier has been a prolific influence that has Nottingham challenging league leaders Belfast Giants and fierce rivals Sheffield Steelers for the title going into the final weekend of the regular season.\nAnd while he has been a hit with a hockey stick, it is with a guitar that he has been working on what he hopes to be a breakout song to be released at the end of the season.\n\"Hockey is something you can only do for so long and if there was any way that I could make a career out of music I would in a heartbeat - it's just so much fun,\" Fossier told BBC Sport.\n\"A lot of the stuff I've written in the past is very slow and it's very melancholy and the song I'm releasing is a little more poppy and upbeat and hopefully more prone to success, and just easier to listen to for your average person.\"\nFossier has been releasing his own music since he was a teenager, with one of his earliest songs 'Howling Sound' generating more than 300,000 streams on Spotify.\nIn 2023, when playing for hometown club Atlanta Gladiators in the East Coast Hockey League – the third tier of the sport in the United States – he put out a full-length album.\nComposing songs, recording tracks and playing gigs are just as much part of his life than his hockey career, which has taken him from the University of Maine to Slovakia with Banska Bystrica as well as a number of ECHL and American Hockey League sides along the way.\n\"They play off each other,\" he said.\n\"It's a cool contrast in the sense that hockey and music are so different that they're good escapes from the other.\"\nWith an acoustic guitar in hand and folksy, tender sound, Fossier the musician appears to be completely different to the goal-hungry winger he is on the ice.\nPlaying what is considered to be the fastest team sport in the world is more in tune with thrash metal music.\n\"You're right, the contrast is kind of funny and it's probably not what most would expect,\" Fossier said.\nBut even as an ice hockey player, he sees himself as \"a smooth and steady kind of guy\" who craves the art that comes with attacking.\n\"One of the reasons I love hockey is the creative aspect of it,\" he said.\n\"There's creativity that I don't think you find in any other sport, so I think instinctually I like to make plays.\n\"I can definitely see the parallel between liking to play music and there being a hint of that in the way I play hockey.\"\nFossier's approach made him an instant fan favourite at Nottingham Panthers, a club that has failed to win a major trophy since 2017.\nWhen he arrived in November, Panthers were seventh in the table.\nNow, heading into the final regular season weekend, they are third and just four points off top. They could still claim the title if they win both their matches against competition leaders Belfast - who they visit on Saturday before hosting on Sunday - and second-placed Sheffield slip up.\n\"It's still mathematically possible, but we need things to go our way at this point,\" Fossier said.\n\"When you look too far ahead it can get overwhelming and you kind of forget to be in the moment. So honestly, I'm trying not to think too much about it.\n\"We are going to Belfast to try and win that game, then we'll see what happens and how the rest of the league looks.\"\nThe drama of the league title race, which will be followed by the play-offs, means Fossier and his Panthers team-mates have nothing but must win games ahead of them.\nWhat comes after that remains less certain for the American who is yet to have a contract in place for next season.\n\"We'll just worry about that after the season,\" he said.\n\"But I will say that there's not too many places that would be better than this to play at outside of playing in the NHL and making millions of dollars.\"", "url": "https://www.bbc.com/sport/ice-hockey/articles/c0qnz9p37llo"}