{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 14:01:37", "date_modify": "2025-05-20 14:01:37", "date_publish": "2023-07-30 13:43:38", "description": "With key midfielder Keira Walsh ruled out through injury, how might England replace her at the Women's World Cup?", "filename": "sport_football_66347027_1747749697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12550/production/_130588057_keira_walsh5_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347027_1747749697.html", "title": "Keira Walsh injury: How can England replace key midfielder in next World Cup game?", "title_page": "Keira Walsh injury: How can England replace key midfielder in next World Cup game? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Keira Walsh went down clutching her knee during England's Women's World Cup win over Denmark last Friday, you could have heard a pin drop inside the stadium in Sydney.\nFears she may have suffered an anterior cruciate ligament injury were quashed by subsequent scans but the seriousness of her injury is still unclear.\nThe 26-year-old, who played all but four minutes of England's successful Euro 2022 campaign, is widely regarded as one of the best midfielders in the world - but she will not be available for the Lionesses' final group game against China in Adelaide on Tuesday.\n\"How do you fill the shoes of someone like Keira Walsh?\" former England goalkeeper Karen Bardsley told BBC Radio 5 Live.\n\"She is essentially the link. She brings others into play and [chances that] typically end in a goal or a shot on target come through Keira Walsh.\"\nHaving lost Walsh for at least one game, what are Sarina Wiegman's options to replace her in midfield?\nManchester City's Laura Coombs came on for Walsh against Denmark to earn her sixth international cap, and could be an option.\nWalsh is a holding midfield specialist who dictates play from a deep role but when Coombs came on, she played in a more advanced role. That meant regular starter Georgia Stanway dropped further back from her usual more attacking position.\nA year ago, Coombs was barely on England's radar, having not played for her country since 2015. Yet now the 32-year-old, the oldest member of the Lionesses squad at the tournament, could fill one of the most important positions on the pitch.\nShe certainly has the support of her team-mates, with Rachel Daly describing her substitute performance against Denmark as \"phenomenal\".\nStriker Bethany England added: \"Coombs is an experienced player. Maybe people underestimate her at this level but I thought she did fantastic coming in for Keira.\n\"She held the ball up well, linked well, settled straight into the game and it didn't look like we were missing anything.\"\nCoombs helped drag England to a second win in two matches in Australia by doing the simple stuff well.\nIn the past two seasons at Manchester City she has played a crucial role, helping to retain possession and bring their creative stars into play. She is reliable and composed in possession, which could prove valuable for England.\nWiegman's squad is relatively inexperienced - only seven players here went to the 2019 World Cup, including goalkeeper Mary Earps who was an unused substitute, while just seven of the 23 players have picked up more than 50 caps.\nWith Walsh missing, Wiegman has lost a leader. She could opt for international experience.\nAston Villa midfielder Jordan Nobbs is a creative, attack-minded player, so is not a direct replacement for Walsh but she is a former England vice-captain, with 71 caps, and is at her fourth major tournament.\nShe could come in as a number eight but that would mean dropping Stanway, arguably England's best performer in their opening match, back to a holding role where she may not be as a effective.", "url": "https://www.bbc.com/sport/football/66347027"}