{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:39:52", "date_modify": "2025-05-21 07:39:52", "date_publish": "2025-03-28 11:49:35", "description": "Plymouth Argyle owner Simon Hallett says he has agreed in principle to sell a stake in the club to new investors.", "filename": "sport_football_articles_cq5z5z67n5no_1747813192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/061f/live/77b8c2c0-0bc7-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5z5z67n5no_1747813192.html", "title": "Simon Hallett: Plymouth Argyle owner agrees to sell stake in club", "title_page": "Simon Hallett: Plymouth Argyle owner agrees to sell stake in club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle owner Simon Hallett says he has agreed in principle to sell a stake in the club to new investors.\nNo details of who will be investing have been revealed, how much they will invest or what size of stake they will have.\nHallett has been Argyle's majority shareholder since 2018 and made it is his mission to turn the Pilgrims into a sustainable Championship side.\n\"We have now reached agreement in principle with a group that will invest in Argyle, and we are in the final stages of due diligence and regulatory approval,\" he said in a statement.\n\"If completed as expected, this transaction will inject new capital into the club in several phases.\n\"The first phase will involve issuing new equity, diluting my stake and those of other shareholders.\n\"Subsequent funds will be available through sponsorship deals and convertible loans, drawn at the club's discretion.\n\"These loans will have favourable interest rates and will eventually convert to equity, allowing the new investors to take a majority ownership position.\"\nIt is the first major investment in the club since a United States-based group formed Argyle Green LLC and paid £4m for a 20% stake in the club in August 2022.\nBut a number of the investors sold their stakes back to Hallett, who went on to control 87% of the club at the time.\nHallett has been keen to invest in Argyle's infrastructure as well as the team on the field.\nA new training centre for the club's academy is being built at Brickfields while he has also invested in first-team training facilities and helped fund the rebuilding of the Mayflower Stand.\nArgyle won promotion back to the Championship in 2023 after being crowned League One champions and secured their survival in the second tier on the final day of last season.\nBut this season they struggled under head coach Wayne Rooney, who was appointed in the summer.\nThe former England captain left on 31 December and was replaced by Austrian Miron Muslic.\nWhile Argyle got a famous FA Cup win over Premier League leaders Liverpool and had a good spell of results in January and February, they have struggled in the past month and are are bottom of the Championship, six points from safety.\nHallett says the new investors are committed to the club, even if they are relegated back to League One.", "url": "https://www.bbc.com/sport/football/articles/cq5z5z67n5no"}