{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:19:30", "date_modify": "2025-05-20 12:19:30", "date_publish": "2023-08-04 22:12:23", "description": "Lowly Castleford Tigers part company with their second head coach this season after sacking Andy Last.", "filename": "sport_rugby-league_66412788_1747743570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E700/production/_130663195__es09879.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66412788_1747743570.html", "title": "Andy Last: Castleford Tigers sack head coach after falling to bottom of Super League", "title_page": "Andy Last: Castleford Tigers sack head coach after falling to bottom of Super League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lowly Castleford Tigers have parted company with their second head coach this season after sacking Andy Last.\nLast was relieved of his duties shortly after Friday's 28-0 home hammering by Huddersfield Giants.\nThe Tigers have won just four games all season, and defeat by their West Yorkshire rivals saw them slip to the bottom of the Super League table.\nThey visit second-bottom Wakefield in their next game in what could prove to be a relegation decider.\nIn a two-line statement, Castleford said Last had departed \"with immediate effect\" and that \"a further statement will be made after the weekend\".\nHe did not do a press conference following the thumping loss by the improving Giants, and Castleford now have six games to avoid being relegated back to the second tier for the first time since 2007.\nThe Tigers are the second Super League team to sack their coach in the past seven days after Daryl Powell left Warrington on Sunday following their defeat by Wakefield.\nWith two weeks until they are next in action, former Cas coach Powell could potentially be back in charge of his old side for their crunch relegation clash.\nLast was appointed on a two-and-a-half-year deal in April after a spell in interim charge following Lee Radford's exit after Cas lost their opening three matches of the season.\nHowever, the former assistant, who was in his first role as a head coach, won just two of his 14 matches in charge and has been sacked off the back of five successive losses.", "url": "https://www.bbc.com/sport/rugby-league/66412788"}