{"authors": ["Andy Campbell", "www.facebook.com"], "date_download": "2025-05-21 06:06:39", "date_modify": "2025-05-21 06:06:39", "date_publish": "2025-04-01 13:54:03", "description": "Celtic lost to Glasgow City on Friday, making the SWPL title charge look like a three-horse race. But are the reigning champions out of it?", "filename": "sport_football_articles_crrz5x92jj8o_1747807599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b271/live/80eefb40-0ef4-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crrz5x92jj8o_1747807599.html", "title": "Are reigning champions Celtic out of SWPL title race?", "title_page": "Are reigning champions Celtic out of SWPL title race? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With Celtic losing to Glasgow City on Friday, the SWPL title charge is starting to look like a three-horse race - with the reigning champions falling behind.\nThat defeat left Elena Sadiku's side fourth, nine points off leaders Hibernian and also trailing Rangers by seven and City by six.\nSo, are Celtic out of the reckoning with eight rounds of fixtures still to play?\nThe tightness of the top three means the league leaders could change within one match day, but Celtic need at least a couple of weeks of teams dropping points to get back into the mix.\nGiven Hibs, Rangers and City have lost just seven times between them all season, that is a tall order.\nWith no fixtures this coming weekend because of the international break, it will be mid-April before reigning champions Celtic can resume the chase.\nThat round of games on 13 April could be pivotal but, in truth, all games in the post-split period have that potential.\nCeltic travel to face Rangers, by which time Hibs will have hosted Hearts and Motherwell will have visited Glasgow City - all three live on the BBC.\nThe SWPL is no stranger to dramatic finishes.\nThe title has been decided on the final day in each of the two past campaigns, with Celtic triumphing on goal difference after scoring late to beat Hibs last season and City doing likewise at Ibrox the year before.\n\"It's a big result,\" said Scotland captain Rachel Corsie of Glasgow City's Friday win over Celtic on the BBC's Behind the Goals podcast.\n\"Celtic are nine points adrift. I was looking at it thinking I don't know if they can claw that back but everyone plays everyone so I'm going to say they're not out of it.\n\"They're now under quite a bit of pressure. They're going to have to pick up a run.\"\nGlasgow City assistant head coach Leanne Crichton agrees, commenting: \"From our perspective, I don't think they're out of it. There's too many points up for grabs.\"", "url": "https://www.bbc.com/sport/football/articles/crrz5x92jj8o"}