{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 07:52:12", "date_modify": "2025-05-21 07:52:12", "date_publish": "2025-03-28 06:02:56", "description": "Wales host England in front of a record crowd at the Principality Stadium for round two of the Women's Six Nations.", "filename": "sport_rugby-union_articles_c79820wl38eo_1747813932.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5c7c/live/6aa8dd40-0b31-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c79820wl38eo_1747813932.html", "title": "Women's Six Nations: Wales v England match preview, coverage & key stats", "title_page": "Women's Six Nations: Wales v England match preview, coverage & key stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A record crowd awaits as Wales take on the might of England at the Principality Stadium on Saturday.\nThe Red Roses arrive in Cardiff as the number-one ranked team in the world, with last weekend's victory over Italy their 21st successive Test win.\nUnder John Mitchell and new captain Zoe Aldcroft, they are going for their seventh consecutive Six Nations title and a fourth consecutive Grand Slam.\nVery few teams have dominated their sport in such a way.\nIn contrast, Wales are looking to return to form which saw them rise to sixth in the world just a couple of years ago.\nThey have a new coach in Sean Lynn, and while he was a proven winner at Gloucester-Hartpury, patience is needed as this is only his second week in the job.\nStill there were enough green shoots of promise in the opening-round loss to Scotland to suggest Wales are a team on the up.\nBut they will need every ounce of home support if they are going to challenge England and repeat the heroics of the class of 2015.\nMore than 20,000 tickets have already been sold for the game, a record for a Welsh women's team event in Wales.\nThe previous best attendance was 10,592, when Wales hosted Italy in the 2024 Six Nations at the Principality Stadium.\nBut there is still a way to go to beat the record for a women’s sporting event in Wales.\nMore than 31,000 turned out to watch Team GB women’s football team beat Cameroon 3-0 at the Principality during the London 2012 Olympics.\nWales know they are in for a tough afternoon and have opted for experience in their pack.\nNineteen-year-olds Maisie Davies and Alaw Pyrs, who made their first starts against Scotland, make way for Gwenllian Pyrs and Gwen Crabb.\nFor Sale Sharks loose-head Pyrs, Scotland was a first outing since surgery in November, which included a disc replacement and disc fusion.\nOther than that it is as you were for Lynn's side.\nThere were some question-marks earlier in the week over the availability of Georgia Evans after the number eight was sent off in Edinburgh for two yellow card offences.\nBut a disciplinary panel deemed the red card \"sufficient\" punishment with \"no further sanction\" needed.\nWales head coach Sean Lynn: Defensively we have to be on point, mistakes are going to happen but it's that fight I want to see from the girls.\nWhen you're growing up it's all about Wales v England, and playing in the Principality with a record crowd it's something we are really proud of.\nWe're so excited and it's what these girls deserve, playing at the Principality and having 18,000. I'm hoping we're going to get to the 20,000 mark.\nWe've set out some small challenges for us, what we want to be getting out of it, I just want to make sure that we can put England in a tough place and see how they react. Sport is about pressure.\nEngland flanker Sadia Kabeya: While it is an away game, there's no added pressure for us. We know it's going to be loud which just means we need to be even louder, it's more of a reason for us to go out there and perform.\nGoing into any game we always try and focus on ourselves and see what we can do to improve our game.\nFor us, it's about being squeaky clean and aggressive around our breakdown, but still be able to play fast.\nBBC Radio Wales commentator Gareth Rhys Owen: Sport's ultimate beauty is its ability to surprise us. And it's in this context that any prediction ahead of this encounter must be framed. Theresa May was the Prime Minister when England last lost a Six Nations match and all indicators suggest they should win comfortably on Saturday.\nSuch is the depth of John Mitchell's squad that he has the luxury of making 13 changes to a side who put 40 points on Italy, although most would suggest that this starting XV is an upgrade.\nWales will look for the emotional pull of playing in front of a record-breaking crowd at the Principality Stadium and there was plenty of evidence of progress in their defeat in Edinburgh last weekend.", "url": "https://www.bbc.com/sport/rugby-union/articles/c79820wl38eo"}