{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:36:56", "date_modify": "2025-05-20 12:36:56", "date_publish": "2023-08-04 00:00:00", "description": "Watch Sportscene coverage and follow text updates as Arbroath host relegated Dundee United in the Scottish Championship season opener.", "filename": "sport_live_football_66198964_1747744616.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66198964_1747744616.html", "title": "Scottish Championship: Dundee Utd ease to 4-0 win over Arbroath", "title_page": "Scottish Championship: Dundee Utd ease to 4-0 win over Arbroath - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'I'm very, very angry\" - Campbell\nFT: Arbroath 0-4 Dundee United\nArbroath manager Dick Campbell tells BBC Scotland: \"Great atmosphere you could see.\n\"It's not like Arbroath to lose four goals so easily.\n\"They got their goals very easily.\n\"Dundee United were made to look good, albeit they were good.\n\"You've got to give credit to Dundee United they looked very, very much the favourites tonight.\n\"It'll be a different ball game the next time we play them.\n\"We did not lay a glove on them so I'm very, very angry about that.\"\n'It was a disciplined performance' - Goodwin\nFT: Arbroath 0-4 Dundee United\nDundee United manager Jim Goodwin tells BBC Scotland: \"We had brilliant travelling support and we really wanted to reward them for their efforts, not just for this season but towards the end of last season as well.\n\"It was a really disciplined performance.\n\"Some of the goals and the build-up play was excellent.\n\"I think Louis Moult is in there now trying to get his contract up to see if he's got an assist bonus - he's certainly got a goal bonus!\n\"Really pleased to put on the type of performance that we did.\"\nFULL-TIME Arbroath 0-4 Dundee United\nIt's a case of start as you mean to go on as far as Dundee United are concerned.\nGlenn Middleton's opener, Matthew Cudjoe's deft dink, and Craig Sibbald's strike were all assisted by Louis Moult.\nThe striker then notched his own goal at the end of the opening 45.\nA less action-packed second half followed, but United kept it professional, maintaining their clean sheet.\nArbroath didn't necessarily play all that poorly, but they failed to ever effectively match the levels of the opposition this evening.\nPost\nArbroath 0-4 Dundee United\nAn Arbroath corner is nodded back across goal and the last header is from Jay Bird, but he knocks it over the bar from close range.\nIt probably should be a consolation for the hosts as he mistimes his jump and he appears to connect with the ball with the top of his back in the end.\nPost\nArbroath 0-4 Dundee United\nGlenn Middleton finds himself on the left-hand side of the box and goes to fizz it back across goal with his left foot.\nHe almost certainly didn't mean to go for goal, but the first-time strike almost flies in the net.\nIt just creeps over the bar in the end.", "url": "https://www.bbc.com/sport/live/football/66198964"}