{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:48:24", "date_modify": "2025-05-20 14:48:24", "date_publish": "2023-07-28 07:02:16", "description": "Hibernian are reportedly close to signing Roda striker Dylan Vente, with Hearts in negotiations with two forwards.", "filename": "sport_football_66334398_1747752504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15379/production/_130550968_ventegossip.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66334398_1747752504.html", "title": "Scottish Gossip: Adams, Stewart, Vente, Tagawa, Vargas, Gallagher, Paterson, Hector", "title_page": "Scottish Gossip: Adams, Stewart, Vente, Tagawa, Vargas, Gallagher, Paterson, Hector - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian are expected to complete the signing of 24-year-old striker Dylan Vente, who has been linked with Coventry City, Sunderland and Swansea City, from Dutch second-tier club Roda next week for an unknown fee. (De Limburger), external\nRoda have accepted a fee in the region of £700,000 to sell forward Dylan Vente to Hibernian, with the 24-year-old being offered a three-year contract by the Scottish Premiership club. (Sky Sports), external\nRoda football affairs manager Robbie Servais has confirmed to Dutch outlet SoccerNews that negotiations are going well between Dylan Vente's agent and another club - and that the 24-year-old striker, who will command a fee of about £750,000, has spoken to the other team's manager. (Daily Record), external\nTokyo forward Kyosuke Tagawa, who recently returned from a spell in Portugal with Santa Clara, is the subject of a loan offer from Heart of Midlothian that would also carry the option of a permanent transfer at a later date for the 24-year-old. (Edinburgh Evening News), external\nDiscussions are at an advanced stage as Hearts look to agree a six-figure fee to sign 21-year-old forward Kenneth Vargas from Herediano after coming to a verbal agreement about a contract with the forward who helped the club finish second in the Costa Rican top flight and has been capped at under-23 level. (The Scotsman), external\nCallum Paterson has spoken for the first time about Hearts' recent failed bids to take him back to Tynecastle before he signed a new contract with promoted Sheffield Wednesday - and the 28-year-old utility man has revealed he is still keen to return to the Edinburgh club one day. (Edinburgh Evening News), external\nScotland striker Che Adams is poised to be offered a £15m return to the Premier League by Wolverhampton Wanderers, with Southampton looking to replace the 27-year-old with Sunderland's Ross Stewart, although there is also interest from Coventry City, Luton Town and Stoke City in his international colleague. (Daily Record), external\nSt Johnstone are poised to announce the signing of a centre-half on a permanent deal after manager Steven MacLean admitted the Perth club had been \"behind the eight-ball\" in the transfer market this summer. (The Courier), external\nCentre-half Michael Hector, who will face Aberdeen for Charlton Athletic in Saturday's friendly, says he would have liked to have stayed longer with the Dons in 2014 before his loan spell at Pittodrie was cut short by then parent club Reading. (Press & Journal), external\nDeclan Gallagher, who has moved from St Mirren to Dundee United, has revealed that manager Jim Goodwin apologised for selling him to the Paisley club last year when they were both with Aberdeen, saying he was too hasty to judge the 32-year-old central defender. (Daily Record), external", "url": "https://www.bbc.com/sport/football/66334398"}