{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:43", "date_modify": "2025-05-21 04:34:43", "date_publish": "2025-04-04 18:50:48", "description": "Luis Reece takes 6-52 and Caleb Jewell hits a rapid 61 on debut as Derbyshire enjoy a strong first day against Gloucestershire.", "filename": "sport_cricket_articles_c62k2k7kpllo_1747802083.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f6b/live/882e3ea0-1185-11f0-9a9e-afe4b53e7e1b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c62k2k7kpllo_1747802083.html", "title": "County Championship: Derbyshire enjoy strong first day against Gloucestershire", "title_page": "County Championship: Derbyshire enjoy strong first day against Gloucestershire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A six-wicket haul from Luis Reece and four from Anuj Dal got Derbyshire's season off to an impressive start on the opening day of the County Championship Division Two match against Gloucestershire at Derby.\nReece claimed his 150th first-class wicket for Derbyshire to finish with 6-52 while Dal had figures of 4-38 from 16 overs as Gloucestershire were bowled out for 222 shortly after tea.\nOnly Graeme van Buuren with 67 and 48 from skipper James Bracey offered any prolonged resistance.\nAnd in reply, Caleb Jewell plundered 61 from 48 balls with Derbyshire closing on 127-2 to trail by just 95.\nA year ago, not a ball was bowled in this fixture following weeks of rain but this time blue skies and sunshine marked the start of the season at the County Ground.\nDespite the glorious weather, a well grassed pitch persuaded Wayne Madsen, in his second spell as captain after a nine-year gap, to bowl first and he was rewarded with a wicket in the fourth over.\nChris Dent moved across to glance Reece but only succeeded in feathering a catch behind down the leg side.\nIt was a poor shot and another ill-judged stroke accounted for Ben Charlesworth when he aimed a firm-footed drive which ended in Madsen's hands at second slip.\nThe introduction of Dal at the City End with his nagging medium pace brought further success as Gloucestershire lost two wickets in four overs.\nMiles Hammond was drawn into playing at one just outside off stump and the resulting edge went low to first slip where Jewell took a fine catch.\nDal then found some extra bounce to Ollie Price who could not keep the ball down and this time Madsen grabbed a low catch at second slip.\nThe morning would have been even better for the home side if David Lloyd had managed to cling on to a fierce chance at gully when Bracey was on 12 but the first session belonged to Derbyshire.\nBracey and van Buuren started to redress the balance after lunch and were looking set until Dal again shifted the initiative with two wickets in consecutive overs.\nHe squeezed a yorker under Bracey's bat to break a stand of 69 from 123 balls and then trapped Tom Price bang in front to reduce the visitors to 138-6.\nDal took his sweater with the impressive figures of 4-26 from 14 overs and Derbyshire should have removed van Buuren on 54 when a top-edged pull at Andersson was spilled by Pat Brown running to square leg.\nIt threatened to be costly as Zaman Akhter provided support to help van Buuren steer Gloucestershire towards respectability but the innings unravelled after tea.\nReece's first ball of the evening session tempted van Buuren into a pull which he skied into the hands of fine leg to end a partnership of 67 with Akhter who was bowled in the same over driving.\nIn his next over, Reece swung one in to have Marchant de Lange lbw and he wrapped up the innings when Matt Taylor edged to first slip.\nIt was an impressive display of control and accuracy from Reece and Dal but Gloucestershire's bowlers failed to show the same discipline which allowed Lloyd and Jewell to reach 50 in the eighth over.\nAlthough Lloyd was bowled by Tom Price, Jewell tucked into Taylor, taking five fours from his fifth over as the Australian reached 50 on debut off only 37 balls.\nIt was threatening to get ugly for Gloucestershire until Jewell pulled de Lange to fine leg to take a little of the shine off Derbyshire's day.", "url": "https://www.bbc.com/sport/cricket/articles/c62k2k7kpllo"}