{"authors": ["Emma Middleton", "www.facebook.com"], "date_download": "2025-05-21 07:33:11", "date_modify": "2025-05-21 07:33:11", "date_publish": "2025-05-20 14:44:53", "description": "BBC Sport explains how the inaugural World Sevens Football works, which teams are involved, and how you can follow.", "filename": "sport_football_articles_c5y2rxwyj34o_1747812791.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/caa7/live/8a7b1420-34cc-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y2rxwyj34o_1747812791.html", "title": "World Sevens Football: Format, prize money, clubs involved", "title_page": " World Sevens Football: Format, prize money, clubs involved - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World Sevens Football (W7F) is a new seven-a-side competition featuring eight clubs in a women's 'grand slam' series.\nThe inaugural tournament will be played in Estoril, Portugal, from 21-23 May 2025, finishing a day before the Women's Champions League final.\nThe 2025 edition features Ajax, Bayern Munich, Benfica, Manchester City, Manchester United, Paris St-Germain, Roma and Rosengard.\nEach team will play between three and five matches, on grass pitches half the size of the usual 11-a-side pitch. Each match will be played over 30 minutes, in two 15-minute halves.\nThe eight teams will be split into two groups, playing in a round-robin format over the first two days.\nManchester City are in Group 1, alongside Ajax, Bayern Munich and Rosengard. Group 2 consists of Benfica, Manchester United, Paris Saint-Germain and Roma.\nThe top two clubs in each group will advance to the semi-finals, which will be followed by a third-place match and the final.\nTeams will have up to 14 players in their match squads, with unlimited rolling substitutions allowed.\nThe series is funded by US-based philanthropist Jennifer Mackesy, who has a minority stake in Chelsea Women and is co-owner of NWSL club Gotham FC.\nClubs are competing for a $5m (£3.76m) prize pot and are contractually bound to give a certain portion of their prize money to staff and players, though the actual amounts will be determined by the clubs themselves.\nFormer players make up the competition's advisory council, including former England international Anita Asante, Swede Caroline Seger, and American two-time World Cup winner Kelley O'Hara.\nAccording to Mackesy, the tournament is designed to \"elevate the women's game\" and provide players \"with a powerful new platform to showcase their talent, grow their personal brands, and provide economic opportunity in a way that truly reflects their value\".\nAsante, meanwhile, believes the W7F provides another opportunity for players \"to shine\".\n\"It's football, but faster, bolder, and made for the future,\" she said.\nW7F has promised \"fast, high-scoring matches, global exposure, and game-changing financial opportunities for players and clubs\".\nBut some have voiced concern about the proximity of the tournament to Euro 2025, which starts just six weeks after World Sevens.\nIn March, before the participating teams were announced, England manager Sarina Wiegman said she was worried about World Sevens fitting into the football calendar, calling it a \"challenge\".\nHowever, she also recognised that some players would get \"meaningful minutes\" to \"be in the right shape for the Euros\".\nManchester United players Maya le Tissier and Elisabeth Terland told BBC Sport they would like to play in World Sevens, and have since been named in the 20-strong squad alongside the likes of Ella Toone, Leah Galton and Grace Clinton.\nManager Marc Skinner said some of the prize money would be used to recruit new players.\n\"For our team, where we don't have Chelsea, Arsenal or Manchester City's budget, it's huge if we're going to be successful,\" he said.\nManchester City have named a travelling squad of 15 for the tournament, including senior England players Jess Park, Laura Coombs and Laura Blindkilde Brown.\nAsk Me Anything is a service dedicated to answering your questions.\nWe want to reward your time by telling you things you do not know and reminding you of things you do.\nThe team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.\nWe will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.\nOur coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.", "url": "https://www.bbc.com/sport/football/articles/c5y2rxwyj34o"}