{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:50:21", "date_modify": "2025-05-20 12:50:21", "date_publish": "2023-07-24 16:32:23", "description": "Robson keen to 'add a few more'", "filename": "sport_articles_czrgm192vnpo_1747745421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8c4/live/9b51ce40-2a3f-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_czrgm192vnpo_1747745421.html", "title": "Robson keen to 'add a few more'", "title_page": "Robson keen to 'add a few more'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Keen for some more transfers, Dons?\nBarry Robson has hinted that Aberdeen may be welcoming a few new bodies to Pittodrie soon as the manager attempts to build a squad which can compete in Europe and domestically.\nFive players have joined Robson's reds so far this summer, with the 44-year-old revealing, \"we're down the line with some\".\n\"The recruitment we've done already has been good, but we're still trying to improve on that as well and add a few more,\" he told Sky Sports., external\n\"There are ones I wanted done as quick as we could and we managed to do that, but there are ones now that are taking a little bit longer to get over the line but hopefully we're down the line with some and we can see where that'll take us in the weeks to come.\"\nAberdeen have guaranteed European football until Christmas, with a Europa League play-off on the horizon. Failure in that still secures group-stage football in the Conference League.\n\"The European nights here for the football club are great. We know games will be difficult but we need to stay in the fight for the league which is really important, while trying to perform in Europe,\" he added.\n\"We're trying to make sure we can try and spare some players at times, keep them fresh for important games - which they all are - to be able to play the way we want to play.\"", "url": "https://www.bbc.com/sport/articles/czrgm192vnpo"}