{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 04:20:12", "date_modify": "2025-05-21 04:20:12", "date_publish": "2025-04-05 14:58:10", "description": "Iliman Ndiaye's equaliser for Everton in their Premier League draw against Arsenal was \"not a penalty\", says Gunners manager Mikel Arteta.", "filename": "sport_football_articles_c20xkrpp67vo_1747801212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e682/live/4a858250-122c-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20xkrpp67vo_1747801212.html", "title": "Everton 1-1 Arsenal: I have seen it 15 times, it is never a penalty", "title_page": "Everton 1-1 Arsenal: I have seen it 15 times, it is never a penalty - Mikel Arteta - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iliman Ndiaye's equaliser for Everton in their Premier League draw against Arsenal was \"never a penalty\", says Gunners manager Mikel Arteta.\nNdiaye's second-half spot-kick at Goodison Park on Saturday lunchtime came after visiting full-back Myles Lewis-Skelly bundled over Jack Harrison inside the box.\nReferee Darren England immediately pointed to the spot and the video assistant referee (VAR) went with the on-field decision after a check.\n\"I am 100% frustrated,\" Arteta told BBC Match of the Day. \"We were very much in control of the match. We were hoping in the second half to continue the domination but out of nothing the referee decides to give a penalty.\n\"I have seen it 15 times - in my opinion it is never a penalty.\n\"They [Everton] are very good at what they do. We gave away so many silly fouls which led to set-pieces. They generated nothing at all.\"\nBlues manager David Moyes added: \"I've watched it zero times so I couldn't tell you if it was a penalty or not because I've not seen it back.\"\nA game that lacked any real flow ended 1-1 - Leandro Trossard opening the scoring for Arsenal before Everton hit back via Ndiaye's coolly taken penalty immediately after the break.\nBut there were question marks as to whether a foul should have been given when Lewis-Skelly and Harrison came together in the box.\nThe Premier League match centre on X explained:, external \"The referee's call of penalty for the challenge by Lewis-Skelly on Harrison was checked and confirmed by VAR - with the contact deemed to be sufficient for a penalty and inside the area.\"\nFormer Premier League striker Chris Sutton said on BBC Radio 5 Live: \"I think it was a very, very soft penalty.\n\"Even David Moyes will look at that and agree that the penalty was a soft one.\"\nFormer England striker Alan Shearer and ex-Liverpool midfielder Danny Murphy added on BBC Match of the Day the decision was \"soft\".\nShearer said: \"There was not enough to give a penalty for me. They aren't going to overturn it though. It is very harsh.\"\nMurphy, added: \"I think Arteta is right. It is a really bad decision, it is never a penalty. They are both tugging and pulling each other.\"\nThe result means Arsenal suffered a potentially fatal blow in their quest for the Premier League crown.\nLeaders Liverpool require only 11 points from their remaining eight games - starting with Fulham on Sunday - to guarantee themselves the title.\nArteta said of the title race: \"We have no margins - that's so clear. We have done enough to win the game but the margins are very small.\"", "url": "https://www.bbc.com/sport/football/articles/c20xkrpp67vo"}