{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:27", "date_modify": "2025-05-21 04:15:27", "date_publish": "2025-04-05 19:22:37", "description": "Everton 1-1 Arsenal: What Jack Harrison said", "filename": "sport_football_articles_cdjld3p1gwgo_1747800927.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4361/live/1b48b260-1253-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdjld3p1gwgo_1747800927.html", "title": "Everton 1-1 Arsenal: What Jack Harrison said", "title_page": "Everton 1-1 Arsenal: What Jack Harrison said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton winger Jack Harrison has been speaking to BBC Radio Merseyside following the draw at Goodison Park: \"I think it's obviously good to get a point against Arsenal, one of the top teams in the league. A lot of us feel frustrated and maybe we feel we could've come away with a win, especially at home and the way the game was going at the end of the second half.\n\"It was a bit of a frustrating start but being able to come away with a point against Arsenal is always good for us. We just have to crack on now, we have a lot of room for improvement.\n\"Against a team like Arsenal, it is always going to be tougher for us attacking players. There was a lot of defending involved and so sticking together as a team is really important.\n\"In the second half, I felt we were able to do that and just hold them to one goal. But, at the same time, we need to try and get up the other side of the pitch and do our best to attack.\n\"So we created a couple of chances but we would have liked to have improved in that aspect a little bit today.\"\nOn the penalty: \"I felt like it was a penalty straightaway. I tried to read the flight of the ball, going on the other side of the defender, and he brought me down from that angle.\n\"I got up straightaway to try and carry on playing, because you never know with VAR, but the referee had already blown the whistle and called a penalty so that was it.\"\nOn his aims for the rest of the season: \"I want to try and add more goals and assists. I want to contribute as much as I can to this club. It's been amazing being here, I know it's just on loan but hopefully we can see what happens going forward.\n\"I just want to continue my growth as a player and contribute as much as I can to this amazing club.\"", "url": "https://www.bbc.com/sport/football/articles/cdjld3p1gwgo"}