{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:19:57", "date_modify": "2025-05-21 05:19:57", "date_publish": "2025-04-03 20:20:05", "description": "Arsenal will have to make Nico Williams one of their top earners, Manchester United chasing striker Lorenzo Lucca, Tottenham ready to fight for Dejan Kulusevski.", "filename": "sport_football_articles_cm2x0mxv76jo_1747804797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e8fa/live/713cad40-1116-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2x0mxv76jo_1747804797.html", "title": "Football gossip: Williams, Lucca, Kulusevski, Rashford, Mainoo, Hernandez", "title_page": "Football gossip: Williams, Lucca, Kulusevski, Rashford, Mainoo, Hernandez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal will have to make Nico Williams one of their top earners, Manchester United chasing striker Lorenzo Lucca, Tottenham ready to fight for Dejan Kulusevski.\nArsenal will have to make Spain winger Nico Williams, 22, one of club's top earners to sign him from Athletic Bilbao this summer. (Telegraph - subscription required), external\nManchester United have made Udinese and Italy striker Lorenzo Lucca, 24, their top target going into the summer transfer window. (Sun - subscription required), external\nTottenham hope to avoid losing Sweden midfielder Dejan Kulusevski, 24, this summer amid interest from AC Milan and Napoli. (GiveMeSport), external\nBayer Leverkusen have made contact with representatives of German Stefan Ortega, 32, and could sign the Manchester City goalkeeper for around 8m euros (£6.7m). (Bild - in German, subscription required), external\nDeportivo La Coruna winger Yeremay Hernandez, 22, is attracting interest from Arsenal and Chelsea. (Teamtalk), external\nEngland forward Marcus Rashford, 27, will have to consider taking a wage drop if he is to seal a permanent move to Aston Villa from Manchester United this summer. (Football Insider), external\nUp to 11 Arsenal players, including Ukraine left-back Oleksandr Zinchenko, 28, and Poland defender Jakub Kiwior, 25, could depart this summer to bolster the club's spending power in the transfer window. (Mirror), external\nSheffield Wednesday's German boss Danny Rohl is a possible target for Leicester City next season if Dutch manager Ruud van Nistelrooy leaves the club in the summer. (Mail), external\nAston Villa have a clear path to pursue Real Madrid's 20-year-old winger Arda Guler after Liverpool ended their interest in the Turkey international. (Teamtalk), external", "url": "https://www.bbc.com/sport/football/articles/cm2x0mxv76jo"}