{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:39", "date_modify": "2025-05-19 15:19:39", "date_publish": "2015-02-12 05:07:29", "description": "Australia captain Michael Clarke will not play against England in Saturday's World Cup opener in Melbourne.", "filename": "sport_cricket_31433726_1747667979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80952000/jpg/_80952725_michael_clarke_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_31433726_1747667979.html", "title": "Michael Clarke: Australia captain to miss England World Cup opener", "title_page": "Michael Clarke: Australia captain to miss England World Cup opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia captain Michael Clarke will not play against England in their World Cup opener on Saturday.\nTeam coach Darren Lehmann said Clarke would, however, be likely to be fit enough to play in Australia's second game, against Bangladesh in Brisbane on 21 February.\nThroughout his career Clarke, 33, has been plagued by injuries.\nHe has suffered persistent hamstring trouble and was ruled out of the recent Test series with India to have surgery.\nClarke made a half century on Wednesday, captaining Australia for the first time in two months as they won their final World Cup warm-up against the United Arab Emirates.\nLehmann said Clarke had \"pulled up really well\" but would not play in the match in Melbourne on Saturday (03:30 GMT).\n\"We're really happy with his progress,\" added Lehmann. \"We're going to stick with the plan and he's going to play against Bangladesh.\"\nClarke suffered two injuries to his left hamstring in 2014 before tearing his right while fielding in the first Test against India on 13 December.\nHe even went so far as to suggest the injury may end his career.\nBut, by 24 December, he stated his desire to be fit for the World Cup - being co-hosted by Australia and New Zealand - and returned to action in grade cricket on 31 January.", "url": "https://www.bbc.com/sport/cricket/31433726"}