{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 14:22:23", "date_modify": "2025-05-20 14:22:23", "date_publish": "2023-07-29 06:02:41", "description": "Sweden turn on the style to demolish Group G rivals Italy and secure a place in the last 16 of the Women's World Cup with one game to spare.", "filename": "sport_football_66347280_1747750943.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CBFA/production/_130581225_07f99dde2b46f36297f30087001ca5f1f3a41184.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347280_1747750943.html", "title": "Sweden 5-0 Italy: Arsenal's Amanda Ilestedt scores two goals in easy win", "title_page": "Sweden 5-0 Italy: Arsenal's Amanda Ilestedt scores two goals in easy win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sweden turned on the style to demolish Group G rivals Italy and secure a place in the last 16 of the Women's World Cup with one game to spare.\nThe 2019 semi-finalists showed why they remain heavyweights of the women's game as Amanda Ilestedt, Fridolina Rolfo and Stina Blackstenius scored in the space of seven minutes at the end of the first half.\nNew Arsenal signing Ilestedt opened the scoring with a glancing header from Jonna Andersson's corner before Rolfo, a Champions League winner with Barcelona, used her knee to double the lead after another corner.\nItaly, who had recorded clean sheets in six of their previous 13 World Cup matches, conceded a third when Blackstenius, another Arsenal player, finished from close range.\nIn front of a crowd of 29,143, it went from bad to worse for Le Azzurre when Ilestedt added the fourth - her third goal of the tournament - with another header from another corner.\nAnd substitute Rebecka Blomqvist added the fifth in the 95th minute.\n\"I really want to pay tribute to the players,\" said Sweden boss Peter Gerhardsson. \"Not for the first time I'm impressed by these players.\"\nAndersson, the former Chelsea defender, was a real threat with her corners as she provided two assists prompting Gerhardsson to add: \"We have been good at set-pieces for a long time.\"\nSweden will face one of the United States, the Netherlands or Portugal in the knockout stage.\nItaly remain second in the group with three points from two games, but need to defeat South Africa next Wednesday back in Wellington (08:00 BST) to make sure of progressing in the tournament.\nFormer finalists Sweden needed a 90th-minute winner from Ilestedt to overcome South Africa in their opening group game.\nThey had no such problems dispatching Italy in New Zealand's capital.\nThe World Cup ever-presents, who are ranked third in the world behind defending world champions the United States and Germany, sent out a powerful message they could go deep into yet another tournament.\nAfter reaching the semi-finalists in France four years ago, they made it to the Olympic final two years ago before making the semi-finals of Euro 2022.\nWill they reach the World Cup final for the first time since 2003?\nWith the team based about half an hour's drive from Wellington, Sweden have attracted lots of local support in New Zealand's capital.\nThe locals in the Saturday night crowd lapped up the goals as Sweden showed their ruthless side, with defender Ilestedt now joint leading scorer at the tournament with Brazil forward Ary Borges.", "url": "https://www.bbc.com/sport/football/66347280"}