{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:04:36", "date_modify": "2025-05-20 12:04:36", "date_publish": "2023-08-05 11:53:51", "description": "Devante Cole scores a hat-trick as Barnsley start life under Neill Collins with a 7-0 thrashing of lacklustre Port Vale.", "filename": "sport_football_66345517_1747742676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17D28/production/_130667579_gettyimages-1258297765.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345517_1747742676.html", "title": "Barnsley 7-0 Port Vale: Devante Cole scores hat-trick as Tykes run riot", "title_page": "Barnsley 7-0 Port Vale: Devante Cole scores hat-trick as Tykes run riot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Devante Cole scored a hat-trick as Barnsley started life under Neill Collins in sensational fashion with a 7-0 thrashing of lacklustre Port Vale at Oakwell.\nLiam Kitching, Jon Russell and Andrew Dallas were on also on target while Dan Jones netted an own goal as last season's League One play-off finalists, now managed by Collins following Michael Duff's departure to Swansea, ran riot.\nThe hosts broke the deadlock in the 23rd minute when debutant Corey O'Keeffe intercepted a loose pass and swept a low ball across to Cole who slotted home.\nBarnsley doubled their lead on the stroke of half-time when Jones turned into his own net.\nCole, the son of former England and Manchester United striker Andy Cole, notched his second just two minutes after the break, this time latching onto Barry Cotter's cross and lashing home.\nThe hat-trick was completed in the 53rd minute. As his side countered, Cole went alone and struck with just enough power for the ball to roll into the net.\nReds skipper Kitching added a fifth on the hour mark. Receiving the ball from Herbie Kane, the defender had time to control and calmly finish beyond Connor Ripley.\nCollins' side added a sixth four minutes later as Russell headed in from Nicky Cadden's free-kick.\nSubstitute Dallas grabbed a debut goal in the sixth minute of added time, diving to head home from Cotter's cross.\nBarnsley's win was the biggest opening day success in the EFL since Luton smashed Yeovil 8-3 in August 2018 and the first time a team has won by seven goals on the first weekend of a season since Wolves beat Man City 8-1 back in 1962.\nBarnsley manager Neill Collins told BBC Radio Sheffield:\n\"It tells me a lot about the players, their mentality, their attitude, that's the most important thing. I said we would learn more about the team once we started playing league football so for me I've learned a lot of positives today.\n\"The biggest positives were not so much the goals but it was the first 30 minutes, we ground in, Port Vale put us under a lot of pressure without creating too much. I thought we handled it really well - that's the most important thing for me.\n\"It's going to be a long season, there are a lot of games, there will be statement wins through it, but for me it was a very positive day - it's been tough for the fans since the Wembley loss so hopefully they can get a bit of optimism back.\n\"Devante Cole has impressed me. He scored goals at really important times. He took his goals fantastically well.\"", "url": "https://www.bbc.com/sport/football/66345517"}