{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:21", "date_modify": "2025-05-21 05:25:21", "date_publish": "2025-04-02 00:00:00", "description": "All the latest football news and build-up to Wednesday's Premier League action as Liverpool look to increase their lead with victory over Everton in the Merseyside derby.", "filename": "sport_football_live_cdde4nppenqt_1747805121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d7c/live/cd0a7ad0-0fc7-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cdde4nppenqt_1747805121.html", "title": "Premier League reaction: Forest beat Man Utd as Arsenal and Wolves win", "title_page": "Premier League reaction: Forest beat Man Utd as Arsenal and Wolves win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All set for tonight's action?\nThank you for joining us today as we brought you Premier League news conferences and previews of tonight's matches.\nIf you're just joining us or would like a recap, click on the links in the summary section for today's latest football news.\nThere are six Premier League matches taking place tonight, follow live text updates plus radio commentary from 18:45 BST.\n'Everything might catch up with Villa'\nBrighton v Aston Villa (19:45 BST)\nWhat a season Aston Villa are having, with a Champions League quarter-final and FA Cup semi-final to look forward to.\nTheir recruitment in January has been key - a lot has been made of how well Marcus Rashford and Marco Asensio are playing after joining on loan, and rightly so.\nWhether Villa can turn them into permanent signings in the summer might depend on whether they get in next season's Champions League, however.\nWhile this is exactly the scenario they want, finishing in the top five is going to be tough on top of everything else, and it is games like this where everything might catch up with them.\nBrighton drew a blank against Nottingham Forest in the FA Cup on Saturday but Villa are a bit more expansive, and I feel like the Seagulls will have plenty of chances here.\nSutton's prediction: 2-1\nMarch, Wieffer & Barkley in contention - team news\nBrighton v Aston Villa (19:45 BST)\nBrighton pair Georginio Rutter and Adam Webster could miss the remainder of the season with the injuries they sustained during Saturday's FA Cup quarter-final defeat at home to Nottingham Forest.\nBoth Solly March and Mats Wieffer might be fit to return to the matchday squad.\nAston Villa midfielder Ross Barkley is in contention to feature on Wednesday after recovering from knee and calf issues.\nAxel Disasi is available, having been cup tied on Sunday, but Leon Bailey is again likely to miss out with a minor injury.\n'Newcastle have to focus on Champions League return'\nNewcastle v Brentford (19:45 BST)\nHave Newcastle stopped celebrating yet? They have been on the lash for a long time after winning the Carabao Cup, culminating - for some of their fans anyway - with their trophy parade on Saturday. I am sure the players have sunk a few too.\nIt showed how much the club's success means to the city, but now they have to focus on the rest of the season, because getting back into the Champions League would be massive for what comes next for Eddie Howe's side, and how they are viewed across Europe.\nThere will be a fantastic atmosphere at this game too, but the danger with that is we know Brentford are capable of spoiling anyone's party with their attacking threat.\nHowe has tried to address that by speaking about the need to finish the campaign strongly, and this is a great example of where his side cannot afford to take their eye off the ball.\nI suspect they will come out of the traps very quickly against Brentford, lifted by the crowd, and go a couple of goals up before the weekend starts to take its toll on them and the fans too.\nSutton's prediction: 3-1\nDid you know?\nNewcastle v Brentford (19:45 BST)\nBrentford, in 11th, have won their past five Premier League away games - the longest winning run on the road by any side in 2024-25.\nOnly one side has won six successive away games in which they began the day outside of the top 10 in the competition - Arsenal from December 2020 to May 2021.\nExcluding own goals, Brentford have scored from their first shot of a match nine times in the Premier League this season - the most of any side.\nMeanwhile, Newcastle have conceded the first shot they have faced nine times - also a league-high figure.\nInjured Gordon suspended for Brentford clash\nNewcastle v Brentford (19:45 BST)\nNewcastle United return to action in the Premier League eager to build on their Carabao Cup triumph by challenging for a return to the Champions League.\nEddie Howe's side are sixth in the Premier League, one point behind fifth-place Manchester City and two shy of Chelsea in fourth, with a game in hand over both sides.\nThey are still without Anthony Gordon, who will complete a three-match ban on Wednesday.\nThe 24-year-old winger also sustained a minor thigh problem on international duty and is a doubt for next week's trip to Leicester.\nDefensive trio Sven Botman, Lewis Hall and Jamaal Lascelles remain long-term absentees.\nBrentford defender Michael Kayode will return to the squad after two games out with a knee issue.\nMathias Jensen is ruled out because of illness, while Fabio Carvalho is expected to miss the remainder of the season after undergoing shoulder surgery.\n'Bournemouth really need a positive result'\nBournemouth v Ipswich Town (19:45 BST)\nBournemouth have lost a bit of form of late, going out of the FA Cup and taking only one point from their past four league games.\nThey really need a positive result to get back on track, so who better to face than an Ipswich team who are struggling badly?\nThe bottom three are doing so badly that we maybe should have relegated them over the international break.\nAs I've said many times, I actually like the Ipswich model and how they play, and I am a fan of Kieran McKenna as a manager.\nI have felt for them this season and, out of the bottom three sides, they have given it the best go at staying up, but it is quite a damning statistic that they are the only side in the top five tiers of English football yet to win a league game in 2025.\nIt is starting to feel like they are resigned to their fate, and they might have to think about how they will bounce back next season - if they can keep their squad together then I'd be confident that will happen.\nSutton's prediction: 3-1\nBournemouth eye Europe as Ipswich visit\nBournemouth v Ipswich Town (19:45 BST)\nBournemouth will look to put themselves back on track as a struggling Ipswich Town visit tonight.\nOnly four points behind fifth-placed Manchester City, the Cherries have, however, lost three of their past four games adn will need a win to boos their chances of securing European football.\nAndoni Iraola's side are also in danger of losing four successive league games at home for the first time in their history.\nIpswich, meanwhile, are third from bottom and saw Wolves move 12 points clear of them last night.\nThey are the only side in the top four tiers of English football without a league victory in 2025.\nThey have failed to win any of their opening 10 league matches in a calendar year (D2, L8) for the first time in their history and have have dropped 22 points from winning positions in the top flight this season.\nKerkez & Huijsen hand defensive boost for Iraola\nBournemouth v Ipswich Town (19:45 BST)\nMilos Kerkez and Dean Huijsen are two Bournemouth defenders who will be in high demand this summer and the duo will return from suspension tonight in a fillip for the Cherries, who are chasing European football.\nKerkez, who has been linked with a move to Liverpool, and Huijsen were both missed their FA Cup quarter-final defeat by Manchester City.\nBut Andoni Iraola could be without winger Justin Kluivert, who is doubtful after picking up a knock against City.\nIpswich have a few players on the brink of returning to action and Kieran McKenna will monitor midfielder Kalvin Phillips, who needed over 20 stitches after suffering a gashed foot against Nottingham Forest on 15 March.\nAxel Tuanzebe and Conor Chaplin have also resumed training and will also be assessed ahead of the trip to Bournemouth.\n'What a depressing place to be for Saints fans'\nSouthampton v Crystal Palace (19:45 BST)\nI've been speaking about some teams like Aston Villa and Newcastle who have got a lot to play for this season, but none of that applies to Southampton.\nSaints' sole aim now is to pick up three more points and avoid going down with the lowest points tally in Premier League history.\nWhat a depressing place to be for Southampton fans - only possibly saving some face by beating Derby County's pathetic points total of 11 points from 2007-08, when Robbie Savage was captain.\nSouthampton took the lead when they played Crystal Palace at Selhurst Park in December, although they still lost.\nI don't see the Eagles having any problems this time, though. Eberechi Eze is on fire for club and country and Ismaila Sarr found the target again in Saturday's FA Cup win over Fulham.\nSarr has gone under the radar a bit but he is one of many Palace players to have hit form, and I don't see Southampton keeping them out.\nSutton's prediction: 0-2\nCan Glasner's Eagles maintain run of away clean sheets?\nSouthampton v Crystal Palace (19:45 BST)\nCrystal Palace\nThe contrast in form between Southampton and Crystal Palace, tonight's visitors to St Mary's, could not be more stark.\nPalace reached the FA Cup semi-finals for only the sixth time in the club's history with a 3-0 victory at London rivals Fulham on Saturday.\nOliver Glasner's Eagles have been a tough nut to crack on their travels this season - they have not conceded an away goal since Christmas, keeping seven consecutive clean sheets on the road in all competitions.\nIf they are to maintain that record tonight they will have to do it without defender Chris Richards, who has been ruled out with a calf issue, but top scorer Jean-Philippe Mateta is available, having made his comeback from a head injury at Craven Cottage.\nWill Hughes, who missed that FA Cup tie through illness, completes a two-game ban affecting only Premier League matches, while Chadi Riad and Cheick Doucoure are long-term absentees.\nUnwanted stats stack up for Saints\nSouthampton v Crystal Palace (19:45 BST)\nSouthampton\nSouthampton and their manager Ivan Juric are racking up a host of unwanted statistics this season as they prepare for tonight's Premier League match at home to Crystal Palace.\nThe basement club have lost their last nine home league matches, with only Watford enduring a longer losing run at home (11 matches in 2021-22) in the Premier League era.\nJuric, who was appointed as Russell Martin's successor in December, could become the third manager to lose each of his opening seven home fixtures in the competition, after Mick McCarthy and Vincent Kompany.\nThe promoted side's return to the Championship is almost assured, but the Saints' Croatian boss is eager for them to avoid setting a new record low points tally for the Premier League as they prepare to welcome a Palace side buoyed by their progress to the FA Cup semi-finals.\nDerby County ended the 2007-08 season with just 11 points - Southampton are currently on nine, with nine games of the season remaining.\nSaints defenders Jan Bednarek, Taylor Harwood-Bellis and James Bree have been passed fit to play against the Eagles, but Will Smallbone is unavailable because of a groin injury.\n'Man City should blow Leicester away'\nMan City v Leicester City (19:45 BST)\nIt is exactly the fixture Manchester City would want after their FA Cup win at Bournemouth, when Pep Guardiola was speaking about his players showing heart and soul, and the desire and passion that they need.\nThe way he was talking shows how much winning the FA Cup means to him, but does it mean they are back on track? I am not sure, and I don't think this game will tell us much either because they should blow Leicester away even if they are nowhere near their best.\nLeicester have not scored a league goal since the end of January, and I don't see that changing at Etihad Stadium. They are at the stage where their fans cheer a corner, let alone a shot at goal - that's desperate, and that's where Leicester are at.\nFrom what Pep was saying, he knows how important this game is for their run-in, as Manchester City look to secure Champions League football next season. I don't think there is any chance they will slip up.\nSutton's prediction: 5-0\nCan Man City cope without injured Haaland?\nMan City v Leicester City (19:45 BST)\nThough Leicester City are expected to provide little in way of a challenge for Manchester City, it will be a tricky few weeks for Pep Guardiola to negotiate with a place in the Champions League still at stake.\nThe City boss confirmed yesterday that Norway striker Erling Haaland will be out with an ankle injury for up to seven weeks, meaning he might not return until the final game of the season against Fulham on 25 May.\nIt will add to the concerns for Guardiola, who has had to juggle his squad following injuries to Rodri, Nathan Ake, Manuel Akanji and John Stones this season.\nMeanwhile, Leicester manager Ruud van Nistelrooy's squad could be boosted by the return of Ricardo Pereira from a hamstring injury.\nThe defender made a brief appearance as a substitute against Chelsea last month after four months out, but missed the next game after suffering a minor setback.\nMan City eyeing big win before Old Trafford trip\nMan City v Leicester City (19:45 BST)\nManchester City can leapfrog Chelsea into fourth place if they defeat strugglers Leicester City at Etihad Stadium tonight.\nChelsea are currently have one point more than City but are not in action until tomorrow, when they face Tottenham, while sixth-placed Newcastle are one point behind Guardiola's side with a game in hand.\nCity have lost three of their last six league games - although those have come against the current top three of Liverpool, Arsenal and Nottingham Forest.\nBut a big win against second-from-bottom Foxes will set them up nicely for Sunday's derby against Manchester United at Old Trafford.\nLeicester have had a torrid time off late, and have lost 13 of their last 14 league matches, scoring just four goals in those games.\nThey could become just the fourth side in English top-flight history to lose seven consecutive games without scoring, after Sunderland (1977), Ipswich (1995) and Crystal Palace (2017).\nThe Foxes have conceded a league-high 35 goals away from home this season.", "url": "https://www.bbc.com/sport/football/live/cdde4nppenqt"}