{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:38", "date_modify": "2025-05-20 14:02:38", "date_publish": "2023-07-30 13:30:32", "description": "Liverpool continue their pre-season preparations with a comfortable 4-0 win over Leicester City in Singapore.", "filename": "sport_football_66355042_1747749758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4D42/production/_130587791_gettyimages-1580377395.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66355042_1747749758.html", "title": "Liverpool 4-0 Leicester City: Reds cruise past Foxes in Singapore", "title_page": "Liverpool 4-0 Leicester City: Reds cruise past Foxes in Singapore - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool continued their pre-season preparations with a comfortable 4-0 win over Leicester City in Singapore.\nDarwin Nunez, Bobby Clark and Diogo Jota scored within eight first-half minutes before Ben Doak added a fourth after the break.\nMidfielders Alexis MacAllister and Dominik Szobozlai also featured as the Reds continue their midfield rebuild.\nPatson Daka had Leicester's best chance late on but he was denied by a last-ditch Jarell Quansah block.\nNunez started half of Liverpool's Premier League games last season and Jurgen Klopp says his ticket into the team will be his \"readiness to defend\".\nThe striker was sent off in his second game after joining the Reds last June, and struggled for starts after the January signing of Cody Gakpo from PSV.\n\"I don't think I have to tell our fans, it's pretty much traditionally - or historically - for us that usually players for us, especially offensive players, [need time],\" said Liverpool boss Klopp.\n\"I think the signs Darwin showed already last season were really good. Injuries and the red card were not helpful in the start but it's all good. They all are a threat, they all are good footballers - the ticket into the team will be the readiness for defence because you never hear about a team being really successful with sloppy defending, it just will not happen.\n\"For Darwin [it's] the same like for all the other strikers as well because I know about the quality they have and they need to do both, like our other players have to do both as well - defend and being influential in all the offensive situations.\"\nNunez scored nine league goals after joining the Reds from Benfica for an initial £64m and Klopp says the 24-year-old was a \"handful\" against the Foxes.\nKlopp added: \"It's good, you can see he is a handful, the speed and the goal was a typical goalscorer's goal. Being there, smelling it and finishing it off. In training he looks really good. He is fit, that helps, and now two more games and Chelsea.\"\nLiverpool end their tour of Asia with a friendly against Bayern Munich in Singapore on Wednesday, while Leicester return home to host local rivals Coventry City in their opening Championship game on 6 August.", "url": "https://www.bbc.com/sport/football/66355042"}