{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:46", "date_modify": "2025-05-21 07:06:46", "date_publish": "2025-03-29 00:00:00", "description": "Cardiff City's bid for Championship survival takes a hit as they squander a winning position to draw at home to Sheffield Wednesday.", "filename": "sport_football_live_cj92k2kwz0vt_1747811206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78a8/live/a9fcbab0-0cbd-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cj92k2kwz0vt_1747811206.html", "title": "Cardiff City 1-1 Sheffield Wednesday: Bluebirds squander lead", "title_page": "Cardiff City 1-1 Sheffield Wednesday: Bluebirds squander lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City's bid for Championship survival took a hit as they squandered a winning position to draw at home to Sheffield Wednesday.\nCardiff dominated the first half and deservedly led as Isaak Davies finished with precision after a rapid counter-attack, but they wasted chances to extend their advantage.\nThose misses were to prove costly as three half-time substitutions reinvigorated Wednesday, who equalised as Michael Ihiekwe headed in from Barry Bannan's corner.\nCardiff struggled to rediscover their earlier verve against their improved opponents, and equally damaging for the Welsh side were wins for relegation rivals Portsmouth and Stoke City.\nWith this draw, the Bluebirds extend the gap between themselves and the relegation zone to two points, but Derby County could close it when they play their game in hand at home to Preston North End on Wednesday.\nAs for the Owls, they stay 12th in the table, five points adrift of the play-off spots.\nThis result was of no real use for either side and their respective aims at opposite ends of the table.\nGiven how firmly they were in control, however, the point will feel particularly underwhelming for Cardiff.\nThey had ended a three-match losing run with an impressive 2-1 win at top-six contenders Blackburn Rovers before the international break, but were still perilously close to the bottom three at the start of this weekend.\nWith this being the Bluebirds' third relegation battle in four seasons, there was a grim familiarity about the sense of apprehension that hung in the air before kick-off here.\nManager Omer Riza took a bold approach to his team selection as he started with 23-year-old Davies alongside Cian Ashford, 20, and Will Alves, 19, in a vibrant attacking three behind striker Yousef Salech.\nTheir inclusion helped Cardiff start the game superbly; quicker, more dynamic and purposeful going forward than they had been for months.\nThe home side missed a handful of chances before taking the lead in the 21st minute with a sweeping counter from their own half as Salech found Alves and he spread the ball to Davies, who cut in from the right and fired a low left-footed shot past the near post.\nSalech should have scored Cardiff's second 10 minutes later but powered a free header from Callum O'Dowda's corner straight at Wednesday goalkeeper Pierce Charles and missed the rebound.\nThe Owls were fortunate not to trail by more at half-time, at which point they were booed off the field by their fans.\nManager Danny Rohl's response was to make three changes at the break, with Marvin Johnson, Svante Ingelsson and Shea Charles replacing Ryo Hatsuse, Nathaniel Chalobah and Jamal Lowe.\nThey had the desired effect as the visitors improved significantly in the second half, playing with more intensity as they pushed Cardiff back towards their own penalty area.\nWednesday did not create many chances but they earned several corners, one of which was nicely clipped in by Bannan to Ihiekwe, who headed in to level.\nCardiff were shaken by that goal and took a while to resettle, with Salech missing two further chances and Will Fish having a penalty appeal waved away.\nThe smattering of boos from the home crowd were nothing new for this season, another slog for Cardiff at the wrong end of the table.\nCardiff manager Omer Riza:\n\"First half I thought we played well. The first 10 minutes it was cagey but after that we were dominant, created opportunities, scored a goal and had a couple more opportunities as well. It was a very good first half.\n\"The front four were energetic, caused problems and we had good stability behind the ball. We were hoping for more in the second half. But it just seems to be an element of a mental thing with the boys.\n\"They didn't apply enough pressure in the second half. They sat and allowed them to have a bit more time in the midfield areas, which put us on the back foot, which was disappointing. A frustrating one overall.\"\nSheffield Wednesday Danny Rohl:\n\"I think this result was fair for both teams. At this stage of the season it's not an easy game and in the first half we felt that, playing against a team fighting for their life to stay in the league.\n\"I saw a team in the second half on the front foot, creating pressure and moments. It was exactly the game I expected. A team in Cardiff who will do everything, fight for the duals and second balls.\n\"I must say, our away performance has been incredible this season, even though we only take a point today.\"", "url": "https://www.bbc.com/sport/football/live/cj92k2kwz0vt"}