{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 04:32:51", "date_modify": "2025-05-21 04:32:51", "date_publish": "2025-04-04 22:42:29", "description": "Momentum is starting to build for the Lionesses as they edge closer to Euro 2025 and manager Sarina Wiegman admits \"something is happening\".", "filename": "sport_football_articles_c62g30n19d0o_1747801971.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f455/live/e79e1f90-119e-11f0-bb29-2d8764962af4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62g30n19d0o_1747801971.html", "title": "'We are getting closer'", "title_page": "'We are getting closer' - England build momentum with Belgium win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Momentum is starting to build for the Lionesses as they edge closer to Euro 2025 and boss Sarina Wiegman admits \"something is happening\".\nAn impressive display on Friday night ensured England cruised to a 5-0 victory over Belgium at Ashton Gate, oozing confidence and superiority.\nIt sealed back-to-back wins in the Women's Nations League for the European champions after their 1-0 victory over world champions Spain in February, leaving them top of Group A3.\nWith goals flowing, two clean sheets on the bounce and substitutes showing they can make a difference, it showed England could be peaking at just the right time.\n\"We know where we're at and what we want to improve and we're working on it every day,\" said Wiegman.\n\"We need to keep having these connections because I do feel something is happening and we are getting closer.\n\"Of course winning helps. I think we're developing. I also thought we were developing in October and November, but we had results we didn't really like.\n\"We're getting closer to how we want to play against different opponents. We also know a lot can change quickly.\"\nEngland still have three months to prepare for their Euros opener against France on 5 July and Wiegman is keen not to get too carried away.\nShe has consistently warned 'it's only April', but the clock is ticking before her side's true ability will be tested on the European stage.\nBelgium, albeit with a weakened squad due to injury, were no match for England in Bristol though, as the hosts dominated from start to finish.\nDefenders Lucy Bronze and Millie Bright gave the Lionesses a two-goal first-half lead, before substitutes Aggie Beever-Jones and Jess Park added to the tally. With two minutes left, Keira Walsh made it five with her first senior international goal on her 83rd appearance.\n\"The things we wanted to do for most of the game we did. The subs came in and brought new energy,\" added Wiegman.\n\"They really showed up. We got the dynamics in possession and what I really liked was that we kept it simple and together.\n\"It looks very simple - but it's very hard to do. At times, I thought we made football look simple and I really liked that.\"\nMidfielder Walsh felt it was a \"free-flowing\" performance from the team - and it could not have been a better night for her personally.\nThe 27-year-old had never experienced the feeling of scoring a senior goal for her country before Friday.\nWiegman said there was \"joy\" afterwards for Walsh - and the team joked it was an own goal because her strike took a deflection before beating Belgium goalkeeper Nicky Evrard.\n\"I'm really excited. It took a big deflection - but a goal is a goal,\" said Walsh afterwards.\n\"All the girls are super happy for me which is a really nice feeling. I finally got one in the end. A few of them like to remind me how long it's taken, but I'm over the moon and it's really good to be off the mark.\n\"It's up there as one of my favourite games. In general with the team performance, we played a lot of good attacking football and it was a nice evening to be part of.\"\nWalsh was not the only one to experience the delight of a first England goal as Chelsea team-mate Beever-Jones came off the bench to score.\nThe 21-year-old forward's maiden goal came on her fourth appearance, having received a first call-up in May last year.\n\"I actually can't quite believe it. It hasn't hit me just yet. I think I was more buzzing for Keira [Walsh] if I'm honest,\" said Beever-Jones.\n\"I played at this stadium before and scored before, so I had a good feeling coming into it.\n\"I pride myself on keeping my feet on the ground and working hard and with a lot of hard work you get moments like this. I'm so happy that I took it well. It is so surreal and a dream come true.\"", "url": "https://www.bbc.com/sport/football/articles/c62g30n19d0o"}