{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:57:10", "date_modify": "2025-05-20 14:57:10", "date_publish": "2023-07-27 07:18:12", "description": "Leandro Trossard scores twice as Arsenal come back to beat Barcelona 5-3 in an entertaining pre-season friendly at SoFi Stadium in Los Angeles.", "filename": "sport_football_66322660_1747753030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FD7C/production/_130529846_gettyimages-1573330674.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66322660_1747753030.html", "title": "Arsenal 5-3 Barcelona: Leandro Trossard scores twice for Gunners in pre-season win", "title_page": "Arsenal 5-3 Barcelona: Leandro Trossard scores twice for Gunners in pre-season win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leandro Trossard scored twice as Arsenal beat Barcelona 5-3 in an entertaining pre-season friendly at SoFi Stadium in Los Angeles.\nTrossard's second-half double helped Mikel Arteta's side secure a comeback victory over the Spanish champions.\nBukayo Saka and Kai Havertz twice hauled Arsenal level in the first half before Trossard's goals put the Gunners in control after the break.\nFabio Vieira added a stunning fifth after Ferran Torres cut the deficit.\nArsenal, Premier League runners-up last season, begin their season on 6 August against Treble winners Manchester City in the Community Shield at Wembley.\nAt the home of the NFL's Los Angeles Rams and Los Angeles Chargers, Barcelona's Robert Lewandowski opened the scoring after seven minutes when he followed up Raphinha's saved attempt.\nSaka slotted in a 13th-minute equaliser, but the England international then sent a penalty wide midway through the first half.\nAfter Raphinha's free-kick deflected in off Martin Odegaard, Arsenal's Norwegian midfielder set up summer signing Havertz to make it 2-2 before the interval.\nWinger Trossard rolled the ball into the bottom corner for his first goal after 55 minutes, adding his second with a first-time finish from Kieran Tierney's pass.\nFerran Torres' goal two minutes from time gave Barcelona hope, but Vieira's excellent long-range strike sealed victory for Arsenal.", "url": "https://www.bbc.com/sport/football/66322660"}