{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:08", "date_modify": "2025-05-21 05:52:08", "date_publish": "2025-04-02 08:59:12", "description": "Brewers boss Gary Bowyer says Ryan Sweeney inspired Burton Albion's win against Leyton Orient with an \"incredible act of bravery\".", "filename": "sport_football_articles_c9w8rrr28kko_1747806728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b27d/live/45083a40-0f9b-11f0-b696-d3bfdfb825fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9w8rrr28kko_1747806728.html", "title": "Ryan Sweeney: Burton Albion boss Gary Bowyer says captain's 'bravery' inspired win against Leyton Orient", "title_page": "Ryan Sweeney: Burton Albion boss Gary Bowyer says captain's 'bravery' inspired win against Leyton Orient - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Ryan Sweeney inspired Burton Albion's 2-1 win against Leyton Orient with an \"incredible act of bravery\" which saw him taken to hospital with a head injury, says Brewers boss Gary Bowyer.\nThe centre-back left the field just before half-time after blocking Diallang Jaiyesimi's close-range effort with his head as the visitors threatened to go 2-0 up after Dan Agyei gave Orient an early lead.\nBurton went on to fight back with two goals in four second-half minutes from Charlie Webster and Rumarn Burrell to clinch a hugely important win in their battle to avoid relegation.\nBowyer said Sweeney had shown himself to be \"a warrior with a capital W\", whose goal-saving effort prompted Brewers midfielder Kyran Lofthouse to rally team-mates at half-time.\n\"Lofthouse was magnificent because he said, 'Look we have to do this for our captain',\" Bowyer told BBC Radio Derby.\n\"And fair play to the rest of them, they stepped up and did it for their captain. The boys really did pull it our for him tonight. That was an incredible act of bravery from him.\"", "url": "https://www.bbc.com/sport/football/articles/c9w8rrr28kko"}