{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:52", "date_modify": "2025-05-21 07:51:52", "date_publish": "2025-01-13 16:12:23", "description": "Bristol Rovers boss Inigo Calderon said his side's FA Cup match against Ipswich came \"too early\" into his reign.", "filename": "sport_football_articles_c87dx848pg9o_1747813912.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9b7/live/b7978680-d1c8-11ef-a00c-b776b3393886.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c87dx848pg9o_1747813912.html", "title": "Inigo Calderon: Ipswich FA Cup match came too early", "title_page": "Inigo Calderon: Ipswich FA Cup match came too early - Bristol Rovers boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Rovers boss Inigo Calderon is confident the club is moving in the right direction despite their FA Cup loss to Ipswich on Sunday coming \"too early\" into his time in charge.\n\"It's a difficult opposition, that's why they play where they play and we play where we play,\" said the Spaniard - who was appointed head coach on Boxing Day - of his side's Premier League opponents.\n\"For me this was probably too early; I don't think we were ready to play this.\"\nHe told BBC Radio Bristol: \"You have to try to do the best and with our identity, or at least the one I want to issue in the team, I think I could see that: defending high in the pitch, defend in their half, and trying to play with the ball - but the difficulty was too much.\n\"We couldn't keep the ball long enough so that meant we had to defend all the time.\"\nThe Gas are 20th in League One, having won just one of their past nine matches in all competitions, beating Cambridge United away in their last outing.\nCalderon arrived after a spell as Brighton & Hove Albion's under-18s manager, and described his new side's cup exit as \"a good learning session\".\nHe continued: \"When you play different styles you have to learn really quick how to deal with that and it took us too long in the first half.\"", "url": "https://www.bbc.com/sport/football/articles/c87dx848pg9o"}