{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:43", "date_modify": "2025-05-21 07:05:43", "date_publish": "2025-03-29 00:00:00", "description": "Ashley Fletcher scores his fourth goal in five games as Blackpool beat Bolton, who have Aaron Morley sent off.", "filename": "sport_football_live_cqx0n0ngqj5t_1747811143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/184a/live/5c6fc2f0-0afc-11f0-94d4-6f954f5dcfa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cqx0n0ngqj5t_1747811143.html", "title": "Blackpool 2-1 Bolton Wanderers", "title_page": "Blackpool 2-1 Bolton Wanderers - Seasiders move closer to play-off spots - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackpool moved to within five points of the League One play-off places thanks to a win over Bolton at Bloomfield Road.\nIt was Stoke loanee Niall Ennis who proved to be the matchwinner as he netted a sixth goal in 12 league matches for the Tangerines with a neat lob over Nathan Baxter on the hour.\nThe hosts, despite having to go large periods without the ball, managed to edge in front inside the first quarter of an hour.\nThe in-form Ashley Fletcher fired in a fourth goal in five matches from close range after Albie Morgan's well-hit volley was deflected into his path.\nThe visitors responded well and were brought level thanks to Aaron Collins' deft header from a curling Aaron Morley cross.\nThey almost reversed the scoreline completely less than a minute later as Hungarian winger Szabolcs Schon nipped in behind the home defence and lobbed Harry Tyrer only to then see his effort cleared off the line by Odeluga Offiah.\nThe second period continued in a similar high octane fashion with the hosts soaking up Bolton's pressure and hitting them on the counter and within 15 minutes of the restart they were rewarded for all of their heavy running.\nDespite appeals of offside, Ennis snuck his way into the box and chipped the ball over Baxter to steal a vitally important win for Blackpool's play-off hopes.\nFrustration boiled over in the dying moments for Steven Schumacher's Bolton as they saw Morley given his marching orders by the referee for a show of dissent.", "url": "https://www.bbc.com/sport/football/live/cqx0n0ngqj5t"}