{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-21 07:34:30", "date_modify": "2025-05-21 07:34:30", "date_publish": "2025-03-26 07:28:41", "description": "Scotland forwards coach John Dalziel is set for a call-up to the British and Irish Lions when the coaching team is confirmed on Wednesday.", "filename": "sport_rugby-union_articles_cx2g82mlk60o_1747812870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f02/live/28bc6610-0a12-11f0-a457-1fbea9af81fd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2g82mlk60o_1747812870.html", "title": "British and Irish Lions: John Dalziel set to join coaching team", "title_page": " British and Irish Lions: John Dalziel set to join coaching team  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland forwards coach John Dalziel is set for a call-up to the British and Irish Lions when Andy Farrell confirms his coaching team on Wednesday.\nDalziel has been Scotland forwards coach since 2020 and is set to join England senior coach Richard Wigglesworth on the Lions staff.\nIreland interim boss Simon Easterby and scrum guru John Fogarty are among those from Farrell's Ireland set-up who will also be confirmed.\nHowever, the inclusion of Dalziel and Wigglesworth ensures a range of perspectives as Farrell looks to win the Lions' first Test series in 12 years.\nIreland forward coach Paul O'Connell - a former Lions captain and three-times a tourist as a player - had been widely expected to take charge of the Lions pack.\nBut with O'Connell out of the running, Farrell has turned to Dalziel. The former Glasgow coach will share forwards duties with Fogarty, with Easterby likely to run the defence.\nWigglesworth will be given responsibilities around skills and attack as Farrell looks to tap into England's best Six Nations performance in five years. England averaged five tries a game in the championship, up from 2.7 in the autumn.\nFarrell will pick his playing squad on 8 May, with the Lions' first match against Argentina in Dublin on 20 June.", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2g82mlk60o"}