{"authors": ["Andy Cryer", "www.facebook.com"], "date_download": "2025-05-19 15:25:54", "date_modify": "2025-05-19 15:25:54", "date_publish": "2015-02-02 20:37:44", "description": "Manchester United will travel to Preston in the FA Cup fifth round after beating League Two Cambridge United.", "filename": "sport_football_30991120_1747668354.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80769000/jpg/_80769129_rojoandmata_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_30991120_1747668354.html", "title": "Manchester United 3-0 Cambridge United", "title_page": "Manchester United 3-0 Cambridge United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United survived an early scare to beat League Two Cambridge United and set up an FA Cup fifth-round trip to Preston North End.\nStriker Tom Elliott should have given Cambridge a shock lead in the replay but shot against a post after a Daley Blind error within the first minute.\nLouis van Gaal's side took the lead through Juan Mata's close-range finish before Marcos Rojo headed in a second.\nJames Wilson's 18-yard low strike sealed the win for the dominant hosts.\nThey will travel to Deepdale on 16 February to face League One promotion hopefuls Preston for the first time since 1972, after North End beat Sheffield United 3-1 on Tuesday, The tie will be broadcast live on BBC One.\nCambridge defied the odds to hold their Premier League opponents to a 0-0 draw at the Abbey Stadium but, with the exception of the first minute, they never looked capable of causing another upset.\nThe lower league side were shown the ultimate respect as Van Gaal named a strong side, with the 13-times Premier League winners' starting line-up costing £231m compared to Cambridge's, which was made up of 10 free transfers and a loan signing.\nThe League Two side, 14th in the table and 79 places below Manchester United, are estimated to have earned £1m from Tuesday's tie and were cheered on by more than 6,600 travelling fans among the 74,511 spectators inside Old Trafford.\nAnd, after a 20-minute delay to kick-off because of traffic problems, they almost stunned Old Trafford in the first minute as Elliott curled against the post, after being sent through on goal by Blind's misplaced pass.\nVan Gaal's men started to dominate as they got the ball to wide men Wayne Rooney and Angel Di Maria as often as possible. They were rewarded when Mata prodded in the opener, via the crossbar, after Marouane Fellaini headed down Di Maria's left-wing cross.\nThe visitors were up against it now and went 2-0 down before the break when Rojo headed in Robin van Persie's deft chip for his first United goal.\nThe home side continued to control proceedings after the break as Van Persie skied over from close range, before the Dutchman was denied by goalkeeper Chris Dunn.\nIt was damage limitation for a tiring Cambridge and Dunn was beaten again by substitute Wilson's low shot from the edge of the penalty area, although Cameron McGeehan did flash a shot wide in injury time for the valiant visitors.\nManchester United boss Louis van Gaal:\n\"Cambridge have played very well, a very organised team and with the mentality that was superb. The fans were fantastic from Cambridge United.\n\"Every club in the FA Cup wants to win, we also. We have to beat Preston and that will not be easy, they won away against a cup fighter like Sheffield United, so it will be difficult for us to win in Preston North End.\n\"For the club, the fans and the coach and my staff, we want to win a title this year. The biggest chance is the FA Cup, but we still have to win four games to do that.\nCambridge manager Richard Money:\n\"I was really pleased with them second half. To come in 2-0 down and play with purpose and control is not easy but we did that.\n\"We gave the ball away too cheaply in the first half. But I couldn't fault them for their organisation and work ethic.\n\"I said at half time 'What's the worst that can happen? You get battered? But so what. So go and show what you can do.'\"", "url": "https://www.bbc.com/sport/football/30991120"}