{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:18", "date_modify": "2025-05-21 04:58:18", "date_publish": "2025-04-04 12:55:27", "description": "Man City news: Fan views on Kevin de Bruyne's exit", "filename": "sport_football_articles_cedy8gw99dno_1747803498.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cedy8gw99dno_1747803498.html", "title": "Man City news: Fan views on Kevin de Bruyne's exit", "title_page": "Man City news: Fan views on Kevin de Bruyne's exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on what Kevin de Bruyne means to you.\nHere are some of your comments:\nSimon: An icon. His unmistakable ginger hair made him stand out anyway but his lung-busting runs and ability to take games by the scruff of the neck and his killer passes would have made him stand out in any event.\nNoreen: I am a Newcastle United fan, but if a Man City match was on TV and De Bruyne was playing I always watched it! Football at its best! Sad to see him go! Great memories - a one in a million!\nPat: I have seen some truly wonderful players play for City over the years - Colin Bell, David Silva, Yaya Toure, Sergio Aguero….the list goes on and on - but, for me, at his peak, KevindDe Bruyne was the best of them all. We've had technically stronger players than him but no one (I would argue in PL history) has had both the vision of KDB and the astonishing talent to be able to deliver a ball that no other player would have even seen.\nTony: KDB has given us everything and it's been a pleasure watching him play his best football for us. He's entitled to have a big hurrah and payday abroad.\nChris: King Kev...nearly as good as King Colin. Thanks Kevin for making us Cityzens so happy and proud. Wishing you and your family all the very best in the future.", "url": "https://www.bbc.com/sport/football/articles/cedy8gw99dno"}