{"authors": ["Craig Anderson", "www.facebook.com"], "date_download": "2025-05-19 15:05:32", "date_modify": "2025-05-19 15:05:32", "date_publish": "2015-02-09 10:01:10", "description": "Jeff Hutchins heaps praise on Dundee Stars goalkeeper Marc Cheverie following his first shutout of the season.", "filename": "sport_ice-hockey_31294573_1747667132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/77486000/jpg/_77486848_158322170.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_ice-hockey_31294573_1747667132.html", "title": "Ice hockey: Hutchins heaps praise on goalkeeper Cheverie", "title_page": "Ice hockey: Hutchins heaps praise on goalkeeper Cheverie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jeff Hutchins was delighted for Dundee Stars goalkeeper Marc Cheverie after the Canadian recorded his first shutout of the season.\nCheverie took the plaudits after a 3-0 win over Fife Flyers on Sunday kept the Taysiders in the play-off hunt.\nDundee remain bottom of the table and are nine points behind Coventry Blaze, who occupy the last play-off berth.\n\"There's a still a big gap and it's by no means an easy task,\" Dundee's player-coach Hutchins said.\n\"It's a position we've put ourselves in and we have to get out of it.\n\"But I'm over the moon for Marc after getting his shutout and I think he unfairly took a lot of criticism earlier in the season.\n\"If you look at his performances over the last number of weeks, they've been great and when we went 3-0 up at Fife, the guys really pushed to make sure he got it.\"\nOn Saturday, Dundee lost 2-1 to Coventry, with Vladimir Nikiforov and Cale Tanaka netting before Martin Cingel pulled one back for Stars.\nHowever they bounced back on Sunday against Fife with James Isaacs, Igor Gongalsky and Kyle Gibbons on target.\nAs for Fife, their three-game winning streak came to an abrupt end on Saturday when they were beaten 5-2 by Edinburgh Capitals, with Rene Jarolin helping himself to a hat-trick.\nDennis Rix's goal was cancelled out by Bobby Chaumont before Jarolin put the Caps ahead in the second period.\nJade Portwood made it 3-1 and Jarolin added two more, with Ned Lukacevic replying.\nRichard Hartmann's Caps side then made it three wins from their last four on Sunday when Coventry Blaze came to town.\nThe visitors hit the front through Ryan O'Marra before Jarolin levelled and added another in overtime.\nThe importance of the two wins was not lost on Edinburgh winger Daniel Naslund.\n\"Winning the two games is probably the biggest weekend of the year and coming out of it with four points is huge for us,\" he said.\n\"Getting the win over Coventry, a team we're battling with, and adding that to the win over Fife Flyers, a team we haven't got a record against, just makes it a great couple of games for us.\n\"Our outlook has to be taking care of business in the home games then trying to nick points on the road.\"\nBraehead Clan remain top of the Elite League after a 1-0 win over Belfast Giants, achieved courtesy of a Leigh Salters goal.\nAnd with title rivals Nottingham Panthers slipping up in their two games and Sheffield Steelers ending the weekend in defeat, it made Saturday's result even better.\nFife's two losses mean Clan need just three wins to seal the Gardiner Conference title.", "url": "https://www.bbc.com/sport/ice-hockey/31294573"}