{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:20:24", "date_modify": "2025-04-26 04:20:24", "date_publish": "2025-03-03 15:35:07", "description": "Too many 'scared' players at Rangers - Steven Naismith", "filename": "sport_articles_cly6r7prd51o_1745641224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7553/live/f53e4930-f840-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cly6r7prd51o_1745641224.html", "title": "Too many 'scared' players at Rangers", "title_page": "Too many 'scared' players at Rangers - Steven Naismith - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Steven Naismith fears there are too many players \"scared\" of the pressure being a Rangers player brings, and worries there are \"not enough leaders\" in the squad to deal with it.\nThe former Ibrox striker believes \"a big overhaul in the summer\" is \"the only real option\" for a team who, he says, are \"playing catch-up\".\n\"I think there are some in the squad that have got leadership skills, and you see that,\" the ex-Scotland forward said at an event at Hampden.\n\"I'm not sure there's enough of them. I'm not sure there's enough of them that feel the pressure and deal with the pressure.\n\"The European games are suited to them because they can be in a secure block and they're good players at the club, so when that space appears they make the right choice, they have a calm finish.\n\"But, when it is challenging and it's 0-0 with 20 minutes to go at Ibrox and the fans are demanding, who's still brave enough to make the right pass or take a shot at the right time and not just pass off the opportunity?\n\"That's the part that the players need to grasp. I think as a player at an Old Firm, club, you need to, one,deal with the pressure and get used to it, but two, see the opportunity and not be scared of it.\n\"I think too many are scared of that feeling.\n\"The way the squad looks, you talk about some not being capable of doing that, really, the only option when it comes to the summer is having to have a big overhaul and keep maybe the few players that do understand.\"", "url": "https://www.bbc.co.uk/sport/articles/cly6r7prd51o"}