{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 04:53:51", "date_modify": "2025-05-21 04:53:51", "date_publish": "2025-01-23 12:10:03", "description": "England remain winless in the Women's Ashes as Australia edge a rain-affected thriller in Canberra by six runs.", "filename": "sport_cricket_articles_cwy73e57r9xo_1747803231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d55f/live/591b7a00-d987-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cwy73e57r9xo_1747803231.html", "title": "Women's Ashes 2025: Australia win series outright after rain-affected T20 in Canberra", "title_page": "Women's Ashes 2025: Australia win series outright after rain-affected T20 in Canberra - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England remain winless in the Women's Ashes as Australia won a dramatic rain-affected encounter by six runs in the second T20 to complete an outright series victory.\nSet a challenging 186 to win in Canberra, England needed 18 from the last five balls with Heather Knight unbeaten on 43 before heavy rain fell and no further play was possible.\nEngland finished on 168-4, an agonising six runs short of the required score set by the Duckworth-Lewis-Stern (DLS) method.\nThe result sees Australia take a 12-0 lead in the points-based multi-format series, which ends England's hopes of a draw.\nRain had also disrupted the tourists' chase after 8.4 overs, with England two runs ahead of DLS at 69-1, but it eased enough for play to resume with no overs lost.\nKnight's brilliant partnership of 65 in 6.5 overs with Nat Sciver-Brunt kept England in contention throughout before the final result was taken out of their hands and the captain walked off visibly upset.\nOpener Danni Wyatt-Hodge's 52 from 40 balls at the top of the order kick-started England's brave effort, supported by Sophia Dunkley's 32, but ultimately they were left to rue a sloppy final three overs of their bowling innings which conceded 48 runs.\nThey were in the game when the hosts stuttered to 137-5 after 17 overs, only for Tahlia McGrath and Grace Harris to bludgeon their way to 185-5.\nMcGrath, standing in for captain Alyssa Healy because of a foot injury, smashed an unbeaten 48 from 35 balls and Harris launched three sixes in her 17-ball 35.\nOff-spinner Charlie Dean was the pick of the bowlers with 2-28 but she dropped McGrath on 42 on another poor night for England's catching statistics, with Lauren Bell and Freya Kemp also putting down chances off Georgia Voll and Annabel Sutherland - they were not particularly costly in terms of runs, but it remains a big concern for Knight's side going forward.\nThe third and final T20 takes place in Adelaide on Saturday, followed by the one-off Test match in Melbourne on 30 January.\nAfter a tumultuous couple of days off the field for England, involving the fall-out from spinner Sophie Ecclestone refusing a television interview with pundit and former bowler Alex Hartley, they responded impressively and a first win of the series was within their sights.\nAustralia raced to 47-0 from five overs with Beth Mooney scoring 44 of them, but England's spinners dragged things back and the hosts slipped to 75-4.\nMooney's opening partner Voll was run out by Maia Bouchier for five, Ecclestone had Mooney stumped and then in the 10th over, Charlie Dean removed Ellyse Perry for two and Phoebe Litchfield for 17 to shift momentum England's way.\nFreya Kemp dismissed Sutherland for 18 and at 114-5, Australia looked in danger of throwing it away, but as they have proved throughout the series, they are the masters of finding a way to win from tricky situations and one of their array of world-class players is always prepared to step up.\nIn this instance, McGrath led from the front with her counter-attacking knock as England's familiar fielding mistakes began to creep in under the pressure.\nHarris provided the firepower and took the wind out of England's sails, as they could only watch the ball sail over the ropes and into the gaps with alarming regularity.\nEcclestone finished with 1-33, including 18 from one over which was her most expensive ever in T20s, while Bell and Sarah Glenn were also targeted and conceded 0-38 and 0-39 respectively.\nEngland captain Heather Knight: \"Shame, it was set to be a really thrilling game.\n\"I felt like it was on, I felt like I was set, obviously the weather came at the worst possible time and we weren't able to see the complete conclusion. It was going to be a tough ask, but I felt like I was set and was going to get it done.\"\nEx-England spinner Alex Hartley: \"For three-quarters of the game, England were better. There are still things to be improved; there were misfields, there were dropped catches. You are going to drop catches, we saw Australia do the same.\n\"But England were definitely better than they have been.\"\nEx-Australia batter Michelle Goszko: \"It feels a bit hollow - this is not a great way to win the Ashes for Australia.\n\"The final over probably shouldn't have started as it was clear that it wasn't going to be finished.\"", "url": "https://www.bbc.com/sport/cricket/articles/cwy73e57r9xo"}