{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:38:51", "date_modify": "2025-04-26 03:38:51", "date_publish": "2025-03-04 22:29:30", "description": "PSV Eindhoven 1-7 Arsenal: Declan Rice and Jurrien Timber on Champions League win", "filename": "sport_football_articles_czjekpz2vxlo_1745638731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eb3/live/76ae5190-f945-11ef-8cf3-dbb453f7fc09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czjekpz2vxlo_1745638731.html", "title": "PSV Eindhoven 1-7 Arsenal: Declan Rice and Jurrien Timber on Champions League win", "title_page": "PSV Eindhoven 1-7 Arsenal: Declan Rice and Jurrien Timber on Champions League win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal defender Jurrien Timber, speaking to Amazon Prime after Tuesday's 7-1 win at PSV in the Champions League:\n\"A massive performance, I'm proud of the guys, we showed we are capable of a lot and put ourselves in a good position for next week.\"\nOn his goal: \"Amazing cross, good header. It was nice to open the scoring. I had to win here, they're rivals of Ajax [Timber's former club] so I had to win here.\"\nGunners midfielder Declan Rice added:\n\"We've been playing like this all season. We feel we've been playing well as a team - sometimes we score five, sometimes two, sometimes we don't score but tonight we did well. We had the opportunity to score more, in the second half especially.\"\nOn Ethan Nwaneri: \"He's 17 years old and he's on the biggest stage. We've taken them [younger players] under our wing and they deserve to be playing. You should see them train, the way they have no fear and want to perform.\n\"Even if [Bukayo] Saka was here, Ethan would be still getting minutes because he's that good and works so hard in training. The same with Myles [Lewis-Skelly], despite having to come off for the yellow card tonight. We have so many top young players.\"", "url": "https://www.bbc.co.uk/sport/football/articles/czjekpz2vxlo"}