{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:24:47", "date_modify": "2025-04-26 06:24:47", "date_publish": "2025-02-28 22:34:50", "description": "Luke Humphries fights back to claim a 10-7 victory and end Beau Greaves' history-making run at the UK Open.", "filename": "sport_darts_articles_crknx4zppxko_1745648687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69de/live/dbd6dd20-f621-11ef-9299-492188589ab2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_darts_articles_crknx4zppxko_1745648687.html", "title": "UK Open: Luke Humphries ends Beau Greaves' historic run with 10-7 win to reach last 16", "title_page": "UK Open: Luke Humphries ends Beau Greaves' historic run with 10-7 win to reach last 16  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Luke Humphries fought back to claim a 10-7 victory and end Beau Greaves' history-making run at the UK Open.\nWomen's world number one Greaves became the first female player to reach the fourth round of the tournament with wins against Stefan Bellmont, Rhys Griffin and Mickey Mansell earlier on Friday.\nThe 21-year-old then led 7-5 against the men's world number one, but Humphries won five successive legs to secure his place in the last 16.\n\"She belongs in big-time darts,\" Humphries told ITV4 afterwards.\n\"She belongs in this environment. She really did test me there and if we were in a Premier League game she would have beaten me.\"\nGreaves, the reigning three-time women's world champion, opened with a 126 checkout before taking out 124 to break for a 2-0 lead.\nBut Humphries worked his way back and, after his win, he called Greaves back to the stage and the pair bowed together in front of the crowd at Butlin's Minehead Resort.\n\"To play Luke, he's amazing, and for me and my game it will bring me on a long way,\" said Greaves, who averaged 93.60 to Humphries' 103.40.\n\"I'm watching these sorts of players all the time on the telly so it's nice to be here. Honestly, I just enjoyed watching him throw.\"\nEarlier on Friday, Jonny Clayton beat Gary Anderson 10-3 before men's world champion Luke Littler edged past Peter Wright.\nTeenager Littler threw away 7-4 and 9-7 leads as Wright made a late charge to move level at 9-9.\nFacing a chance to wrap up the victory with a 170 checkout, Littler was jeered after taking a safety-first approach and firing into the 10 bed.\nThe 18-year-old shook his finger and mouthed \"not a chance\" to the crowd before eventually sealing the win with an average of 108.69.\nThree-time champion Michael van Gerwen defeated fellow Dutchman Dirk van Duijvenbode 10-8, while Gerwyn Price lost 10-9 to Connor Scutt.", "url": "https://www.bbc.co.uk/sport/darts/articles/crknx4zppxko"}