{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:54", "date_modify": "2025-04-26 06:13:54", "date_publish": "2025-03-05 00:00:00", "description": "Follow live text commentary, score updates and match report from Livingston vs Raith Rovers in the Scottish Championship.", "filename": "sport_football_live_cgkmgmpnvjlt_1745648034.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cgkmgmpnvjlt_1745648034.html", "title": "Livingston vs Raith Rovers: Scottish Championship stats & head-to-head", "title_page": "Livingston vs Raith Rovers: Scottish Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Livingston and Raith Rovers missed the chance to gain significant ground in the Scottish Championship promotion race as they took a point apiece from a hard-fought goalless contest.\nIn front of a 1,331-strong crowd, hosts Livi came close to breaking the deadlock after 55 minutes.\nRobbie Muirhead sent a cross into the box, the Raith defenders struggled to cope with it and Christian Montano's effort from 12 yards was just over the crossbar.\nFinlay Pollock was clean through on goal for Raith only for keeper Jerome Prior to race out and block the Hearts loanee's effort.\nRyan McGowan thought he had snatched a late winner when he bundled the ball home from close range only for the flag to be raised for offside.\nMcGowan again came close in the final minute but his header from six yards was straight into the arms of Rovers keeper Joshua Rae.\nThe point for Livingston takes them to within three of league leaders Falkirk and level with second-placed Ayr United, having played one game more than both.\nRaith Rovers are up to fifth, a point above Queen's Park and four behind Partick Thistle, who in fourth hold the final Premiership play-off spot.\nLivingston manager David Martindale: \"That's us 11 unbeaten. We did enough in the game to win the game. We dominated large parts of the game. We played some decent football. Give Raith a wee bit of credit.\n\"Disappointed? Of course we are. Do I still think we've got a chance of automatic promotion? Of course I do. Falkirk have been incredible this year, Ayr United have been really good this year so it's between the three of us and I think we'll all drop points between now and the end of the season.\"\nRaith Rovers manager Barry Robson: \"This is one of the hardest places you can come and play football in Scotland. We pressed them well, we limited them to a few chances. We probably ended up with the best chances in the game.\n\"Really pleased with the clean sheet. It was a good point. This division's difficult. When we've cut out the little mistakes in games, we've been very, very good but it's the mistakes that have cost us. Tonight, we made sure we didn't make the mistakes.\"", "url": "https://www.bbc.co.uk/sport/football/live/cgkmgmpnvjlt"}