{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:56", "date_modify": "2025-05-21 06:57:56", "date_publish": "2025-02-08 08:44:54", "description": "Full-back Hugo Keenan says Ireland's 10-game winning run over Scotland hasn't been discussed ahead of Sunday's Six Nations game in Edinburgh.", "filename": "sport_rugby-union_articles_cvg900g6wqgo_1747810676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2736/live/119c2cd0-e402-11ef-ac59-0352e7f6e421.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvg900g6wqgo_1747810676.html", "title": "Winning run hasn't been discussed - Hugo Keenan - BBC Sport", "title_page": "Six Nations 2025 - Scotland v Ireland: Winning run hasn't been discussed - Hugo Keenan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Full-back Hugo Keenan says Ireland's 10-game winning run over Scotland hasn't been discussed ahead of Sunday's Six Nations game in Edinburgh.\nScotland's last win over Ireland came in the Six Nations at Murrayfield in 2017.\nBoth sides won their opening matches as Ireland defeated England in Dublin while Scotland battled past Italy.\n\"To be honest, I didn't even know there was a streak like that,\" said Keenan, who added Ireland's win over England was \"a good start\" to the Six Nations.\n\"It's not something we talk about. We don't look at our successes against them in the past.\n\"We just take it for each game that comes around. We're not looking at any history records, I suppose.\"\nIreland are aiming to win an unprecedented third Six Nations title in a row and Keenan, 28, feels their second match with Scotland will be \"such a tough battle\".\n\"I can just remember the tough games and match-ups that we've had them over the last number of years and how it's always so competitive,\" he said.\n\"They're in a good, rich vein of form and they'll be fancying themselves, so we're just taking them for the team that is in front of us this week and not really looking back too much on the years gone by.\n\"It's going to be a huge challenge for us. I know they're hugely up for it and we've just got to match that and bring more to the party as well.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvg900g6wqgo"}