{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:20", "date_modify": "2025-05-21 07:24:20", "date_publish": "2025-05-19 19:30:44", "description": "'It's a massive shock' - Cammy Kerr on Tony Docherty's Dundee dismissal", "filename": "sport_articles_c93l459vvpyo_1747812260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13cc/live/5476ffe0-34e7-11f0-88e5-8bd4dc0ade3a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c93l459vvpyo_1747812260.html", "title": "'It's a massive shock'", "title_page": "'It's a massive shock' - Cammy Kerr on Tony Docherty's Dundee dismissal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Dundee right-back Cammy Kerr admits he was \"shocked\" at the timing of Tony Docherty's dismissal but appreciates its been a \"disappointing\" season for those at Dens Park.\nDocherty was sacked the morning after the Dark Blues secured their Scottish Premiership status finishing tenth, having ended the season before in the top-six.\n\"It's definitely not the season that he would have wanted, the club would have wanted in terms of where they were last year,\" Kerr told BBC Scotland, \"so, it's been a disappointing season\".\n\"I know that there's been a bit of frustration from the fans and at times probably, rightly so, but they got over the line when they needed to so it'll be a massive shock to him as well.\n\"I was shocked in terms of the timing of which it came out. I obviously know it was the Player of the Year event last night and all the staff were at as well so in terms of the timing to come out that quickly this morning after the season's just finished, it's a shock.\"\nKerr hinted at the notion Docherty was perhaps a victim of his own success, raising the bar to a top-six height in his first season.\n\"I've been at Dundee a long time and I know what the club's all about,\" the Queen's Park defender added.\n\"I know what the fans expect and the Dundee fans can't expect too much at times. They probably won't want to admit that, but they do.\n\"After last season, it was always going to be a hard feat to beat that this season and I think on the back of last season you need to remember that Hibs, Aberdeen, they had really poor seasons - not taking anything away from Dundee - so to go and do that again this year was going to be incredibly tough.\n\"I just think in the manner in which the results have come about this season, I think a lot of the performances haven't been what the fans have really thought a Dundee team should be.\n\"I'd like to think that you know the football club, there's a certain expectation of what it means to play for Dundee and I think that's maybe been missing in a few performances this season.\"\nTo ensure that doesn't happen again, Kerr has tipped the next appointment to be someone \"connected\" with Dundee and who \"knows the football club inside out\".\n\"For me, it's got to be somebody that's connected to the football club, that knows the football club, but that'll be a decision for John Nelms and all the other people that make those decisions to make.\"", "url": "https://www.bbc.com/sport/articles/c93l459vvpyo"}