{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 13:48:53", "date_modify": "2025-05-20 13:48:53", "date_publish": "2023-07-31 11:56:34", "description": "Former England forward Eniola Aluko says Japan are the best team she has seen at the Women's World Cup after a 4-0 win over Spain.", "filename": "sport_football_66360475_1747748933.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/128A3/production/_130593957_gettyimages-1582436613.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66360475_1747748933.html", "title": "Women's World Cup 2023: Japan 'a joy to watch'", "title_page": "Women's World Cup 2023: Japan 'a joy to watch' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japan have fallen on harder times since the golden age when they won the 2011 Women's World Cup.\nTwelve years on from that triumph in Germany, could the good times be about to return?\nThe Nadeshiko sent out a powerful message that they mean business at the 2023 edition by destroying Spain 4-0 in Wellington to finish top of Group C and advance to the last 16.\n\"Japan's shape, defensive play, their counter-attacking play was a masterclass,\" said former Spain midfielder Vicky Losada on ITV.\nFormer England forward Eniola Aluko added: \"That's the best team I think we've seen in this World Cup in every way.\"\nA match against Norway back in New Zealand's capital on Saturday at 09:00 BST awaits Japan.\nHaving gone out at the last-16 stage in France in 2019, are they good enough to go all the way this time?\nJapan manager Futoshi Ikeda spent 15 minutes answering questions in his post-match news conference at the Wellington Regional Stadium before being clapped out of the room by the Japanese media.\nEarlier, his players left the pitch to a standing ovation after a thumping win over a Spain team who sit sixth in the Fifa rankings - five places above Japan.\nJapan look solid at the back and devastating going forward.\nThey are yet to concede in three games in New Zealand, while they have scored a tournament-high 11 goals.\nIn addition, Hinata Miyazawa is the leading scorer at the World Cup after adding two goals to the double she scored against Zambia in the opening group game.\nIncredibly, Japan outsmarted Spain despite having only 23% possession.\n\"Japan don't waste chances,\" former Republic of Ireland goalkeeper Emma Byrne told ITV.\n\"Three chances, three goals before half-time. Forget the possession stats - I'd rather have that.\"\nThis is just the second time Japan have won all of their group stage games in a single edition of the Women's World Cup, along with the 2015 tournament.\nEight years ago they reached the final before losing to the United States in the final, and Losada believes they could make it all the way through to this final in Sydney on 20 August.\n\"It's a masterclass by Japan,\" she added.\n\"They've shown they can beat teams like Spain. It was a joy to watch from the Japanese side.\"\nAluko added: \"Japan showed composure in everything they did. Whether it was the finishing, the shape, defensively - even when they were attacking, when they lost the ball, their counter-attacking play was exceptional.\"\nThe talent in Japan's squad runs deep.\nIkeda made five changes to the side that defeated Costa Rica 2-0 in Dunedin five days ago, whereas Spain made just one alteration, fielding what looked close to their strongest possible side.\nJapan's starting XI against Spain featured Liverpool midfielder Fuka Nagano and West Ham duo Risa Shimizu and Honoka Hayashi, while Manchester City midfielder Yui Hasegawa came on as a substitute.\nThere were impacts from the bench as Mina Tanaka scored a fine fourth goal following an assist by fellow substitute Miyabi Moriya.\n\"In the first and second games, we had more time to work with the ball but had to be wary of the counter-attack,\" said Ikeda.\n\"In this match against Spain, we knew we would have to defend for long periods. So we knew we would have to take advantage of every opportunity we had to play the game we wanted to.\n\"We were successful in this.\"", "url": "https://www.bbc.com/sport/football/66360475"}