{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:03:26", "date_modify": "2025-05-21 04:03:26", "date_publish": "2025-01-23 22:15:51", "description": "Ulster prop Corrie Barrett says it is \"a childhood dream\" to be part of the Irish province's squad after a somewhat nomadic rugby career so far.", "filename": "sport_rugby-union_articles_c5y6pey091go_1747800206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a673/live/67982bf0-d81a-11ef-9c2b-f324606bf591.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5y6pey091go_1747800206.html", "title": "Playing for Ulster 'a childhood dream' for Barrett", "title_page": "United Rugby Championship: Playing for Ulster 'a childhood dream' for Barrett - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster prop Corrie Barrett says it is a \"childhood dream\" to be part of the Irish province's squad after four years of playing his rugby in England.\nThe 26-year-old signed a deal until the end of the season after having a six-week trial in the summer.\nA former Schools' Cup winner with Royal Belfast Academical Institution in 2015-16, Barrett started playing club rugby for Instonians.\nThe front-rower, who can play either side of the scrum, was previously involved in the Ulster Rugby pathway, having played for Ulster Under-19s and Ulster 'A'.\nHis perhaps unorthodox rugby path would also see him turn out for Garryowen, Munster 'A', Bedford Blues, Saracens and most recently Doncaster Knights in the RFU Championship last season.\n\"It's home sweet home. I'm delighted after many years away to grind my way back here,\" Barrett told BBC Sport NI.\n\"You're going in through the Academies but I just missed out on an opportunity. The best advice I got was go and play some rugby, learn and expand your game and then it was always in the back of my mind to come back here.\n\"It's home, it's where my family are so when the opportunity came in the summer for a six-week trial I had to jump at it. Those few years in the Championship crafted who I am as a person and as a rugby player. They were valuable years.\"\nBarrett came on as a second-half replacement for Scott Wilson in last week's Investec Champions Cup win over Exeter in Belfast and is hopeful of being handed a chance to impress in Sunday's match against Zebre in the absence of the suspended Tom O'Toole.\n\"You never want to wish bad on anyone and the good thing about here [the Ulster squad] is there is no 'position hate'. We all help each other out so although it's unfortunate for him [suspended Tom O'Toole] it's fortunate for me.\n\"The opportunity is there for me to take and try and keep hold of the jersey.\n\"There's definitely a step up with the pressures of everything and obviously as a group you want to do as well as possible. But for me personally it's just about me doing my job to the best of my ability.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c5y6pey091go"}