{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 07:33:45", "date_modify": "2025-04-26 07:33:45", "date_publish": "2025-02-27 15:54:46", "description": "Crystal Palace: Prospect of regulator is paralysing football - Parish", "filename": "sport_football_articles_cx288qy427go_1745652825.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a36/live/00551060-f4fe-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx288qy427go_1745652825.html", "title": "Crystal Palace: Prospect of regulator is paralysing football", "title_page": "Crystal Palace: Prospect of regulator is paralysing football - Parish  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace chairman Steve Parish says the prospect of an independent regulator in football has \"basically paralysed the game\".\nThe Palace chairman and co-owner was speaking at the Financial Times Business of Football Summit, where he spoke about a wide range of topics including Crystal Palace, the Premier League and investment issues in football.\nParish is one of the most vocal in the owners and shareholders meeting and he was asked about what the potential introduction of a regulator could mean for the game.\n\"We have a problem that we are constantly being told that we are not a business and we're a sport. And that we are part too of the fabric of communities and that we need to prioritise winning over everything else and that's fair and that's why most of us go into it,\" Parish said.\n\"And then at the same time, we're in court being treated until the nth degree like a business.\n\"We have got the spectre of a government regulator as everybody knows, who unfortunately wants to interfere in all the things we don't want them to interfere in and help with none of the things we actually need help with it feels.\n\"The dynamic of English football has worked outstandingly over the years.\n\"The various different gravitational pulls of the EFL, the FA, the Premier League have got to the right answer.\"\nHowever, despite what Parish believes is positive in the current structure, he thinks that the prospect of new rules and a regulator is stopping the game from progressing.\n\"We are now in a complete paralysis because the government have put this spectre of a regulator and have basically paralysed the game and driven it into the courts,\" Parish said.\n\"I don't think that is good but I don't think it is the fault of the Premier League or the Premier League's leadership. I think that there are other factors that have contributed to that and they are doing their best to try and find a way through it.\n\"And all the time this still - very fortuitously and through a lot of hard work by people at the Premier League - it's one of the few sporting leagues that's growing its media value and growing its appeal globally and we need to take care of that.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx288qy427go"}