{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:01:55", "date_modify": "2025-05-21 05:01:55", "date_publish": "2025-04-04 10:12:23", "description": "Wrexham have added four new members to their board of directors, taking the total number of directors at the League One side to nine.", "filename": "sport_football_articles_crld3d7016po_1747803715.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04a1/live/1356be80-113b-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crld3d7016po_1747803715.html", "title": "Wrexham appoint four new board members", "title_page": "Wrexham appoint four new board members - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham have appointed four new directors to its board following approval by the English Football League (EFL).\nCaroline Hutchinson, Thayer Joyce, George Dewey and Ricky Engelberg have all joined the League One club's board - taking the total number of Wrexham AFC Limited directors to nine.\nThe club states the newly-appointed directors will \"further strengthen the board providing an enhanced governance structure to support the CEO and senior leadership team\".\nCommenting on the appointments, co-chairmen Rob McElhenney and Ryan Reynolds said: \"Our four new directors are not new faces to people at Wrexham AFC or the town.\n\"They've already been working tirelessly to improve our fortunes on and off the pitch and we welcome them as official board directors while shamelessly asking them to continue right on doing what they're doing.\"\nKaleen Allyn - who became executive director in January - also sits on the board, along with Humphrey Ker and Shaun Harvey.\nDewey and Engelberg have both worked with Reynolds during their careers.\nDewey is executive producer of the Welcome to Wrexham documentary and is a co-founder - alongside Reynolds - of movie, TV series, content and advertising creators Maximum Effort.\nHe started his career as a writer with advertising agency McCann and was the marketer for Deadpool, which starred Reynolds, and Aviation Gin.\nDewey was also producer of movies including Free Guy, The Adam Project and Spirited.\nEngelberg was chief marketing officer at VistaPrint, who have been a shirt sponsor of Wrexham's under the ownership of Reynolds and McElhenney.\nHe also held numerous roles with global sports brand Nike and is a partner in Reynolds' Maximum Effort firm.\nHutchinson has operated as a ventures principal for McElhenney's More Better Industries.\nJoyce has served as chief operating officer for the It's Always Sunny in Philadelphia actor's company.\nA Wrexham statement read: \"Caroline, Thayer, George and Ricky all come with a huge amount of experience from different areas of the US sports and entertainment industry and are well versed in the growth of the club and the Wrexham brand outside the UK through their roles at More Better and Maximum Effort.\"\nWrexham sit second in League One, three points above Wycombe Wanderers who are third, although the Chairboys have a game in hand.\nPhil Parkinson's side return to action against Burton Albion at the Stok Racecourse on Saturday (12:30 BST).", "url": "https://www.bbc.com/sport/football/articles/crld3d7016po"}