{"authors": ["Daniel Austin", "www.facebook.com"], "date_download": "2025-05-21 07:34:15", "date_modify": "2025-05-21 07:34:15", "date_publish": "2025-05-20 14:18:56", "description": "How are stadiums selected for European finals and who will host them in 2026 and 2027?", "filename": "sport_football_articles_cn4qjg0ez4xo_1747812855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8aec/live/d4ed7d90-355d-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4qjg0ez4xo_1747812855.html", "title": "Uefa finals: How are host stadiums chosen?", "title_page": "Uefa finals: How are host stadiums chosen? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The stadiums that host the annual finals of the European club competitions - the Champions League, Europa League, and Conference League - are selected by governing body Uefa.\nA few years before each final, the Uefa general secretary sends a letter to each of its 55 member associations inviting bids from prospective host nations and stadiums. The letter sets out which finals are available to bid for, and what the minimum criteria is for a bid to be submitted.\nNational football associations and stadium operators who are interested then work together to create a bid, attempting to present a convincing case in areas including stadium access, regional events, hospitality, and security.\nInterested parties then submit a bid dossier to Uefa, which is evaluated against those submitted by rival bidders. During evaluation, Uefa may ask bidders for more information or firmer commitments on matters like renovations works.\nBidding periods are often open for multiple seasons, meaning bidders can ask to host a final in a specific year, or register their interest for any final across a period of a few years.\nUefa ranks stadiums across Europe in four categories, with one being the lowest and four the highest.\nOnly category-four stadiums can host major finals. A category-four stadium must have a capacity of at least 8,000 and meet a plethora of other qualifying criteria, which include stringent rules on facilities including:\nPitch and dressing-room sizes\nLevel of floodlighting\nCCTV coverage\nNumber of turnstiles, media working positions, and parking spaces for broadcast vans and VIPs\nRegional infrastructure - like airport capacity, number of available hotel rooms, and transport - is also taken into account when bids are appraised.\nThe men's Champions League final is typically held in stadiums with a capacity of at least 65,000, and in the past four seasons only stadiums with more than 70,000 seats have been chosen.\nOnly three stadiums with a capacity less than 60,000 have hosted the Champions League final this century - Hampden Park in Glasgow in 2002 (51,866), Arena AufSchalke in Gelsenkirchen in 2004 (54,740), and Porto's Estadio do Dragao (50,033) in the Covid-impacted 2021 final.\nFor the Europa League, the most recent letter of invitation circulated by Uefa stipulated bidding stadiums were required to have a capacity of 40,000-60,000.\nThe Conference League was launched by Uefa in 2021 with the goal of giving clubs in less economically strong national leagues the opportunity to compete in the latter stages of European competition, and so far the tournament's finals have been held in smaller stadiums in countries that do not typically host major events.\nThe 42,000-capacity Wroclaw Stadion in Poland, which will host the 2024-25 showpiece, will become the largest to have hosted the Conference League final.\nIn previous seasons, the Agia Sophia Stadium in Athens (32,500) and the Fortuna Arena in Prague (19,370) have both hosted the final.\nThis article is the latest from BBC Sport's Ask Me Anything team. Ask Me Anything is a service dedicated to answering your questions.\nWe want to reward your time by telling you things you do not know and reminding you of things you do.\nThe team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.\nWe will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.\nOur coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.", "url": "https://www.bbc.com/sport/football/articles/cn4qjg0ez4xo"}