{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-04-26 06:41:38", "date_modify": "2025-04-26 06:41:38", "date_publish": "2025-03-02 12:32:00", "description": "Shaughnessy feels 'stronger than ever' after injury return", "filename": "sport_articles_czx7yvwgplno_1745649698.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f00/live/9eb2be10-f760-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_czx7yvwgplno_1745649698.html", "title": "Shaughnessy feels 'stronger than ever' after injury return", "title_page": "Shaughnessy feels 'stronger than ever' after injury return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dundee captain Joe Shaughnessy says he's feeling \"stronger than ever\" after making his first start for the club in 11 months.\nThe 32-year-old defender injured his knee against Rangers last April but made his full return in the 1-1 draw with St Johnstone on Saturday.\n\"To come through a game like that today, although I was cramping up after an hour, shows my fitness wasn't too far off it,\" Shaughnessy told BBC Scotland. \"I didn't feel like I was out of place. I felt stronger than I've ever been because I've had eight months in the gym.\n\"That's been the main frustration over the last 10 months, watching from the side, not feeling you're able to help out as much. It's good to be back now and help the lads out as much as I can.\"\nShaughnessy started every game before the split last season, helping Dundee sneak into the split before rupturing his ACL.\n\"It was eight minutes into the game against Rangers last April,\" the Irishman explained. \"I stepped backwards, there was no one near me, and my knee just popped in the way. No pain, but I knew it was gone, it was ruptured.\n\"From then I got the scan, got the operation, and then the physio and sports scientist had a programme for me. It was just a case of following that and trying not to get too bogged down in how long it was going to take me.\"\nThe skipper found it especially hard not being able to add his voice on the training pitch, as manager Tony Docherty overhauled the squad in the summer.\n\"You've got all these new players coming in and I'm trying to have an influence around the place as the captain,\" Shaughnessy explained.\n\"They're coming in and none of them have seen me play. It's a bit unusual. I'm not maybe as vocal in the dressing room, but I am on the training pitch. That's where you see me, but they weren't seeing any of that. I was trying to find my place over the summer, that was tough.\"", "url": "https://www.bbc.co.uk/sport/articles/czx7yvwgplno"}