{"authors": ["Andrew Petrie", "www.facebook.com"], "date_download": "2025-05-20 12:08:07", "date_modify": "2025-05-20 12:08:07", "date_publish": "2023-08-05 10:25:39", "description": "Dundee and Motherwell share the points at a soaking wet Dens Park on the opening day of the Scottish Premiership season", "filename": "sport_football_66194488_1747742887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6C80/production/_130667772_20812091.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194488_1747742887.html", "title": "Dundee 1-1 Motherwell: Dundee return to top flight with deserved point", "title_page": "Dundee 1-1 Motherwell: Dundee return to top flight with deserved point - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee's return to the Scottish Premiership was marked with a hard-fought draw with Motherwell at a rain-soaked Dens Park.\nTheo Bair scored a debut goal on the brink of half-time for Stuart Kettlewell's visitors before Lyall Cameron's back-post header levelled the score.\nTony Docherty's side looked more likely to find a winner, hitting the post twice through the hard work of Luke McCowan, but they could not find a way to goal.\nIt means Kettlewell has still not lost an away match as Motherwell manager since taking charge in February.\nThe setting was similar to the Scotland v Georgia game back in June - rain hammering down and threatening to turn the game into a complete washout.\nMotherwell threw Bair into the deep end, starting the Canadian striker up top despite only signing on Tuesday. He repaid the manager's faith in him, sweeping home Stephen O'Donnell's cross moments before the break.\nThe hosts came flying out the traps in the second-half and got the goal they deserved as Cameron turned in at the back post. They also came inches away on two occasions as Motherwell keeper Liam Kelly watched the ball strike his woodwork.\nA late rally from the visitors threatened to send all three points to Lanarkshire, but Lennon Miller's goal-bound drive was deflected wide by Joe Shaughnessy.\nIt's hard to tell if the torrential rain made this game more of a spectacle or not. The players battled hard against the conditions, which led to thrills and spills aplenty.\nIf either side was nervous on the opening day of the season, it was hard to tell. Both were clearly keen to play football - Motherwell building through Miller, Spittal and Slattery while Dundee countered with Cameron and McCowan.\nAnd both sides could also be upset only leaving with a point. In spite of the conditions, they created chances to score and showed a great desire to play the game.\nDundee manager Tony Docherty: \"Going in at 1-0 down at half-time was against the run of play, probably a bit unjust. We were the better team in the first half. It was important that we showed the belief we could still get something from the game and I was really pleased with the response.\n\"We hit the post twice, and we're unlucky not to win. We had 17 shots, and I thought we were the better time. I'm a little disappointed not to win the game.\"\nMotherwell boss Stuart Kettlewell: \"It was a hard fought game. It was almost like a November-December fixture, because of the conditions. It was incredible, it never stopped throughout the match. There was doubt surrounding the game, because of the water on the far side.\n\"We put ourselves in a good position and the disappointment comes from the nature of the goal that we concede. A draw is probably a fair result.\"", "url": "https://www.bbc.com/sport/football/66194488"}