{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:57", "date_modify": "2025-05-21 07:59:57", "date_publish": "2025-01-04 00:00:00", "description": "Relive coverage of Saturday's action in League One and League Two.", "filename": "sport_football_live_cy0nnpnzkdxt_1747814397.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy0nnpnzkdxt_1747814397.html", "title": "EFL League One and Two LIVE: Relive Saturday's matches", "title_page": "EFL League One and Two LIVE: Relive Saturday's matches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All wrapped up!\n#bbcefl\nWhew.\nThat late Blackpool equaliser was quite the heart-rate raiser - just what you need on a chilly afternoon!\nIt means Wycombe Wanderers hand their top spot in League One to Birmingham City while none of the teams in the bottom four got any closer to escaping the relegation scrap.\nBut over in League Two, there's been quite the shuffle with more yet to come.\nJoin us tomorrow for more action in the fourth tier, when AFC Wimbledon and Crewe Alexandra will try to take a place in the automatic promotion spots.\nSee you then!\nThe League Two table\nSalford are second in League Two after making it six wins in a row with a 1-0 win at MK Dons.\nPort Vale move up to third after picking up their first league win since 16 November over Doncaster, who drop down to sixth.\nNotts County also moved up the table into fifth after they returned to winning ways against Swindon.\nBradford leapfrog Grimsby into eighth after their 3-1 win over the Mariners.\nHarrogate, who had lost six of their past seven league games, picked up a big win over Barrow to move them five points clear of the drop zone.\nTranmere also moved five points above the relegation zone after beating bottom club Carlisle 1-0 in the big game at the foot of the table.\nThe League One table\nBirmingham are the new leaders of League One, thanks to their 3-0 win at Wigan and Blackpool's late equaliser at 10-man Wycombe.\nMatt Bloomfield's side are now level on points with third-placed Wrexham, who scored a late winner against Peterborough.\nBarnsley's comfortable home win strengthened their play-off hopes, while at the other end of the table there were crucial wins for Bristol Rovers and Northampton.\nFULL-TIME\nWycombe 1-1 Blackpool\nBlackpool rescue a point as the 10 men of Wycombe couldn't hold on.\nRichard Kone put the Chairboys ahead from the penalty spot shortly before half-time but Alex Hartridge was sent off for a second yellow 10 minutes into the second half.\nWycombe tried to cling on but Kyle Joseph struck three minutes into stoppage time for the Tangerines.\nIt means Wycombe now slip back to second after Birmingham beat Wigan.\nFULL-TIME\nDoncaster 1-2 Port Vale\nBig win for Port Vale who stop the rot of no wins in eight league games before today.\nDarren Moore's side last won in the league on 16 November but goals from Ryan Croasdale and Lorent Tolaj sees them move up to third in the League Two table.\nJamie Sterry's strike late on gave Doncaster hope but Vale hold on to pick up the three points.\nDefeat sees Grant McCann's side drop down to sixth.\nFULL-TIME\nHuddersfield 0-0 Rotherham\nPlenty of endeavour but no goals as it ends all square.\nBoth sides had chances to win the game but couldn't put the ball in the back of the net.\nPerhaps the biggest talking point in the end will be Huddersfield's Ruben Roosken seeing red just nine minutes after coming on.\nHonours even and second draw in a row for the Terriers. Three games without defeat now for the Millers.\nGOAL: Wycombe 1-1 Blackpool\nKyle Joseph (90+3 mins)\nBlackpool have grabbed a late equaliser and it's a devastating blow for Wycombe!\nKyle Joseph has surely rescued a point for the Tangerines with his seventh goal of the season.\nAlbie Morgan curls one in from the right and Joseph is there to get a toe on it, which loops up over the keeper into the back of the net.\nThe Chairboys couldn't hang on with 10 men.", "url": "https://www.bbc.com/sport/football/live/cy0nnpnzkdxt"}