{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:39:55", "date_modify": "2025-04-26 04:39:55", "date_publish": "2025-02-28 08:46:16", "description": "West Ham 2-0 Leicester: Fan views on Premier League win", "filename": "sport_football_articles_cvg55lp18gqo_1745642395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg55lp18gqo_1745642395.html", "title": "West Ham 2-0 Leicester: Fan views on Premier League win", "title_page": "West Ham 2-0 Leicester: Fan views on Premier League win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views after West Ham United beat Leicester City to record back-to-back wins in the Premier League on Thursday night.\nHere are some of your comments:\nShane: Steady as she goes - no drama, a clean sheet and a clear plan. The players finally look like they didn't first meet on the bus to the game. 'Harry' Potter is certainly starting to work his magic. Europe might be just beyond us this year, but I'm finally hopeful for next season.\nMatthew: Pretty dire from both teams, if I'm being honest. Maybe we edged it in terms of quality but it was still a very lethargic game overall. But two wins and clean sheets in a row.\nBubba: Poor Leicester have given up. This was like a friendly practice game for us, a nice opportunity to work on tactics and so on. Three points are three points. The team put in a solid shift. I'm not sure we are there yet, though.\nBarry: A good, dominant display. Leicester were pretty toothless, but we did what was necessary. A professional and controlled display plus a great win. Todibo is looking good under Potter and Tommy got a great goal on his birthday. It felt like watching a pre-season game. Still, three more points on the board.", "url": "https://www.bbc.co.uk/sport/football/articles/cvg55lp18gqo"}