{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 05:49:58", "date_modify": "2025-05-21 05:49:58", "date_publish": "2025-01-31 15:53:42", "description": "Dundee United: Jim Goodwin keen to keep morale high after recent defeats", "filename": "sport_articles_cg45nlkd3dwo_1747806598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4a38/live/bded0e90-dfbc-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg45nlkd3dwo_1747806598.html", "title": "Goodwin keen to keep morale high after recent defeats", "title_page": "Dundee United: Jim Goodwin keen to keep morale high after recent defeats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United manager Jim Goodwin says his side must not \"get too down\" on themselves after a poor run of January results.\nUnited have lost four of their past five matches in all competitions, but still sit third in the Scottish Premiership, two points ahead of fourth-placed Aberdeen.\nGoodwin, whose side are away to Kilmarnock on Saturday, insists context is needed when analysing United's poor recent form and is confident of maintaining their league position.\n\"Obviously there have been a few defeats in there in recent weeks,\" Goodwin said. \"Prior to the Rangers game our form actually wasn't all that bad, we had won four of the previous six league games.\n\"I look at the defeats we have had - Rangers, Celtic, the Hearts game [had] very little in it, they narrowly beat us 1-0. Anybody that watched the Dundee cup game saw the amount of good opportunities we had to get back into that game.\n\"It is important we don't get too down on ourselves. We have won four of the previous seven [league games]; if we win four of the next seven then we put ourselves in a great position for that top-six position.\"\nUnited's impressive away form has been a feature on their return to the top flight, and they will fancy another victory on the road against a second-bottom Killie side that have won just one of their past five league games.\n\"I think Kilmarnock with Derek McInnes in charge will gradually pull themselves away from the position they are in,\" Goodwin added.\n\"They have some very good players in their squad and they gave us a big fright the last time we were down there, so we know what to expect from Kilmarnock.\n\"It is going to be a tough fixture for us, no doubt. Two teams that want to get back to winning ways and it should make for a very good game of football.\"", "url": "https://www.bbc.com/sport/articles/cg45nlkd3dwo"}