{"authors": ["Charlotte Coates", "www.facebook.com"], "date_download": "2025-05-21 03:49:05", "date_modify": "2025-05-21 03:49:05", "date_publish": "2025-02-01 17:32:33", "description": "Newcastle 1-2 Fulham: Magpies falter ahead of big week", "filename": "sport_football_articles_cdjdn9e4j14o_1747799345.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5dce/live/27739190-e0c1-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdjdn9e4j14o_1747799345.html", "title": "Newcastle 1-2 Fulham: Magpies falter ahead of big week", "title_page": "Newcastle 1-2 Fulham: Magpies falter ahead of big week - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When the referee blew his whistle for half-time, Newcastle fans could not have been much happier as they were 45 minutes away from moving into the top four ahead of their semi-final showdown with Arsenal.\nThe Gunners make the trip north to St James' Park on Wednesday as the Magpies look to land another trip to Wembley for the League Cup final.\nWas this the worst possible preparation for that? Quite possibly. For the first time in a year, Newcastle have lost two home games on the spin.\n\"It's the second home game in a row where we haven't performed and that's a huge frustration for us,\" said boss Eddie Howe to BBC Match of the Day.\nHowe's side were well in control up until the half-time whistle and they Marco Silva worked his magic at the break, leading to Fulham flying out of the blocks for the second period and looking dangerous on the attack.\nIt looked only a matter of time before Fulham found their leveller and once Raul Jimenez had done just that, it looked like the game would go either way.\nYou could see the disappointment on the Newcastle faces once Substitute Rodrigo Muniz turned in the winner as they knew this was three points that had slipped through their grasp.", "url": "https://www.bbc.com/sport/football/articles/cdjdn9e4j14o"}