{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 13:01:24", "date_modify": "2025-05-20 13:01:24", "date_publish": "2023-08-01 11:39:03", "description": "David Harrison will run Glamorgan's One Day Cup campaign after Mark Alleyne is moved to an assistant coach role with Welsh Fire.", "filename": "sport_cricket_66373586_1747746084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B950/production/_130604474_cdf_290322_glamorgancccphotocall36.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66373586_1747746084.html", "title": "David Harrison to run Glamorgan for One Day Cup", "title_page": "David Harrison to run Glamorgan for One Day Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Harrison will be in charge of Glamorgan's One Day Cup campaign after white-ball coach Mark Alleyne was appointed as a Welsh Fire assistant coach.\nHarrison will be the third different head coach used by Glamorgan in the three different formats this year.\nAlleyne ran the team in the T20 Blast and was expected to do so again for the 50 overs tournament.\nBut both he and Matthew Maynard will work with Mike Hussey in the Hundred.\nThe temporary move of Alleyne and Championship head coach Maynard to the franchise event means Harrison takes control of the One Day Cup for the third year running.\nGlamorgan won the trophy on his watch in 2021, the first year it ran alongside the Hundred, topping their group before beating Essex and then Durham in the final.\nThey narrowly failed to qualify for the knockout stages in 2022, winning four from eight.\nHarrison, 42, has been part of Glamorgan's coaching staff since his enforced retirement from playing in 2011, also working for England's second tier Lions side.\nGlamorgan will be without Chris Cooke and Dan Douthwaite on Welsh Fire duty, while Championship captain David Lloyd has been allowed to play for Derbyshire on loan ahead of his transfer there - although he is due to return in September for the end of Glamorgan's four-day promotion effort.\nKiran Carlson will captain the One Day Cup side for the third successive year, starting away to Worcestershire on Friday, 4 August.", "url": "https://www.bbc.com/sport/cricket/66373586"}