{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 06:35:09", "date_modify": "2025-05-21 06:35:09", "date_publish": "2025-01-31 08:55:09", "description": "Cornish Pirates say they will begin talks about upgrading their home at the Mennaye Field.", "filename": "sport_rugby-union_articles_cyv4g7dmpd4o_1747809309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3af5/live/57825c00-df30-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cyv4g7dmpd4o_1747809309.html", "title": "Cornish Pirates look into Mennaye Field improvements after takeover", "title_page": "Cornish Pirates look into Mennaye Field improvements after takeover - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornish Pirates say they will begin talks about upgrading their Mennaye Field home.\nThe Championship club, who play at the home of Penzance and Newlyn RFC, were taken over by a consortium of four local businessmen on Thursday.\nThe club has long been looking for a home that would meet the Premiership's minimum standards.\nPlans for a new stadium capable of hosting rugby and football in Truro were shelved in 2022.\nTruro City Football Club opted to build their own ground on the outskirts of the city which opened last summer.\nThe club's new owners are setting up a development committee with Penzance and Newlyn RFC to look at ways of making the Mennaye - which has a capacity of 4,000 - better for fans.\n\"The Mennaye is our home and our heartland,\" chief executive Sally Pettipher told BBC Sport.\n\"We are here and we want to be a really competitive Championship club here, possibly a Premiership club.\n\"We've got some quite grand plans this year to improve what's here and then we're going to sit and look at a masterplan for the future.\n\"This will be a step change, as we have in leadership, so it'll be on the ground.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cyv4g7dmpd4o"}