{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:07:36", "date_modify": "2025-04-26 08:07:36", "date_publish": "2025-02-26 14:11:47", "description": "Kildare goalkeeper Mary Hulgraine tells The GAA Social how her faith and beloved dog helped turn her life around following battles against alcohol and drug addiction.", "filename": "sport_articles_cj675g170ggo_1745654856.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d558/live/cd356f90-f435-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cj675g170ggo_1745654856.html", "title": "The GAA Social: Kildare keeper Mary Hulgraine on recovery after addiction battles", "title_page": "The GAA Social: Kildare keeper Mary Hulgraine on recovery after addiction battles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kildare goalkeeper Mary Hulgraine is this week's guest on The GAA Social as she reveals how her religious faith helped turn her life around following a lengthy battle against alcohol and drug addiction.\nHulgraine will be in Crossmaglen on Sunday when Kildare face Armagh in Division One of the Ladies National Football League.\nThe podcast explores faith in a modern Ireland and is a fascinating insight into recovery and second chances.\n\"When I look back and see say 2016, it's a million miles away from where I am today playing football,\" Mary told Thomas and Oisin.\n\"My preparation is impeccable [now]. Looking back then, I was drinking the night before an All-Ireland Final.\"\nHulgraine added that she has to battle against a sense of \"shame\" that can envelope her when she thinks about those dark days.\n\"I really do work and praying over it and that shame and condemnation that comes with stuff, I really do have to try and not let that get in.\n\"That's a battle. That's called spiritual warfare I suppose. It's a constant battle to be like 'I'm not listening to you today'. I have a bit of work to do yet I think.\"\nThe Kildare keeper also talks about the role her beloved dog Bailey played in her recovery.\n\"I was anxious when I wasn't with him. There was a very strong emotional attachment there.\n\"Someone said 'God brought that dog to keep you going and now he's saying, his job is done…..we're bringing him home',\" said Mary of Bailey, who had to be put to sleep last June because of illness.", "url": "https://www.bbc.co.uk/sport/articles/cj675g170ggo"}