{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:39:53", "date_modify": "2025-05-20 11:39:53", "date_publish": "2023-08-06 22:43:21", "description": "Hart in mouth for Celtic fans left lukewarm by start", "filename": "sport_articles_cn4g9my0n8ro_1747741193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/381c/live/4ac60480-34aa-11ee-bde6-7ffba94c56ae.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cn4g9my0n8ro_1747741193.html", "title": "Hart in mouth for Celtic fans left lukewarm by start", "title_page": "Hart in mouth for Celtic fans left lukewarm by start - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your reaction to Celtic's 4-2 win at home to Ross County as they start the defence of the Scottish title under returning manager Brendan Rodgers and the responses were mixed.\nConor: Celtic looked slow and complacent. Joe Hart has never looked quite good enough, but that was downright awful. If Ross County can pressure him into so many mistakes, he will be embarrassed in Europe. David Turnbull is a good player but is not dynamic enough to start ahead of Reo Hatate. Yang Hyun-jun looks promising, though, and keeping Kyogo is invaluable.\nIain: Not bad for the first game of the season, but I wish Celtic would stick to the direct format used by Ange Postecoglou. We are also returning to playing the ball round the back again and we all know where that got us. Carl Starfelt has to go - hurry up Spartak Moscow.\nEwan: Joe Hart yet again embarrassing himself. Thanks for the last two years, but we can't be sentimental. He doesn't have it any more and should just retire. No team is taking a goalkeeper that poor.\nMichael: Not a great performance. Joe Hart needs replacing in goal - and the defence except from Cameron Carter-Vickers. As for Brendan Rodgers coming back twice, it doesn't work for me. I do hope I'm wrong.", "url": "https://www.bbc.com/sport/articles/cn4g9my0n8ro"}