{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:00:00", "date_modify": "2025-04-26 04:00:00", "date_publish": "2025-03-04 05:32:09", "description": "Cardiff City: Bluebirds look to match clean sheet experts Burnley", "filename": "sport_football_articles_cd0nlx0vpj2o_1745640000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23c7/live/ad3a62f0-f858-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd0nlx0vpj2o_1745640000.html", "title": "Cardiff City: Bluebirds look to match clean sheet experts Burnley", "title_page": "Cardiff City: Bluebirds look to match clean sheet experts Burnley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City boss Omer Riza wants his side to show their own defensive improvements when they take on clean sheet experts Burnley.\nThe Bluebirds welcome Scott Parker's promotion chasers to Cardiff City Stadium on Tuesday (19:45 GMT) after both were knocked out of the FA Cup over the weekend.\nWhile Cardiff bowed out of the fifth round to Premier League Aston Villa, Burnley were surprisingly knocked out by fellow Championship side Preston.\nWhat was more surprising was the Clarets conceding three times given they are on course to break a whole host of defensive records, including having already kept 25 clean sheets in the league this season.\nThat includes a second-tier record 12 in a row as they prepare to head to south Wales, just two short of equalling Manchester United's consecutive shut-out record of 14.\nThey have conceded just nine Championship goals all term - Chelsea hold English football's league record with 15 in 2004-05.\nCardiff have had their struggles at the back – including shipping seven against Leeds United at the start of last month – with only three sides conceding more than their 55 so far this term.\nHowever, Riza was keen to point out his side's eye-catching display as they held Champions League-level opposition at bay for 68 minutes at Villa Park.\n\"We've been doing well – we've lost two in 12 – so our run's been okay,\" said Riza, whose side go into the game five points and two places above the bottom three.\n\"So we're working off something solid and the boys have proved their levels of defensive focus against a very good Premier League side who are in the knock-out stages of the Champions League.\n\"We can take heart from that. Burnley is a tough game against a side who don't concede many goals, but we go into it with a lot of confidence.\n\"If we are solid and focussed and don't concede goals, we have proven we have the potential to score goals – and that's what we are looking to do.\"\nCardiff have only kept four clean sheets themselves in the league this season but the last was only a week ago in a significant home win over fellow strugglers Hull City.\nAnd Riza is keen for the positives and pride found in a defiant display at Villa to be taken into their final 12 games of the campaign, saying: \"The momentum we've gained from the cup run for the league has been great with respect to our confidence levels. We're out now and our focus is on the league and we'll take the positives into it.\n\"Our performance levels have been good and we've been unlucky at times picking up one point instead of all three.\n\"The defensive focus is something we'll take into the league because we've proven we can do it. \"\nOn-loan Leicester City winger Will Alves could return from injury to feature while midfielder Alex Robertson should be available after making his fitness comeback off the bench at Villa.", "url": "https://www.bbc.co.uk/sport/football/articles/cd0nlx0vpj2o"}