{"authors": ["Mark Sanderson", "www.facebook.com"], "date_download": "2025-05-20 14:00:04", "date_modify": "2025-05-20 14:00:04", "date_publish": "2023-07-31 07:00:07", "description": "After he led Luton back to the top flight, BBC Sport talks to those who have played under manager Rob Edwards.", "filename": "sport_football_66164148_1747749604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/102EC/production/_130348266_gettyimages-1258225106.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66164148_1747749604.html", "title": "Luton Town: 'He's a winner' - the rise and rise of Rob Edwards as Premier League awaits", "title_page": "Luton Town: 'He's a winner' - the rise and rise of Rob Edwards as Premier League awaits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town's promotion to the Premier League came in Manchester City's treble season, both going down as startling achievements in 2022-23.\nIn his first season in charge at Kenilworth Road, Luton's Rob Edwards achieved what the club's previous 21 managers had been unable to do - he took the club back to the top flight.\nIncredibly, promotion came just nine years after the Hatters were playing in non league.\nLike Luton Town, Edwards has been on an upward trajectory over the last decade. The former Wales, Wolves and Blackpool defender went into coaching aged just 30, after retiring from playing due to injury.\nThe 40-year-old has made a lasting impression on those he has managed since, who suggest there's yet more to come from their former coach.\nIn 2014, Luton gained promotion back to the Football League, the same time as Edwards turned down the opportunity to become a permanent youth coach with Manchester City to take a role with the academy at Wolves.\nIt was at Molineux in 2019 that he guided the under-23s into the top tier of Premier League 2. Then in 2022, he took Forest Green Rovers up as League Two winners.\nMuch like with Luton's penalty shoot-out promotion, both of his earlier big achievements saw dramatic finales.\nGateshead midfielder Ed Francis was part of that Wolves under-23 team, having been coached by Edwards at Manchester City.\nFrancis said: \"It was only for about six weeks, but he made a real impression on me and was one of the main reasons I went to Wolves. Everyone he's coached will tell you about his man-management, he was so good for me. The culture he was able to create was through his ability to manage us as a group.\"\nFrancis points to Edwards' communication skills, which were vital when dealing with a group with aspirations of the first team. \"He always treats people well and is honest with them. Even those not playing regularly bought into what he was trying to achieve.\"\nThe young Wolves set up their opportunity to win the second division Premier League 2 title by beating Stoke - Francis getting the winner. They had to go to Manchester United and win to have any chance of securing the trophy. This looked far from likely after going 2-0 down to a strong United side featuring Angel Gomes, now a Lille player.\nFrancis recalls United having a great chance to go three up, yet Wolves pulled off a 3-2 victory.\n\"We probably shouldn't have won it, but we did,\" said Francis. \"He [Edwards] seems to have that knack. The way that game went gave you goosebumps.\"\nDerry City midfielder Sadou Diallo was a team-mate of Francis at Wolves. \"I still think about that night against United- it was an emotional one,\" he said.\nBut at half-time and losing 1-0, Diallo felt particularly down. \"I felt defeated - I hadn't had the best of halves, but he (Edwards) noticed and came over to see how I was. He just told me to keep going.\"\nThose reassuring words would prove a great tonic. Despite going 2-0 down early in the second half, Edwards' Wolves found a way to win. They pulled one back with 10 minutes to go, equalised with two left, before Diallo tucked home the winner in injury time, thrilling the 350-plus travelling Wolves fans.\n\"He is a great man manager,\" said Diallo.\nHe also points to the passion Edwards has for his work, which is evident in the footage showing jubilant scenes from the sidelines. By 2021, Edwards was appointed by Forest Green Rovers, and he brought Diallo with him.\n\"The club had come close to getting to League One the season before,\" says Diallo. \"Rob brought the players together and spoke of his expectations. As well as his man-management skills, he's very hands-on when it comes to training. He'd take all the sessions and is very detailed. He's good with the group, but he's good at giving instruction individually, too.\n\"Looking back, we could have won League Two weeks earlier, but ended up doing so on the last day at Mansfield.\"\nThey did so on goal difference, as Diallo recalls. \"I joked with him afterwards, you like doing things the hard way, don't you.\"\nThat appears to be the case. Edwards has been on record to say he's never hidden his ambition to reach the highest level. He left shortly Forest Green shortly after promotion to join Watford. Rovers owner Dale Vince was furious, claiming negotiations were held behind the club's back.\nThis was May, yet by September Edwards had been sacked after just 10 games, with the Hornets a point outside the play-off places.\nThe official line was that performances had not matched the owners' ambitions. Within two months, he was at Watford's rivals Luton and the rest is history.\nNeither Francis nor Diallo has been surprised to see Edwards move up to the Premier League.\n\"He's a winner,\" says Francis. \"I remember other coaches saying in five years he'll be in the Premier League.\"\nDiallo is equally enthusiastic. \"I'm not surprised at all. He's gone through all the levels, I think there's greater things to come from him.\"\nLuton now await the likes of Pep Guardiola's all-conquering City.\nAfter serving up one of the stories of last season, Edwards and his squad will be keen to write another chapter.", "url": "https://www.bbc.com/sport/football/66164148"}