{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:39", "date_modify": "2025-04-26 06:59:39", "date_publish": "2025-03-02 00:00:00", "description": "World record signing Naomi Girma makes her debut for Chelsea, who have to come from behind to salvage a draw at Brighton in the Women's Super League.", "filename": "sport_football_live_cm2n9wz4kkvt_1745650779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cde4/live/f6edc5a0-f78a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cm2n9wz4kkvt_1745650779.html", "title": "Girma makes debut but Chelsea draw with Brighton", "title_page": "Brighton & Hove Albion v Chelsea: Girma makes debut but Chelsea draw with Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "World record signing Naomi Girma made her Chelsea debut as the league leaders had to come from behind to salvage a draw at Brighton in the Women's Super League.\nGirma's debut did not go to plan though as she was forced off through injury before an hour was played with her side trailing 2-1.\nMarisa Olislagers had grabbed Brighton a deserved equaliser midway through the first half after Sandy Baltimore's brilliant volley put Chelsea in front.\nBrighton captain Vicky Losada then ran off celebrating with her arms outstretched after she gave the hosts the lead on the stroke of half-time, stunning the Chelsea side.\nThat capped off an outstanding first-half display from Dario Vidosic's side, who played with freedom and intensity, barely allowing Chelsea to retain possession.\nHowever, substitute Mayra Ramirez had an instant impact early on in the second half as it was her strike that rebounded for Lauren James to slot home, making it 2-2.\nThat came after Girma had signalled to the Chelsea bench she had a problem and was substituted immediately.\n\"It doesn't look too bad but we will need to have a scan tomorrow,\" said Chelsea manager Sonia Bompastor afterwards.\n\"She is learning about the league and her team-mates. As you could see, it was never easy because it is a competitive league. It was tough in this game.\"\nBrighton, who continued to carry a threat, had to hold off Chelsea's late attempts to find a winner as Johanna Rytting Kaneryd and James forced smart saves from goalkeeper Melina Loeck.\nIt was a deserved and hard-earned point for Brighton while Chelsea, who battled to maintain their unbeaten record, still sit top of the table.\nGirma was given an instant taste of how life will be in the WSL as Brighton went at Chelsea from the first minute in a relentless and exhilarating first half.\nThe USA defender had to make an early block to deny Madison Haley after Fran Kirby – facing her former club for the first time in the league - had won the ball high up to mount an attack.\nBrighton maintained their pressure but it was the WSL leaders who broke the deadlock against the run of play when James' moment of magic down the right-hand side set up Baltimore.\nIt did not dent Brighton's momentum however as the hosts immediately responded with a chance at the other end when Nadine Noordam's backheel flick rolled inches past the far post.\nEngland international Nikita Parris then provided the through ball for Olislagers' smart equaliser and there were further chances for Brighton before captain Losada put them 2-1 up on the stroke of half-time with a side-footed finish from close range.\nGirma's afternoon was to get tougher in the second half as she was immediately tested by Haley in a one-on-one race down the right-hand side and forced into a crucial block inside the six-yard area which led to appeals for a penalty.\nShe was forced off through injury minutes later, compounding what had already been a difficult trip for Chelsea and a testing debut for the USA star.\nBut the WSL champions are where they are for a reason and they had quality to introduce off the bench with Ramirez making an impact.\nJames, who has been in fantastic form since her return from injury, was in the right place to slot home the equaliser – although she may have been offside.\nBrighton remained in the contest until the final whistle and were applauded off the pitch enthusiastically by the majority of the 4,490 in attendance.\nThey had struggled to perform in recent weeks but, as well as providing a valuable point, this display showed why they sit fifth in the WSL table.\n\"We had the opportunities to go 3-1 up. The first half was really, really good. We limited them and they didn't create too much of note,\" said Brighton boss Vidosic.\n\"In the second half, it's just that mental and physical aspect about being 2-1 up against the champions. It's all part of that process.\"", "url": "https://www.bbc.co.uk/sport/football/live/cm2n9wz4kkvt"}