{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:25", "date_modify": "2025-05-21 03:50:25", "date_publish": "2025-04-07 11:11:56", "description": "Liverpool news: Alexis Mac Allister on bouncing back from Fulham defeat", "filename": "sport_football_articles_cly2n7j9ryro_1747799425.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f81/live/44c3ab80-139e-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly2n7j9ryro_1747799425.html", "title": "Liverpool news: Alexis Mac Allister on bouncing back from Fulham defeat", "title_page": "Liverpool news: Alexis Mac Allister on bouncing back from Fulham defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alexis Mac Allister says Liverpool still have work to do to win the Premier League title and must cut out the mistakes that cost them against Fulham on Sunday, as the runaway leaders produced a poor defensive performance at Craven Cottage.\nTheir remaining seven league matches include home games against West Ham, Tottenham, Arsenal and Crystal Palace plus away fixtures against Leicester City, Chelsea and Brighton.\n\"I think there's going to be a lot of people saying that the Premier League is done but, in the dressing room, we know that it's not,\" said Argentina international Mac Allister after the 3-2 defeat.\n\"We still have a lot of games coming up and all of them are going to be really difficult in a league like this. Everyone is fighting for something.\"\nOne good thing for Arne Slot's side between now and the end of the season is that they will have a week to prepare for each of their remaining seven games, with no midweek matches left in the calendar.\nWhile nearest rivals Arsenal are involved in the Champions League this week, Liverpool have a clear week to prepare for West Ham's visit to Anfield on Sunday (14:00 BST).\n\"I'm pretty sure we will come back stronger and, in the next game, we will show what we can do,\" the midfielder added.", "url": "https://www.bbc.com/sport/football/articles/cly2n7j9ryro"}