{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:44", "date_modify": "2025-05-21 06:53:44", "date_publish": "2025-03-29 17:47:22", "description": "Boss Tom Cleverley says he had to get angry during half-time of Watford's scoreless draw with bottom side Plymouth.", "filename": "sport_football_articles_c2ljl4dy0kwo_1747810424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6ae/live/bd696650-0cc4-11f0-bc3f-7189b99ed678.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2ljl4dy0kwo_1747810424.html", "title": "Tom Cleverley 'rocket' brings Watford reaction but not result", "title_page": "Tom Cleverley 'rocket' brings Watford reaction but not result - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Tom Cleverley said he had to get angry during the half-time break of Watford's scoreless draw with bottom-of-the-table Plymouth Argyle.\n\"We wasted 45 minutes against a team that we're good enough to beat,\" Cleverley told BBC Three Counties Radio.\n\"We didn't play with enough tempo, enough desperation to score, enough penetration and there were too many unforced errors.\n\"There has to be a determination to break down that back line and I didn't see that. It's not just going to happen, you have to make it happen.\n\"The second half was how we should play. It was a more entertaining style, more direct, no mistakes. It's a bit of a head scratch how the ball's not found its way into the net, but that's the way it's been going for us.\n\"I've a lot of admiration for our second-half performance - how the players reacted to a bit of a rocket at half-time.\n\"There have only been two or three rockets this season. I feel the players are mentally strong enough to take them, otherwise I wouldn't do it.\n\"It probably wasn't my character when I was a player but I have developed it. It's a stressful job.\"", "url": "https://www.bbc.com/sport/football/articles/c2ljl4dy0kwo"}