{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:43", "date_modify": "2025-04-26 06:44:43", "date_publish": "2025-03-01 16:58:02", "description": "Leinster score six tries as they beat Cardiff 42-24 in Dublin to continue their perfect winning record this season.", "filename": "sport_rugby-union_articles_c5y0420rre9o_1745649883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7fc8/live/d6d27e40-f6b4-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c5y0420rre9o_1745649883.html", "title": "United Rugby Championship: Leinster beat Cardiff to continue winning record", "title_page": "United Rugby Championship: Leinster beat Cardiff to continue winning record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leinster maintained their 100% winning record this season as they scored six tries in a bonus-point 42-24 victory over Cardiff in Saturday's United Rugby Championship game at the Aviva Stadium.\nThe Irish province have won all 12 of their URC games to top the table, having also come out on top in the four Investec Champions Cup fixtures they have played.\nTries from John McKee and Jack Boyle helped Leinster to a 14-12 lead at the break, Henry Millard and Thomas Young crossing for Cardiff in the first half.\nMax Deegan, Luke McGrath, Charlie Tector and Rob Russell touched down for the home side after the interval while Millard's second try and a score from Ellis Bevan ensured that the Welsh side left Dublin with a consolation point for scoring four tries.\nHaving lost to Connacht in their previous outing, Cardiff remain in mid-table as they remain in contention for the top eight spot which would secure a place in the end-of-season play-offs.\nIt was 15 minutes in when hooker McKee got the scoreboard rolling by barging over from a driving maul but Cardiff responded within two minutes with their opening try.\nThe ball went through the hands quickly as they launched an attack, culminating in wing Mallard racing down the line and going over in the corner.\nBereft of their Ireland internationals, the hosts uncharacteristically made a number of errors while an efficient Cardiff display in the first 40 was rewarded with their second score, flanker Young driving his way over after his side went through the phases and executed a number of effective 'pick and go' moves.\nCallum Sheedy's conversion gave the Welsh side a five-point advantage but Leinster were to have the final say in the first half when loose-head prop Boyle went over in the corner after some enterprising build-up play.\nByrne's additional two points from the tee made it 14-12 at the interval and the fly-half would go on to convert each of his side's tries.\nReplacement Alex Mann was sent to the sin bin for infringing within a couple of minutes of the restart and Leo Cullen's side took advantage of their superior numbers as Deegan crashed over.\nA maul from a line-out set up the home side's fourth try, skipper McGrath breaching Cardiff's defences and darting over from close range.\nTwo minutes later Tector carved his way through the visiting rearguard to dot down try number five for Leinster as his side assumed control.\nCardiff fought back however with Millard collecting the ball and crossing for his second touchdown of the game and Bevan showed searing pace for his try to further reduce the deficit.\nReplacement Russell dived over the line in the corner in the closing stages to complete a convincing success.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c5y0420rre9o"}