{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:12:07", "date_modify": "2025-04-26 04:12:07", "date_publish": "2025-03-04 12:34:41", "description": "Arsenal news: Nedum Onuoha on Champions League chances", "filename": "sport_football_articles_cyveje6l09go_1745640727.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4da8/live/a2f582a0-f8e6-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cyveje6l09go_1745640727.html", "title": "Arsenal news: Nedum Onuoha on Champions League chances", "title_page": "Arsenal news: Nedum Onuoha on Champions League chances - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "If Arsenal remain defensively solid then they have \"as good as a chance as anybody\" at winning the Champions League, according to former Premier League defender Nedum Onuoha.\nPSV are the Gunners' first test to overcome and should they progress they will face one of Real Madrid or Atletico Madrid in the quarter-final.\nNot too long ago, Arsenal were one of the favourites to lift Europe's greatest accolade, but a drop in league form and more injuries has cast doubt over their ability to go all the way.\n\"If Mikel Arteta manages to be the manager that gives Arsenal the chance to play in another Champions League final, then that is huge success,\" said Onuoha on the BBC Radio 5 Live Football Daily podcast. \"With the home advantage Arsenal have in the second leg, I don't think it's the case of being on the brink of collapse, I think it is more so an opportunity for them.\n\"They have a real chance in the Champions League, as good as a chance as anybody else because as we've seen any result is possible and if they can find good football and be defensively solid like they have been throughout the competition so far, they will be in with a good chance.\n\"I see it more as an opportunity. Who is to say they can't do it? Why not believe?\"", "url": "https://www.bbc.co.uk/sport/football/articles/cyveje6l09go"}