{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 15:19:43", "date_modify": "2025-05-19 15:19:43", "date_publish": "2015-03-01 21:32:36", "description": "Mercedes' testing times leave competitors unable to hide their dejection, but there's still plenty to race for - writes Andrew Benson.", "filename": "sport_formula1_31675543_1747667983.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81324000/jpg/_81324352_testing_epa_final.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_31675543_1747667983.html", "title": "Lewis Hamilton: 'Like last year's car, but better'", "title_page": "Lewis Hamilton: 'Like last year's car, but better' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the sun set on the Circuit de Barcelona-Catalunya on Sunday evening, was it a metaphor for the fading hopes of any team who thought they might challenge Mercedes in Formula 1 this year?\nIt is a measure of the apparent superiority of the world champions over the rest of the F1 field as pre-season testing comes to an end that the customary game of cloak and dagger has been abandoned.\nUsually, teams and drivers will spend the winter trying to convince the media that they don't know where they are, that it is impossible to predict the competitive picture because of the unknowns of fuel loads, car specifications and so on.\nWe know they're fibbing; they know we know they're fibbing. The clever computer simulations and mountains of data they work with mean they always know pretty much where they stand. But the evasion is part of the game.\nNot this year, though.\nHere is a selection of quotes from leading drivers over the course of the final four-day test, which ended at Spain's Circuit de Catalunya on Sunday afternoon.\nMcLaren's Jenson Button: \"Mercedes are unbelievably quick and we are obviously a long way off.\"\nFerrari's Sebastian Vettel: \"It's clear Mercedes are in front. After that there seems to be a bit of a gap and then it is a lot closer, between many teams.\"\nWilliams' Felipe Massa: \"They're quick. We know they're quick. It's not a surprise that Mercedes have a very good package.\"\nLotus driver Romain Grosjean: \"Mercedes are far ahead and then it seems to be quite tight behind.\"\nNot much room for doubt there.\nIt was Friday afternoon at 16:45 local time when Nico Rosberg appeared to remove any lingering doubts about the brutal pace of the Mercedes W06 Hybrid.\nThat was when the German scorched around Barcelona in one minute 22.792 seconds on soft tyres. It was a staggering 1.2 seconds faster on the day than the next fastest man, Williams' Valtteri Bottas, on the same tyres, and 0.3 seconds faster than anyone else managed all test on the faster super-soft, which Mercedes have not run.\nBottas's downcast voice afterwards said it all.\n\"I think everyone was a little bit surprised,\" the Finn said. \"Everyone knew they were quick, but they are very quick. But that's how it is.\"\nBottas' remarks were very revealing, for they gave away that his Williams must have been pretty close to full qualifying, low-fuel specification. If it had not been, he had no reason to be so worried, for he would have known Williams still had something in hand. Whereas it appears from his reaction that they did not.\nSingle lap times in testing can be misleading, but the evidence of Mercedes' superiority has been piling up over the course of the two tests in Barcelona.\nFirst, Lewis Hamilton did a race simulation run at the second test on which he was more than 0.8 seconds a lap on average faster than Red Bull's Daniel Ricciardo, doing the same thing at the same time.\nOn the following two days, Ricciardo's team-mate Daniil Kvyat and Bottas also did 'race sims'. Their averages were within 0.1 seconds or so of Ricciardo's.\nThen, at the final test, Rosberg's eye-catching time on Friday - described by Vettel as \"very, very strong\" - was followed by Hamilton on Saturday lapping 0.24 seconds quicker than Massa and Raikkonen when they were on tyres between 0.5-0.8 seconds faster.\nIn short, Mercedes appear to have made a car that last year produced one of the most dominant seasons in F1 history even faster. As Hamilton said, when asked for his impressions of the new car: \"Like last year's car but better.\"\nMercedes are talking down their superiority, of course, at least up to a point.\n\"We are confident we have a good car,\" Rosberg said, \"but we are well aware the others are posting some good times so we need to keep our heads down and keep working.\"\nBut he is not kidding anyone. The evidence points in only one direction - Mercedes have a significant margin over the rest of the field, probably of about a second a lap, and already the title battle looks like it will be Hamilton v Rosberg Part II.\nIf it seems abundantly clear that Mercedes are in front, picking the next best team out of Williams, Red Bull and Ferrari is much more difficult.\nVettel said he expected this fight to be \"very close\", and Williams technical boss Pat Symonds agrees.\nThe times, though, suggest that Williams have an advantage over Ferrari of anywhere between 0.2-0.4 seconds. It is difficult to say where Red Bull fit in, as they have not done any low-fuel runs, but their race simulations have been on a par with those of Williams.\nThe Ferrari is strong in high-speed corners; the Williams is good in low-speed, which are more important in terms of overall lap time. And Ferrari have improved their engine, their weakest link last year.\nFerrari may have had a slight advantage over Red Bull's Renault on outright power in 2014, but the Italian engine lagged in terms of driveability and the performance of its energy recovery system.\nMercedes, who have improved their engine by a reputed 50-60bhp, still lead the way, but Ferrari have closed the gap by adding as much as 80bhp to theirs, borne out by the car's improved performance in the speed traps.\nThe Red Bull chassis again appears strong, but Renault has made the smallest gains of any manufacturer over the winter - only 30bhp or so - with the result that their works team looks to have fallen further behind Mercedes.\nRenault has upgrades in the pipeline, but the most important one - developed by consultant Mario Illien, formerly of Mercedes - will not arrive until the summer, probably around the time of the British Grand Prix.\nMcLaren-Honda are the big question mark, after a torrid time in pre-season testing.\nAs the breakdowns piled up and the car spent endless hours in the garage with mechanics trying to work out how to fix whatever was wrong this time, team bosses have reminded the media that their problems were not a surprise.\nRewind 12 months, they said, and remember the pre-seasons some of the teams had in 2014, when their new turbo hybrid engines were in their infancy, as Honda's is now.\nIt's a fair point - as is that Red Bull-Renault recovered last year from a pre-season very much like McLaren's this to qualify and finish second in Melbourne.\nIt would be a shock, though, if McLaren-Honda were to do the same.\nRacing director Eric Boullier admitted at the weekend that it might take until the European season - five races in - before McLaren can be \"more competitive\".\nBut \"more competitive\" than what, exactly? The car has barely run, McLaren have done no performance work and, as far as we know, the Honda engine has never been run at full power.\nHonda F1 boss Yasuhisa Arai said on Saturday that the lap times were \"not so bad\" in the circumstances and that he had a \"good feeling\".\nRivals believe there is strong evidence that the McLaren car is pretty competitive. If the engine can be made to run in Melbourne, it would not be a massive shock if Fernando Alonso - assuming he is fit - put it in the top six on the grid.\nBoullier insists: \"We know the base of the car and engine are good. Give us some time to get everything back in order and I think we can give Mercedes some headaches.\"\nGiven McLaren are currently at least two seconds a lap slower than Mercedes, that raised a few eyebrows.\nBrave words, though, are all McLaren have right now. In F1, talk is cheap; it's deeds that mark out the winners from the rest. And Mercedes have been doing their talking on the track.", "url": "https://www.bbc.com/sport/formula1/31675543"}