{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:19:18", "date_modify": "2025-05-21 04:19:18", "date_publish": "2025-04-05 16:12:17", "description": "Larne pass up the opportunity to move into second place in the Irish Premiership as they are held to a 2-2 draw with Crusaders while Loughgall delay likely relegation by beating Glenavon 1-0.", "filename": "sport_articles_cp34j5q7zk0o_1747801158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c6c/live/8c8684e0-1238-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp34j5q7zk0o_1747801158.html", "title": "Irish Premiership: Larne miss chance to go second after draw with Crusaders", "title_page": "Irish Premiership: Larne miss chance to go second after draw with Crusaders - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Larne passed up the opportunity to move above Glentoran into second place in the Irish Premiership table as they were held to a 2-2 draw by Crusaders in a pulsating game at Seaview on Saturday.\nThe Glens' 2-1 defeat by Linfield at Windsor Park in the day's early kick-off had opened up the chance for the Invermen to climb into the runner-up spot which will guarantee European football but in the event Gary Haveron's side sit a point behind Declan Devine's team with three sets of fixtures remaining.\nPaul O'Neill had Larne ahead after 10 minutes, Philip Lowry levelled in the second half, Shaun Want restored the visitors' lead, but Stewart Nixon's stunning late strike restored parity. Jordan Stewart received a straight red card in the closing stages.\nIn the day's other fixture in the top half, Jamie Glackin scored a superb late winner to give Coleraine a 3-2 home win over Dungannon Swifts.\nCliftonville strengthened their hold on seventh position as Eric McWoods notched a double in a thumping 5-0 win over Ballymena United while Carrick Rangers were convincing 4-1 victors against Ballymena United.\nLoughgall's 1-0 triumph over Glenavon at Mourneview Park in Darren Murphy's first game in charge thanks to Kirk McLaughlin's goal means the Villagers' probable relegation is not yet confirmed.\nThey trail Carrick by nine points with three games remaining but with a much inferior goal difference.\nO'Neill opened the scoring at Seaview when he finished in off the underside of the crossbar after his initial effort was blocked on the line.\nDaniel Larmour had a good chance to level but only managed to poke into the arms of Rohan Ferguson from close range and a Josh Williamson header was glanced wide as it remained 1-0 at the end of a fairly forgettable opening half.\nThat would all change after the break as the hosts got back on terms when Lowry initially lifted over Ferguson who seemed favourite to gather, but the Crusaders skipper got there first to poke home.\nLarne were back ahead on 68 minutes after Mark Randall's initial shot broke to Want to steer home, but the lead lasted seven minutes as Nixon curled home beautifully from outside the box.\nBoth sides pushed for a winner, with Larne going close as Conor McKendry tried his luck from distance that almost beat Tuffey.\nStewart was shown red as the game moved into added time for a heavy challenge on McKendry. They still could have nicked it as Ferguson was forced into an acrobatic save from Ross Clarke, but it would finish honours even.\nThe Bannsiders started in whirlwind fashion at Ballycastle Road and goals from Jack Scott and Dean Jarvis had them 2-0 up inside 10 minutes before John McGovern and Adam Glenny levelled matters only to be denied by Glackin's outstanding late strike.\nScott broke the deadlock inside six minutes with just his second goal of the season.\nThe midfielder was quick to block down Caolan Marron's attempted clearance on the edge of his own box and then had the assuredness to roll the ball past a helpless Declan Dunne from 12 yards.\nColeraine doubled their advantage four minutes later, again from an unlikely scorer, defender Jarvis.\nGlackin's low corner caused panic in the visitors' defence and there was the left-back to bundle home from close range for his first of the season.\nDungannon responded positively to the early setback and pulled a goal back midway through the half, McGovern netting his 11th of the season with an unstoppable effort from 25 yards\nThe visitors drew level just after the hour when Glenny found himself completely unmarked in front of the Coleraine goal to head home from six yards out.\nBut the drama was not yet complete as Glackin seized on a loose defensive clearance to curl an unstoppable effort past the despairing dive of Dunne in added time.\nCliftonville went in front inside five minutes as Shea Gordon collected a pass from Alex Parsons 25 yards from goal and his strike beat United keeper Sean O'Neill all ends up.\nThe Reds almost doubled their advantage when Joe Gormley played a one-two with Parsons but couldn't get enough power on his shot and O'Neill was able to save.\nBallymena's best chance saw the unmarked Ben Kennedy meet Shane Flynn's cross with a powerful header but it went narrowly over the crossbar and landed on top of the net.\nThe home side came close two minutes into the second half when Gormley cut inside and fired in a low shot which crashed off the base of the post, while a Parsons effort came off the underside of the bar.\nA second goal duly arrived on 55 minutes when Gormley latched onto a through ball by Rory Hale and waited for O'Neill to go to ground before side-stepping the keeper and side-footing home.\nBallymena came close when Stephen O'Donnell's header was brilliantly tipped over by David Odumosu but Cliftonville added a third with eight minutes left as Eric McWoods bundled the ball home after O'Neill had failed to catch a Sean Stewart corner.\nCliftonville added some gloss to the scoreline with two goals in stoppage time as both Ryan Curran and McWoods burst clear of the Ballymena defence to score past the exposed O'Neill.\nLoughgall's Kirk McLaughlin broke the deadlock for the visitors just before the hour mark, racing onto Benji Magee's incisive ball down the right before gliding past Ben Wilson and rifling a low, left-footed finish beyond Tadhg Ryan at his near post.\nThe Lurgan Blues had threatened earlier, nearly edging in front when Harry Lynch met Peter Campbell's whipped free-kick with a glancing header that fell narrowly wide of the far post.\nPaddy McLaughlin's side continued to attack from a distance throughout the first half, with Ben Wilson, Malone, and Campbell all trying their luck, but the trio failed to trouble Nathan Gartside.\nAt the other end, the Villagers carved out a golden opening of their own before the break. McLaughlin linked sharply with Adam Towe on the right, but after drifting into space, the striker dragged his shot wide.\nAfter falling behind, the hosts almost hit back immediately. Chris Atherton slipped a clever ball into Davy McDaid, who flicked it smartly into Malone's stride. The midfielder let fly from a tight angle, only for Robbie Norton to produce a superb, last-ditch block.\nLoughgall nearly added a late second when Magee broke clear one-on-one, but Ryan stood tall to deny the Larne loanee.", "url": "https://www.bbc.com/sport/articles/cp34j5q7zk0o"}