{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:49", "date_modify": "2025-05-20 12:32:49", "date_publish": "2023-08-04 09:54:09", "description": "Manchester United: Can Man United prevent Man City from four titles in a row?", "filename": "sport_articles_cw5rwzrz4p6o_1747744369.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25dd/live/5d4384d0-32a6-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw5rwzrz4p6o_1747744369.html", "title": "Can Man United prevent Man City from four titles in a row?", "title_page": "Manchester United: Can Man United prevent Man City from four titles in a row? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harvey Downes, Opta\nAfter a concerning start to life at the helm, new boss Erik ten Hag was able to steady the ship at United, leading them to Carabao Cup glory, an FA Cup final, the Europa League semi-final and a third-place finish in the league. In fact, at the turn of the year, there were quiet murmurings of an unprecedented quadruple.\nIt's often said that clean sheets win titles and while United kept the most in the Premier League last season (17), it is in goal where they've decided to change things. Having spent 12 seasons at Old Trafford, David de Gea left United following a season in which he won the Golden Glove, but also made the joint most errors leading to a goal of any Premier League goalkeeper in all competitions (four).\nHis replacement, Andre Onana, had an excellent Champions League campaign with runners-up Inter Milan. Based on Opta's Expected Goals on Target Conceded model, he prevented more goals (7.8) than any other keeper in the competition last term.\nHowever, it is his ability on the ball that would have caught Ten Hag's attention, completing 10 more passes per 90 minutes than De Gea last season (29 per 90), while his touch map from the Champions League final showcases the type of keeper they've acquired.", "url": "https://www.bbc.com/sport/articles/cw5rwzrz4p6o"}