{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:05", "date_modify": "2025-05-21 07:09:05", "date_publish": "2025-01-13 00:00:00", "description": "Reaction and the best clips as Australia hold their nerve to win the second one-day international in Melbourne.", "filename": "sport_cricket_live_cp830nz8j31t_1747811345.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cp830nz8j31t_1747811345.html", "title": "Alana King stars as Australia win second ODI against England", "title_page": "Alana King stars as Australia win second ODI against England - as it happened, BBC live text - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England throw away golden chance to level series\nJust waking up? You've missed more extraordinary Ashes drama and the plain facts are that England are now 4-0 down in this series.\nEngland were superb with the ball but shoddy with the bat. They failed in a chase of 181 in a 21-run defeat.\nScroll down to read how it all played out. You can also read the best reaction from players and pundits or read full details in Ffion Wynne's match report.\nWe'll be back on Thursday night for the third ODI.\n'It will be about regrouping'\nEngland bowler Alice Capsey: \"It will be about regrouping, having some good reflection. This series is so quick, we’re four down but last time we were six down. We’ve got so much more time to regroup and get better.\n\"It's not the best start to our campaign but at the same time we’ve shown glimpses of what we can do so far.\n\"It was a bit tricky. We didn't expect it to spin as much as it did out there. Respect to the Aussies bowlers.\n\"All it took was one partnership to get us over the line but we couldn't do that. The pitch was pretty dry but the pace was consistent.\"\n'Pure frustration'\nEngland captain Heather Knight: \"It's frustrating, I feel like it was there for the taking. Sophie [Ecclestone] and Alice [Capsey] bowled brilliantly. The wickets cost us. We need to be a bit braver with the bat.\n\"Amy was great at keeping us in the game. She was trying to face the majority of the balls and picking up boundaries when she could. It's obviously frustrating. Amy got us close but unfortunately just not close enough.\n\"We're really close. We just need to do a few things better in a few areas and need to be braver with the bat.\"\n'Got the job done'\nAustralia skipper Alyssa Healy: \"A tremendous game of cricket. To take it as deep as we could was a serious effort from our girls. I think that was one of the best wins I've been a part of. I think I said I'd rather lose with them eight down in the 35th over trying to bowl them out than take it to the 49th over so a bit ridiculous!\n\"I thought our bowlers did an outstanding job and there was enough in the wicket all day, even right at the back end with Lauren Bell's dismissal. There was enough in it if you bowled in the right areas. We did an amazing job of creating pressure and holding chances when they came our way. We got the job done.\n\"We do [find a way to win no matter what] and we speak about just hanging in there and staying in the contest then creating opportunities as much as we can. We were able to do that today. But we move on. There's still a lot of games left in this Ashes series. We go on to Hobart and hopefully put on a more complete display. We're still unbeaten at the Junction Oval which is awesome.\"\n'A gutsy win'\nPlayer of the match Alana King of Australia: \"That was a really well-fought win for us. That was great from our girls and we fought to the very last ball that was bowled. They were different conditions to what we are used to at Junction Oval and there was a lot of turn.\n\"I just knew if we got our lengths right and our lines right there was enough in it for the bowlers. Kim Garth started off well for us and we reaped the rewards at the back end.\n\"Stoked to get the win today and it puts us 4-0 up in the series. A gutsy win for us but I'm happy to play my part in whatever situation it is, whether it's bat or ball I'm happy to contribute to the team's success.\"\nPost\nEbony Rainford-Brent\nFormer England batter on TNT Sports\nThe point of difference for me was how well Australia started with the ball. If you compared it with how England started with the ball, it was 13 in an over from Lauren Filer and a few wides from Lauren Bell. Kim Garth set the tone. She took wickets up top and they were so miserly. That gave Australia the platform for Alana King to come in and keep chipping away. England were just under the pump. To defend 180 when their backs were up against it, and for every Australia player to deliver, is pretty impressive.", "url": "https://www.bbc.com/sport/cricket/live/cp830nz8j31t"}