{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:59:11", "date_modify": "2025-05-20 12:59:11", "date_publish": "2023-08-02 16:57:03", "description": "Uganda replaced a player in their Netball World Cup squad because she was \"weak\" with suspected malaria, says She Cranes coach Fred Mugerwa.", "filename": "sport_africa_66384324_1747745951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C649/production/_130616705_gettyimages-1559359346.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66384324_1747745951.html", "title": "Netball World Cup: Uganda coach Fred Mugerwa says player had suspected malaria", "title_page": "Netball World Cup: Uganda coach Fred Mugerwa says player had suspected malaria - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Uganda replaced a player in their Netball World Cup squad because she was \"weak\" with suspected malaria, says She Cranes coach Fred Mugerwa.\nTwo Uganda players withdrew before their 73-56 win against Wales at the 16-team finals in Cape Town on Wednesday.\n\"One, I think, had malaria,\" Mugerwa told BBC Sport Africa. \"She started feeling weak. That's why we decided to withdraw her.\"\nMugerwa said a second player was \"sick\" when they travelled with the team.\nThe long-serving coach, who is leading a 12-player squad during his second spell at the helm, did not specify whether the cause of the other player's illness was known.\n\"We thought that maybe she would improve but, as she continued playing again, she became weaker and weaker, so we decided to replace her,\" he added.\n\"It worked because the wing attack we brought in gave her all and performed very well.\"\nMalaria is a tropical disease spread by mosquitoes. Symptoms usually appear seven to 18 days after infection, but it is not contagious.\nUnder new rules introduced by World Netball earlier this year, teams are allowed to take up to three reserves to the World Cup and replace players with them if their reasons and written evidence for doing so are acceptable to the governing body.\nUganda's dominant first World Cup win over Wales was their third at the South African edition of the tournament, where they finished second in their initial group behind holders New Zealand.\nThey are preparing to face South Africa on Thursday as part of the second group stage.\n\"It is a tricky encounter because they have an eighth person who is always going to play for them,\" Mugerwa said in a reference to the hosts' supporters at the Cape Town International Convention Centre, the setting for all of the World Cup matches.\n\"We are prepared for that and we shall perform to our best - we want that win.\"", "url": "https://www.bbc.com/sport/africa/66384324"}