{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:36", "date_modify": "2025-05-21 07:30:36", "date_publish": "2025-01-22 08:47:29", "description": "Mark McGuinness says Luton Town must sort out \"the fundamentals\" defensively after slipping to next to bottom of the Championship.", "filename": "sport_football_articles_c5y780e25v3o_1747812636.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e16/live/d3960e70-d898-11ef-9567-af1f21102465.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y780e25v3o_1747812636.html", "title": "Mark McGuinness: Luton Town must 'nail down defensive fundamentals'", "title_page": "Mark McGuinness: Luton Town must 'nail down defensive fundamentals' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Defender Mark McGuinness admitted Luton Town must sort out \"the fundamentals\" defensively after slipping even further into the relegation mire with defeat at Oxford United.\nThe Hatters led twice in Matt Bloomfield's second game in charge, with McGuinness heading their second goal, only for Oxford to come from behind and take the points.\nThe result left Luton next to bottom of the Championship on goal difference - and was their 11th successive league defeat away from home.\n\"We're in the position we are, there's no hiding from that. We've got to focus on ourselves, regardless of what's going on around us, sort things out in training and hopefully thing will turn,\" McGuinness told BBC Three Counties Radio.\n\"We know there are things we're doing wrong, it's not just away from home. It's just fundamentals that we're not doing well at and we're conceding rubbish goals - if you concede three goals, you're more than likely not going to win games.\n\"We need to sharpen up and build from a solid foundation.\"\nManager Bloomfield was again happy with what he saw from his team going forward, but their vulnerability at the back, one of the main reasons which ultimately cost predecessor Rob Edwards his job, continued.\n\"We're playing some nice football with a nice flow, we're getting in some good areas with good passages of play but ultimately we all need to chip in and defend,\" said McGuinness, who was signed from Cardiff City last summer.\n\"That's how games are won, by keeping the ball out of your net.\n\"This isn't a one person error, it's the whole team. Everyone has to take responsibility. We all need to get together and nail down the fundamentals.\"\nLuton will be at home to Millwall and away to Sheffield Wednesday on the next two Saturdays before a tough run of games when they will face Sunderland and Sheffield United, who are both currently in the top three, followed by Watford at Vicarage Road in the 'M1 derby'.\n\"Any successful, winning football team does the basics well - and we have to do the basics better,\" said Bloomfield.\n\"When the ball comes in our box we have to get first contacts, we have to have the right number of bodies between the posts to defend the crosses.\"\nHe continued: \"To rise up the table, we need to put a run together. We need to get the first one on the board and then belief and confidence will start to grow from there.\"\nOne plus for Luton was the return of wing-back Alfie Doughty, who had been out of action since early November, as a second-half substitute.\n\"He's been a big player for this club for a few years now,\" added Bloomfield. \"It was fantastic to get him on the pitch and he showed a real intensity and that's the Alfie we want and hopefully we can build towards getting more minutes from him.\"", "url": "https://www.bbc.com/sport/football/articles/c5y780e25v3o"}