{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:47", "date_modify": "2025-04-26 06:44:47", "date_publish": "2025-03-01 16:52:22", "description": "'These are the games you wish you were playing in' - Gray relishing derby clash", "filename": "sport_articles_cy9dvg5dqp7o_1745649887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c626/live/53156e60-f6bd-11ef-84d4-499fadd0dc53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy9dvg5dqp7o_1745649887.html", "title": "'These are the games you wish you were playing in' - Gray relishing derby clash", "title_page": "'These are the games you wish you were playing in' - Gray relishing derby clash - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "David Gray is urging Hibs to embrace the pressure of Sunday's Edinburgh derby clash against Hearts.\nThe capital clubs face off having both recovered from dismal starts to the season - Hibs are unbeaten in 14 while Hearts have lost just one of their last 11 games.\nGray's side were held to a 1-1 draw at Easter Road but narrowly beat Neil Critchley's side 2-1 at Tynecastle on Boxing Day.\n\"You know what it means to both sets of supporters and you want to be the team on top,\" the Hibs boss said.\n\"I know that more than anybody growing up in the city and having played in these games, they're fantastic games to be involved in.\n\"And now sitting on the other side, as a manager, I'm thoroughly enjoying them as well.\n\"These are the games you kind of wish you were playing in, to be honest. As a player, I thoroughly enjoyed them and the message to the players is that these are the games you need to look forward to.\n\"From everything that goes with it this weekend, from where the two teams are, the form they're in, the form we're in, what's at stake for everyone involved, it's a fantastic opportunity, a great game to look forward to.\"", "url": "https://www.bbc.co.uk/sport/articles/cy9dvg5dqp7o"}