{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:32", "date_modify": "2025-05-21 05:31:32", "date_publish": "2025-04-02 20:19:02", "description": "Wales midfielder Rachel Rowe says increased resources and support has made her and her teammates believe they belong among world football's elite nations.", "filename": "sport_football_articles_c30qpnrrry5o_1747805492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00a5/live/8ba62e70-0fb0-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c30qpnrrry5o_1747805492.html", "title": "Wales women: Support has improved us", "title_page": "Wales women: Support has improved us - Rachel Rowe  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales midfielder Rachel Rowe says increased resources and support has made her and her teammates believe they belong among world football's elite nations.\nWales' women will play at a major tournament for the first time this summer after qualifying for the 2025 European Championships in Switzerland.\nRhian Wilkinson's side are also competing in the top tier of the Nations League, with Denmark visiting Cardiff on Friday before Wales travel to Sweden who are ranked sixth in the world.\nWales' journey has been a long one and with her and her teammates now paid the same international match fee as their male counterparts and offered the same facilities, Rowe admits it has helped to grow the belief of what can be achieved.\n\"Being entirely honest, a lot of us have been told to be grateful for so long,\" she said.\n\"You do get to a point in your career where you think, yes, I am grateful, but there's still so much room for improvement. That's the point where we've got to now.\n\"Like resources for example, how can you expect to be at the top when your resources are at the bottom.\n\"When you meet somewhere in the middle, the expectation is fair, and we get that now, we get treated fairly. It's good to see the progress on the pitch, but also to see it as a whole. That's what we've got to look at as a nation. When there is resources and investment, there is progress.\"\nRowe believes Wales' maiden performance at a major tournament can be a transformative moment for football in Wales.\n\"2025 is a moment of big change,\" she said. \"There has been so much development so far, but this is the perfect opportunity, externally, to take women's football seriously.\n\"There's always been this expectation, but sometimes resources don't meet that expectation.\n\"We've been building as a nation for years; women's football has been building for years to get to a point of something big happening.\n\"It happened with England at the Euros, and my hope from getting to a major tournament is that it filters back down into the Adran Leagues and there's change in that and more investment, and in five or 10 years, we can see the progress.\"\nWales have started their Nations League campaign with a narrow 1-0 defeat in Italy before shocking Sweden with a 1-1 draw at Wrexham.\nRowe, who missed the Sweden match with injury, felt the contest underlined Wales' new philosophy under boss Rhian Wilkinson, who wants Wales to be braver in possession.\n\"We're transforming into a nation that plays football,\" Rowe said. \"We've always prided ourselves on our defensive organisation and being difficult to break down, that's what our identity has always been, but now we're developing into something else.\n\"That's because we're being given free rein to do that, and in the past, we haven't been given that. On a training pitch, anyone can keep the ball, but to do it in a game with high stakes and where results have consequences, it's exciting.\"", "url": "https://www.bbc.com/sport/football/articles/c30qpnrrry5o"}