{"authors": ["Phil Cartwright", "www.facebook.com"], "date_download": "2025-05-21 06:47:55", "date_modify": "2025-05-21 06:47:55", "date_publish": "2025-03-28 21:58:21", "description": "Warrington Wolves produce a second-half fightback to beat Leeds Rhinos in the 5,000th game to be played in Super League.", "filename": "sport_rugby-league_articles_czrn5le1djxo_1747810075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/efd8/live/6c34a950-0c21-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_czrn5le1djxo_1747810075.html", "title": "Super League: Warrington Wolves 16-14 Leeds Rhinos", "title_page": "Super League: Warrington Wolves 16-14 Leeds Rhinos - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warrington Wolves produced a second-half fightback to beat Leeds Rhinos in the 5,000th game to be played in Super League.\nAfter Arron Lindop had put the hosts in front with a fine individual try, Leeds crossed three times without reply either side of half-time.\nTries from James McDonnell, Riley Lumb and Ryan Hall gave the Rhinos a 14-6 advantage midway through the second period.\nBut Stefan Ratchford's converted score took Warrington back within two points and, with Leeds' Keenan Palasia in the sin-bin late on, Jake Thewlis dived over in the corner to secure a fourth win in six league outings for the Wire in 2025.\nThat victory, coupled with Leigh's loss at home to Wakefield, lifted Sam Burgess' side up to third in the table.\nWithout several injured backs, a rejigged Wire team made the perfect start when teenage winger Lindop carried the ball from inside his own half, chipped a kick behind Leeds' backline and raced onto it himself to touch down.\nAsh Handley's fine offload to Lumb set up Leeds' swift response, although the final pass of the move made by Jake Connor to McDonnell appeared to go forward.\nHowever, there was no doubt about the validity nor the quality of Connor's pass to send Lumb over for his fifth Super League try of the season.\nThe competition's all-time leading try-scorer Hall, who made his 500th career appearance in the win over champions Wigan last weekend, acrobatically finished his 257th Super League score to extend the visitors' advantage to eight points.\nConnor hit the crossbar with his conversion attempt from the touchline, keeping Warrington's deficit in single figures.\nExperienced centre Ratchford wriggled his way over the try-line from close range to reduce that gap to two points.\nPalasia's yellow card for a high tackle meant Leeds would play the final seven minutes with 12 men and Warrington pounced almost immediately through Thewlis for the winning score.\nWarrington centre Stefan Ratchford told BBC Radio 5 Sports Extra:\n\"We set out a game plan through the week and we kind of went away from that at the beginning of the game.\n\"Leeds had all the field position early on but we got ourselves in front with a great try from Arron Lindop.\n\"We felt good in patches but then conceded two tries on the last play, which was frustrating.\n\"There's still plenty to work on but it's a good win for us in the end.\"\nRhinos head coach Brad Arthur told BBC Radio Leeds:\n\"It was a very good effort, we were good physically, we were really good in the first half with plenty of fight and spirit.\n\"We had to defend our try-line for a long period, especially at the start of the second half. Just in the end, probably in the second half there were too many errors and penalties.\n\"I was happy with the way that we had plenty of fight and grit. We've just got to learn that the difference of one or two sets here and there - if we can control those a bit better, it can be the difference in the game.\"\nOn Palasia's yellow card: \"I've seen plenty of them before - as long as they're consistent. I'd have to watch the replay and slow it down. They've got all the angles.\n\"I don't want to say anything until we've had a really good look at the incident because I'm just watching it from the sideline.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/czrn5le1djxo"}