{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:44:47", "date_modify": "2025-05-20 13:44:47", "date_publish": "2023-07-31 20:13:37", "description": "Brazil midfielder Fabinho completes a move to Saudi Arabian club Al-Ittihad from Liverpool on a three-year deal.", "filename": "sport_football_66259309_1747748687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17844/production/_130442369_gettyimages-1491766443-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66259309_1747748687.html", "title": "Fabinho: Liverpool midfielder joins Saudi side Al-Ittihad", "title_page": "Fabinho: Liverpool midfielder joins Saudi side Al-Ittihad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brazil midfielder Fabinho has completed a move to Saudi Arabian club Al-Ittihad from Liverpool on a three-year deal.\nThe 29-year-old did not travel with the Reds to a recent training camp in Germany after the Saudi side made a £40m bid for him.\nFabinho was also left out of the club's current trip to Singapore as the move was finalised.\nCapped 29 times by his country, he joined Liverpool in July 2018 from Monaco for a fee in the region of £39m.\nFabinho said he was leaving his \"home\" after representing Liverpool \"with the greatest honour and happiness possible\" for five years.\nHe added: \"I say this with a heart full of joy: I love this club. Thank you, Reds, for everything we've experienced together.\"\nFabinho is Al-Ittihad's latest high-profile signing this summer as part of a widespread influx of players into the Saudi Pro League.\nBallon d'Or winner and former Real Madrid striker Karim Benzema, former Chelsea midfielder N'Golo Kante and ex-Celtic forward Jota have all joined the club managed by ex-Wolves and Spurs boss Nuno Espirito Santo.\nAl-Ittihad said Fabinho's signing is part of their effort to \"reinforce the team with outstanding players, who will support their journey in the upcoming phase, which includes multiple domestic and international competitions\".", "url": "https://www.bbc.com/sport/football/66259309"}