{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:50", "date_modify": "2025-05-20 13:35:50", "date_publish": "2023-08-01 18:35:18", "description": "'It's a bit unusual, but Hearts fans are used to seeing unusual management teams!'", "filename": "sport_articles_cp025d5lp47o_1747748150.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp025d5lp47o_1747748150.html", "title": "'It's a bit unusual, but Hearts fans are used to seeing unusual management teams!'", "title_page": "'It's a bit unusual, but Hearts fans are used to seeing unusual management teams!' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Is it possible to have a discussion about Hearts these days without the first topic of conversation revolving around who's the boss?\nWell, that was the first train of thought on the Hearts edition of the BBC's Scottish Football Podcast, with journalist - and Jambo - Joel Sked.\n\"Steven Naismith is seen as the head honcho,\" said Sked. \"He said recently everything is the same as it was last season, just different roles.\n\"It's a wee bit convoluted from the outside but as long as the players are receiving a clear message, I think everything is fine. It's just a wee bit unusual, but Hearts fans are used to seeing unusual management teams!\"\nNaismith was in the hot seat as the Gorgie club finished fourth last season. A position Sked is hopeful the Jambos won't end up again come May.\n\"If you don't finish third, the least you can do for Hearts is finish fourth,\" he added.\n\"The last time we finished in the top three back-to-back was under Craig Levein, so it shows you how difficult it is, but it also shows how much Hearts have underperformed for a very long time.\n\"We should be doing a lot better, third should always be the aim. Certainly top four, the team should not be dropping out of that.\"\nFinishing fourth has made European football a trickier path this season, with Sked adding \"a shock\" will be required for group stage football to return to Tynecastle this season.\n\"Beating Rosenborg would be a scalp, but they are struggling a little in the Norwegian league. It's the sort of tie you have a bit of hope right now that Hearts can actually get through.\n\"There'll be big teams waiting in the play-off round. It would take a shock to get into the group stages, which would be absolutely huge, given the finances that come with that.\"", "url": "https://www.bbc.com/sport/articles/cp025d5lp47o"}