{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:32:30", "date_modify": "2025-04-26 06:32:30", "date_publish": "2025-02-27 07:38:50", "description": "Canada's American manager Jesse Marsch is \"ashamed\" that US President Donald Trump continues to label Canada \"the 51st state\".", "filename": "sport_football_articles_c0eggg489qjo_1745649150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9cfa/live/1d656390-f4d5-11ef-a18f-394b1249001d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0eggg489qjo_1745649150.html", "title": "Donald Trump: Jesse Marsch ashamed of President's Canada comments", "title_page": "Donald Trump: Jesse Marsch ashamed of President's Canada comments - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Canada's American-born manager Jesse Marsch is \"ashamed\" of US President Donald Trump's repeated comments about making Canada the 51st state.\nTensions have been rising between the neighbouring countries over recent weeks following Trump's 51st state remarks as well as proposed severe trade tariffs between the nations.\nThe former Leeds United boss took charge of Canada in May 2024 and could face the US in the final of the CONCACAF Nations League next month.\n\"If I have one message to our president, it's lay off the ridiculous rhetoric about Canada being the 51st state,\" said Marsch, who was born in Wisconsin and played twice for the US national team during a long MLS career.\n\"As an American, I'm ashamed of the arrogance and disregard we've shown one of our historically oldest, strongest and most loyal allies.\"\nCanada and the US recently met across two fixtures in the 4 Nations ice hockey competition, with the former winning the final.\nTheir first game descended into chaos with three fights breaking out between players in the first nine seconds, while the US national anthem was loudly booed.\nAmerican supporters also jeered the Canadian national anthem, which was sung with different lyrics in protest about Trump's statements.\nAfter Canada won in overtime, Prime Minister Justin Trudeau wrote on X: \"You can't take our country - and you can't take our game.\"\nMarsch has won six of his 13 games in charge of Canada, who are seeking their first piece of silverware since 2000 in the Nations League.\nCanada meet Mexico in the semi-finals on 21 March and the winner will face either the US or Panama in the final two days later, with all the games being played at SoFi Stadium in California.\n\"Canada is a strong, independent nation that is deep-rooted in decency and it's a place that values high ethics and respect, unlike the polarised, disrespectful and often now hateful climate that is in the US,\" Marsch added.\n\"When I look forward to a month from now I know this will fuel our team, the mentality and will that we have to play for our country, the desire to go after this tournament in every way and to show on and off the pitch exactly what Canadian character is.\"\nMexico manager Javier Aguirre and Panama coach Thomas Christensen were at the same media event as Marsch in California while America were represented by USA Soccer vice-president Oguchi Onyewu, who refused to be drawn into any political comments.", "url": "https://www.bbc.co.uk/sport/football/articles/c0eggg489qjo"}