{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 07:52:42", "date_modify": "2025-05-21 07:52:42", "date_publish": "2025-01-30 23:05:04", "description": "Arsenal sign Manchester City and England forward Chloe Kelly on loan until the end of the season after her rollercoaster January transfer window.", "filename": "sport_football_articles_c75zv7pk1wqo_1747813962.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77a1/live/20b13920-df5e-11ef-be62-217e5da8a772.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75zv7pk1wqo_1747813962.html", "title": "Chloe Kelly: Arsenal sign Manchester City and England forward on loan", "title_page": "Chloe Kelly: Arsenal sign Manchester City and England forward on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England forward Chloe Kelly has joined Arsenal on loan from Manchester City for the remainder of the season after a rollercoaster January transfer window.\nThe 27-year-old was the subject of heavy speculation throughout the month as she sought a move away from City.\nRivals Manchester United had made an offer for the striker on deadline day but it was rejected by City before a loan agreement with Arsenal was struck.\nKelly is ineligible to play on Sunday when City host Arsenal in the Women's Super League (WSL).\nOn Wednesday, Kelly posted on Instagram that she wanted \"to be happy again\" and did not see her future at City beyond the summer.\nHer contract is due to expire in June but Kelly, who has made just one WSL start this season, was concerned about her place in the England squad with the 2025 European Championship taking place in July.\nShe scored the winning goal against Germany when England created history by winning their first major women's tournament at Euro 2022.\nKelly added on Wednesday: \"With the Euros fast approaching, this summer is a huge one and I want to be in a position to give it my best shot to represent my country.\n\"However, to be dictated whom I can and can't join with only four months left of the football season is having a huge impact on not only my career by my mental wellbeing.\n\"The situation has been dragged on for too long, it's disappointing and not right.\"\nHer only WSL start this season came against West Ham in October but she hopes to secure a place in the England squad with regular minutes at Arsenal.", "url": "https://www.bbc.com/sport/football/articles/c75zv7pk1wqo"}