{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-04-26 07:41:03", "date_modify": "2025-04-26 07:41:03", "date_publish": "2025-02-27 12:02:27", "description": "The unbeaten Southampton boxer challenges for the European super-featherweight title on Saturday.", "filename": "sport_boxing_articles_c5y99g22458o_1745653263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6769/live/d1f0e040-f4ef-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_c5y99g22458o_1745653263.html", "title": "Southampton's Ryan Garner going for European glory", "title_page": "Southampton's Ryan Garner going for European glory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "If you asked someone from Southampton about sporting success for the city on a European stage, then they might mention that famous night against Inter Milan in 2016.\nOr maybe Southampton sprinter Iwan Thomas racing his way to two European gold medals.\nOn Saturday night boxer Ryan Garner has a shot at European success himself as he fights for the vacant European super-featherweight title.\n\"It still doesn't feel real, the support and the build-up,\" he told BBC Sport.\n\"It doesn't feel real to be headlining my own show, I don't think I'm that big time yet.\n\"Three or four years ago this wasn't something that I thought would have even been possible.\"\nGarner takes on fellow unbeaten boxer Salvador Jimenez, from Spain, at the Bournemouth International Centre.\nAs well as being for the vacant European title, Garner will also defend the WBC International belt.\nThe 27-year-old earned the opportunity to headline after his most recent win over Londoner Archie Sharp at the O2 Arena.\nGarner's promoter Frank Warren teased the possibility that they would have to put on a show for his fans on the south coast.\nThe Bournemouth International Centre's Windsor Hall - which holds up to 4,000 people - is expected to be at capacity for the main event on Saturday.\n\"The support has been incredible,\" Garner said.\n\"A lot of people from Southampton are backing and supporting me, even people I don't know, which is quality.\"\nHe added: \"There's not many people up and down the country that can do ticket sales like we have been doing.\n\"It goes to show that everyone is behind me and believing in me, all I have to do now is repay their faith and become European champ.\"\nOne of Garner's big supporters has been Southampton FC, with the club often posting about him on social media and bringing attention to his big wins and upcoming fights.\nThey have previously brought him out at St Mary's Stadium to address the crowd, and recently invited Garner to the training ground to speak with the players and coaches.\n\"When I was about 11 years old I actually used to play for Southampton in their youth teams,\" Garner said.\n\"It's massive to be supported by the club as I am, they're right behind me. It's quality to have my childhood football club following me and helping me.\n\"They want to push for me to fight at St Mary's in the summer, it's all there for me, and on Saturday I have to grab it with both hands.\"\nOn the pitch, Southampton have been far from impressive this season in the Premier League. They sit bottom of the table with nine points from 27 matches.\n\"I feel like the Saints fans need something to get behind this season,\" Garner added.\n\"There's a lot of people that aren't happy with Saints at the moment as we aren't doing very well, so people might be looking at me as doing something good for the city.\n\"With my success people have started to watch, and I feel as if the city wants a good night out and I believe my style is the exciting kind to give them that.\"\nGarner will be attempting to extend his unbeaten record to 17 wins against Jimenez.\nHis opponent, who has a record of 14 wins and one draw, is fighting outside of Spain for the first time.\n\"I have no doubt in my mind that I'm going to win this fight, there is bigger and better things on the horizon and this is a big opportunity for me,\" Garner said.\n\"I believe I'm meant to go on and win the European title and go on to fight at St Mary's, I have to do my part now.\n\"I have no doubt in my mind that it is going to be an exciting fight and one that I'm going to win convincingly.\"", "url": "https://www.bbc.co.uk/sport/boxing/articles/c5y99g22458o"}