{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:13:41", "date_modify": "2025-05-21 06:13:41", "date_publish": "2025-04-01 11:49:38", "description": "Nicknamed the 'Snowbok', South African cross-country skier Matt Smith is set to compete at the 2026 Winter Olympics despite only taking up the sport two years ago.", "filename": "sport_articles_cr525r8v5g5o_1747808021.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d3a/live/78b2e380-0ee3-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr525r8v5g5o_1747808021.html", "title": "Matt Smith: How South Africa's Snowbok booked Winter Olympics spot in cross-country skiing", "title_page": "Matt Smith: How South Africa's Snowbok booked Winter Olympics spot in cross-country skiing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matt Smith grew up dreaming of playing rugby for South Africa, but rather than pull on the famous green Springboks jersey he has established his own nickname in a sport rarely practiced by his compatriots.\nThe 34-year-old cross-country skier - dubbed the 'Snowbok' - has earned a quota place for his nation at the 2026 Winter Olympics in Italy.\nHis achievement is all the more remarkable given that he only took up the sport two years ago after relocating from Cape Town to Norway.\n\"I think [for] anybody who is a hobby athlete, the Holy Grail is the Olympics,\" Smith told Sportshour on the BBC World Service.\n\"The reality is for many of us, myself included, that was a wild dream that would never be achieved until I set out on a journey two years ago.\n\"I've dedicated a lot of time, energy, resources. It's just the most phenomenal dream come true.\"\nSouth Africa is the continent's second-most successful nation at the summer Olympics with 28 gold medals but, given its warm climate, it is yet to make a real impact at the Winter Games.\nThe country did not send anyone to the Sochi 2014 or Beijing 2022 Games, and Smith is set to be just the 16th South African to represent his country at the event.\n\"I just love putting South Africa on the map in a winter sport,\" he said.\n\"I'm not the first. I definitely won't be the last.\n\"We have heart, courage and determination as a nation. All these South African athletes who precede me have been champions.\"\nShortly after his move to the Norwegian capital Oslo, Smith's passion for the outdoors piqued an interest in skiing.\n\"I loved to run, cycle, swim outside, and then I moved to Norway as the snow was falling and the winter was coming,\" he explained.\n\"I thought to myself, I have two options here: either I lean into this or I hibernate.\"\nSmith chose to embrace the conditions in Scandinavia and, as fate would have it, his new hobby led to him meeting Allan Corona, a Mexican cross-country skier.\nThe two men have since formed a close bond, becoming training partners and also competing alongside one another on the international circuit.\n\"I just decided to take the bull by the horns,\" Smith said.\n\"If Allan can represent Mexico, why can't I represent South Africa?\"\nThen came bigger questions and an ambitious target.\n\"When's the next Olympics?\" Smith continued. \"Do we have anyone representing us? No.\n\"Is it humanly possible to qualify in two years' time and represent your country in three? I proved that it is.\"\nSmith secured South Africa a spot at Milan-Cortina at the Nordic World Ski Championships in Trondheim at the end of February.\nA 38th-placed finish in a 7.5km race - some 10 seconds behind Corona - earned him enough ranking points from the world governing body to achieve a dream which appeared unlikely when he took up the sport.\nWith his fiancee expecting to give birth to the couple's first child this year, Smith will have to manage his time wisely as he prepares for the Winter Olympics, which will take place in February next year.\n\"I've got the points I need to qualify. The comfort that I have now is I can go into the summer without stress,\" he said.\n\"I will hopefully have a month or two off where my son is born over summer, which is usually a quieter period.\n\"I will try to maintain my training - what my son will allow - to get away for an hour or two here and there. I might have to do a lot of training on the bike at home.\n\"The plan is to enjoy summer, become a father and whatever that throws me.\"\nThe prospect of being South Africa's flagbearer at the Winter Olympics is something that excites Smith, though he is hopeful that others from the country could join him in Italy.\n\"There are currently five active South African athletes in five different disciplines,\" he said.\n\"I very much hope we all qualify, because it would be the largest team we will have ever sent to a [Winter] Games.\n\"I would love to carry the flag but I think the greatest honour is being there and achieving a childhood dream of representing my country in a sport.\n\"It was the Springboks. I'll take the Snowbok.\"", "url": "https://www.bbc.com/sport/articles/cr525r8v5g5o"}