{"authors": ["Eshlin Vedan", "www.facebook.com"], "date_download": "2025-05-21 03:47:54", "date_modify": "2025-05-21 03:47:54", "date_publish": "2024-12-26 07:48:44", "description": "Olympic 200m Letsile Tebogo provided inspiration to help Botswana's Ross Branch win a historic World Rally-Raid Championship title this year.", "filename": "sport_motorsport_articles_cge97lng8rwo_1747799274.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53bf/live/55c12020-be17-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_cge97lng8rwo_1747799274.html", "title": "Ross Branch: Letsile Tebogo's part in World Rally-Raid Championship victory", "title_page": "Ross Branch: Letsile Tebogo's part in World Rally-Raid Championship victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the aftermath of his historic 200m gold medal at the Olympics, sprinter Letsile Tebogo was full of encouragement for his fellow Botswanans in the world of sport.\nAmong them was motorcyclist Ross Branch, who was on the brink of becoming the first African to win the World Rally-Raid Championship (W2RC) in October.\n\"Letsile was on the phone with me the week before saying 'We can do it. We are Botswana and we stand together',\" Branch told BBC Sport Africa.\n\"I was leading the championship, so there was a lot of talk, and everybody wanted me to follow up what he did. With his gold medal came a lot of pressure but it was good pressure.\n\"We have such a small country and there is a small community of athletes in Botswana so we all stand together.\"\nBranch held his nerve in the last of five events on the W2RC circuit, held in Morocco, to secure the championship and make his own piece of history.\nThe 38-year-old's success was more than three decades in the making as he began honing his skills in Jwaneng from the age of four.\n\"It's been a tough journey - 34 years of racing and lots of ups and downs,\" he said.\n\"Motorsport is a cruel sport as well as the best sport in the world. When you have your lows, it's hard to get over it. I had a dream and a goal and kept chasing that goal.\n\"Everyone was saying I might be too old to get a world title but I'm so happy to have proved those guys wrong.\"\nWhile casual observers may be hearing Gaborone-based Branch's name for the first time following his W2RC success, his route to the top has involved overcoming hurdles along the way.\nAt his lowest, he did consider quitting the sport.\n\"There has been more than once that I wanted to chuck in the towel and hang up the boots,\" he said.\n\"I had the right people right around me. My family was there and kept pushing me. We did take a break for six months at one time.\"\nIt is common for African competitors in high level motorsport to relocate to Europe in search of more lucrative financial opportunities and to be close to elite teams.\nBranch has taken the unorthodox approach of opting to remain based in Botswana, and believes this decision has been beneficial in some ways.\n\"Being in Botswana and in Southern Africa, we've got the best terrain and the best areas to go and ride,\" he explained.\n\"It's not far from my house that I can go and get into an open desert. For me and the facet of the sport that we are in, it's extremely important to stay here in Southern Africa.\n\"I'm extremely happy and proud to have been here and not have to emigrate overseas and stay with a trainer.\"\nRegardless of whether he defends his W2RC title in 2025, it will be a special season for Branch.\nA stage will be held in Sun City, South Africa, in May next year, marking the first time that a leg of the championship will be held in Southern Africa.\nBecause of its expensive nature, the African continent as a whole has struggled to produce many competitors in high-level motorsport, let alone champions.\nYet Branch feels this is something that can change in the future, especially with more events being staged there.\n\"Having the South African round will open the door for hundreds of riders that are here,\" he said.\n\"It will make it a lot cheaper to participate and break into the market of Rally-Raid racing.\n\"I have full confidence that in the next two to three years we will see another 10-15 riders come out of Southern Africa. This is huge for us.\"\nThe Sun City stage also provides Branch with an opportunity to compete in front of many of those close to him for the first time in his career.\n\"As soon as they released the calendar for next year I had at least 100 family and friends book accommodation [to watch the race],\" he said.\n\"I'm excited to host my family and friends and show them what we can do.\"\nGiven the high demands of motorcycling Branch is realistic that, while he is contracted with Hero MotoSports until 2027, his time competing as an elite rider may be limited.\nOptions for him will not be short once he does call it a day in motorbiking as he is a qualified pilot and is also open to exploring the possibility of competing in the car category of the Dakar Rally and W2RC.\nThe most recent Dakar Rally champion, Carlos Sainz Sr, became the race's oldest winner when he triumphed age 61 in January.\nWhen away from racing, Branch does charter flights on a part-time basis for Mack Air in Botswana.\n\"The love of flying is the freedom we have in the sky,\" Branch said.\n\"I fly over the most beautiful place in the world, the Okavango Delta, which is extraordinary. It's a big privilege for me to fly and keep doing what I love doing.\"", "url": "https://www.bbc.com/sport/motorsport/articles/cge97lng8rwo"}