{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:59:22", "date_modify": "2025-05-21 04:59:22", "date_publish": "2025-02-12 00:00:00", "description": "Gustaf Nilsson wins and scores a controversial late penalty as Club Brugge claim a narrow lead over Atalanta in the first leg of their Champions League knockout play-off tie.", "filename": "sport_football_live_c30d204428dt_1747803562.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c30d204428dt_1747803562.html", "title": "Club Brugge 2-1 Atalanta: Belgian side score late penalty to earn first-leg lead", "title_page": "Club Brugge 2-1 Atalanta: Belgian side score late penalty to earn first-leg lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This will be the first European meeting between Club Brugge and Atalanta. The Belgian side are winless in their last 15 games against Italian sides in major European competition (D6 L9), since winning 1-0 away to Milan in October 2003 in the UEFA Champions League.\nClub Brugge’s last home win against an Italian side came back in April 1978, in a 2-0 victory over Juventus in the UEFA Cup. Since then, they haven’t won any of the nine times they’ve hosted Italian opposition in Europe (D4 L5), although have avoided defeat in the last three (all draws), including one this season (0-0 v Juventus on MD7).\nAtalanta’s only previous meetings with a Belgian side in Europe came back in the 1987-88 Cup Winners’ Cup semi-finals, losing home and away to KV Mechelen (1-2 in both matches, 2-4 on aggregate).\nThis will be just the third knockout stage match Club Brugge have played in the UEFA Champions League, with the previous two coming in the Last 16 in 2022-23. They were beaten in both legs by Benfica on that occasion, losing 0-2 at home and 1-5 away (1-7 on aggregate).\nAtalanta are looking to qualify for the Last 16 for the third time in four UEFA Champions League tournament appearances (previously in 2019-20 and 2020-21). Indeed, they were the highest finishers in this season’s league phase (9th) among teams involved in the play-off round, and have only lost one of their eight matches in the competition this term (W4 D3).\nAtalanta have conceded just six goals in eight UEFA Champions League games this term, with only Internazionale (1), Arsenal (3) and Liverpool (5) conceding fewer. Indeed, only Arsenal (19) allowed fewer shots on target than Atalanta (20) during the league phase this season.\nThe two goals scored following the longest sequences of passes in the UEFA Champions League this season have both been netted against Club Brugge – 42 for Savinho’s goal for Man City (in January) and 34 for Jamie Gittens’s strike for Borussia Dortmund (in September).\nCharles De Ketelaere has been directly involved in nine goals in eight UEFA Champions League games for Atalanta this season (four goals, five assists). He could become the first player to reach 10+ goal involvements in a single UCL campaign for an Italian club since Edin Dzeko in 2017-18 (8 goals, two assists for Roma).\n20-year-old Joel Ordóñez (born in April 2004) is the youngest player to have played every minute in the UEFA Champions League this season (720). Indeed, the only Club Brugge player with more minutes played for the club in the competition while aged under-21 is current Atalanta man Charles De Ketelaere (1,084).\nAtalanta’s Lazar Samardzic has created seven chances with a line-breaking pass in the UEFA Champions League this season; the joint-most of any player during the 2024-25 league phase (also seven by Jamal Musiala and Joshua Kimmich).", "url": "https://www.bbc.com/sport/football/live/c30d204428dt"}