{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-04-26 04:23:31", "date_modify": "2025-04-26 04:23:31", "date_publish": "2025-03-03 13:10:38", "description": "Walsall's Liam Gordon says that the Saddlers will not 'underestimate' Carlisle United in Tuesday's 'bottom v top' clash.", "filename": "sport_football_articles_clyjgx551npo_1745641411.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c42e/live/9da25e70-f82f-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyjgx551npo_1745641411.html", "title": "Carlisle United v Walsall: Leaders will not 'underestimate' bottom side", "title_page": "Carlisle United v Walsall: Leaders will not 'underestimate' bottom side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "League Two leaders Walsall have vowed not to underestimate the backmarkers, Mark Hughes' Carlisle United, in Tuesday night's 'bottom v top' meeting at Brunton Park.\nThe Saddlers have won only three of their last 10 league games - to see their advantage at the top cut to four points, following Saturday's home defeat by Swindon Town.\n\"Everyone wants us to lose,\" Saddlers midfielder Liam Gordon told BBC Radio WM. \"It was their cup final and it will be Carlisle's on Tuesday night.\n\"But we know to never underestimate the teams at the bottom, as we're fighting for two different things.\n\"As long as we stay together, then something special is about to happen.\n\"It's always about the next game. Saturday is all forgotten about if you go and get three points on Tuesday night - and we're lucky we have a quick to chance to put it right.\n\"I don't know who created Tuesday night at Carlisle. We'd rather it was a Saturday game but we have to play every team in the league and it is what it is.\n\"There's no negativity. We're all it together. We all believe in each other and we're all pushing together. We've just got to be more ruthless in front of goal.\"\nWalsall have found goals harder to come by since teenage top scorer Nathan Lowe's return to parent club Stoke City in early January - but they did win 2-0 on their last long haul up the M6 to Carlisle's fellow strugglers Morecambe just nine days ago, with second-half goals from Taylor Allen and Jamie Jellis against 10 men.\nCarlisle, then only second bottom, were in the middle of a nine-game winless run when they went to Bescot Stadium in late October and on-loan Lowe scored after just two minutes to set Walsall, then only second top, on their way to a 3-1 win.\nBut, after the shock of their second managerial change of the season, on 3 February, just after previous boss Mike Williamson had brought in a new team during the January, there are already signs of a revival under Hughes.\nThe Welsh legend began with two defeats, but two successive goalless draws at home followed by a 1-0 victory in last week's all-Cumbrian clash at Barrow has at least offered hope.\n\"Three games is a decent run,\" Hughes told BBC Radio Cumbria. \"But we need to get back-to-back wins if we can. That would help us immensely.\n\"I told the lads they need to remember that emotion of winning and now we need to feel it again.\n\"Yes, it's a big game to come, but then every game from now until the end of the season is important. And we are managing games better.\"\nOpposite number Mat Sadler says that where the two teams are in the table is immaterial.\n\"It's just about us attacking the next game,\" he told BBC Radio WM. \"We just need to focus. You want to pick up points from every game and I don't put more relevance on one than another.\n\"The table doesn't have an effect on the game. It's not about what anyone else does.\"\nHaving said that, if Walsall do slip up again and Hughes' former club Bradford City win at home to Cheltenham, then the Saddlers' lead, which stood at 12 points when they lost Lowe, will be down to just one point.", "url": "https://www.bbc.co.uk/sport/football/articles/clyjgx551npo"}