{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:52", "date_modify": "2025-05-21 05:45:52", "date_publish": "2025-01-31 18:32:12", "description": "ILT20 results: Nicholas Pooran hits MI Emirates to win over Gulf Giants", "filename": "sport_cricket_articles_c99y72yjr4jo_1747806352.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d48/live/a413e0d0-e001-11ef-b1b3-51355c7a67fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c99y72yjr4jo_1747806352.html", "title": "ILT20 results: Nicholas Pooran hits MI Emirates to win over Gulf Giants", "title_page": "ILT20 results: Nicholas Pooran hits MI Emirates to win over Gulf Giants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Nicholas Pooran hit an unbeaten 58 off 37 balls as he drove MI Emirates to a five-wicket victory over Gulf Giants in the International League T20.\nHaving already hit six fours and two sixes, the West Indies wicketkeeper cleared the ropes once more from the first ball of Chris Jordan's final over to seal the win.\nChasing 174, Pooran came in at number five with his side 61-3 in the eighth over.\nHe started his innings slowly, scoring just 10 from his first 22 balls, but struck his first boundaries with back-to-back fours at the end of the 15th over to leave his team needing 71 from 30.\nFrom that point he powered on, accompanied by compatriot Romario Shepherd (23 not out from nine) who hit a six of his own from the final ball of the 19th to ensure MI Emirates needed just six from the final over.\nEnglish batter James Vince hit 86 off 50 balls from the top of the order for the Giants as they posted 173-6, but no other batter passed 20.\nIn a tight table, MI Emirates move up to second in the table with eight points from eight matches, while Giants are bottom with six from the same number of games.", "url": "https://www.bbc.com/sport/cricket/articles/c99y72yjr4jo"}