{"authors": ["Kenny Crawford", "www.facebook.com"], "date_download": "2025-05-19 15:09:08", "date_modify": "2025-05-19 15:09:08", "date_publish": "2015-02-20 16:49:48", "description": "Adam Rooney's instinctive brace against St Mirren helps Aberdeen go level on 57 points with Premiership leaders Celtic.", "filename": "sport_football_31466545_1747667348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81151000/jpg/_81151904_10678783.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31466545_1747667348.html", "title": "Aberdeen 3-0 St Mirren", "title_page": "Aberdeen 3-0 St Mirren - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Adam Rooney's instinctive brace against St Mirren helped Aberdeen go level on 57 points with Scottish Premiership leaders Celtic.\nThe Irishman's close range finishes - his 22nd and 23rd goals of the season - keep the pressure on Ronny Deila's side ahead of Sunday's match with Hamilton.\nSt Mirren's John McGinn tested Scott Brown with a first-half header.\nBut the Buddies failed to find a way of beating the Dons goalkeeper and watched Mark Reynolds head Aberdeen's third.\nIt means the Dons have successfully negotiated their way through the first match of the 13-game mini-season that manager Derek McInnes had described on Thursday.\nThe Aberdeen boss, under relentless questions about whether his side can maintain their title challenge, stressed the good performances to date this campaign were no longer relevant, but the remaining matches between now and May are of the utmost importance.\nMcInnes's deadline day signing from St Mirren, Kenny McLean, understandably had the spotlight shone firmly in his direction against his former club, but in the end it was the Dons' regular headline-grabber Rooney that crucially converted chances in each half to continue what is an extremely admirable goal haul this season.\nBoth, like so many before by the Irishman, were tucked home from inside six yards.\nFor the first, St Mirren's Stevie Mallan had cleared Rooney's header from a McLean corner off the line seconds before Reynolds made Mark Ridgers save well. But the ball worked its way back to McLean, who back-heeled for Peter Pawlett to centre and Andy Considine headed it back across goal for Rooney to stab in.\nAs St Mirren manager Gary Teale watched from the stands because of a touchline ban, former Buddie McLean also played his part in Rooney's second, scored in a similar fashion.\nThis time some sterling work down the left by Niall McGinn resulted in a deep delivery which McLean put back into the danger area for Rooney to score right-footed from a few yards out.", "url": "https://www.bbc.com/sport/football/31466545"}