{"authors": ["Victoire Eyoum", "www.facebook.com"], "date_download": "2025-05-20 12:39:32", "date_modify": "2025-05-20 12:39:32", "date_publish": "2023-08-03 17:18:21", "description": "As Italy's Gianluigi Buffon ends his remarkable career at the age of 45, BBC Sport Africa looks at how a Cameroon legend shaped his life.", "filename": "sport_africa_57166672_1747744772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/64EE/production/_118483852_gianluigibuffon.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_57166672_1747744772.html", "title": "Gianluigi Buffon: How Cameroon great Thomas Nkono inspired the Italy legend's career", "title_page": "Gianluigi Buffon: How Cameroon great Thomas Nkono inspired the Italy legend's career - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gianluigi Buffon's retirement at the age of 45 brings an end to a playing career that included a record 176 Italy caps and an unsurpassed Serie A appearance total of 657 league games.\nThings could have been so different, though, had Buffon not watched Cameroon when Italy hosted the 1990 World Cup, external.\nAt the time, Buffon was 12 and playing as a midfielder with dreams of scoring rather than stopping goals.\nBut that all changed when he saw Cameroon keeper Thomas Nkono.\nNkono and his Indomitable Lions had kept two clean sheets in three games but had suffered elimination in the group stage of the 1982 finals, drawing all of their matches.\nEight years later, they secured their first win at the tournament with one of the great World Cup upsets, keeping Diego Maradona at bay in a 1-0 win over holders Argentina in the opening match at the San Siro in Milan.\n\"I must say that Cameroon's 1990 World Cup team will always have a special place in my heart,\" Buffon told BBC Sport Africa.\n\"I remember all the 22 players because, for me, they were true heroes.\"\nWhile strikers Roger Milla and Francois Omam-Biyik caught the young Buffon's imagination, he found Nkono's personality \"the most stunning\".\n\"I was totally blown away,\" Buffon recalls. \"Watching Nkono in goal triggered something and motivated me to become a goalkeeper, because I loved to death the way he interpreted the goalkeeping role.\n“I loved his personality so much and the way he would come out of goal to punch the ball away. He also had exceptional reflexes.\n\"I loved scoring, which would give me so much satisfaction. But then that thing [seeing N'Kono] happened and I’m happy things went that way. That was an important sliding doors moment in my life.\"\nA year after that World Cup, Buffon joined the academy at Italian club Parma, where he honed his newly discovered goalkeeping skills.\nHe made his Serie A debut for the club in 1995 at the age of 17, keeping a clean sheet against AC Milan, who had that year's Ballon d'Or winner and three-time African Footballer of the Year George Weah in attack.\nBuffon soon established himself as the first-choice keeper at Parma, moving on to Juventus in 2001.\nDuring his first spell at Parma, Buffon crossed paths with Cameroon striker Patrick Mboma, who played for Cagliari for two seasons from 1998.\nBuffon could not help but discuss his admiration for Nkono, and Mboma put the two goalkeepers in touch with each other, leading to Buffon making the trip to Cameroon for Nkono's testimonial game in 1999.\n\"I was surprised to hear that Gigi Buffon became a goalkeeper because of me,\" Nkono admitted.\n\"I got to know him when he was playing in Parma, with my fellow countryman and 'little brother' Patrick Mboma.\n\"Patrick told me he was the future Italy national team goalkeeper. I didn’t know he changed his field position thanks to me, but I think he made the right choice.\"\nNkono had such an influence on Buffon's career that, in 2007, the man who had won the World Cup a year earlier named his first son after the Cameroon legend.\n\"We called my first-born Louis Thomas after Nkono, because I believe that he was a key figure in my life and for my career,\" said Buffon.\n\"He enabled me to do what I do, because if I had not been following the Cameroon team that day during that World Cup, I would probably not have become a goalkeeper.\"\nNo doubt there will be many goalkeepers around the world saying the same about Buffon himself.", "url": "https://www.bbc.com/sport/africa/57166672"}