{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:54:06", "date_modify": "2025-05-20 13:54:06", "date_publish": "2023-07-24 12:16:08", "description": "Notts County boss Luke Williams praises the off-field impact of Tobi Adebayo-Rowling on squad morale.", "filename": "sport_football_66291727_1747749246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F0AA/production/_130501616_shutterstock_editorial_13911029cq.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66291727_1747749246.html", "title": "Tobi Adebayo-Rowling: Notts County boss Luke Williams hails defender", "title_page": "Tobi Adebayo-Rowling: Notts County boss Luke Williams hails defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Notts County boss Luke Williams has praised the off-field impact of Tobi Adebayo-Rowling on squad morale.\nInjuries limited the defender to just six starts for the Magpies last season after his summer move from Ebbsfleet.\nAfter his return to action in pre-season, Williams said the 26-year-old had helped the squad even when injured.\n\"You don't have to look any further than Tobi to know that there is a happy camp and that everybody can laugh,\" he told BBC Radio Nottingham.\n\"He's incredible. We charge him up on the bus on the way to a game, we plug him in and then he's ready and full of life when we arrive.\n\"He's just a top guy and has that personality that everyone is drawn to, and we have to have that in the group as well.\n\"As much as we work hard and it's intense, still we have to have fun as well.\"\nAfter their dramatic play-off promotion from the National League in May, Notts will mark their return to the Football League with a trip to Sutton United on Saturday, 5 August.\nSpeaking after County's 1-0 friendly win at Boston on Saturday, Williams said the line-ups for their final two warm-up games - against Alfreton and Shrewsbury - would more resemble the starting XI for their League Two bow.\nThat could mean more game time for some of the new signings made over the summer, as County prepare for their first EFL campaign since 2018-19.\n\"I'm glad we have still got some time,\" he said.\n\"We can still work and make sure the players have been pushed as hard as they possibly can be pushed without breaking, and in that way they should be in perfect condition for the season.\"", "url": "https://www.bbc.com/sport/football/66291727"}