{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:29", "date_modify": "2025-05-21 07:16:29", "date_publish": "2025-01-14 00:00:00", "description": "Follow action from Tuesday's four games in the Premier League including Nottingham Forest v Liverpool, Chelsea v Bournemouth and Brentford v Manchester City.", "filename": "sport_football_live_c24nnry1lnnt_1747811789.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c24nnry1lnnt_1747811789.html", "title": "Premier League LIVE: Nottingham Forest v Liverpool, Chelsea v Bournemouth, Brentford v Manchester City", "title_page": "Premier League LIVE: Nottingham Forest v Liverpool, Chelsea v Bournemouth, Brentford v Manchester City - radio & text - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'It's happened too often for us this season'\nFT: West Ham 3-2 Fulham\nFulham\nFulham boss Marco Silva speaking to BBC Match of the Day: \"The result didn't reflect at all what happened on the pitch. The best team lost the game. The team that that tried to win the game and created chances didn't win as well. In football, you have to be strong at both ends to be a dominant team and mistakes that we made this evening cannot happen.\n\"We were penalised for the mistakes and it was completely our fault we didn't win the game.\n\"It's happened too often for us this season. It's happened over the last few weeks when we were playing too well. The goal conceded against Bournemouth and against Ipswich as well. We have been punished by our own mistakes.\"\n'We can be disappointed'\nFT: Nottingham Forest 1-1 Liverpool\nLiverpool\nLiverpool manager Arne Slot speaking to BBC Sport: \"I am a little bit disappointed, although when you're 1-0 down against Nottingham Forest it is maybe a lot to ask for a win because they've hardly given away any chances in the recent games that they have played. That is why I couldn't ask for more from our players. They created so many chances in the second half but to not score from all of those chances was a little disappointing of course.\"\nOn Matz Sels: \"He was also like this at Anfield, but also all season. It isn't just their goalkeeper, but the way they defended and because of that maybe they deserved to not concede a second or third goal because they threw themselves for every ball and cross. They fight with everything they've got and the fans were really loud and helped them a lot. Still, we managed to create more than a few chances to score and that is what pleased me most and maybe, not for the first time this season, we didn't get what we deserved.\"\nOn what changed in the second half: \"We were a bit more patient in the second half. Maybe the intensity was a little bit higher but maybe the other team is a little bit more tired too.\"\nOn the Jota & Tsimikas substitutions: \"I just wanted to bring more attacking threat to the team and the fact we scored immediately was just a bonus.\"\nOn the result as a whole: \"We should be disappointed, although they are having a great season. We want to win every game and they probably want to win every game as well. With how the game went I think we can be disappointed. They are a counter-attacking team and I think we only conceded one counter-attack and for us to come from behind shows the character and quality the team has. We must not get a habit of not getting what we deserved because it happened at Tottenham and it happened today and the analysts might not agree but based on expected goals we deserved more than 2-2 draw against Manchester United too.\"\n'It's a nice start but we can't get carried away'\nFT: West Ham 3-2 Fulham\nWest Ham United\nWest Ham manager Graham Potter speaking to BBC Match of the Day: \"It feels great. It's a big three points for us. It was hard-fought in a tough game, a London derby. Fulham started the game as a better team. We had some trouble trying to put pressure on them, but we changed that in the middle of the first half and were more aggressive. That helped us to put some pressure on them.\n\"We were disappointed to concede the goal early in the second half, but credit to the players, they stuck at it and stuck together.\n\"The start point is the foundation of togetherness and the foundation of a team. We were far from perfect. But in terms of application of the players and how they fought and suffered, they were really, really, good. We have to look at the context of what happened and it's been a tough week for the players and we have players missing, especially in the forward areas. But nevertheless, the team spirt, the team effort and willingness to try were fantastic.\"\nOn missing players due to injury: \"We don't really want to talk about the individuals that aren't there. It's about the team that's there. They did the best. The substitutes came on and did well. We need a good reaction from our substitutes and their reactions were really good today. The pressure got us another goal and that was the one that got us over the line.\n\"Danny Ings, Andy Irving, Ollie Scarles and Aaron Cresswell were all great. It's obviously nice to score three goals and long may that continue.\"\nOn Danny Ings: \"Danny had a massive game against Aston Villa. He hasn't played consistently for a while, so I just thought going from Friday to Tuesday was big for him and that he would be more useful towards the back end of the game and he has really helped us. It also means Mohammed Kudus is fresh and ready for another big game coming up for us.\"\nOn being back in management: \"It's stressful. I know how hard it is in this league. Marco Silva's team is in a fantastic moment. So to get three points is great. It's a nice start, but we cannot get carried away.\"\n'We can now aim a little higher'\nFT: Nottingham Forest 1-1 Liverpool\nNottingham Forest\nNottingham Forest goalkeeper Matz Sels speaking to TNT Sports: \"One point is a good result for us. Before the game there was a lot of talk from everyone about 'if we win or if we lose' but this was a good scenario for us. We scored a quick goal but then we know it is a small advantage.\n\"In the second half we knew they would have more spaces between the lines. They are a very good team, they use that space and created a lot of chances. We are happy with the point and are looking forward to Sunday.\"\nOn his personal performance: \"First half I did not have a lot of work but always against these teams there are a few moments. In the last 20-25 minutes they had quite a few chances. It is important for me to be there to help the team to stay in the game.\n\"In the end everyone could see that people had cramps and pains which shows that everybody fought for it and we deserved the point. We need to continue looking forward.\"\nOn the talk around the team: \"We are of course enjoying it. We had just won six times in a row, which is something positive. We need to enjoy these moments.\n\"We said before the season that if we took 40 points as quick as possible that would be great and we are now on 41 with 17 games to go. We can now aim a little higher and see where we end up by the end of the season.\"\nOn challenging for the title: \"We are not talking about this. We want to finish as high as possible in the league. A lot of people before the season said we would play against relegation so we need to enjoy the good momentum we are in. We take it game by game.\"\n'We dominated for 97 minutes'\nFT: Nottingham Forest 1-1 Liverpool\nLiverpool\nLiverpool manager Arne Slot speaking to BBC Radio 5 Live: \"In the first 10 minutes we had three or four shots off the target. We totally controlled and dominated the game for 97 minutes. They had one counter-attack and they score and then the opinion is that we didn't start the game well. I can only credit the effort and performance to do that against a team who don't give away many chances and to create as many as we did I couldn't have asked for more - except for a goal, of course.\"\nOn substitutes Tsimikas and Jota combining for the equaliser: \"If it had been open play then people could maybe say it was a tactical masterclass but it was a set-piece so I don't think I deserve any credit for that. It was a substitution where we brought an attacker on for a defender and the fact it immediately led to a goal you could say it was luck.\"\nFrustrated at the result? \"Since the new year, in two out of three games most agree with me where I say we deserve more than we got. The only one the pundits didn't agree with was the United game but when you look at the chances we both created we deserved more than a 2-2 in that one. Too many times now, we deserved more than we got and this is something we have to adjust as soon as we can. Our fans, our players and me, we want to win the league but we want the fans to come and see us and like what they see. We played some outstanding football in the second half.\"\n'Matz kept us in the game with some huge saves'\nFT: Nottingham Forest 1-1 Liverpool\nNottingham Forest\nNottingham Forest manager Nuno Espirito Santo speaking to BBC Match of the Day: \"First half was very organised. We did not allow too many situations for Liverpool. They had possession but were not able to break us.\n\"We knew in the second half that they would react. The game went a bit up and down and we knew in that moment that they could be dangerous. They had control and with the speed and the talent they created so many chances.\n\"Overall I'm proud of the way we worked. The running and desire of the players was incredible.\"\nOn Matz Sels: \"Amazing. Matz [Sels] kept us in the game with some huge saves. We are very proud. He is in a good moment. He has been able to keep us in games many times now, that shows how good he is. It also shows we have to do better in our defensive actions.\"\nOn Chris Wood: \"Two touches in front of goal and then Chris delivers. Clinical. Very good.\"\nOn the atmosphere: \"We cannot thank the fans enough. In the added time they were the ones running for us and pushing the players. This is the bond that we want.\"\nOn keeping momentum: \"It shows a lot for the way that the players commit themselves. To see them disappointed after the game is a good sign.\n\"We have to be fair with the game. Liverpool are very good, they had some good chances and are an amazing team. Being able to compete and challenge against them shows that we want to progress and continue.\"\nJames 'happy' to return after 'lonely and frustrating' period out\nFT: Chelsea 2-2 Bournemouth\nChelsea\nChelsea captain Reece James speaking to BBC Radio 5 Live: \"It was great to get the point and we should have really put it out of sight but football is like that. If you don't take your chances it can come back and hurt you.\n\"I am glad and honoured to be back representing this team and I am happy to be back to help the team. It was lonely and frustrating but I am really happy to be back helping the team.\"\nOn top-four ambitions: \"I think it is realistic if you look at how we play. When we have played against the top teams we don't shy away. We take it one game at a time and see where we will end up at the end of the season.\"\n'The second half of the season is more difficult'\nFT: Nottingham Forest 1-1 Liverpool\nLiverpool\nMore from Liverpool manager Arne Slot speaking to TNT Sports: \"The main reason to be frustrated is always being either 1-0 down or 1-1. At that point you want as much playing time as you can but the team who is happy with the current result wants as least as possible.\"\nOn improvements since last game v Forest: \"We were definitely better than the last time that we played them. That wasn't that difficult though. Back then we did not create much, today we did.\n\"To win games in the second half of the season is more difficult than in the first. Teams get used to playing you and they improve, they can even bring in new players or a new manager, and they fight for every point.\n\"If we continue bringing performances like in the second half today then we will not always be that unlucky that it ends with a draw.\"\n'Second half was like a ping pong match'\nFT: Nottingham Forest 1-1 Liverpool\nNottingham Forest\nNottingham Forest manager Nuno Espirito Santo talking to TNT Sports: \"It was a good game. It was entertaining. First half I think we were organised and didn't allow too many situations. The second half was like ping pong and that is when Liverpool become stronger, when they have space and with the speed and talent they have it is very dangerous. I am very proud of the team for the way they worked and ran, especially up and down and the sprints to recover and the desire to attack.\"\nOn Chris Wood's goal: \"It was a beautiful finish. It was clinical. It was good.\"\nOn the equaliser: \"When Liverpool made the changes, we were also about to make a change. Credit to Liverpool, they had a lot of chances.\"\nOn Matz Sels: \"He is in a good moment. He is full of confidence and he is keeping us in games. We are very thankful.\"\nOn the support: \"It is amazing. Today they helped us defend. We didn't have the ball for so much time and they kept supporting us realising how tough the opponent is. The support in the last seven minutes felt like they were giving extra runs to our players.\"\nOn being second: \"Of course we are satisfied. Especially because of the way the players work. I am so proud. We keep going. We want to enjoy the moment and we are competing very well.\"\n'It's a very, very positive start'\nFT: West Ham 3-2 Fulham\nWest Ham United\nWest Ham striker Danny Ings speaking to TNT Sports on Lucas Paqueta's winning goal: \"You just saw that Fulham were starting to control the game and I wanted to just come in and lift the tempo of the game.\n\"[Bernd Leno] hesitated a little bit on the ball and I thought I could nick it. And thankfully, Paqueta was there to score.\n\"He is a matchwinner for us, as simple as that. He's got that quality and his work rate is also great. He played the whole game chasing the ball. Sometimes, with this much talent, we don't often see that side. He's top quality.\"\nOn working with Graham Potter: \"He asked us to be brave to play. If you make mistakes, they are mistakes. You are human. It's about how you react. We competed from the start to finish. We haven't had much time working together but it is a very, very positive start. In the game against Aston Villa, we did really well for long periods and tonight, we showed great character to win three points tonight.\"\n'A fantastic three points'\nFT: West Ham 3-2 Fulham\nWest Ham United\nWest Ham manager Graham Potter speaking to TNT Sports: \"It's a fantastic three points, considering the players we were missing. It was a real team effort. We had to ride our luck at times and suffer. But we got three goals and pressed well to get those.\n\"We weren't prefect for sure. But the foundation and the starting point has to be preparing to suffer together and looking after each other. They did that. We suffered at the start of the game. We were bit more aggressive with pressing halfway through the first half and it helped us. We got the goals which was against the run of play at that time. Then we got the crowd involved and then I though it was a little better for us.\n\"You have to start with a solid base. The team has conceded some goals and the change of manager is never a nice feeling. We need to get the defensive side right and little bit of shape in the attacking perspective. It's three games in a week and you don't get enough training. We have just got to try and do our best and the players did that. They gave everything and sometimes when you do that, you can get a result.\"\n'We miss and then we concede'\nFT: Chelsea 2-2 Bournemouth\nChelsea\nChelsea boss Enzo Maresca speaking to BBC Match of the Day: \"I think first half we completely deserved to win the game. We should have scored three goals. When we conceded in the second half, we dropped. We deserved to win the game when we created so many chances.\n\"It was one of the best parts of the season in the first half. We were aggressive and the chances we created. We are a bit unlucky in scoring goals. We miss and then we concede. We need to continue. The bad thing as I said is that after the penalty, we drop and there is no reason we need to do that.\n\"The game was completely in our control and it's something we need to improve.\n\"I have concerns always even when we are winning matches. This is the Premier League, when you don't create chances and don't score then you have to be more concerned.\"\n'One more point but we wanted the three'\nFT: Nottingham Forest 1-1 Liverpool\nLiverpool\nLiverpool goalscorer Diogo Jota speaking to TNT Sports: \"I not only score goals but I scored with my first touch today which I felt gave the team a bit of momentum. I had one or two more chances and I think I could have given us the three points. Unfortunately I couldn't.\"\nOn combining with fellow sub Tsimikas for the goal: \"We were watching the cup goal from a few years ago where he [Tsimikas] passed it to me and so when we were on the touchline we said: \"Let's go now and recreate that, you take the corner.\" And it was a goal.\n\"It was one of those occasions where everything went right. But like I said I am not happy because I think we could have won.\"\nOn Matz Sels performance: \"I was just telling that to my former coaches from Wolves just now. He made two or three great saves. You want to do better but he was good as well.\"\nOn their lead at the top: \"It's a long way to go in the Premier League. Every ground you go to it's hard. It's one more point but we wanted the three.\"\n'We didn't take the right decisions in the final third'\nFT: Brentford 2-2 Manchester City\nManchester City\nManchester City boss Pep Guardiola speaking to TNT Sports: \"We're a bit disappointed but at 2-0 up we didn't manage to hold on to the lead and unfortunately we couldn't close the game. Today we didn't take the right decisions in the final third. I had the feeling that we didn't take the right decisions in the final third to close the game.\"\nOn the team being tired: \"With the absence of the central defenders, Rodri, with many things, we are not [at our best] and we didn't take the right decisions. It's fine, it's not a good place to come. Unfortunately, we couldn't win.\"\nOn if he is happy with a point: \"Yeah, it is what it is.\"\nOn why his side are struggling to hold on to leads: \"I don't know, it can happen. Sometimes it happens. We have to manage a little bit better but today was not bad.\"\n'These players want to give everything'\nFT: West Ham 3-2 Fulham\nWest Ham United\nWest Ham manager Graham Potter speaking to BBC Radio 5 Live: \"It was probably not one for the purists but from our point of view we are delighted with the three points. I think we started the game a little bit passive and credit to Fulham for being in the game well and we tried to get the crowd a little bit more involved.\n\"Fulham scored and we thought it was a bit tough. It was about sticking together. We had some breathing space but we were never comfortable and that's why it's nice to get over the line.\"\n\"The players want to give everything and they did and thankfully we managed to do it. It is straight back to work. We have got to get ready for another big game on Saturday. We know that is another big game and we need to recover and be ready.\"\nOn the January transfer window: \"We are always looking but it is a complicated market. We need to focus on the players that are here now.\"\n'I don't think we deserved to win'\nFT: Chelsea 2-2 Bournemouth\nBournemouth\nBournemouth boss Andoni Iraola speaking to TNT Sports: \"It's difficult to value. When you consider how Chelsea played and we played, I don't think we deserved to win. Cucurella is touching Semenyo and they scored. It should be changed. What do you have to check? I don't think we were better than Chelsea.\"\nOn David Brooks challenge: \"It was not violent. he just tries to grab him. It is not something violent. I don't understand why VAR gets involved in these things. I don't understand a lot of things from the referee today.\n\"I think first half they were playing like they were Chelsea and they were much better than us. We cannot play as slow as we were playing. I'm disappointed with the first half because we haven't seen the team we've been all season.\n\"Justin Kluivert is a strange one because with 25 players available he probably would have started. I wanted to have someone who could have improved from the bench.\n\"We have to analyse. Every game is different Chelsea are a very good team. I am happy for the players who have played in that number nine position.\"", "url": "https://www.bbc.com/sport/football/live/c24nnry1lnnt"}