{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:41:18", "date_modify": "2025-05-21 04:41:18", "date_publish": "2025-04-03 08:53:22", "description": "Newcastle 2-1 Brentford news: Fans' verdict", "filename": "sport_football_articles_cdx27lw4yxro_1747802478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdx27lw4yxro_1747802478.html", "title": "Newcastle 2-1 Brentford news: Fans' verdict", "title_page": "Newcastle 2-1 Brentford news: Fans' verdict - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Newcastle's win over Brentford on Wednesday.\nHere are some of your comments:\nNewcastle fans\nMatt: Did Sandro Tonali really mean that strike? The late movement of his foot suggests he did - but that's my heart ruling my head, maybe! On track for Europe again and perhaps a big win against Manchester United.\nPaul: Great win but we made hard work of it with either sloppy finishing or great last-ditch defending by Brentford. Alexander Isak wasn't at his best, taking time to pull the trigger but we could have easily been three goals up at half-time.\nDuncan: Any signs of a hangover from the cup success were soon dispelled. A good start from the whistle, with lots of pressure on the Brentford 18-yard box. A good all-round performance marred by Nick Pope's poor decision-making again. Tonali finished it with a wonder strike to secure the points and continue the push for Champions League football next season. Did he mean it? Absolutely! He has been going for long-range efforts like that all season. Our strongest player all season.\nRobbo: Difficult game and could have easily been a draw. Pleased with a win after such a historic few weeks. Good luck to the Bees for the rest of the season. Thought Kieran Trippier and Tino Livramento were brilliant. Did Tonali mean to score? Of course he did.\nBrentford fans\nBrahams: Very unlucky not to get a point and on another day all three! A strong performance full of passion. While Mikkel Damsgaard is a super sub to have, I just think we are missing (through injuries etc) a few game-changing players that we have in our squad. But that's not to take away anything from the performance away at a strong team who were on a high from their trophy win. I think the sky is the limit when Brentford have the full force of their squad playing week in week out.", "url": "https://www.bbc.com/sport/football/articles/cdx27lw4yxro"}