{"authors": ["Emma Middleton", "www.facebook.com"], "date_download": "2025-04-26 06:57:22", "date_modify": "2025-04-26 06:57:22", "date_publish": "2025-02-28 14:21:37", "description": "BBC Sport explains how the FA Cup fixtures are chosen, and which factors influence the decision.", "filename": "sport_football_articles_cx28pdjw8p3o_1745650642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f1f/live/3f9d9c30-f466-11ef-8dd5-1d47b25c094a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx28pdjw8p3o_1745650642.html", "title": "How does the BBC pick FA Cup fixtures?", "title_page": " How does the BBC pick FA Cup fixtures? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The process of deciding which matches are shown on the BBC is set out in a contract also signed by the Football Association and fellow rights-holders ITV.\nIt starts with the FA Cup draw, to determine which ties will take place.\nIn rounds one, three, five and the semi-finals, the BBC gets first pick of the matches it wants to televise. ITV then gets the second and third pick, before the BBC is allowed to make the fourth.\nThis opposite happens for other rounds, with ITV leading with the first pick, the BBC then making a second and third, and ITV a fourth.\nIt is only when the first pick is confirmed and scheduled that the other broadcaster can make their choices.\nFor each round, the BBC chooses two matches for television broadcast, with the option of showing additional games on BBC iPlayer.\nA team of BBC Sport editors and producers will discuss the ties once the draws for each round are made.\nThe decision comes down to factors including whether the tie appeals to a large audience, if the tie looks exciting, and whether the match will fit in the BBC's television schedule.\nWhen the BBC picks first, BBC Sport executive producer Stephen Lyle will inform the FA of the top choice, and propose a time for kick-off.\nThe FA will then confirm whether the clubs are able to play at that time, with local police forces often asked to advise on timings.\nOnce that has been confirmed, ITV will be able to make their second and third choices, and the process continues.", "url": "https://www.bbc.co.uk/sport/football/articles/cx28pdjw8p3o"}