{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:14", "date_modify": "2025-04-26 03:53:14", "date_publish": "2025-03-03 08:58:43", "description": "Newcastle 1-2 Brighton: Fan views on FA Cup game", "filename": "sport_football_articles_cly43w8w00ko_1745639594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly43w8w00ko_1745639594.html", "title": "Newcastle 1-2 Brighton: Fan views on FA Cup game", "title_page": "Newcastle 1-2 Brighton: Fan views on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the FA Cup fifth-round tie between Newcastle and Brighton.\nHere are some of your comments:\nNewcastle fans\nDavid: Never a red card. The defender had a hold of Anthony Gordon's shirt and he merely over-exuberantly shoved him off - pathetic refereeing. The same referee had let off a definite second yellow card for Carlos Baleba just 15 minutes before. Newcastle deserved to progress, despite not being at their best. Sandro Tonali and Alexander Isak were a class above. Brighton were very fortunate but hung in there and rode their luck.\nRich: The wheels came flying off the bus. We were unlucky with two offside goals but ultimately we lacked accuracy of passing, imagination and skill in nearly every position. A two-week transformation is required if we are to stand any chance in the Carabao Cup final.\nSimon: Another home defeat. It is becoming a frustration that every season seems to go in the same way. I don't know what I watched but it was amateurish and a calamity. Joelinton was just infuriating and he needs to rein his petulance in a little. Playing Isak was a mistake and I hope he wasn't injured. Gordon is out of the Carabao Cup final, which we will most certainly lose if we turn up defeated before kick-off. Eddie Howe has got a miracle to perform.\nChris: Some of our players aren't good enough for the Championship, never mind the Premier League. Do their brains switch off when the game starts? Do they listen to the manager? It looks like me and my son will never see Newcastle United win anything.\nBrighton fans\nBrian: What a fantastic end-to-end game, settled by a brilliant finish from Danny Welbeck. Brighton to win the FA Cup? Why not.\nBen: We played very well in attack and decently in defence. There were some silly fouls coming in, which shouldn't have done, but it was still a very good performance. Nice to see Solly March back on the pitch and getting the assist. What a player Danny is to get the final goal - what a legend.\nSergio: Welbeck was amazing but March also deserves credit for finding that deadly pass and putting in a shift defensively. They were both substitutes too! Fabian Hurzeler made some great calls in this game.", "url": "https://www.bbc.co.uk/sport/football/articles/cly43w8w00ko"}