{"authors": ["Andy Campbell", "www.facebook.com"], "date_download": "2025-05-21 04:55:54", "date_modify": "2025-05-21 04:55:54", "date_publish": "2025-04-04 14:09:48", "description": "What will the penultimate round of Scottish Premiership fixtures before the split throw up?", "filename": "sport_football_articles_cvgnlly1ep2o_1747803354.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/455a/live/71876c20-0e48-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgnlly1ep2o_1747803354.html", "title": "Scottish Premiership picks: Ibrox encounter, Murray & Wimmer in focus", "title_page": "Scottish Premiership picks: Ibrox encounter, Murray & Wimmer in focus - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last week's Scottish Premiership card looked like being a succession of largely comfortable home wins until Rangers snatched a dramatic late win at Dundee and Dundee United secured a narrow victory at Ross County.\nBut what will this weekend - the penultimate round of fixtures before the league split - throw up?\nHere are some names and games that could have a big say...\nThe last time Rangers and Hibernian met, they drew 3-3. Since then, both have been involved in goal-laden games, which whets the appetite for this encounter.\nHibs are front-runners to finish third - quite the turnaround since November when they were bottom.\nOnly Celtic - in the league and Scottish Cup - have beaten them in the interim as David Gray's side have amassed 10 league wins and five draws.\nThey are also scoring goals for fun - 48 in the Premiership.\nRangers, on the other hand, are leaking goals. They've conceded 12 under interim head coach Barry Ferguson, who bemoaned \"old habits\" after the win at Dundee.\nThe former Ibrox captain is yet to enjoy an Ibrox victory since replacing Philippe Clement, but did celebrate a penalty shootout triumph over Fenerbahce in the Europa League.\nThe table is set, the ingredients are in place, it's over to Rangers and Hibs to serve up another football feast.\nAmong those challenging Daizen Maeda for the Premiership's golden boot is Dundee's Simon Murray.\nThe 33-year-old forward and Dundee United counterpart Sam Dalby both sit on 13 league goals, two behind Celtic's Maeda.\nMurray netted his fifth in six games in last weekend's loss to Rangers.\nIt's St Mirren at home for Dundee on Saturday and Murray scored both when the sides last met in Paisley in December, sealing a 2-1 victory for Tony Docherty's side.\nA repeat performance would be welcomed by his manager, with the Dark Blues still second bottom, five points above St Johnstone.\nMurray is no stranger to a relegation scrap, having helped County survive the play-offs over the past two seasons, and seems just the sort of character that relishes such a battle.", "url": "https://www.bbc.com/sport/football/articles/cvgnlly1ep2o"}