{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:25", "date_modify": "2025-05-19 15:13:25", "date_publish": "2017-07-04 14:25:38", "description": "Rory McIlroy will tee up alongside world number two Hideki Matsuyama and Spaniard Jon Rahm in the first two rounds at the Irish Open.", "filename": "sport_golf_40497806_1747667605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1343E/production/_96801987_mcilroyhideki.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_40497806_1747667605.html", "title": "Irish Open: Rory Mcllroy to play with Hideki Matsuyama and Jon Rahm at Portstewart", "title_page": "Irish Open: Rory Mcllroy to play with Hideki Matsuyama and Jon Rahm at Portstewart - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tournament host Rory McIlroy will play with world number two Hideki Matsuyama and Spaniard Jon Rahm in the first two rounds of this week's Irish Open.\nJapan's Matsuyama leapfrogged McIlroy in the rankings after finishing in a share of second place at the US Open while Rahm is the world number 11.\nThe trio, who will start at 13:20 BST on Thursday, are the highest-ranked players in the Portstewart field.\nMcIlroy is ranked fourth after Jordan Spieth's recent move up to third spot.\nMatsuyama's Japan Open triumph last autumn started a remarkable run of four wins in five starts which included the World Golf Championship HSBC Champions event in Shanghai and the Hero World Challenge in the Bahamas.\n\"When you look at what he has achieved, not just last year and already this year, but over the past few years it is impressive how he goes about his business,\" said McIlroy.\n\"He is a very hard worker and anytime you are on the practice range he always seems to always be there and it is the same scenario when you are on the practice putting green.\n\"I heard he was interested in playing some links golf ahead of the Open, so we got in touch with his management team saying that would love to have him compete at Portstewart and we would do anything to help in getting him to the tournament.\"\nLast year's Masters champion Danny Willett will be in the next three ball off the first tee on Thursday at 13:30 with fellow Englishmen Matthew Fitzpatrick and Ian Poulter.\nWorld number 22 Tyrrell Hatton will start 10 minutes before McIlroy alongside Lee Westwood and emerging Irish star Paul Dunne.", "url": "https://www.bbc.com/sport/golf/40497806"}