{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-04-26 07:46:40", "date_modify": "2025-04-26 07:46:40", "date_publish": "2025-02-27 00:54:34", "description": "After a dreadful start, Rangers recovered at Kilmarnock to record a win in Barry Ferguson's first game in interim charge.", "filename": "sport_football_articles_ckgzznn71m7o_1745653600.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ebba/live/60936bb0-f4a5-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgzznn71m7o_1745653600.html", "title": "Barry Ferguson: Rangers go from 'horrendous' to 'different class' in interim manager's first game", "title_page": "Barry Ferguson: Rangers go from 'horrendous' to 'different class' in interim manager's first game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It was a moment Rangers legend Barry Ferguson had long dreamed of, but one which he thought had long disappeared into the night.\nFewer than 15 minutes into his debut as boss in his boyhood club's dugout, he must have thought he was locked in a nightmare.\n\"It was horrendous,\" Ferguson said of the way his players started against Kilmarnock, his new side going two goals down inside 14 minutes at Rugby Park.\n\"I was wondering at times if they were listening.\"\nFerguson couldn't be blamed for wondering as his side struggled to catch a breath in Ayrshire. His big return to Rangers was being ruined.\nBut, just shy of the half-hour mark, the interim manager put the floundering Clinton Nsiala out of his misery by replacing him and the rest of the players began to deliver what Ferguson called \"the type of Rangers performance I expect to see\".\nIt has been a whirlwind few days for the former Ibrox captain. They have been days during which he would rather have spent more time on the training pitch than has been possible.\nWhen asked about that woeful first 30 minutes, when Kilmarnock were cruising thanks to Joe Wright's header and Brad Lyons' lasered strike, Ferguson conceded he \"maybe gave the players too much information\".\nGiven the difficulties with defending set-plays under previous manager Philippe Clement, you might expect ways to rectify that would have been one of the first messages to get across. On the evidence of the first goal, it wasn't.\nIt was a familiar scene, with Rangers players either marking fresh air or falling to the ground. Watching on from the sidelines, Ferguson frowned.\nLess than three minutes later, more calamitous defending cost the visitors again. Ferguson stared deep into the night while, behind him, his coaching staff of Neil McCann, Allan McGregor and Billy Dodds fulminated.\nWhen Kilmarnock won in this fixture in October, Dodds was present in a media role, saying on Sportsound that day his former side's attitude was \"miles off it\".\nThat threatened to be the case again on Wednesday. Heads were down or shaking, shoulders were slumped, and confidence was devoid.\nThen, Vaclav Cerny struck to halve the deficit before the break. Just a matter of minutes after Nsiala was hooked.\nWhat followed was \"different class\", said Ferguson.\nIt was certainly a different Rangers.\nCyriel Dessers, who first hauled his side level and then shot them in front, revealed that Ferguson told them at half-time that \"we're still in this\".\n\"We came out and felt, 'hey, we're going to get them today' after that goal after half-time,\" the striker told Sky Sports.\nAn elated Ferguson couldn't hide his emotions when the final whistle peeped after what turned out to be a fairly comfortable win.\nRelieved, yes. But rational enough to realise Rangers are far from resurgent.\n\"You've got to be resilient at Glasgow Rangers,\" Ferguson said. \"There's demands and expectations to win every game and if you don't, you come in for criticism and you need to handle that criticism.\n\"There's a lot to work on and we'll work on it, but one thing they showed tonight was character.\"\nFor a fair while, Rangers have lacked in that department. There are still many unanswered questions when it comes to Ferguson's credentials, but he's a fine example of showing character.", "url": "https://www.bbc.co.uk/sport/football/articles/ckgzznn71m7o"}