{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:12:11", "date_modify": "2025-05-20 13:12:11", "date_publish": "2023-08-01 07:00:06", "description": "Aberdeen reportedly reject Lecce's offer for Ylber Ramadani as Everton are linked with Southampton's Che Adams.", "filename": "sport_football_66367825_1747746731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10496/production/_130601766_ramadanigossip.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66367825_1747746731.html", "title": "Scottish Gossip: Tierney, McTominay, Morelos, Kent, Jota, Adams, Stewart, Ramadani, Vata, Vente", "title_page": "Scottish Gossip: Tierney, McTominay, Morelos, Kent, Jota, Adams, Stewart, Ramadani, Vata, Vente - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen have rejected a £1.1m bid for Ylber Ramadani from Lecce, while the 27-year-old midfielder is also a target for Serie A rivals Hellas Verona. (Press & Journal), external\nAberdeen have thrown out an offer of £850,000 for Ylber Ramadani from Lecce, while Serie A rivals Hellas Verona are expected to join the bidding for the Albania midfielder. (Daily Record), external\nEverton are keen on Southampton's Scotland striker, Che Adams, with Wolves and Bournemouth also tracking the 27-year-old. (Football Insider), external\nSouthampton have cooled their interest in Sunderland 27-year-old Ross Stewart and will now pursue alternative targets as they consider a replacement should Che Adams be sold. (Football Insider), external\nScotland defender Kieran Tierney is among six players Arsenal are ready to sell following their £200m summer signing spree as manager Mikel Arteta believes the squad is now too large. (Football Insider), external\nManchester United have priced West Ham out of a deal for Scotland midfielder Scott McTominay and the London club have three alternatives to the 26-year-old in mind. (TeamTalk), external\nHibernian will pay Roda around £700,000 for new striker signing Dylan Vente, who had been attracting interest from Coventry City and Sunderland, as well as Serie B clubs Palermo and Pisa. (The Scotsman), external\nCeltic midfielder Rocco Vata has been snapped up by high-profile football agency CAA Base, with the 18-year-old joining some of the biggest names in world football on its books. (Daily Record), external\nSt Johnstone manager Steven MacLean is preparing to change his transfer plans with eight senior professionals on the sidelines through injury. (The Courier), external\nWatford are weighing up a move for former Rangers striker Alfredo Morelos, but the Championship club could face competition for the 27-year-old Colombian from teams in Saudi Arabia and LaLiga outfit Granada. (Daily Mail, print edition)\nRyan Kent could be sent out on loan by Fenerbahce if the Turkish club sign two of three transfer targets only a month after the 26-year-old winger signed a four-year contract after leaving Rangers. (Fotomac), external", "url": "https://www.bbc.com/sport/football/66367825"}