{"authors": ["Iqra Farooq", "www.facebook.com"], "date_download": "2025-05-19 14:41:51", "date_modify": "2025-05-19 14:41:51", "date_publish": "2017-08-14 11:05:01", "description": "Scotland play the Netherlands and the United States in Stirling this week in qualifiers for the Women's World Twenty20.", "filename": "sport_cricket_40742287_1747665711.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D892/production/_97324455_dm4womentrain-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40742287_1747665711.html", "title": "Scotland begin Women's World Twenty20 quest in Stirling", "title_page": "Scotland begin Women's World Twenty20 quest in Stirling - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland are in good shape to reach the Women's World Twenty20 for the first time, claims head coach Steven Knox.\nThey play the Netherlands and the United States in Stirling this week in a double round-robin qualifier.\nThe top two sides advance to the main qualifying event next year, with the 2018 finals then hosted by defending champions West Indies.\n\"We're shaping up to be a proper international women's cricket team, which is pretty cool,\" said Knox.\n\"We played the Netherlands last summer in the 50-over qualifiers and we managed to beat them.\n\"If we can keep that form going into this T20 competition, then we've got a good chance of progressing.\n\"Just the fact they're playing at home and in front of families and friends makes a huge impact along with knowing the conditions pretty well.\"\nThe Scots missed out on a place at the 2016 Women's World Twenty20 after losing to Ireland at the semi-final stage of the qualifying event in Bangkok.\nIreland were in Scotland earlier this month playing in the Celtic Cup series, with the visitors winning all three Twenty20 games.\nAhead of the World Twenty20 qualifiers, captain Abbi Aitken hopes hosting the competition will encourage more girls to take up the sport in Scotland.\n\"We had this as a main aim throughout the whole summer so the girls are raring to go. It's the first time we've had a major tournament in Scotland for a number of years. It doesn't come around too often for us,\" she said.\n\"I was the only girl playing in an all-boys tournament, so the fact these tournaments are happening now is exciting.\n\"The Wildcats are great role models for younger girls. Year after year we see participation levels increasing and long may that continue.\"\nAfter play was abandoned without an over being played because of rain on Monday, Scotland's matches against Netherlands and USA were rescheduled for Wednesday.\nFixtures:\nAll matches will be played at Stirling County cricket ground.\nTuesday, 15 August: USA v Netherlands\nWednesday, 14 August: Scotland v Netherlands & Scotland v USA\nThursday, 17 August: Scotland v USA & Netherlands v USA", "url": "https://www.bbc.com/sport/cricket/40742287"}