{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:55", "date_modify": "2025-05-21 07:49:55", "date_publish": "2025-05-18 17:06:31", "description": "Hampshire hit back from last week's thrashing by Nottinghamshire in emphatic style with an 89-run win over Warwickshire inside three days.", "filename": "sport_cricket_articles_cvg5131kzw4o_1747813795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a2e/live/f77bf6f0-3406-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvg5131kzw4o_1747813795.html", "title": "County Championship: Hampshire complete comfortable win over Warwickshire", "title_page": "County Championship: Hampshire complete comfortable win over Warwickshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire hit back from last week's thrashing by Nottinghamshire in emphatic style with an 89-run County Championship win over Warwickshire inside three days at Edgbaston.\nSet a target of 310, Warwickshire were all out for 220, unpicked by seamers James Fuller (5-56) and Kyle Abbott (3-44 and 8-91 in the match).\nAlex Davies (66) and Ethan Bamber (43) offered some resistance but the rest were blown away by a Hampshire side resurgent after their surrender at Trent Bridge.\nHampshire's second innings had closed in the morning on 203. Beau Webster took 4-57 and Bamber 4-60 but the match was decided by the visitors outbowling their hosts on a pitch which offered encouragement to seamers throughout.\nAfter Hampshire resumed on 159-6, already 275 ahead, Bamber quickly struck twice when Brad Wheal edged to second slip and Fuller's middle-stump was sent flying by an inside-edged slog.\nAbbott pulled Bamber for six in a handy run-a-ball stand of 32 with Toby Albert (43) before Webster had Albert and John Turner caught behind in three balls.\nA target of 310 offered an intriguing last chapter to an engrossing match and Warwickshire's chase began spectacularly. They were 10-2 after three overs after Abbott hit Rob Yates' off stump, Davies struck his first two balls for four and Tom Latham edged Abbott to wicketkeeper Ben Brown.\nUnfazed by the rocky start, Davies and Sam Hain added 68 in 24 overs. Hain looked in excellent form on his way to 30 but his season's story so far of getting in then getting out continued when he offered no shot to an Abbott in-ducker and was lbw.\nDavies reached a 66-ball half-century but was among the casualties as Fuller unleashed a ferocious spell from the Pavilion End, ripping out three for three in 12 balls. Webster and Davies were trapped in front by balls that kept low, either side of Ed Barnard tickling an outswinger to the keeper.\nAt 126-6, Warwickshire needed something special from their lower order on a pitch which had yielded just one half-century in each innings. It was understandably beyond them.\nZen Malik hoisted Turner to fine leg. Bamber and Che Simmons fought hard to add 43 in 17 overs before Fuller returned to complete his five-for by removing both.\nBamber edged behind, Simmons lofted to long leg and when Turner flattened Olly Hannon-Dalby's off-stump, Hampshire's reassertion of their qualities was complete.", "url": "https://www.bbc.com/sport/cricket/articles/cvg5131kzw4o"}