{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-04-26 07:03:37", "date_modify": "2025-04-26 07:03:37", "date_publish": "2025-02-28 08:05:11", "description": "Paul O'Connell says Ireland will not need to use the emotion of upcoming retirements as motivation when they face Six Nations title rivals France.", "filename": "sport_rugby-union_articles_ce344ywx8wqo_1745651017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/078a/live/b790feb0-f526-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ce344ywx8wqo_1745651017.html", "title": "Six Nations 2025: Ireland v France not about exits", "title_page": "Six Nations 2025: Ireland v France not about exits - Paul O'Connell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Paul O'Connell says Ireland will not need to use the emotion of upcoming retirements as motivation when they face Six Nations title rivals France next weekend.\nThe highly anticipated Aviva Stadium encounter will double as a top-two showdown and Dublin farewell for Ireland greats Peter O'Mahony, Conor Murray and Cian Healy, who will retire from Test rugby at the end of the tournament.\nBut victory over Les Bleus on 8 March (14:15 GMT) will put Ireland in the driving seat with one game left and O'Connell says the squad can be trusted to focus on the job at hand.\n\"Boys don't rely on emotion massively,\" said the forwards coach, who played with the trio for Ireland as well as O'Mahony and Murray at Munster.\n\"It's the icing on the cake rather than the whole cake these days. I don't think we'll be using it for emotion or to help us win the game. It's more about marking their contribution.\n\"It hasn't always been easy for them. They've had to keep coming back and keep fighting for their place. Pete has been in and out in the last few years, same with Conor Murray, Cian has had to reinvent himself and figure out a way to stay part of the group.\"\nO'Connell, who won the 2014 and 2015 Six Nations titles alongside the retiring trio, added: \"As I said, how much they enjoy it adds to the whole enjoyment for all the players and coaches.\n\"They've had to work really hard so it's about marking their contribution rather than using it as any motivation for us.\n\"I just don't think we need it for this weekend, we're good when we know how important it is and how serious the occasion is, but we're good when we're nice and clear as well and calm under pressure.\"\nWith captain Johnny Sexton having retired after the 2023 World Cup, Ireland will lose another 372 caps worth of experience when O'Mahony, Murray and Healy bring the curtain down after the Italy match in Rome on 15 March.\nAnd while the World Cup in Australia is still two-and-a-half years away, O'Connell admits Ireland will face a difficult period of adjustment without their three most experienced players.\n\"I'm sure it will be difficult and I'm sure there will be days when we struggle a little bit and we won't know why we're struggling, it'll be because that little bit of experience,\" admitted O'Connell.\nO'Connell said O'Mahony is \"very good at saying the right thing at the right time in the right way\", praised Murray's \"amazing temperament\" and hailed Healy's role as a leader of Ireland's props.\nBut he stressed the onus will be on the remaining members of the squad to step up in their absence.\n\"When you lose those guys, you probably won't know what the answer is when something's going wrong, it'll be hard to pinpoint it. Into that void other guys will have to fill the space.\n\"They have given a great example to other players of what you should do, how you should do it and how you go about your business.\n\"Hopefully a few of them are copying and pasting what they did and maybe coming up with their own version of it and it's helping them fill that void for us in time.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ce344ywx8wqo"}