{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:24:22", "date_modify": "2025-05-21 06:24:22", "date_publish": "2025-01-22 23:14:17", "description": "PSG 4-2 Man City: 'I accept the defeat because the best team won' - Pep Guardiola reacts after defeat", "filename": "sport_football_articles_cly7vey1p54o_1747808662.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad23/live/522742a0-d915-11ef-af7e-1b8cd76fd4b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly7vey1p54o_1747808662.html", "title": "PSG 4-2 Man City: 'I accept the defeat because the best team won'", "title_page": "PSG 4-2 Man City: 'I accept the defeat because the best team won' - Pep Guardiola reacts after defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola, speaking to TNT Sports: \"The first half they had some moments, we had some moments, but they were better.\n\"We scored the first goal, we could not control it. In that moment we were knocked out and they were lifted and then they were better. They were quicker, faster, stronger in the duels. They had control in the middle and we could not cope with that.\n\"I accept the defeat because the best team won. We have a last chance at home against Club Brugge. If we win then hopefully we can qualify.\n\"The game was never like we wanted but for that I give so much credit to PSG. They are an extraordinary team. But at 2-0 if we could manage it... but they scored right after. Then if we could keep the ball a little bit and stay like that it would have been better but we could not do it.\n\"To defend the result you have to keep the ball and we did not do that. They had it more, they attacked better and that is why it was difficult.\nOn City potentially going out of the competition: \"It could happen. If we don't win, we don't deserve it.\n\"Sporting is tough, PSG is tough, Juventus is tough, all the away games we had were difficult. This is the reality. We did not get enough points. The last game against Bruges will dictate what we have to do.\"", "url": "https://www.bbc.com/sport/football/articles/cly7vey1p54o"}