{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:24", "date_modify": "2025-05-21 07:40:24", "date_publish": "2025-02-11 00:00:00", "description": "Birmingham extend their lead at the top of League One to seven points with a one-sided 4-0 win over basement side Cambridge.", "filename": "sport_football_live_cp9xp4451kdt_1747813224.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cp9xp4451kdt_1747813224.html", "title": "Birmingham City 4-0 Cambridge United: Blues stretch lead at top of League One with win", "title_page": "Birmingham City 4-0 Cambridge United: Blues stretch lead at top of League One with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Birmingham extended their lead at the top of League One to seven points with a one-sided 4-0 win over basement side Cambridge.\nJay Stansfield gave Birmingham the lead from the spot in the 23rd minute with his 19th goal of the season in all competitions. It came after the hosts won a hotly disputed penalty when James Brophy shoved Ethan Laird.\nIt was 2-0 when Liam Bennett sliced the ball past his own goalkeeper Nathan Bishop on 39 minutes from Keshi Anderson's cross.\nKieran Dowell made it 3-0 in the 40th minute, side-footing home after Anderson dummied Stansfield's square pass.\nStansfield earned a second penalty in the 57th minute when he was pushed over by Ben Stevenson, but Bishop blocked his effort – ending his perfect record this season, having scored his first seven spot-kicks.\nSubstitute Luke Harris lashed home the fourth goal from 20 yards with 10 minutes remaining after former City defender Michael Morrison glanced away Scott Wright's cross.\nIt was City's biggest league home win since they beat Reading 6-1 in December 2014 and it extended their unbeaten League One run to 14 games.", "url": "https://www.bbc.com/sport/football/live/cp9xp4451kdt"}