{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:36:23", "date_modify": "2025-05-20 13:36:23", "date_publish": "2023-08-01 16:08:58", "description": "Ireland forwards coach Paul O'Connell believes suspended captain Johnny Sexton will be concerned about his lack of game time before the Rugby World Cup.", "filename": "sport_rugby-union_66376390_1747748183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/150F3/production/_130595268_bbc-sport-index-imagery-2-split-images-gradient-9d292b5d-6d20-4973-a1b3-3d497eca2856.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66376390_1747748183.html", "title": "Johnny Sexton: Ireland captain will feel uneasy about missing World Cup warm-ups - Paul O'Connell", "title_page": "Johnny Sexton: Ireland captain will feel uneasy about missing World Cup warm-ups - Paul O'Connell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paul O'Connell believes suspended Ireland captain Johnny Sexton will be concerned about his lack of game time before his World Cup swansong.\nSexton, who is set to retire after the tournament in France, will miss each of Ireland's warm-up games after being hit with a three-match ban for misconduct.\nThe 38-year-old has not played competitively since March.\n\"I'd say it's a worry for him, you know. He wants to finish playing really, really well,\" said O'Connell.\n\"I'd say he'd love to have a few more games under his belt.\"\nSexton was forced off by a groin injury in the final match of the Six Nations against England, ruling him out of the remainder of the season with his province Leinster.\nWhile forwards coach O'Connell concedes his former team-mate is likely to feel uneasy about the situation, he insists Sexton's extended absence is not a major worry for Ireland's management team.\n\"Whenever he's come back from injuries [previously], he rarely needs a lot of games to get back up and running,\" said O'Connell.\n\"It's a real strength of his. He's trained since the start of pre-season pretty much, he hasn't missed a training session.\n\"He seems to watch an awful lot of rugby, he thinks a lot about rugby, so I think that kind of helps him hit the ground running when he comes back.\n\"It is what it is. It's not something I'm worried about.\"\nIreland face Italy, England and Samoa this month before beginning their World Cup campaign on 9 September against Romania in Bordeaux.", "url": "https://www.bbc.com/sport/rugby-union/66376390"}