{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:50:55", "date_modify": "2025-05-20 12:50:55", "date_publish": "2023-08-03 12:24:22", "description": "Ricky Hatton joins new tournament-style Box Off competition as team leader for Manchester.", "filename": "sport_boxing_66395711_1747745455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16758/production/_130629919_rickyhatton0364-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66395711_1747745455.html", "title": "Ricky Hatton: Boxing legend joins new tournament-style Box Off competition as Manchester team captain", "title_page": "Ricky Hatton: Boxing legend joins new tournament-style Box Off competition as Manchester team captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world champion Ricky Hatton will lead a new team format boxing tournament called Box Off.\nBox Off will see London, Manchester, Birmingham and Leeds go head-to-head as teams in a knockout competition.\nHatton will be the team leader for his hometown Manchester and the first event is due to take place on 16 September in Telford.\n\"Ideas like this give people another chance at their big break and I love that thought,\" Hatton said.\nThe British Boxing Board of Control will back the pro tournament, which will mostly include novice boxers rather than seasoned professionals.\nThe Leeds captain is yet to be announced, but Grime star Jaykae, real name Janum Khan, will captain Birmingham and former Apprentice star Tom Skinner will oversee team London.\n\"I love Manchester and will not let the city's name not be associated with a loss,\" Hatton said.\n\"I was a carpet fitter to pay for my petrol and travel to training and events, and that kind of background makes you hungry as a fighter.\"\nThere will be several weight divisions, with men and women competing for each team.\nEach event will see the teams pick up points, with a final showpiece to be announced later in the year.\nUnlike most regional shows where a fighter's purse depends on their ticket sales, Box Off have committed to a signing on fee for each boxer and bonuses as they progress through the rounds or produce stoppages.", "url": "https://www.bbc.com/sport/boxing/66395711"}