{"authors": ["Ciaran Varley", "www.facebook.com"], "date_download": "2025-05-21 06:34:46", "date_modify": "2025-05-21 06:34:46", "date_publish": "2024-12-24 07:36:00", "description": "What connects David Healy to Away in a Manger? How many Cantonas? And why are West Ham fans dreaming of a Frank Lampard?", "filename": "sport_football_articles_ced85x95q2lo_1747809286.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0de2/live/419aa1c0-be0d-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ced85x95q2lo_1747809286.html", "title": "Christmas songs: David Healy, Eric Cantona, Frank Lampard and the greatest festive football chants", "title_page": "Christmas songs: David Healy, Eric Cantona, Frank Lampard and the greatest festive football chants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland's record scorer David Healy holds a special place in the heart of the nation, so it is appropriate that he is synonymous with a famous festive football chant.\nIn the mid-2000s, Northern Ireland fans began adapting the Christmas carol Away in a Manger to serenade their talismanic striker, substituting the last two words of the opening verse - \"he lay\" - with Healy's surname.\n\"Away in a manger/No crib for a bed/The little Lord Jesus/Laid down His sweet head/The stars in the bright sky/Looked down where Healy! Healy! Healy! Healy!\"\nKillyleagh man Healy netted 36 times in 95 appearances for his country, with some memorable goals including his winner against England at Windsor Park in 2005 – for Northern Ireland's first victory over their neighbours since 1972 - as well as scoring a hat-trick in a 3-2 win against Spain in 2006.\nHe also scored a record 13 goals in 12 games during the qualifying campaign for the 2008 European Championship, a feat recognised by a special award from then Uefa president Michel Platini.\nGary McAllister, chairman of the Amalgamation of Official Northern Ireland Supporters Clubs, told BBC Sport that Healy \"gave us all belief, no matter who we were playing that we actually had a chance of getting a result\".\nHe believes the 45-year-old \"gets in the Northern Ireland greatest XI easily\", alongside players like George Best and Pat Jennings.\nMcAllister said Healy's chant was started by fans at a time when there were efforts by his own organisation, the Irish FA and fans to remove sectarian chants and introduce a new song list.\n\"I just remember it really catching on,\" he said. \"I thought it was very clever.\"\nHis favourite memory of hearing the chant came the day after that famous victory over England in 2005.\n\"The next day, Colin Murray sang the song on Radio 1, before playing commentary of the goal,\" McAllister said.", "url": "https://www.bbc.com/sport/football/articles/ced85x95q2lo"}