{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 05:43:43", "date_modify": "2025-05-21 05:43:43", "date_publish": "2025-04-02 23:43:18", "description": "Bournemouth suffer a fifth successive Premier League loss as struggling Ipswich Town hold on to leave Vitality Stadium with three points and a 2-1 victory.", "filename": "sport_football_articles_ckg2zqg0532o_1747806223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/21a1/live/ff7b33e0-1014-11f0-992e-13a2fb1a4046.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg2zqg0532o_1747806223.html", "title": "Bournemouth 1-2 Ipswich: Cherries winless league run continues", "title_page": "Bournemouth 1-2 Ipswich: Cherries winless league run continues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth suffered a fifth successive Premier League loss as struggling Ipswich Town held on to leave Vitality Stadium with three points and a 2-1 victory.\n\"It's a bad result for us, but we need to stay together and focus on the things we can improve,\" said boss Andoni Iraola. \"We are in a bad period. They scored two goals with two shots on target, that was the worst part as we controlled the game.\"\nBournemouth have never played in European competition and a 3-1 win at Southampton in February had left Iraola's team fifth in the Premier League.\nHowever, they have not won a top-tier match since and, although they remain 10th, this was a big opportunity missed to get back on form.\nThey probably deserved at least a point, but, despite sustained pressure late on, Bournemouth could not find an equaliser as Ipswich secured only their fourth league win of the campaign.\nIt has been a fine season for the Cherries, but Iraola and the club's fans will be worried the campaign could end in disappointing fashion with this latest defeat hurting the chances of European football coming to Vitality Stadium.", "url": "https://www.bbc.com/sport/football/articles/ckg2zqg0532o"}