{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:56", "date_modify": "2025-05-20 14:42:56", "date_publish": "2023-07-25 13:55:19", "description": "'Some days I don't see my family' Kettlewell", "filename": "sport_articles_cv21473e8vdo_1747752176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce70/live/dd7504f0-2af2-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cv21473e8vdo_1747752176.html", "title": "'Some days I don't see my family' Kettlewell", "title_page": "'Some days I don't see my family' Kettlewell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There's a couple of early-risers around Fir Park it seems...\nStuart Kettlewell was up bright and early this morning giving a little insight into the day-to-day runnings of Motherwell as the Scottish Premiership season edges ever closer.\nThe 'Well manager couldn't be more involved if he tried, admitting everything \"revolves around football\"... What you want to hear from your manager, right?\n\"We speak about the work ethic and it isn't just for show,\" he told Sky Sports, external. \"We're in here everyday from 7am, Stephen Frail, Liam Jukes and myself and sometimes we find that it's the best time of the day to give us the chance to plan, prepare and organise everything that comes with the rigours of a Premiership club.\n\"When you have that willingness and that passion for success, sometimes it comes at a bit of a sacrifice - sometimes I don't see the family before I leave or when I come home but there will be no complaints from us. It all revolves around football.\n\"As I did at Ross County, I'm trying to get myself immersed in every aspect of the club.\n\"There's massive trust in the staff that are here that if I am caught up in transfers or recruitment stuff, we're still not missing a beat on what's happening on the pitch - on a daily basis, everything on the pitch is exactly how I want it to be.\nAnother wee thing you'll want to hear from the manager - how many more signings is he looking to add?\n\"The absolute minimum for me is we need another three.\"", "url": "https://www.bbc.com/sport/articles/cv21473e8vdo"}