{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:18:27", "date_modify": "2025-05-20 13:18:27", "date_publish": "2023-08-02 11:46:32", "description": "Brighton: 'You gave me a platform' - Chelsea's Levi Colwill", "filename": "sport_articles_cm5jx07vd5eo_1747747107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4145/live/5a6c6f20-3129-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cm5jx07vd5eo_1747747107.html", "title": "Brighton: 'You gave me a platform'", "title_page": "Brighton: 'You gave me a platform' - Chelsea's Levi Colwill  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Levi Colwill has thanked Brighton and the club's fans for their support during his loan spell.\nThe defender, who impressed during his time with the Seagulls last season, now looks set to sign a new contract with Chelsea, external.\nIt was understood Brighton had wanted to bring the 20-year-old back to the club on a permanent basis, but Blues boss Mauricio Pochettino see's him as part of his plans for the upcoming season.\nIn the message posted on his social media, external, the England Under-21 international said: \"I am proud to have played a small part in the club's success last season.\n\"You gave me an opportunity to play in the Premier League when no one else did. I thank Graham Potter for first bringing me to the club and to all the employees at the stadium and training ground for making it a great place to perform and develop.\n\"To the fans, you've always had my back! Since I got into the side, your continuous support made me feel comfortable to play the way I wanted to play and not fear about making mistakes. You gave me a platform to shine and show my ability in the best league of the world. I will never forget that you supported me.\n\"Lastly Roberto de Zerbi, you challenged me every day! You made me think and see football in a different way. I cannot thank you enough.\"", "url": "https://www.bbc.com/sport/articles/cm5jx07vd5eo"}