{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:03:08", "date_modify": "2025-05-21 07:03:08", "date_publish": "2025-03-29 00:00:00", "description": "Tune into BBC Radio 5 Live Final Score & BBC Radio London commentary and follow the live text for score updates and match stats as Fulham host Crystal Palace in the quarter-finals of the FA Cup.", "filename": "sport_football_live_cx298987dndt_1747810988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c6b7/live/38e40490-0ca5-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx298987dndt_1747810988.html", "title": "FA Cup Quarter-finals LIVE: Fulham 0-3 Crystal Palace", "title_page": "FA Cup Quarter-finals LIVE: Fulham 0-3 Crystal Palace - radio commentary, text, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Palace become the first of the final four\nWe're wrapping up our coverage of this FA Cup quarter-final tie but don't forget that today's other tie - Brighton v Nottingham Forest is live on BBC One and iPlayer from 17:00 GMT. We will also have build-up to that game on the website from 16:15.\nI'll leave you with the below highlights as Crystal Palace become the first semi-finalists for this year's competition.\n'Clear second yellow card for Wharton' - Silva\nFT: Fulham 0-3 Crystal Palace\nFulham\nFulham boss Marco Silva speaking to ITV1: \"One game until 25 minutes of the match, we completely dominated and we had three or four dangerous moments around their goal. We should have scored in those moments. You need to be ruthless and clinical. They are solid and compact. They set nine players around their box every single time and when we are able to create, we have to score. We didn't and we were not strong in both ends this afternoon.\nOn Adam Wharton avoiding a second yellow card: \"For me it is clear, it's a second yellow card but we are used to these kind of situations. I prefer to say we are unlucky but it has been a long story with us. Of course VAR cannot overturn this decision but you have many eyes inside the pitch, the linesman has all the angles to see it, the fourth official. It is a clear second yellow card, definitely. It would have a massive impact on the game but against us it is always more difficult to see. We have been unlucky in these type of situations and let's hope it will be balanced at the end of the season.\"\n'The individual quality is unbelievable'\nFT: Fulham 0-3 Crystal Palace\nCrystal Palace\nCrystal Palace manager Oliver Glasner speaking to ITV: \"Key number one was to survive the first 20 mins. We were really rusty after three weeks with no competitive game. We only had one training before this game with everyone coming back from the national team. The structure wasn't good and everyone struggled. Key number two was Eberechi's goal. It's unbelievable - the individual quality. Then we have the confidence and in our structure waiting for the right moments.\"\nOn Eze: \"What I told him I already said to you - it was so important the first goal because we got the belief back, we were really struggling in the beginning. You need something when you're struggling in the game, some positive actions to get the belief back.\nOn his team's effort: \"It's not fair to only talk about one player because it was such a great team effort. In the second half there was a lot of pressure because if they (Fulham) score one goal it would be a tight game again. It's a great group and everyone is here to help the team.\"\n'We deserved more'\nFulham 0-3 Crystal Palace\nFulham\nFulham winger Willian: \"We are sad because I think we deserve more. The first 25 minutes we controlled the game very well, we create chances to score the goal but in two counter attacks we concede two goals and it becomes more difficult to keep going. We try after that in the second half to score the goal to push but unfortunately today we did not do what we wanted because the plan was clear to go to the next stage but unfortunately not today.\"\n'We're confident in ourselves'\nFT: Fulham 0-3 Crystal Palace\nCrystal Palace\nCrystal Palace midfielder Eberechi Eze speaking to ITV1: \"It was an important goal. I'm happy to help the team and that's what I'm here for. We didn't start the best, it was difficult and there was a lot of defending but eventually we broke them down.\nOn his goal: \"I want to get the ball in the pockets and cutting inside, thank God it went in today. We took our chances when we got them and we put in a good performance.\nOn whether Crystal Palace have what it takes to win the FA Cup: \"We're confident in ourselves and we know what we can do, we know what we are capable of. It's games like today where you show the mentality which will get you further in the tournament.\"\n'We will do our best to take the opportunity'\nFT: Fulham 0-3 Crystal Palace\nCrystal Palace\nCrystal Palace captain Marc Guehi speaking to ITV1: \"We dug deep and got our rewards. Big credit to the manager and the staff, we make sure we are set up in the right way with real leaders on the pitch. There is resilience in the team and that's what we need.\n\"We'll take it one game at a time. We did what we had to do today, we focus on the league and then focus on who we get in the next round. One game at a time. We thank God for this opportunity so we will do our best to take it.\"\n'Glasner has done a tremendous job'\nFT: Fulham 0-3 Crystal Palace\nMark Schwarzer\nFormer Fulham goalkeeper on BBC Radio 5 Live\nCrystal Palace are a very good side and they are very organised. Oliver Glasner has done a tremendous job and the club itself from the top to the bottom is really well done. The recruitment has been excellent and they have put a squad together alongside individual brilliance from someone like Eze.\nIt's exciting to watch and if you are Palace fan you must be very excited right now.", "url": "https://www.bbc.com/sport/football/live/cx298987dndt"}