{"authors": ["Martin Watt", "www.facebook.com"], "date_download": "2025-04-26 08:11:08", "date_modify": "2025-04-26 08:11:08", "date_publish": "2025-02-26 12:05:50", "description": "Might Celtic face fight to keep Daizen Maeda?", "filename": "sport_articles_c9de52xe4d0o_1745655068.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecfb/live/db9ab5b0-f438-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c9de52xe4d0o_1745655068.html", "title": "Might Celtic face fight to keep Daizen Maeda?", "title_page": "Might Celtic face fight to keep Daizen Maeda? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Twenty five goals. Nine assists. An immeasurable work ethic.\nCeltic's Daizen Maeda continues to sparkle in the most productive season of his career.\nThe Japan forward's double in the 5-1 midweek rout of Aberdeen took him to the 25-goal mark and encapsulated his effectiveness.\nStarting as the central striker, Maeda settled Celtic's shaky start by reacting quickest to volley in the first-half opener.\nThen, having shuttled out to the left wing after Adam Idah's introduction on the hour, Maeda wrapped up the victory with an injury-time second from Alistair Johnston's delivery.\nMaeda had the most touches in the opposition box (6) of any player on the pitch, and his three shots on target brought two goals from an xG of 1.31, highlighting the quality of his finishing.\nIn the Premiership this season he now has 11 goals from 25 outings and boasts a shot accuracy of 46%. He looks a strong favourite to be crowned Scottish football's player of the year.\nIt's the other side of Maeda's game – the tracking back and relentless pressing – that endears the 27-year-old to team-mates and supporters too.\nHe contested a match-high 11 duels against the Dons, winning five, and contributed two interceptions.\nBrendan Rodgers described Maeda after the game as the \"symbol\" of his Celtic team - and admitted his impressive form may well bring interest from bigger clubs.\n\"Yes, I would think he would,\" said Rodgers. \"I think if you're scoring goals like he has, work as hard as he does, then of course that will always bring attention.\n\"But I also think the team and the structure of the team really promotes his qualities. He's a great symbol for our team and the collective.\"\nCeltic have already lost one Japan talisman, with Kyogo Furuhashi off to embark on a new adventure in Rennes. Might they face a fight to keep Maeda, who is under contract for a further two years, this summer?\nFormer Celtic goalkeeper Pat Bonner says Celtic are not the same team without \"vital cog\" Maeda at the heart of it.\n\"He's having a fantastic season,\" Bonner said on BBC Sportsound.\n\"He's so important to the team. That trigger of his press ignites the team into doing it. Take him out the team and they lack that piece, because he's so quick - he never stops. He's closing you down all the time and that then runs through the team.\"", "url": "https://www.bbc.co.uk/sport/articles/c9de52xe4d0o"}