{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 06:37:13", "date_modify": "2025-05-21 06:37:13", "date_publish": "2025-01-04 13:48:52", "description": "Luke Littler says he will never admit to being the best in the world at darts despite winning the 2025 PDC World Darts Championship.", "filename": "sport_darts_articles_cpq9007l1e3o_1747809433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68e5/live/3f98d650-ca9a-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cpq9007l1e3o_1747809433.html", "title": "Luke Littler: Teenage world champion says he will 'never admit' to being the best", "title_page": "Luke Littler: Teenage world champion says he will 'never admit' to being the best - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newly crowned world champion Luke Littler says he will never describe himself as the best darts player in the world.\nLittler, 17, became the youngest ever winner of the PDC World Darts Championship with a 7-3 victory over Michael van Gerwen at Alexandra Palace on Friday night.\n\"People will say I am the best at the minute but I've said I will never admit I am the best,\" Littler told BBC Breakfast.\n\"But, maybe my performances show I am the best.\"\nThe teenager was making only his second appearance at the tournament having reached the final on debut 12 months ago, losing to current world number one Luke Humphries.\nSince his Alexandra Palace debut in December 2023, Littler has risen from 164th to second in the PDC Order of Merit.\nSince lifting the Sid Waddell Trophy, Littler has received congratulations from across the world of sport.\nThe most meaningful to Littler was from former England captain David Beckham, a legend at Manchester United who the teenager supports.\nAt last month's BBC Sports Personality of the Year, Littler said he wanted Beckham to follow him on Instagram and he has since done so.\n\"David Beckham messaged me,\" Littler told BBC Radio 5 Live after his win over Van Gerwen.\n\"That's the biggest one [I've had]. He said 'well done and wow'.\"\nLittler's World Championship win finishes off a year in which his success has helped the sport grow massively.\nIn 2024, Littler was the most searched for sports person on Google in Great Britain and the third most searched person overall.\nAs well as winning the BBC's Young Sports Personality of the Year award and finishing second in the main award, Littler has featured on TV chat shows and is in Forbes' 30 Under 30 Europe list, uncharted territory for a darts player.\nDubbed the 'Littler effect', 'The Nuke' is aware of what his success has done for darts, with significant growth in the number of academies for children being formed across Great Britain in the last 12 months.\n\"It is good to see the family section full with my darts shirts,\" said Littler.\n\"I know what I have done for the sport and [it is] good for kids to experience Alexandra Palace.\n\"Even seeing the darts academy open in Warrington, it is special in my home town.\"\nAs well as his older brother, Littler's parents joined him on stage at Alexandra Palace to see him celebrate his World Championship crown.\n\"They have put the hard work and effort into me but just to get them on stage, and my brother's 21st [birthday] today, it is a good present,\" Littler said. \"My sister didn't want to come on stage.\n\"It is not a normal 17-year-old's life but it shows what I have done for myself.\n\"My parents got the right sponsors for me and they have also done a lot for me.\"\nLittler also spoke about the future of the PDC World Darts Championship and its home at the Alexandra Palace in London.\n'Ally Pally' has held the competition annually since the 2008 edition, but Matchroom Sport president Barry Hearn has suggested in recent interviews that the tournament could leave its iconic home because of the growth in the sport's popularity.\nIn response, Littler called on the PDC to consider facilities for players when debating whether to move venues.\n\"The guys at the PDC will do what is best for them,\" Littler told the BBC.\n\"But probably one of the main things is you can get an arena of 5,000 or 6,000 easy, but there's also getting the likes of the hospitality tickets [and] the player's practice rooms.\n\"We need somewhere to have a good practice and obviously, see the family.\"", "url": "https://www.bbc.com/sport/darts/articles/cpq9007l1e3o"}