{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:03:41", "date_modify": "2025-04-26 04:03:41", "date_publish": "2025-03-03 19:55:57", "description": "Ryan Reynolds and Rob McElhenney's bid to redevelop Wrexham's Stok Cae Ras ground has taken a step forward after plans for a new all-seater Kop Stand were green-lit by local authorities.", "filename": "sport_football_articles_cn0jg7ln0dro_1745640221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3270/live/e3c85150-f8e5-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn0jg7ln0dro_1745640221.html", "title": "Wrexham: Planning committee vote to approve new Kop Stand plans", "title_page": "Wrexham: Planning committee vote to approve new Kop Stand plans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ryan Reynolds and Rob McElhenney's bid to redevelop Wrexham's Stok Racecourse ground has taken a step forward after plans for a new all-seater Kop Stand were green-lit by local authorities.\nNew designs for the ground's iconic stand – drawn up by the same architects behind the new Tottenham Hotspur Stadium – were approved after a vote by Wrexham County Borough Council's planning committee.\nIn February, the north Wales club released images of revised plans for the new 5,500-capacity section - which would give the club the option to increase capacity at a later date, subject to a separate planning application.\nWrexham's chief executive officer Michael Williamson said: \"It was a pleasure to speak in front of the planning committee today and share the club's excitement and ambition to deliver an atmospheric and authentic new Kop Stand for our fans.\n\"We look forward now to turning this vision into reality and writing a new chapter in the rich history of our proud club and stadium.\"\nWrexham say the stand's proposed external brick facade design pays homage to the city's 'Terracottapolis' nickname, while the brick colour and textures are reminiscent of the historic Ruabon red brick from the local area and will look on to a public plaza.\nIt represents the latest boost for the north Wales side as the club seeks a third successive promotion under Hollywood co-owners Reynolds and McElhenney.", "url": "https://www.bbc.co.uk/sport/football/articles/cn0jg7ln0dro"}