{"authors": ["Emma Middleton", "www.facebook.com"], "date_download": "2025-05-21 05:47:31", "date_modify": "2025-05-21 05:47:31", "date_publish": "2025-01-14 14:25:13", "description": "BBC Sport looks at why the Australian Open is streaming matches in cartoon style.", "filename": "sport_tennis_articles_c4gx74rke13o_1747806451.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6e13/live/40304800-d274-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c4gx74rke13o_1747806451.html", "title": "Why the Australian Open is streaming matches in cartoon style", "title_page": " Why the Australian Open is streaming matches in cartoon style - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The tennis balls are unusually large, players' heads are out of proportion and the racquets they are holding sometimes seem to drift away from their hands.\nBut the scores are spot on.\nThis cartoon is the Australian Open's free-to-watch version of the live action taking place at Melbourne Park.\nHow has this come about?\nThe Australian Open's official YouTube channel 'live' option brings up a choice of ongoing matches to watch, featuring animated players on a virtual court.\nThey have real, human-voice commentary on top and the animation mirrors what is happening on court - even going as far as including racquet-smashing episodes, as well as the rallies.\nTennis Australia told BBC Sport the aim is to \"captivate a new generation of tennis fans, making the sport more accessible and engaging, particularly for kids and families\".\nHaving this animated form is giving people the chance to watch a 'live' version, even if they don't have various TV subscriptions.\nIn the UK, for example, the Australian Open is broadcast by Eurosport, which requires a subscription.\nA free-to-watch YouTube stream may also help appeal to younger audiences.", "url": "https://www.bbc.com/sport/tennis/articles/c4gx74rke13o"}