{"authors": ["Mark Palmer", "www.facebook.com"], "date_download": "2025-05-21 04:18:29", "date_modify": "2025-05-21 04:18:29", "date_publish": "2025-04-05 16:39:18", "description": "Swansea University win three out of four events against rivals Cardiff University in the Welsh Varsity Boat Race.", "filename": "sport_rowing_articles_c98gy5d76g1o_1747801109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd2e/live/3f0d44d0-123b-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rowing_articles_c98gy5d76g1o_1747801109.html", "title": "Swansea dominate Cardiff in Welsh Varsity Boat Race", "title_page": "Swansea dominate Cardiff in Welsh Varsity Boat Race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea University swept away Cardiff University on the River Taff to take the honours in Saturday's Welsh Varsity Boat Race.\nThree of the four races went to Swansea's crews to retain their grip on the title of top Welsh rowers in the event hosted in the Welsh capital.\nTheir men's senior eight had a convincing four-and-a-half length win, with Cardiff's senior women taking the sole victory for their team.\nWith the wind picking up in the morning, Swansea's rowers had strong wins in both the men's and women's novice events over the 1.7km course.\nWith windy conditions continuing in the afternoon, Cardiff's women picked up their team's only win with a three-and-a-half length victory over their academic rivals.\nSwansea's senior men then finished the day in style with a win which their captain Oscar Whitcombe described as one of the club's best rows of the season\n\"It was really windy at the top and really challenging. The wind again hit us as we came round the bend to Clarence Bridge, but we held in there,\" Whitcombe said.\n\"This sets us up nicely for the British Universities and Colleges (BUCS) regatta later in the season.\"\nWelsh beach rowing sprint international Frances Katirewa sat in the seven seat for Swansea's senior women, who lost to Cardiff, but coached the novice women's eight.\n\"It was an incredible win for the novice eight,\" she said. \"I've been coaching them since October with the hope of a Varsity win at the forefront of their minds and then coming here today to win in very tricky conditions. I am so proud of them\".\nWelsh Rowing senior national coach James Walker said the event was \"a great opportunity\" to talent spot on a pathway for rowers to go on to represent Wales and Great Britain.\n\"It was great to see Welsh internationals like Kiera Delaney and Menna Sutton on the water for Cardiff's women, but it was also an opportunity for other rowers to get into the spotlight,\" Walker said.\n\"We have rowers with Welsh vests here today, but in the past this event has seen competitors like Tom Barras and Josh Bugajski row for Cardiff and then go on to represent Wales and medal for GB at the Olympics.\"", "url": "https://www.bbc.com/sport/rowing/articles/c98gy5d76g1o"}