{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:11:57", "date_modify": "2025-05-21 05:11:57", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text commentary, score updates and match stats from Fleetwood Town vs Swindon Town in the League Two", "filename": "sport_football_live_c1jxd54k65gt_1747804317.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f744/live/53470660-107f-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1jxd54k65gt_1747804317.html", "title": "Fleetwood Town vs Swindon Town: League Two stats & head-to-head", "title_page": "Fleetwood Town vs Swindon Town: League Two stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fleetwood's feint promotion hopes took a serious blow as they fell to a 4-0 League Two defeat by Swindon at Highbury.\nGoals by Kabongo Tshimanga, Miguel Freckleton, a Rhys Bennett own-goal and a late contribution by Nnamdi Ofoborh were more than enough to see the visiting Robins take maximum points from this mid-table encounter.\nThis battle of Red and White armies started slowly, but Fleetwood's Owen Devonport came close to scoring from the edge of the area in the 19th minute. Then, Harrison Neal did the same, six minutes later.\nSwindon had few chances until the 36th minute, when they won a penalty following a desperate challenge by Bennett. Tshimanga scored, slotting the ball calmly down the middle to open the scoring.\nIan Holloway's men really put their foot down in the second half.\nFreckleton doubled their lead from close range two minutes in, before Bennett put through his own net after a dangerous low cross from the right essentially put the game to bed after 70 minutes.\nSwindon added the gloss with three minutes remaining as substitute Ofoborh fought into the box from the left flank and slotted a strike beyond Jay Lynch.", "url": "https://www.bbc.com/sport/football/live/c1jxd54k65gt"}