{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:26", "date_modify": "2025-05-19 15:27:26", "date_publish": "2017-08-11 13:41:06", "description": "Shaun Lunt scores two tries as Hull KR come from behind to win at Leigh in The Qualifiers.", "filename": "sport_rugby-league_40868997_1747668446.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4FB1/production/_97310402_leigh.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40868997_1747668446.html", "title": "Qualifiers: Leigh Centurions 16-20 Hull KR", "title_page": "Qualifiers: Leigh Centurions 16-20 Hull KR - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull KR recorded a second straight victory in The Qualifiers as they won at Leigh Sports Village for the second time this season.\nFollowing on from their 23-10 Challenge Cup win in April, they again restricted Leigh to two tries, from Daniel Mortimer and Atelea Vea.\nBut Rovers ran in three themselves from the experienced Shaun Lunt, who got two, and winger Ryan Shaw.\nJamie Ellis kicked four goals for Rovers, as did Leigh's Josh Drinkwater.\nBoth sides had won their opening game in The Qualifiers, but only Rovers and Warrington, who beat Catalans Dragons, now have 100 per cent records.\nLeigh coach Neil Jukes:\n\"Ultimately it was a game of inches - both teams competed high and kicked pretty well. Nobody gave each other an inch.\n\"There was a clear knock-on in the build-up to Lunt's second try and even though it went to the screen they (the video ref) didn't even look at it.\n\"In a game of that magnitude, you can't get those things wrong. It's a tough competition. Losing has not made it impossible. It has just added pressure on the next few games.\"\nHull KR coach Tim Sheens:\n\"To win two out of two and one against a Super League side certainly helps, there's no doubt about that. Leigh completed at a very high rate and they battered us in the middle.\n\"We got lucky on the play the ball for Lunt's try on the try-line. And we hung in right till the end. We were not as clever as them with our kicking options but we managed to keep turning their fellahs around.\n\"We will enjoy the win but it means nothing if we don't come out with the right attitude next week. London at home will be a tough game again.\"\nLeigh: McNally; Dawson, Fleming, Langi, Higson; Mortimer, Drinkwater; Hansen, Higham, Maria, Vea, Paterson, Burr.\nReplacements: Hood, Richards, Tickle, Stewart.\nHull KR: Moss; Carney, Blair, Hefernan, Shaw; Marsh, Ellis; Scruton, Lawler, Jewitt, Addy, Clarkson, Kavanagh.\nReplacements: Lunt, Greenwood, Atkin, Masoe.", "url": "https://www.bbc.com/sport/rugby-league/40868997"}