{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:40", "date_modify": "2025-05-20 12:23:40", "date_publish": "2023-08-04 13:50:57", "description": "Stockport manager Dave Challinor says that new FA guidelines surrounding gamesmanship will catch many players unaware this weekend.", "filename": "sport_football_66407915_1747743820.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11B9D/production/_130650627_gettyimages-1577040625.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66407915_1747743820.html", "title": "Dave Challinor: Stockport boss warns new guidelines will bring a spike in yellow cards", "title_page": "Dave Challinor: Stockport boss warns new guidelines will bring a spike in yellow cards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stockport manager Dave Challinor warned there could be an increase in the number of cards shown when the new season begins this weekend.\nAn FA crackdown on time-wasting will catch many players unawares, said the Hatters boss, who begin their League Two campaign against Gillingham.\nDeliberate time-wasting will bring an automatic yellow card.\nChallinor said he and his staff had addressed the matter after a pre-season friendly against Blackburn.\nHe said: \"We played a game on Friday where there wasn't a tackle in the game and we were told post-game that that game would have had 18 yellow cards.\n\"We looked back at them and had a referee in on Monday who went through them.\n\"He didn't agree that there was that many, but I would suggest that with the decisions that are going to be made early in the season around delaying re-starts, whether it be standing in front of the ball, or kicking the ball away half a yard - which in normal circumstances over the past 15 to 20 years would have been managed - there is going to be no management of that. They are going to be yellow cards.\n\"There could be people who become victims of that very early in football matches. It's very much zero tolerance and that's going to take a bit of getting used to.\n\"Players have been used to that for a long period. I suppose everybody is being warned that the potential for something happening at the weekend, and there being a fall guy as such, could have an impact.\n\"It's something we all have to be aware of.\"", "url": "https://www.bbc.com/sport/football/66407915"}