{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 03:42:51", "date_modify": "2025-05-21 03:42:51", "date_publish": "2025-04-06 17:35:55", "description": "Brentford head coach Thomas Frank has described the new format of the Club World Cup as \"ridiculous.\"", "filename": "sport_football_articles_cglxyd2yxn4o_1747798971.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b705/live/1e64d250-130a-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cglxyd2yxn4o_1747798971.html", "title": "2025 Club World Cup: Brentford's Thomas Frank calls competition 'ridiculous'", "title_page": "2025 Club World Cup: Brentford's Thomas Frank calls competition 'ridiculous' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brentford head coach Thomas Frank has described the Club World Cup as \"ridiculous\" ahead of its new format launching this summer.\nThe revamped inter-continental tournament, which is switching from a seven-team competition to one consisting of 32 sides, takes place in June.\nChelsea, Manchester City and Real Madrid are among those competing in the enlarged inaugural edition.\nThe competition has proven controversial since plans were first announced there is just over two months from it starting when Al Ahly face Inter Miami on 15 June.\nHowever last month it was announced that the overall prize fund, shared between all 32 teams based on different factors, will be £775m, with £407m divided between all participating clubs and £368m awarded on a performance-related basis.\nSpeaking on fixture congestion following his side's 0-0 draw with Chelsea at the Gtech Community Stadium, Frank said: \"It happens all the time.\n\"I once had this season that we had the least rest between games when we played Carabao Cup games and we played teams with bigger squads. I didn't think that was fair and it was the one time I raised it but if there is two days in between, we deal with it no problem and with three days, always there is no problem.\n\"Then there is a bigger conversation about the amount of games over a year- but that is not for us and more for the teams in Europe. Then there is the Club World Cup, which is ridiculous in my opinion. Then I understand it is too much.\n\"It's just because it is another tournament. Who wants it? No one.\"\nLater asked if he would be watching this summer's Club World Cup, Frank replied \"no, I will enjoy my summer. No chance [will I watch it].\"\nChelsea made a number of changes to their team which faced Brentford, mindful of Thursday's trip to Poland to face Legia Warsaw in the quarter-finals of the Conference League.", "url": "https://www.bbc.com/sport/football/articles/cglxyd2yxn4o"}