{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:26:40", "date_modify": "2025-05-21 04:26:40", "date_publish": "2025-01-23 18:57:03", "description": "Julie Forrest edges out Scottish compatriot Beth Riva to win the women's singles title at the World Indoor Bowls Championships in Norfolk.", "filename": "sport_bowls_articles_c79dqn44ezwo_1747801600.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8e2/live/8702a790-d9b9-11ef-abf7-8b2a99c77ef2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_bowls_articles_c79dqn44ezwo_1747801600.html", "title": "World Indoor Bowls Championship: Julie Forrest beats 21-year-old Scottish compatriot Beth Riva in women's singles final", "title_page": "World Indoor Bowls Championship: Julie Forrest beats 21-year-old Scottish compatriot Beth Riva in women's singles final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Julie Forrest edged out Scottish compatriot Beth Riva to win the women's singles title at the World Indoor Bowls Championships in Norfolk.\nForrest, 56, triumphed 11-8 8-9 2-0 to win the title for the third time after singles successes at Yarmouth in 2019 and 2020.\n\"I dug deep again. It was a matter of keeping my head and keep going,\" Forrest told BBC Sport.\n\"My brother-in-law died six months ago and I felt he was here with me. I feel he was there getting me through the games.\"\nRiva won the mixed doubles title on Tuesday alongside Jason Banks in what was the 21-year-old law student's first time competing in the tournament.\n\"I am delighted to compete in a final like that and it's been a great week. I've enjoyed every moment,\" Riva said.\n\"I was beaten today by the better player - Julie was unbelievably good. No matter how close I was getting my balls she was determined. She is a worthy winner and a legend who deserves the trophy.\"", "url": "https://www.bbc.com/sport/bowls/articles/c79dqn44ezwo"}