{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:27", "date_modify": "2025-05-21 04:35:27", "date_publish": "2025-01-18 00:00:00", "description": "Cameron Brannagan scores the only goal with a brilliant free-kick as Oxford United beat play-off hopefuls Blackburn Rovers.", "filename": "sport_football_live_cp8q19y3qrrt_1747802127.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cp8q19y3qrrt_1747802127.html", "title": "Oxford United 1-0 Blackburn Rovers: Rowett's unbeaten run continues", "title_page": "Oxford United 1-0 Blackburn Rovers: Rowett's unbeaten run continues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United continued their unbeaten run under manager Gary Rowett as they beat play-off hopefuls Blackburn Rovers at the Kassam Stadium.\nAn unstoppable free kick thundered in from Cameron Brannagan on 67 minutes – his first goal since the opening day of the season – proved the difference between the two sides.\nThe result made it four wins and two draws since Rowett took over on 22 December and saw the U's further secure themselves in mid-table, six points clear of the drop zone.\nIn the same period, Blackburn's fortunes have taken a distinct turn for the worse, with this reverse for John Eustace's side, who have just one win from their last six league outings.\nRovers, though, remain fifth following Middlesbrough's defeat at Portsmouth, but the Teessiders, along with West Brom and Watford are just a point behind.\nDespite their position in the table, Blackburn have found goals hard to come by this season with 31 in 27 games, although they have emerged on the right side of a 1-0 scoreline on six occasions.\nAgainst Rowett's rejuvenated outfit, though, Rovers could have few complaints about their hosts' being value for a bigger win then they secured, with Aynsley Pearsby far the busier of the two keepers.\nThere were few chances in a first half in which both sides just about managed to keep their opponents at arm's length.\nMark Harris had the ball in the net for the hosts after 10 minutes, reacting quickest to bundle home after Ruben Rodrigues had stung the palms of Pears, only for celebrations to be cut short by the linesman's flag.\nFor Rovers, John Buckley arrowed a long range effort inches over the upright and Andreas Weimann had an effort blocked by the legs of Jamie Cumming.\nOxford United boss Gary Rowett told BBC Radio Oxford:\n\"I was super impressed with the players today. I thought it would be a different type of challenge - a team in the top six coming here on the back of a good result. So it was one of those games where I was quite keen to see how we handle it and how we are going to play.\n\"I thought we started really brightly and we looked like we had a threat and there were loads of quality moments against a tough side who don't give many chances away.\n\"If we are going to win a game like this it was going to need a little bit of magic. We got the wrong side of an offside which I don't think was offside then Cammy [Brannagan] steps up and drills one in the top corner.\n\"It was a finish worthy of winning any game of football. It was the best performance from the team [under me]. To play against a good side like Blackburn and control large parts of the game and create some good opportunities was encouraging.\"\nBlackburn Rovers head coach John Eustace told BBC Radio Lancashire:\n\"It was a frustrating afternoon for us. I didn't think we started very well and rode our luck in the first 15 minutes. But after that, I thought we grew into it and played some good stuff.\n\"We were disappointed not to take any of our chances and we need to be better in that final third. Second half we couldn't match them for 10 minutes and then they have punished us with a very good free-kick.\n\"We have to learn from it and move on. It is pleasing to see the boys efforts fighting and pushing at the end but we were not good enough.\n\"Sonny Tronstad [who was injured in the first half] has done something to his hamstring so we will have to look at that. He has been player of the season up to now and you can see when he goes off the pitch we were a little bit different. We will have to adapt.\"", "url": "https://www.bbc.com/sport/football/live/cp8q19y3qrrt"}