{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:05:41", "date_modify": "2025-05-20 12:05:41", "date_publish": "2023-08-05 12:16:33", "description": "Manchester City: Josko Gvardiol says signing 'is a real honour'", "filename": "sport_articles_c9xjrnrgg78o_1747742741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c162/live/9f2cbef0-3389-11ee-9180-1bfd52fd8dec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c9xjrnrgg78o_1747742741.html", "title": "Manchester City: Josko Gvardiol says signing 'is a real honour'", "title_page": "Manchester City: Josko Gvardiol says signing 'is a real honour' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josko Gvardiol says he has always dreamed of playing in English football and is delighted that will be fulfilled at Manchester City.\nThe Croatia centre-back became the second-most expensive defender in history when he completed his £77m move from RB Leipzig.\n\"To be doing so now with Manchester City - after the season they have just had - is a real honour for me,\" he said.\n\"Anyone who saw Manchester City play last season knows they are the best team in the world. To win the Treble says everything you need to know about the quality this team has.\n\"To have the chance to work with Pep Guardiola will be amazing. I know I am not yet the finished article and I am sure my game will progress under the best coach in football.\n\"To be linking up with [Croatia midfielder] Mateo Kovacic will also be special.\"\nHe is also relieved to be playing alongside, rather than against, Erling Haaland who scored five in the second leg of the Champions League last-16 tie against Gvardiol's RB Leipzig.\n\"Luckily, I'm on his side now and I don't have to take care of him anymore!\" he said.\n\"Everyone last season wanted to avoid City as a team. We knew it was going to be hard. It's unbelievable the way they play at home and the atmosphere. Also, the calmness on the ball - it was just a different level.\"", "url": "https://www.bbc.com/sport/articles/c9xjrnrgg78o"}