{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 05:26:52", "date_modify": "2025-05-21 05:26:52", "date_publish": "2025-01-13 14:21:33", "description": "Former heavyweight world champion Tyson Fury announces his retirement from boxing.", "filename": "sport_boxing_articles_c1wejqevx1wo_1747805212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78bc/live/cfcab580-d1bc-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c1wejqevx1wo_1747805212.html", "title": "Tyson Fury retires: Former world champion announces retirement again", "title_page": "Tyson Fury retires: Former world champion announces retirement again - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world heavyweight champion Tyson Fury has announced his retirement from boxing.\nFury last fought in December when he lost his rematch against WBA (Super), WBC and WBO champion Oleksandr Usyk.\nThe 36-year-old Fury previously announced his retirement after beating Dillian Whyte in April 2022 but returned six months later.\nThe Briton has enjoyed two stints as heavyweight champion and holds a record of 34 wins, two defeats and one draw.\n\"Hi everybody, I'm going to make this short and sweet,\" Fury said.\n\"I'd like to announce my retirement from boxing, it has been a blast, I've loved every single minute of it and I'm going to end with this; Dick Turpin wore a mask.\"\nThe Briton shocked long-reigning world champion Wladimir Klitschko in 2015 to win the WBA (Super), IBF, WBO, IBO, and The Ring heavyweight titles.\nAfter over two-and-a-half years out of the ring, during which he tackled mental health issues, Fury returned to action in 2018 and became a two-time champion by beating Deontay Wilder to claim the WBC belt in 2020.\nFury's decision to retire denies fans the chance to see a long-anticipated clash with fellow Briton Anthony Joshua.\nOn Saturday, Joshua said a fight with Fury \"has to happen this year\" when speaking at the Ring Magazine awards.\nMatchroom's Eddie Hearn, who promotes Joshua, has however questioned the legitimacy of Fury's announcement.\n\"We've been here before. If that is the end, congratulations on a great career,\" Hearn told BBC Sport.\n\"One of the best heavyweights of this generation and made a bucket load of money. If your hearts not in it, if the fight has been punched out of you, it's definitely time to call it quits.\n\"A few people will always suggest that he could be calling a bluff, but I don't know him well enough to give you an answer. If you don't want it anymore, if your hearts not in it anymore, if you've had the fight punched out of you – it's a dangerous game.\"\nJoshua and Fury have been leading figures in the heavyweight division over the past decade but both are looking to bounce back from losses.\nJoshua suffered the fourth defeat of his career against IBF heavyweight champion Daniel Dubois in September, while Fury's last two trips to the ring have ended in losses against Usyk.\n\"You do not want to get in the ring with Anthony Joshua if you're doing it for money,\" Hearn added.\n\"You've got to want it. You've got to want to provide the British public with the biggest fight in the history of the sport. You've got to want to go to war with AJ and get that victory. If it's just a money thing, you've got enough money.\n\"I'm always an optimist. For me when that fight with AJ is a fight that can be made in two minutes in a room, I am always hopeful. But Tyson Fury's earned the right to make his own decisions. If he's done, he's done. If not, then we make the biggest fight in the history of the sport. Only time will tell.\n\"Every fight fan stops me in the street and asks when do we get to see that fight. AJ has made it very clear in last couple of days, he's called Fury out. It's quite unlike Anthony.\n\"Fury doesn't want the fight, there's nothing you can do. You can't drag him into the fight. I don't know whether this was a move to stop the flow of pressure because with AJ calling him out, pressure is mounting. It could be the start of a great build-up, great mind games or it could be the end of Tyson Fury's career.\n\"What lays in the palm of his hand is the biggest fight in the history of our country. Will he walk away from that? Maybe.\"\nKal Sajad, BBC Sport journalist\nA quick glance at the comments section on Fury's retirement announcement video tells you everything you need to know. We have been here before and only a few truly believe the Gypsy King's words.\nThe general feeling is that Fury will be lured back into the ring. A super-fight with Joshua, one which has been years in the making, makes too much money for it to not materialise – especially with the Saudi-funded heavyweight showdowns.\nAfter Fury's losses to Usyk and Joshua's shock defeat by Daniel Dubois, perhaps this is Fury's way to hype up a fight which had lost a bit of its appeal; make the public think it will never happen before it does. Fury's savvy boxing business acumen matches his in-ring intelligence.\nIf this is the end for the Morecambe fighter – and that's a big if – then he will go down as one of Britain's greatest heavyweights of the modern-era, and there is certainly no shame ending your career after defeats by generational great Oleksandr Usyk.", "url": "https://www.bbc.com/sport/boxing/articles/c1wejqevx1wo"}