{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 04:27:41", "date_modify": "2025-05-21 04:27:41", "date_publish": "2025-04-05 12:22:29", "description": "Pioneering female jockey Hayley Turner announces her immediate retirement from racing as she reveals that she is pregnant.", "filename": "sport_horse-racing_articles_cdxg917vxyxo_1747801661.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4c2/live/78bd2e90-1216-11f0-988a-a1e4cc68f9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cdxg917vxyxo_1747801661.html", "title": "Hayley Turner: Pioneering female jockey retires and announces pregnancy", "title_page": "Hayley Turner: Pioneering female jockey retires and announces pregnancy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pioneering jockey Hayley Turner has announced her immediate retirement from racing and that she is expecting her first child in October.\nTurner, 43, calls time on her career 25 years on from her first ride at Southwell in March 2000.\nIn 2011, Turner became the first female jockey to ride a Group One winner in Great Britain, guiding Dream Ahead to victory in the July Cup at Newmarket, before winning on Margot Did in the Nunthorpe Stakes at York a month later.\nOn Wednesday, Turner rode Spirit of Jura to victory at Southwell in her final race - her 1,042nd career win.\nTurner said: \"I have decided to retire from being a jockey following my winner at Southwell last week, especially as I had my first ride at the racecourse on 27 March, 2000.\n\"I am very excited to also announce that I am having a baby in October, all being well, which I have been planning for the last two years. My family and I are all very excited.\n\"I would like to thank everyone that has supported me over the years especially Michael Bell, David Simcock, Andrew Balding and Harry Eustace. I would also like to thank my riding agent, Guy Jewel, who has been my agent for the majority of my career.\n\"I am looking forward to my next life chapter but will be focusing on the baby in the short term.\"\nTurner retired for the first time in 2015, before returning to action in 2018.", "url": "https://www.bbc.com/sport/horse-racing/articles/cdxg917vxyxo"}