{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:44", "date_modify": "2025-05-19 15:06:44", "date_publish": "2015-02-09 14:10:37", "description": "Celtic will travel to face Dundee United in the only all-Premiership tie in the Scottish Cup quarter-finals.", "filename": "sport_football_31307148_1747667204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80887000/jpg/_80887205_fojut.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31307148_1747667204.html", "title": "Scottish Cup: Dundee United host Celtic in quarter-finals", "title_page": "Scottish Cup: Dundee United host Celtic in quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Favourites Celtic will travel to Tannadice to face Dundee United in the only all-Premiership tie in the quarter-finals of the Scottish Cup.\nScottish Championship outfit Raith Rovers, who knocked out Rangers on Sunday, are away to top-flight side Inverness Caledonian Thistle.\nLowland League side Spartans will have an Edinburgh derby against Hibernian if they defeat Berwick Rangers.\nQueen of the South host Championship rivals Falkirk.\nThe tie at Palmerston Park is a reward for the Dumfries side knocking out holders St Johnstone on Saturday.\nMonday's draw, made with the assistance of Scotland's world darts champion Gary Anderson, featured only three sides from Scotland's top flight.\nWith the quarter-finals scheduled for the weekend of 7/8 March, Celtic and United will now meet three weekends in a row.\nThe quarter-final comes the week before the sides meet in the Scottish League Cup final at Hampden Park and the Tayside outfit then travel to Celtic Park on 21 March on league duty.\nCeltic midfielder Liam Henderson hopes to help manager Ronny Deila realise his dream of completing a domestic treble of trophies.\n\"He said at the start of the season that's what his ambition is and obviously all the boys in the team are wanting that as well,\" he said.\n\"It's going to be a tough one obviously, away to Dundee United at Tannadice.\n\"They have been brilliant, play a lovely style of football and and they've got a lot of good players in every position, but I'm sure all the boys will be looking forward to it.\"\nPremiership leaders Celtic's last defeat was at Tannadice in December, since when they have gone on a seven-game unbeaten run, winning their last six.\nFourth-top United are themselves unbeaten in seven games and the tie of the round is given added spice by Celtic buying two of the Terrors' top players, Stuart Armstrong and Gary Mackay-Steven, on transfer deadline day.\nHowever, the midfielders are ineligible for the quarter-final as they are cup-tied for the competition, which culminates with the final at Hampden Park on 30 May.\nUnited midfielder Chris Erskine said: \"They are massive misses for us, were two of our best players and it's nice they will miss out.\n\"But I think people have been writing us off already, which is a bit silly as we've been playing well all season, the whole squad, not just Gary and Stuart.\n\"It's a hard draw obviously - the toughest we could have got - but I'm sure Celtic will be thinking the same thing about us.\n\"We beat Celtic at Tannadice in the last game, so I'm sure we'll take heart from that, home advantage will be good for us and I think, on our day, we can beat anyone.\"\nRovers midfielder Grant Anderson is hopeful of another upset against John Hughes' Caley Thistle and thinks the chances of a non-Premiership side lifting the trophy had increased.\n\"That all-Premiership tie knocks another top-flight team out, so it's burst wide open and it's looking interesting,\" he said.\n\"It is a tough one for us. Yogi's got them playing well and they have a good style of football up there and it is a distance to travel for us as well.\n\"But it's one we'll look on as winnable and we've got to go there with confidence.\"\nFalkirk defender David McCracken admits that the January switch of midfielder Mark Kerr and striker John Baird from promotion rivals Queens will make their tie even more intriguing.\n\"They've made a massive difference for us as they've a lot of experience there, so I'm sure that will add a bit,\" he said.\nThe lowest-ranked side to make the quarter-finals will be winner of the 17 February replay at Shielfield Park between League Two outfit Berwick and Spartans following their 1-1 draw in Edinburgh.", "url": "https://www.bbc.com/sport/football/31307148"}