{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:46:08", "date_modify": "2025-05-20 14:46:08", "date_publish": "2023-07-27 16:42:24", "description": "George Russell warns Formula 1 faces a \"challenging\" weekend with rain predicted at the Belgian Grand Prix.", "filename": "sport_formula1_66331506_1747752368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12A39/production/_130554367_gettyimages-1337092399.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66331506_1747752368.html", "title": "Belgian Grand Prix: Expected rain presents challenges for race officials, says George Russell", "title_page": "Belgian Grand Prix: Expected rain presents challenges for race officials, says George Russell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George Russell believes Formula 1 faces a \"challenging\" weekend with rain predicted at the Belgian Grand Prix.\nThe Mercedes driver said officials needed to make \"bold decisions\" to avoid putting drivers at risk at one of the world's most challenging circuits.\n\"Everybody wants a race but when you're going down that straight at 200mph and you can't see 50m in front of you, there will be huge incidents,\" he said.\n\"So [governing body] the FIA has a big responsibility this weekend.\"\nThe Belgian Grand Prix was called off without any racing laps taking place two years ago, when it was determined after several hours of trying to start the race that conditions were never going to be suitable.\nAnd this year's race at historic Spa-Francorchamps takes place less than a month since 18-year-old Dutch driver Dilano van 't Hoff was killed in a junior category race at the track.\nVan 't Hoff was unsighted because of spray in a wet race and collided with another car that had crashed into barriers and slid back on to the track along the Kemmel straight.\nThere was another fatality at Spa in 2019, when Formula 2 driver Anthoine Hubert was T-boned in the dry by another car after a crash at the top of the Eau Rouge swerves, a few hundred metres earlier in the lap.\nRussell said he felt that \"it was only a matter of time\" before an incident such as Van 't Hoff's happens again.\n\"Drivers aren't going flat out in the straight because they can't see, someone gets rear-ended and then there is a car in the middle of the track,\" he said.\n\"To have a race cancelled is not perfect for anybody but we don't want to see another huge incident as we've just seen.\"\nWeather forecasts say the chances of rain are variable through the weekend, which is being held to F1's 'sprint' format, but Friday's qualifying, Saturday's sprint race and the grand prix on Sunday could all be affected.\nMany drivers expressed concerns about the lack of visibility in F1 in wet weather, which they believe has been growing worse in recent years because of there adoption of wider tyres, bigger cars and ground-effect aerodynamics.\nFerrari's Charles Leclerc said: \"We are not exaggerating when we say we see nothing [in the wet] - we really don't see anything.\n\"We have quite a bit of downforce. There is quite a bit of spray and this causes quite a lot of incidents.\n\"Easy to say, much more difficult to find solution. The FIA is on it and trying to do the best. And then when is it safe to start a race?\n\"This is another topic for the FIA to look at closely - to not feel the pressure of starting a race just [to avoid] no running.\n\"We could be in that situation this weekend. Obvious to say, but safety needs to come first. And we shouldn't complain if we don't have any laps because it is not safe.\"\nThe FIA tested devices aimed at reducing spray at a test at Silverstone earlier this month but the experiment was not a success and Russell said: \"The fact is we are not going to find a solution for poor visibility for probably years to come.\"\nBoth Fernando Alonso and Max Verstappen said the problem was not unique to Spa and its high-speed nature.\nAlonso said: \"We will keep an eye on visibility. That is the biggest factor for us. Grip level normally is fine, no problem. Aquaplaning should also be fine because we don't expect huge level of rain or standing water. So it is just visibility is the biggest question mark.\"\nThe two-time champion said he had been \"surprised\" to find that \"visibility was borderline\" in a wet practice session last weekend at the Hungaroring, which is a much slower track.\nVerstappen said: \"I don't think it's track-related. There are dangerous corners [at Spa], yes, and in the wet there is more risk. But everyone is competent enough to make the right calls. If it's too wet, it's too wet.\n\"There are always things that can be done better but we are also racing in Monaco which is way more dangerous than here.\n\"Accidents happen and when you look back at the accident [involving Van 't Hoff], it is just extremely unfortunate the way it happened.\n\"I don't think there is a lot you can do to make it safer because there are other tracks out there where you have a crash and you are back on the track and with low visibility. It can happen again.\n\"A bit unlucky it happened at Spa two times quite close to each other.\"\nThe world champion said that the drivers had to accept that visibility would be limited if racing was to take place in the rain.\n\"You will know if it is safe or not,\" Verstappen said, \"but the visibility is going to be bad anyway, otherwise we cannot have any rain races any more.\n\"It's bad, but it has been bad for a very long time so I don't think there is a lot at the moment we can do about it.\"\nThe rules have been changed since 2021 so a result cannot be declared unless the field manages to complete at least two laps without being controlled by a safety car or virtual safety car.", "url": "https://www.bbc.com/sport/formula1/66331506"}