{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:02:54", "date_modify": "2025-05-20 12:02:54", "date_publish": "2023-08-05 13:03:52", "description": "Barrow begin the new League Two season in style with an impressive 2-1 win over Tranmere at Prenton Park.", "filename": "sport_football_66345954_1747742574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15C36/production/_90724198_football_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345954_1747742574.html", "title": "Tranmere Rovers 1-2 Barrow", "title_page": "Tranmere Rovers 1-2 Barrow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barrow began the new League Two season in style with an impressive 2-1 win over Tranmere at Prenton Park.\nA freak goal from Niall Canavan and a wonder strike from Kian Spence were the difference as Pete Wild's side got off to the ideal start in treacherous conditions on Merseyside.\nTranmere looked more threatening in an end-to-end first half as Josh Hawkes forced Barrow goalkeeper Paul Farman into action with a fierce shot from the edge of the box after just eight minutes.\nBut it was the visitors who took the lead after 19 minutes when Spence's speculative effort was unwittingly deflected home by Canavan in front of a delirious travelling support.\nThe home side should have been level in the 24th minute when the ever-dangerous Hawkes pounced on a poor backpass only to be denied by Farman, who came out to narrow the angle.\nWith half an hour remaining, though, Rovers were handed a lifeline when Harvey Saunders was upended in the box and Hawkes stepped up to calmly convert the penalty.\nHowever, with the home side looking the more likely to go on and take all three points, Spence blasted Barrow back into the lead in the 70th minute with a stunning effort from the edge of the area.", "url": "https://www.bbc.com/sport/football/66345954"}