{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:41", "date_modify": "2025-05-21 07:52:41", "date_publish": "2025-01-22 09:39:25", "description": "Cardiff City: Bluebirds have found momentum at right time - Steven Caulker", "filename": "sport_football_articles_cj4825vk1k9o_1747813961.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e85/live/13666040-d8a3-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj4825vk1k9o_1747813961.html", "title": "Cardiff City: Bluebirds have found momentum at right time", "title_page": "Cardiff City: Bluebirds have found momentum at right time - Steven Caulker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Steven Caulker believes former club Cardiff City have built momentum at the right time as they strive to pull clear of the Championship relegation fight.\nThe Bluebirds followed last weekend's south Wales derby win against Swansea City with a 2-2 Tuesday night draw at Millwall.\nA late goal from new signing Yousef Salech, who came off the bench at The Den, saw Omer Riza's side extend their unbeaten league run to six games.\n\"It was really, really important [at Millwall] just to keep momentum,\" Caulker told BBC Radio Wales Breakfast.\n\"It's six games unbeaten and seven if you include the FA Cup as well. I just think when the team's down the bottom fighting for points, those last-minute equalisers do feel like winners.\n\"I feel Omer's doing a good job. He started off really well, had a rough patch, and Cardiff seem to be turning a corner.\"\nCaulker says Cardiff, who host 20th-place Derby County on Saturday, have found momentum at \"a really good time\" in the season.\n\"You don't want to be in that relegation zone in March, you don't want to be there in April, and you certainly don't want to be there May,\" he added.\n\"I think they're full of confidence and they've got, let's say, a winnable game on the weekend against Derby County, which would actually see them start to pull away from the relegation zone [if they win]. So fingers crossed the momentum stays with them.\"\nThe draw at Millwall, in which Cardiff came back from 2-0 down, means Riza's side are two points clear of the relegation places in 19th ahead of Wednesday's Championship fixtures.", "url": "https://www.bbc.com/sport/football/articles/cj4825vk1k9o"}