{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:57:52", "date_modify": "2025-04-26 07:57:52", "date_publish": "2025-02-25 12:04:02", "description": "Liverpool news: Rotation 'difficult' at this stage of season - Arne Slot", "filename": "sport_football_articles_c1mn559x2jro_1745654272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fd5/live/259a3fc0-f36f-11ef-add3-5160ab1f5b9d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1mn559x2jro_1745654272.html", "title": "Rotation 'difficult' at this stage of season", "title_page": "Liverpool news: Rotation 'difficult' at this stage of season - Arne Slot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool head coach Arne Slot is reluctant to rotate his squad for Wednesday's home game against Newcastle as they continue to lead the Premier League title race.\nRight-back Conor Bradley is the latest player to be sidelined, with Slot confirming in Tuesday's pre-match news conference that \"it will be weeks\" before the 21-year-old will be back in contention.\nThat is in addition to fellow defender Joe Gomez, who is expected to miss almost all of the remainder of the season with a hamstring injury.\nSlot is optimistic midfielder Alexis Mac Allister will be \"OK\" for Wednesday's game - as long as he feels fine after Tuesday's training session - and Cody Gakpo's return is a big plus should Slot want to potentially reduce the workload of other forwards, including Mohamed Salah, at any point.\nWhen asked if he may freshen the side against the Magpies, Slot said: \"I'm not so sure. It is difficult because these players are trained for this and they are ready for this.\n\"They are in a certain rhythm and they have shown this season many times that they are able to do it.\n\"But it was the reason that I changed the line-up so drastically against Plymouth [in the FA Cup] because I don't think you can do this all season.\n\"You need once every four or five weeks, a normal week - and what I mean by a normal week is two games a week, not three games a week.\n\"Of course, it hurt us in the FA Cup but it also means that these players are now able to play five games in a row at the highest possible level.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1mn559x2jro"}