{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:00:51", "date_modify": "2025-05-20 13:00:51", "date_publish": "2023-08-01 11:54:52", "description": "Manchester United: Rasmus Hojlund transfer analysis", "filename": "sport_articles_c0xvv66y05do_1747746051.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/022c/live/a7bce0e0-2fba-11ee-9664-6135ab3d2b6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c0xvv66y05do_1747746051.html", "title": "Manchester United: Rasmus Hojlund transfer analysis", "title_page": "Manchester United: Rasmus Hojlund transfer analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Manchester's Joe McGrath has been discussing Rasmus Hojlund's imminent arrival at Old Trafford on The Devils' Advocate podcast: \"Hojlund is an interesting one. I would be a little bit gutted, not because I don't want Hojlund, but because the Harry Kane deal looks done and dusted. I honestly thought this summer was going to be the year Harry Kane makes his way to Old Trafford.\n\"But, if we splash £70m on Hojlund, I don't see it happening. It would be a bittersweet deal - I like that we're getting deals done early and we're not scrambling around for a striker last minute.\n\"I would be a bit gutted because Kane was going to be the one who would get us to the next level next year, and maybe push for second or even first spot in the Premier League.\n\"Let's see, Hojlund could be a great asset to Manchester United. Is he going to be a worldie straight away? No. How many goals is he going to get for us in the first year? It would be great if he got 15/16 goals but his record isn't amazing and it takes a while to adapt to how United play.\n\"So I'm a little bit apprehensive about it. I'm very excited to be proved wrong though, if he does come in and do very well straight away.\"", "url": "https://www.bbc.com/sport/articles/c0xvv66y05do"}