{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 04:20:02", "date_modify": "2025-05-21 04:20:02", "date_publish": "2025-04-05 15:21:41", "description": "Jockey Patrick Mullins wins the Grand National on Nick Rockett at Aintree as his trainer father Willie Mullins sweeps the first three places.", "filename": "sport_horse-racing_articles_cgm89zye9dwo_1747801202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2920/live/7a58e190-1234-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cgm89zye9dwo_1747801202.html", "title": "Grand National 2025 result: Nick Rockett wins at Aintree for Patrick and Willie Mullins", "title_page": "Grand National 2025 result: Nick Rockett wins at Aintree for Patrick and Willie Mullins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jockey Patrick Mullins won the Grand National on Nick Rockett as his trainer father Willie Mullins took the first three places in the race at Aintree.\nThe 33-1 chance denied last year's winner I Am Maximus, who finished second, with Grangeclare West in third. Favourite Iroko was fourth, ahead of Meetingofthewaters.\nIt was an emotional victory for winning owner Stewart Andrew, whose late wife Sadie died from cancer in December 2022, five days after watching Nick Rockett in his first race.\nBroadway Boy had led for much of the race but suffered a crashing fall on the second circuit.\nThe Jockey Club said both Broadway Boy and Celebre D'Allen - who was pulled up - were walked on to horse ambulances after being assessed on course by vets and taken to the racecourse stables for further assessment.\nBroadway Boy's jockey Tom Bellamy was taken to Aintree University Hospital for assessment. All other riders returned to the weighing room.\nThe start of the following race was delayed by about 15 minutes while the horses and jockey were attended to.\nCelebre D'Allen's rider Micheal Nolan was given a 10-day suspension after Aintree stewards ruled he had continued when his mount had no more to give and was losing ground.\nNick Rockett galloped away from top weight I Am Maximus after the final fence to win by two and a half lengths.\nThere was a further half-length back to Grangeclare West in third.\n\"It's everything I've dreamed of since I was a kid,\" said the winning rider, who is an amateur jockey.\n\"I know it's a cliche but when I was five or six years old, I was reading books about the National and watching black and white videos of Red Rum. To put my name there is very special.\"\nTo cap a dominant day for the father and son duo, they celebrated victory with 10-3 favourite Green Splendour in the final race of the meeting.", "url": "https://www.bbc.com/sport/horse-racing/articles/cgm89zye9dwo"}