{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:23:51", "date_modify": "2025-05-19 15:23:51", "date_publish": "2015-02-13 13:19:26", "description": "Brighton earn a potentially important point in their battle against relegation with a goalless draw at Sheffield Wednesday.", "filename": "sport_football_31423278_1747668231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81013000/jpg/_81013184_sheffieldwednesday.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31423278_1747668231.html", "title": "Sheffield Wednesday 0-0 Brighton & Hove Albion", "title_page": "Sheffield Wednesday 0-0 Brighton & Hove Albion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton earned a potentially important point in their battle against relegation with a goalless draw at Sheffield Wednesday.\nBoth sides had plenty of chances to secure victory, with Wednesday dominating the first half and Brighton having the better of the second.\nSergiu Bus had an effort saved before the break for the hosts, while Joe Bennett shot over for Brighton.\nAtdhe Nuhiu had a good chance to win it for Wednesday late on, but blazed over.\nThe point means Brighton remain 21st, one place and one point above Millwall, who occupy the final position in the relegation zone.\nSheffield Wednesday are 11th with 40 points, 13 away from the play-offs.\nSheffield Wednesday manager Stuart Gray:\n\"In the second half we dominated the game on a difficult pitch - again we're talking about the pitch - but I feel for Atdhe at the end there with the chance he's created for himself.\n\"He's gone to side-foot it and it's bobbled up and it's ended up going off his shin which is very frustrating.\n\"I wanted a response. On Tuesday we were very poor against Ipswich (in a 2-1 defeat) and I can't fault the effort. Again it's just that little missing piece of the jigsaw.\"\nBrighton manager Chris Hughton:", "url": "https://www.bbc.com/sport/football/31423278"}