{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:42", "date_modify": "2025-05-21 04:53:42", "date_publish": "2025-04-04 15:21:59", "description": "Leicester Tigers head coach Michael Cheika says there are \"no easy games\" in the Investec Champions Cup knockout stages as they prepare to face Glasgow Warriors in the last 16.", "filename": "sport_rugby-union_articles_cvg9mnrl8j2o_1747803222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f423/live/25d0a5e0-1167-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvg9mnrl8j2o_1747803222.html", "title": "Glasgow Warriors v Leicester Tigers: Hanro Liebenberg to captain the visitors at Scotstoun", "title_page": "Glasgow Warriors v Leicester Tigers: Hanro Liebenberg to captain the visitors at Scotstoun - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester Tigers head coach Michael Cheika says there are \"no easy games\" in the Investec Champions Cup knockout stages as his side prepare to face Glasgow Warriors in the last 16.\nChieka has made four changes to his side from their Premiership defeat by Saracens for the trip to Scotstoun.\nVeteran prop Dan Cole returns to the front row, alongside hooker Finn Theobald-Thomas, while Emeka Ilione is named in the back row.\nIn the backs, centre Dan Kelly replaces Joseph Woodward to partner Solomone Kata in midfield.\nClub captain Julian Montoya drops out of the squad, with Hanro Liebenberg taking over the role in the back row, while England forward Ollie Chessum is also unavailable.\n\"Any time you reach the knockout stages of Europe, every team remaining is a chance and every team remaining is a quality side,\" said Cheika, who is set to leave his role in charge of Tigers at the end of the season.\n\"There are no easy games in Europe and that's the case for us against the defending United Rugby Championship champions in their backyard.\n\"We are looking forward to this challenge and excited about Saturday's game, travelling to Scotland for some knockout rugby.\"\nURC champions Glasgow, who are playing their debut home knockout tie in the competition, make three changes to the side which thumped Johannesburg Lions in their last league match.\nAll three tweaks come in the forward pack, with Johnny Matthews and Zander Fagerson coming into the front row to join Nathan McBeth, and Matt Fagerson replacing Euan Ferrie at blindside flanker.\nGeorge Horne continues at scrum-half, having become the club's all-time leading try scorer last week, while Tom Jordan and Stafford McDowall combine again in the centres.", "url": "https://www.bbc.com/sport/rugby-union/articles/cvg9mnrl8j2o"}