{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:22", "date_modify": "2025-04-26 03:53:22", "date_publish": "2025-03-03 08:47:03", "description": "Man City 3-1 Plymouth: Fan views on FA Cup fifth-round win", "filename": "sport_football_articles_c1w0dyqy3g5o_1745639602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1w0dyqy3g5o_1745639602.html", "title": "Man City 3-1 Plymouth: Fan views on FA Cup fifth-round win", "title_page": "Man City 3-1 Plymouth: Fan views on FA Cup fifth-round win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Manchester City's performance in beating Championship side Plymouth in the FA Cup fifth round.\nHere are some of your comments:\nFranek: I was at the Etihad and I would just like to take a moment to applaud the away fans. They were so loud, even at full-time. However, at the end of the day, a win is a win. I was surprised when Haaland assisted De Bruyne - it's usually vice versa! Nico O'Reilly really burst on to the scene with two crucial goals. I have a feeling about him. I don't know what exactly but it's certainly a feeling...\nSteve: O'Reilly was excellent, but City's performance from corners was poor. Plymouth had one corner and scored, City had loads of corners before O'Reilly got the winner.\nSean: I thought it was a professional performance and eventually our quality shone through. We had a lot of the ball and they were always going to get tired. They defended well and made it difficult for us.\nAndrew: Plymouth had one corner and four long throw-ins in 95 minutes. Other than that, they had all 11 players behind the ball. It was only right that City won the game for playing football. Leyton Orient created more chances in the previous round!", "url": "https://www.bbc.co.uk/sport/football/articles/c1w0dyqy3g5o"}