{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:23", "date_modify": "2025-05-21 03:56:23", "date_publish": "2025-02-01 16:11:06", "description": "Nottingham Forest 7-0 Brighton: What Nuno Espirito Santo said", "filename": "sport_football_articles_cx2yxyqxvkzo_1747799783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ef72/live/2122efc0-e0a8-11ef-a544-6d6714619779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2yxyqxvkzo_1747799783.html", "title": "Nottingham Forest 7-0 Brighton: What Nuno Espirito Santo said", "title_page": "Nottingham Forest 7-0 Brighton: What Nuno Espirito Santo said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest boss Nuno Espirito Santo has been speaking to BBC Match of the Day: \"The response on the pitch from the players was beyond our expectations. We were concerned and we wanted to put it right because last week wasn't good enough. They were aware of that and the response was great.\n\"We were very fortunate and lucky to score first, an own goal but it was a good movement from Morgan [Gibbs-White]. He stepped into the box, had a good delivery and Brighton reacted immediately. After that, it is always difficult.\"\nOn Chris Wood's performance: \"Amazing. More than anything, it is the way he works for the team, the way he helps. Three assists from Anthony [Elanga] also - a hat-trick of assists - so more delight.\"\nOn Anthony Elanga's performance: \"Great. It is very beautiful to see. When he puts all of his talent [on show], it is very hard [to stop him].\"\nOn the Forest fans: \"Their support is great and we cannot thank them enough. It was beautiful to see the atmosphere at the City Ground, seeing our fans happy is what we work for. At the same time, seeing our players and the way they celebrate the other players' goals, is important.\n\"It's important for us that we keep this team spirit and try to build. We are confident going forwards.\"", "url": "https://www.bbc.com/sport/football/articles/cx2yxyqxvkzo"}