{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:27:21", "date_modify": "2025-05-20 12:27:21", "date_publish": "2023-08-04 07:12:06", "description": "Newcastle United: Southampton's Tino Livramento fee agreed", "filename": "sport_articles_c3gdxk37ve7o_1747744041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f29b/live/a31fefd0-3291-11ee-9e8a-f15a18c75fc0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3gdxk37ve7o_1747744041.html", "title": "Newcastle United: Southampton's Tino Livramento fee agreed", "title_page": "Newcastle United: Southampton's Tino Livramento fee agreed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Magpies centre-half Steve Howey has been reacting to the news that a fee for TinoLivramento has been agreed on BBC Radio Newcastle: \"Southampton have obviously got what they wanted because I think the fee is about £30-32m with add-ons, so close to about £40m. It has been bubbling away for a long time, so I'm pleased that we've got him.\n\"He's represented England at all levels. I think Eddie thinks that he's a possible England international and, again, it's a quality signing because the team will need strength and depth. The team could play over 50 games this season, with all the competitions and of course being in the Champions League.\n\"He does like to get forward, he's got a great engine on him, and he whips in a great ball as well, which the forwards will love. He likes to have good partnerships with people and an understanding.\n\"I saw him play against Newcastle and I was very impressed with him. After that, I've kind of kept an eye on him. I think Newcastle fans, the ones that don't know about him, will be surprised when he plays. They'll realise he's an excellent player and a very good prospect.\n\"Even though he's only 20 years old and had a bad injury which kept him out for around a year, he won't be coming here to sit on the bench. He'll want to be pushing for a place. Obviously you can only play 11 players, but it's a good step forwards to strengthening that squad.\"", "url": "https://www.bbc.com/sport/articles/c3gdxk37ve7o"}