{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:53:12", "date_modify": "2025-05-20 12:53:12", "date_publish": "2023-08-03 10:18:22", "description": "'I'm hanging my hat on Theo' - Kettlewell backs Bair to defy doubters", "filename": "sport_articles_c030dny4r37o_1747745592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/98ef/live/6a57eb90-31e6-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c030dny4r37o_1747745592.html", "title": "'I'm hanging my hat on Theo' - Kettlewell backs Bair to defy doubters", "title_page": "'I'm hanging my hat on Theo' - Kettlewell backs Bair to defy doubters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell boss Stuart Kettlewell is confident new signing Theo Bair can follow the example of Scotland striker Ross Stewart by proving the doubters wrong.\nCanada cap Bair, 23, has moved to Fir Park after one goal in 38 games for St Johnstone, although most of his appearances came as a substitute.\nKettlewell was Ross County co-manager when they signed Stewart from St Mirren in 2018 after he had failed to net a Championship goal for the Buddies and had been loaned out to Alloa.\nThe forward helped County to promotion and made his mark in the top flight before moving to Sunderland and hitting 40 goals in his first year.\n\"I have always been someone that looks for people that need a second chance, who have room for growth,” said Kettlewell.\n\"When I was at Ross County we signed Ross Stewart from St Mirren - hadn't kicked a ball really. And I am not trying to heap this pressure on Theo but I think if you scoured the country and asked anyone if they would want to take Ross Stewart in the top flight at that time the answer would have been no.\n\"I understand people might doubt the fact that Theo has had one goal at St Johnstone and maybe limited game time. But I see, and the staff see, something in Theo that we think is going to connect with how we play, and I think that will be a success in the Premiership.\n\"I am hanging my hat on Theo Bair and I think there is loads of room for growth.\n\"Theo will have a bit of frustration in his time at St Johnstone but it's now my job and Theo's job to essentially prove doubters wrong. One thing I love doing is proving people wrong.\"\nMotherwell start the new campaign needing to adapt to the loss of Kevin van Veen, who has moved to Groningen after hitting 29 goals last season.\nKettlewell's three experienced strikers - Jon Obika, Conor Wilkinson and Bair – hit five goals combined last term.\nKettlewell said: \"I need to think overall, not just in the striker situation, how we adjust and score goals and get assists from other areas of the pitch. And how can we eke out a little bit more from the other guys in terms of numbers?\n\"Jon had a definitive role within our team when he was playing as a strike partner with Kevin. Maybe that changes some of the positions he takes up, which gives him greater opportunity.\n\"Conor will be a guy that backs himself to score goals in this league. I also think we have good quality in other areas, midfield, set-plays.\"", "url": "https://www.bbc.com/sport/articles/c030dny4r37o"}