{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:17:49", "date_modify": "2025-05-19 15:17:49", "date_publish": "2017-07-04 11:36:56", "description": "Championship club Preston North End appoint former Norwich and Hamilton boss Alex Neil as their new manager.", "filename": "sport_football_40493654_1747667869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79DF/production/_96799113_neil2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40493654_1747667869.html", "title": "Alex Neil: Preston North End appoint ex-Norwich boss as manager", "title_page": "Alex Neil: Preston North End appoint ex-Norwich boss as manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Championship club Preston have appointed former Norwich and Hamilton boss Alex Neil as their new manager.\nThe 36-year-old has replaced Simon Grayson, who left North End to join Sunderland on 29 June.\nThe Scot will take up the role officially on Thursday after being given a one-year rolling contract.\n\"It is a really good challenge for me. The club has made progress and I am looking forward to trying to continue that progress,\" said Neil.\nNeil has been out of the game since March, when he was sacked by Norwich after 27 months at Carrow Road.\nHe led Norwich into the Premier League via the Championship play-offs in 2015, but the Canaries lasted only one season in the top flight before being relegated.\nPreston finished 11th in the Championship last season but Neil believes he has a squad with the ability to challenge for a higher position in the table.\n\"The ultimate aim for any club in the Championship is to try to get promoted at some stage,\" said Neil.\n\"The club has been stable in the Championship for the last two years and you never know what is going to happen in the next year or two, but we want to try to build a side and a squad that is capable of competing at the top end of the Championship.\"\nPreviously, Neil had spent two years at Hamilton, guiding the club into the Scottish Premiership in his first full season.\nHe becomes Preston's youngest permanent manager since fellow Scot David Moyes, who was 34 when he took over as player-manager at Deepdale in 1998.", "url": "https://www.bbc.com/sport/football/40493654"}