{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:32", "date_modify": "2025-05-21 04:16:32", "date_publish": "2025-02-01 00:00:00", "description": "Live professional championship boxing from the Ulster Hall in Belfast, as John Cooney puts his Celtic super featherweight belt on the line against Welshman Nathan Howells and Colm Murphy defends his Commonwealth silver featherweight title against Kasimu Hamad Haji in the co-main event.", "filename": "sport_boxing_live_c93q0vlq7n4t_1747800992.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_live_c93q0vlq7n4t_1747800992.html", "title": "Watch: Nations Fight Night", "title_page": "Watch: Nations Fight Night - Northern Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's a wrap!\nSome good fights in Belfast including Colm Murphy retaining his Commonwealth title.\nWe hope you enjoyed it but that's all from us for now.\nThanks for your company.\nAlin makes it three wins from three\nNations Fight Night\nTeo Alin comes through on points in the final fight of the night and it was a very lively one against the always dangerous Brayan Mairena.\nA very good test for the Cookstown man against the Nicaraguan who has previous for causing an upset, but Alin takes it 40-36.\nThat's a wrap from the Ulster Hall tonight. We hope you enjoyed it as much as we did.\nKnockout night for Murphy\nNations Fight Night\nColm Murphy retains his Commonwealth silver featherweight title as the body attack does the job against Haji.\nA patient start gradually gave way to more pressure and it was the attack downstairs that finally ended the argument with the Tanzanian down and unable to beat the count in the third.\n'Posh Boy' improves to 14-0 on his headline night.\nWe're not finished at the Ulster Hall as there is one more contest to come with Cookstown's Teo Alin taking on Brayan Mairena.\nTo watch all the action, hit the play button above.\nMurphy and Haji almost ready to go\nNations Fight Night\nJohn Cooney has been taken to hospital as a precaution following his loss to Nathan Howells, so with the safety of the boxers paramount, we have awaited the return of the medics to ringside.\nBut we are now back on with the Commonwealth silver title just moments away.\nTo watch all the action, hit the play button above.\nHowells rips Celtic title from Cooney\nNations Fight Night\nWhat an incredible battle we've just witnessed as Nathan Howells recovered from a tough opening round to completely take over against John Cooney and land the Celtic super-featherweight title.\nThe Welshman was relentless and finished it in the ninth with body shot initially dropping a faded Cooney and the follow-up assualt leaving referee Darren Sarginson with no option but to step in.\nBut what a battle as they threw everything they had at one another in a thriller.\nHow to top that? Well, Colm Murphy and Kasimu Hamed Haji will try as Murphy defends his Commonwealth silver featherweight title.\nTo watch all the action, hit the play button above.\nO'Neill blitzes Fash\nNations Fight Night\nWhat a performance that was from Jack O'Neill who has scored his first career KO and in fine style, taking Luke Fash out in the first round.\nNon-stop pressure from the Belfast man told as Fash went down initially and although he managed to rise, a thunderous right closed the show with 2.57 gone in the opener.\nWe have a bit of a break now until the first of our title fights which could be a cracker as John Cooney and Nathan Howells battle it out for Cooney's Celtic super-featherweight title.\nTo watch all the action, hit the play button above.\nQuinn back to winning ways\nNations Fight Night\nConor Quinn in total control of the six rounds against Sean Jackson and he is rewarded with a 60-54 points win to improve to 10-1-1.\nA good exercise for Quinn who banked rounds and worked on cutting off the ring in his first under new coach Ryan Burnett.\nNext up is four rounds in the super-bantamweight division between Jack O'Neill and Luke Fash.\nTo watch all the action, hit the play button above.\nMcDonagh coasts to a points win\nNations Fight Night\nIt's two pro wins from as many fights for Charles McDonagh, who had the answers against Karl Sampson by winning 40-36 on referee Eamonn Magill's scorecard.\nA good learning experience for the Dungannon lightweight.\nOur third bout of the night will see a return for Conor Quinn, who is seeking to bounce back from his first career defeat when he takes on Sean Jackson.\nTo watch all the action, hit the play button above.\nFreeman takes a points win\nNations Fight Night\nJames Freeman threw the kitchen sink at Jacob Marrar for four rounds and although he would have loved the stoppage, will be content with a 40-35 win on the cards to improve to 4-0.\nMarrar was down in the first although it seemed more of a slip, but he stood up to much heavier fire down the stretch as Freeman dominated.\nUp next we have a four-round lightweight contest between Charles McDonagh and Karl Sampson.\nTo watch all the action, hit the play button above.\n\"It's a name in the mix\" - Cacace on potential Wood clash\nNations Fight Night\nAnto Cacace is part of our team tonight at the Ulster Hall and has been speaking to Mark Sidebottom about his decision to vacate the IBF super-featherweight title.\n\"Boxing is a business as well as a sport,\" Cacace told BBC Sport NI.\n\"I feel like it's a better decision to vacate for my family's future and for my future to create a legacy in this sport, and for my name to be remembered for big fights - so I think it's the correct choice.\"\nWhen questioned on the prospect of fighting former world champion Leigh Wood:\n\"It's a name in the mix,\" Cacace admitted.\n\"It doesn't seem to be much of a secret but there's a couple of names in the mix. I'm staying focused for whatever comes next.\"\nMeet the team\nNations Fight Night\nWe've got a stellar line-up both in and out of the ring tonight at the Ulster Hall.\nFormer IBF super-featherweight world champion Anthony Cacace, former European champion and podcaster/comedian Tommy McCarthy, and Commonwealth Games gold medallist Michaela Walsh are part of the punditry team.\nMark Sidebottom will present the action with Nicola McCarthy ringside and legendary commentator Jim Neilly calling the action on the headline bouts after Oisin Langan commentates on the undercard bouts.", "url": "https://www.bbc.com/sport/boxing/live/c93q0vlq7n4t"}