{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:39:18", "date_modify": "2025-05-19 15:39:18", "date_publish": "2017-07-28 13:37:16", "description": "Fermanagh rider Lee Johnston will make his return from injury at the Ulster Grand Prix at Dundrod in two weeks time.", "filename": "sport_motorsport_40752541_1747669158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AC45/production/_97110144_lee3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_motorsport_40752541_1747669158.html", "title": "Ulster Grand Prix: Lee Johnston targets winning return after injury", "title_page": "Ulster Grand Prix: Lee Johnston targets winning return after injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lee Johnston will make his return from injury at the Ulster Grand Prix.\nThe Fermanagh rider crashed at the Isle of Man TT in June during Supersport practice suffering back, tailbone and finger fractures.\nDespite little practice time since his crash, Johnston is targeting at least one win at Dundrod in two weeks time.\n\"You're wasting petrol and fuel and tyres if you're not going with winning in mind, you have to at least set that goal,\" Johnston said.\n\"If you turn up thinking you're only going to get top five then you're definitely not going to win.\"\nJohnston will be riding the East Coast Racing Team Superstock and Superbike machinery and will join Bruce Anstey and Conor Cummins on the Padgett's Motorcycles team for the Supersport class.\n\"The good thing is I'm riding bikes that I know well which helps massively and I wouldn't be going at all if I didn't think I was going to be competitive.\n\"I might be a little bit rusty for the first couple of races until we get going again but the good thing about that is we have the Thursday racing to get back in the swing of it and then I'll be hopefully be ready for the Saturday.\"", "url": "https://www.bbc.com/sport/motorsport/40752541"}