{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:54", "date_modify": "2025-05-20 13:35:54", "date_publish": "2023-08-01 16:39:09", "description": "Sheffield United: Iliman Ndiaye is 'virtually irreplaceable'", "filename": "sport_articles_cp978rlk3l2o_1747748154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4934/live/5c8d9d10-310b-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp978rlk3l2o_1747748154.html", "title": "Ndiaye is 'virtually irreplaceable'", "title_page": "Sheffield United: Iliman Ndiaye is 'virtually irreplaceable' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rob Staton, BBC Radio Sheffield\nSo the saga is over and not in the way anyone at Sheffield United hoped or, as of a couple of weeks ago, expected.\nDespite the pull of his boyhood club in France, Iliman Ndiaye was on the brink of signing a new contract at Bramall Lane. Then, something changed the situation. Now he has swapped the Premier League for Ligue 1 and Sheffield United have huge shoes to fill.\nIt's also disappointing for fans and, less importantly, those of us who were looking forward to watching Ndiaye from the press box. He is such a talent and waiting to see if he could have an impact in the best league in the world was exciting. He could've been the difference between two very different outcomes for United this year.\nNow, the challenge will be to find goal contributions from other players. As a talent, he is virtually irreplaceable - you'd have to spend tens of millions.\nSuch is the modern game though, even if the player initially wants to stay, so many people influence what actually happens. His contract was running down and the club say they reluctantly accepted an offer from Marseille. Life goes on but it's a bitter blow for the red side of Sheffield.", "url": "https://www.bbc.com/sport/articles/cp978rlk3l2o"}