{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:38:34", "date_modify": "2025-05-19 14:38:34", "date_publish": "2017-08-21 16:27:21", "description": "Kemar Roofe scores a hat-trick as Leeds United come from behind against Newport County to progress in the EFL Cup.", "filename": "sport_football_40932078_1747665514.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1D86/production/_97485570_cdf_220817_cf_leeds_v_newport_10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40932078_1747665514.html", "title": "Leeds United 5-1 Newport County", "title_page": "Leeds United 5-1 Newport County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United came from behind to see off League Two Newport County in convincing fashion in the Carabao Cup.\nThe home side won thanks to an impressive hat-trick from Kemar Roofe while substitute Samu Saiz and Ronaldo Viera also found the net.\nSkipper Joss Labadie had given the Welsh side a surprise lead on 33 minutes following a mistake by home goalkeeper Rob Green.\nNewport started the game brightly and were rewarded with Labadie's opener.\nBut just before half-time Leeds were level when Newport failed to deal with a corner and Roofe was alert to slot the ball home.\nThe Championship club wasted no time after the break with Roofe volleying home his second before executing a spectacular bicycle-kick to complete his hat-trick.\nDespite a battling showing from the visitors, Saiz came off the bench to find the net on 78 minutes and, with two minutes left, a Viera shot meant Leeds go into the third round draw.\nNewport manager Mike Flynn told BBC Radio Wales: \"I thought it was a bit flattering for Leeds. But you could see the quality the Championship side have got where they take their chances and anticipate things in the box.\n\"There were some things that concerned me and I've just said that to the players.\n\"But we played some fantastic football and created a lot of good chances and you need to be prepared and put your neck on the line and get on the end of one.\"", "url": "https://www.bbc.com/sport/football/40932078"}