{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:52", "date_modify": "2025-05-20 14:42:52", "date_publish": "2023-07-25 15:04:10", "description": "Swindon Town owner Clem Morfuni says the club are still \"cleaning up the mess\" - two years after taking over.", "filename": "sport_football_66305010_1747752172.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9E5D/production/_130514504_shutterstock_editorial_13673662as.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66305010_1747752172.html", "title": "Clem Morfuni: Swindon owner says club still 'cleaning up mess' from past", "title_page": "Clem Morfuni: Swindon owner says club still 'cleaning up mess' from past - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swindon Town owner Clem Morfuni says the club are still \"cleaning up the mess\" from previous decades, two years after taking over.\nAustralian businessman Morfuni bought the club in July 2021 following a long period of turmoil and a lengthy legal battle.\nIn October last year Morfuni confirmed Swindon's debt had been reduced to £1m, down from £7.5m.\n\"We need to run this club sustainable,\" Morfuni told BBC Radio Wiltshire.\n\"I think in the last 20 or 30 years it hasn't been run as a proper business and we're still trying to clean up the mess, so to speak, to fix everything and I don't click my fingers and things happen overnight.\"\nThe club issued a statement on Monday regarding the apparent appointment of a liquidator within Morfuni's Axis Group, to dismiss concerns about the stability of his business.\n\"This is nothing to be concerned about as this is an old and in-effect redundant company within the Axis Group where there are a large number of companies currently trading,\" chief executive Rob Angus said, external.\nMorfuni reiterated that his business is in good health.\n\"We're turnover roughly around 250 million globally, we've got a good work order book around the globe at the moment,\" he said.\nSwindon finished 10th in League Two last season and appointed Michael Flynn as their new head coach following the conclusion of the campaign.\nThey have only signed two players this transfer window, both on loan, with Flynn also reiterating that they are \"not in a rush\" to bring people in.\n\"The fans are a bit upset that we're not making the signings that we do, but they are looking at a lot of players and we know what players we need and what depth, they're the footballers,\" Morfuni added.\n\"He'll say 'we need this player and this is the amount of money we need' and we'll say 'all right, let's work it out' and if we can afford it we'll do it and if we can't afford it then we won't do it. That's how simple it is.\n\"He knows the players he wants, he knows the people he wants and we make sure that we can support him and feed him the budget that we're providing him.\n\"He's got a healthy budget but we just want to make sure we get the right players.\"", "url": "https://www.bbc.com/sport/football/66305010"}