{"authors": ["Mohamed Fajah Barrie", "www.facebook.com"], "date_download": "2025-05-19 14:41:31", "date_modify": "2025-05-19 14:41:31", "date_publish": "2017-07-28 09:11:04", "description": "As a Fifa investigation into match-fixing in Sierra Leone moves a step closer there is a mixed reaction form those being looked into.", "filename": "sport_football_40751619_1747665691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DEED/production/_91096075_img_3933.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40751619_1747665691.html", "title": "Mixed reaction as Fifa's Sierra Leone probe moves closer", "title_page": "Mixed reaction as Fifa's Sierra Leone probe moves closer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An investigative body is being established by world football's governing body, Fifa to probe match fixing allegations in Sierra Leone.\nPlayers and officials have given mixed reactions to the panel being set up by world football's governing body.\nThey are accused by the Sierra Leone Football Association (SLFA) of attempting to fix a goalless draw 2010 World Cup qualifier against South Africa in Pretoria.\nEleven officials and four players, who have all denied any wrongdoing. have been suspended since 2014 pending an investigations.\nThe SLFA president Isha Johansen confirmed the establishment of the Fifa panel on Thursday.\n\"An international investigative body is being set up which will, together with one appointed person from Sierra Leone look into the match fixing allegations,\" she said.\nHowever one of the officials being looked into, Rodney Michael the former chairman of Sierra Leone Premier League board, is questioning the legality of the Fifa body.\n\"I am revered for demanding adherence to the principles of transparency, accountability and constitutionality and thus will only appear before a legitimate body,\" Michael told BBC Sport.\n\"Fifa has always maintained internal issues do not fall under their remit.\n\"Fifa will have to justify the sudden change of policy in setting up their committee rather than use the independent ethics board elected by the SLFA Congress.\n\"My position is purely on principles and not in fear, as I have adequate evidence to prove my innocence in front of any committee.\"\nAnother of those accused, who preferred to remain anonymous, agreed with Michael's interpretation of the SLFA rules but also welcomed the move.\n\"It's a total contravention of the SLFA constitution. But if that will help speed the process that has stalled for over three years, then let it be,\" he said.\n\"Am tired of the time wasted and am pretty sure I will be vindicated because I don't have anything wrongfully to hide or to answer to.\"\n\"I hope they will do it fast and clear our names because I'm confident that I'm innocent.\"\nOne of the players accused is the former Leone Stars goalkeeper Christian Caulker, who is currently based in USA, is happy with the latest developments.\n\"We welcome the investigations. This is what we've been calling for,\" Caulker told BBC Sport.\n\"We've been suspended for three years now without any investigations and it has seriously affected our careers.\n\"They should compensate us for tarnishing our reputation and wasting of time if they don't find us guilty. I know I'm innocent.\nJohansen's statement came a week before her executive's term of office comes to an end it remains unclear whether she will stand for re-election.\nHowever elections will not be held on or before 3 August after Fifa suspended the SLFA ordinary congress that should have paved way for an elective congress.", "url": "https://www.bbc.com/sport/football/40751619"}