{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:46", "date_modify": "2025-05-21 07:30:46", "date_publish": "2025-05-20 16:30:19", "description": "Exeter's former England forward Poppy Leitch is retiring from playing to take up a coaching role.", "filename": "sport_rugby-union_articles_cvg777epxkro_1747812646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4989/live/76a162e0-3596-11f0-b0ff-f7093bacd9ad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvg777epxkro_1747812646.html", "title": "Poppy Leitch: Exeter forward ends playing career to take up coaching role", "title_page": "Poppy Leitch: Exeter forward ends playing career to take up coaching role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter's former England forward Poppy Leitch is retiring from playing to take up a coaching role.\nThe 27-year-old is to become the club's first women's Under-23s coach and will oversee young players coming into the club.\nLeitch became the first woman to play 100 times for Chiefs, who set up their women's side in 2020.\nShe is currently head coach at the University of Exeter and will also oversee the club's Women's Championship South 1 side.\nLeitch will be assisted by fellow Exeter players Emily and Flo Robinson, Alex Tessier and Abby Middlebrooke.\n\"We are undertaking bold, wholesale changes to the coaching structure here at Exeter Chiefs and that includes those who oversee the care of our younger players,\" Exeter's chairman and chief executive Tony Rowe said.\n\"We want to produce more England-qualified players that have come through our pathway and Poppy has already had success in this area. I have no doubt she will flourish in this role.\n\"Her contribution to the club as a player, captain and Exeter University's head coach has been remarkable.\n\"The number of players who have come through her programme to pull on a Chiefs jersey is testament to her success that we are looking to build on with her new role.\"\nLeitch joined the club from Bristol ahead of its debut season, having won her first England cap in 2016, and helped the Red Roses win a Six Nations Grand Slam in 2019.\n\"I am excited to get stuck in with this new Under-23s infrastructure that we have put in place for the season ahead. Our aim is to invest in the person beyond the play,\" Leitch said.\n\"Each of the programmes within our pathway have shown the ability to produce excellent players with world-class potential.\n\"The aim of the Under-23s programme is to develop the holistic skills these players require to have long, successful careers.\n\"We have already identified more than 30 players who will become part of the Under-23s programme, with a new cohort still due to join in September 2025.\n\"While we aim to sow the seeds of the future, our ultimate aim is to make Exeter Chiefs and Sandy Park feel like home for all of our players.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvg777epxkro"}