{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:21", "date_modify": "2025-05-21 04:20:21", "date_publish": "2025-01-15 06:28:47", "description": "Cardiff City: League position making players anxious - Omer Riza", "filename": "sport_football_articles_ce8yd8ddpnlo_1747801221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e7a9/live/5af65440-d2d3-11ef-86e4-31e50b6c5341.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8yd8ddpnlo_1747801221.html", "title": "Cardiff City: League position making players anxious", "title_page": "Cardiff City: League position making players anxious - Omer Riza - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City's lowly position in the Championship table is causing players to feel \"anxious\", according to manager Omer Riza.\nThe Bluebirds climbed out of the relegation zone with Tuesday's 1-1 home draw with Watford but will feel they should have won.\nThe Hornets' 87th-minute equaliser was their first shot on target, whereas Cardiff missed several chances and should have secured what would have only been their second league victory since 2 November.\nRiza's side have made a habit of conceding late equalisers, having done so in recent matches against Stoke and Coventry.\n\"There are always things you can work on which we [coaches] are bringing to light all the time,\" said Riza.\n\"The position we are in the league leads the boys to be anxious or nervous at times. But we had enough control of the game to keep it, play out, make the opposition work more.\n\"We allowed them to have the ball, when we went too early with the ball, we allowed them to hurt us. That's what happened at the end. For huge parts of the game we didn't give them much.\"\nThis is an important week for Cardiff. As well as searching for valuable points in their fight against relegation, they host Swansea City in a south Wales derby on Saturday.\nAlthough the Bluebirds have squandered leads lately, they are at least unbeaten in their past five matches in all competitions.\n\"It's frustrating and there is stuff we need to work on. That will improve as the season goes on,\" said Riza.\n\"We know we need three points, but we are out of the bottom three for now. It was a good performance and we have to take that into Saturday.\"", "url": "https://www.bbc.com/sport/football/articles/ce8yd8ddpnlo"}