{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:00:28", "date_modify": "2025-04-26 07:00:28", "date_publish": "2025-03-02 00:00:00", "description": "Aberdeen come from two behind to draw with Dundee United in the Scottish Premiership thanks to a Kevin Nisbet double.", "filename": "sport_football_live_c99ny3gpy54t_1745650828.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c99ny3gpy54t_1745650828.html", "title": "Kevin Nisbet double as Aberdeen come from behind to hold Dundee United", "title_page": "Kevin Nisbet double as Aberdeen come from behind to hold Dundee United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kevin Nisbet struck in stoppage time as Aberdeen came from 2-0 down to earn a point at home to Dundee United.\nThe Scotland striker had earlier reduced the deficit with a drilled shot, as the Dons dominated the second half.\nThe visitors took the lead when the unmarked Vicko Sevelj nodded in at the back post.\nUnited then doubled their advantage courtesy of Sam Dalby's glancing header in what was the ninth minute of first-half added time.\nAberdeen drop to fourth in the table, having been overtaken by Hibernian who had beaten Hearts earlier, while United remain fifth, one point behind the Dons.\nThe hosts had the bulk of the possession in the first half, but lacked a cutting edge.\nUnited took their chances and could have been further ahead, when Sevelj saw his shot deflected into the net by substitute Emmanuel Adegboyega, who was subsequently ruled offside.\nAberdeen were on the front foot as soon as the second half started and Pape Habib Gueye should have done better when he fired wide from 10 yards.\nAt the other end, Kristijan Trapanovski went close with a low curling strike.\nNisbet has struggled at times during his loan from Millwall but his fine effort set up a grandstand finish, and his fourth goal in five games ensured the points were shared.\nSuch is the rollercoaster nature of this season, Aberdeen find themselves in a real dogfight for the European places, having been clear in third spot.\nAfter a blistering opening to the campaign, the Dons endured an alarming slide, before seemingly getting themselves back on track with back-to-back wins.\nIt looked like they would end the weekend in fifth place until Nisbet's late intervention.\nThe team that prevails in the race to be best of the rest, will need grit, determination and character – as well as a dusting of quality.\nWe will find out if Aberdeen have the characteristics needed to get them over the line, in the coming weeks.\nAfter stepping up from the Championship, United's impact in the top flight continues to be one of Scottish football's great success stories.\nBut with defying the odds, perhaps comes a change in expectations.\nHaving spent so long challenging at the top end of the table, a campaign that begin with survival as their main objective has evolved into one with loftier goals.\nBut United are stumbling, with only two wins from their past nine league outings, and this draw may sting like a defeat.\nThere is never a good time to have a wobble, but with the business end of the season now fast approaching, this appears a particularly bad time for them to slide off the victory trail.\nUnited are far from out of the race to finish third but if they are to keep themselves in the mix, they are going to need to find a way of consistently delivering wins again – and soon.\nAberdeen manager Jimmy Thelin told BBC Scotland: \"Performance wise, maybe we're not happy with the result. But football is football.\n\"We started well, but they score and we have to do better in how we defend. It is difficult to be 2-0 down at home at half-time in a really important game.\n\"But, the belief and the character of the players - and supporters who pushed us until the last second - I'm so proud of that. That atmosphere will be the difference at the end of the season.\"\nDundee United manager Jim Goodwin: \"First half, we were really good. The shape of the team was excellent and on the counter-attack we got into really dangerous areas.\n\"Credit to Jimmy Thelin, he made some positive changes. I think they have to gamble at that point. We couldn't get up the pitch, although I thought we defended our box really well.\n\"We're not blessed with the biggest squad. The three games in eight days really took its toll on the players at the end and I think that's what cost us.\"", "url": "https://www.bbc.co.uk/sport/football/live/c99ny3gpy54t"}