{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:38", "date_modify": "2025-05-21 06:25:38", "date_publish": "2025-01-31 11:51:49", "description": "Oxford United are nine points clear of the relegation zone thanks to a superb run under new boss Gary Rowett that's left many fans optimistic about a second season in the Championship.", "filename": "sport_football_articles_cg5ymmjm3l8o_1747808738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1b9/live/b095dc10-dfc4-11ef-aa66-cde6e2edab48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5ymmjm3l8o_1747808738.html", "title": "Oxford United: U's closing in on safety?", "title_page": "Oxford United: U's closing in on safety? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United are currently meandering around the bottom half of the table but, with nine points between them and the relegation zone, many fans are beginning to feel optimistic about a second season in the Championship.\nThe U's are on a great run, unbeaten since new boss Gary Rowett took the helm in December, which has helped lift them to 16th on 36 points.\nIt puts them out of immediate striking distance from the bottom six and five points ahead of Cardiff City in 18th.\n\"It's pretty anomalous to go down with that many points,\" journalist George Elek told the Dub podcast.\n\"For these teams to all overtake us, they all have to massively improve.\"\nThough Oxford do have some tough games ahead of them which threaten to end Rowett's dazzling start.\nThey welcome former boss Liam Manning back to the Kassam Stadium as eighth placed Bristol City visit on Saturday (12:30 GMT), before a trip to promotion-contenders Burnley three days later (19:45 GMT).\n\"When you look at our fixtures - especially at home, where we are playing some of the best teams in the league, and the home games are where we've relied on for our points so far - I definitely accept that it's hard to plot where we are going to pick up these points,\" Elek said.\n\"But, we now pick up points on the road.\n\"I don't want to jinx it but I don't think we are that far away.\"", "url": "https://www.bbc.com/sport/football/articles/cg5ymmjm3l8o"}