{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:39", "date_modify": "2025-04-26 03:37:39", "date_publish": "2025-03-08 00:00:00", "description": "Bochum come from two goals down to stun 10-man Bayern Munich in the Bundesliga and spoil their 125-year anniversary celebrations.", "filename": "sport_football_live_cn9vj99pe41t_1745638659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1f54/live/1286f840-fc3b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn9vj99pe41t_1745638659.html", "title": "Bayern Munich 2-3 Bochum: Hosts stunned as 125th anniversary celebrations spoiled", "title_page": "Bayern Munich 2-3 Bochum: Hosts stunned as 125th anniversary celebrations spoiled - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bochum came from two goals down to stun 10-man Bayern Munich in the Bundesliga and spoil their 125-year anniversary celebrations.\nRaphael Guerreiro scored twice in the opening 28 minutes, firing in from close range before heading in from Thomas Muller's headed assist.\nJakov Medic smashed his first Bundesliga goal into the top corner to reduce the deficit.\nWith two minutes of the first half remaining, Joao Palhinha was shown a straight red card for catching Giorgos Masouras on the shin.\nBochum drew level when Ibrahima Sissoko headed home from Felix Passlack's looping ball into the box.\nMatus Bero completed a remarkable turnaround, slotting home from close range on the counter as Vincent Kompany suffered only his second Bundesliga defeat since he became Bayern manager last summer.\nJonas Urbig, 21, who made his debut in goal for the injured Manuel Neuer and produced a brilliant save to deny Moritz Broschinski as the away side looked to increase their lead.\nIn between Guerreiro's goals, Leroy Sane was fouled in the box by Medic but Serge Gnabry hammered his effort against the post as Bayern missed the chance to increase their lead from the spot.\nIt is the first penalty Bayern have missed this season, with regular taker Harry Kane one of 10 changes to the side after their midweek Champions League win over Bayer Leverkusen.\nThe changes proved costly as the home side fell to their first league defeat since 14 December against Mainz, while it is the first time in 34 years that Bochum have won away at Bayern.\nThe result means Bayern remain eight points clear at the top while Bochum are two points from safety in 16th place.", "url": "https://www.bbc.co.uk/sport/football/live/cn9vj99pe41t"}