{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:48:12", "date_modify": "2025-05-20 14:48:12", "date_publish": "2023-07-28 07:51:51", "description": "Nottingham Forest: Steve Cooper wants further signings", "filename": "sport_articles_ce7egprxlw3o_1747752492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d12f/live/7da05310-2d1b-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce7egprxlw3o_1747752492.html", "title": "Nottingham Forest: Steve Cooper wants further signings", "title_page": "Nottingham Forest: Steve Cooper wants further signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest boss Steve Cooper says he wants new signing Anthony Elanga to be the latest young player to become an \"asset\" to the club.\nElanga made his first appearance for the club after his £15m move from Manchester United in Thursday night's 2-0 pre-season defeat to Leeds United.\n\"He's double quick,\" Cooper told BBC Radio Nottingham.\n\"We saw a lot of things last year in the Premier League that you need to be and that is athleticism and pace so he certainly has that.\"\nForest broke a Premier League record last summer by signing 21 players in a single transfer window, and Cooper wants more additions this year - with a similar profile to the 21-year-old Sweden international.\n\"Hopefully the other players we bring in - because we need other players that's for sure - will be of equal athleticism,\" he added.\n\"You always want young players in your squad that can become an asset to the club while having an impact on a short-term basis.\n\"We hope Anthony can become the next example of that after the likes of Morgan (Gibbs-White), Brennan (Johnson), Neco (Williams), Danilo - so that's the aim of course.\n\"We want him to have a short-term impact in what we do but we also know there's still a lot of development to do and a lot of potential that he'll need to work hard to fulfil as well.\n\"But, I'm pretty sure that will be the case.\n\"We’ll continue to get stronger in terms of our minutes and preparation. We need that. It’s clear that for us to do better in the Premier League we need a better team and a stronger squad than last year. We are still trying to work towards that.\"", "url": "https://www.bbc.com/sport/articles/ce7egprxlw3o"}