{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:52", "date_modify": "2025-04-26 03:37:52", "date_publish": "2025-03-08 00:00:00", "description": "Sheffield Wednesday send relegation-threatened Plymouth Argyle to the bottom of the Championship as they ease to victory at Home Park.", "filename": "sport_football_live_c15qn552x9kt_1745638672.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c15qn552x9kt_1745638672.html", "title": "Plymouth Argyle 0-3 Sheffield Wednesday: Owls cruise to victory", "title_page": "Plymouth Argyle 0-3 Sheffield Wednesday: Owls cruise to victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sheffield Wednesday sent relegation-threatened Plymouth Argyle to the bottom of the Championship as they cruised to victory at Home Park.\nThe Owls went ahead when Nathanael Ogbeta scored an own goal under pressure from Djeidi Gassama.\nCallum Paterson doubled his side's lead shortly before the break with a calm finish from six yards.\nGassama did get on the scoresheet when he slotted home after facing on to a through-ball for his sixth goal of the season.\nMichael Smith had two great chances to increase Wednesday's lead in the closing moments.\nThe win sees Wednesday's feint hopes of making the play-offs stay alive - they remain 13th in the Championship and are seven points off sixth place.\nBut for Plymouth - who suffered a morale-shaking 2-0 loss at relegation rivals Hull City on Tuesday - the loss sees them six points from safety with 10 games to play.\nDerby's win over Blackburn saw Miron Muslic's side drop to the foot of the table.\nArgyle had just three attempts on goal in their poor 2-0 loss at Hull City on Tuesday, but registered as many inside the first four minutes as they made a superb start this time.\nMustapha Bundu forced keeper James Beadle into a diving save after 30 seconds with a curling strike from the edge of the box, while Nathanel Ogbeta went wide from a similar distance before Darko Gyabi headed into Beadle's arms after a floated free-kick had been nodded back across the face of goal.\nBut that was about as good as it got for Argyle, a week after a brave 3-1 loss at Manchester City in the FA Cup, as the Owls went in front with their first effort on target.\nSvante Ingelsson managed to get the better of Maksym Talovierov by the left corner flag and floated in a pass towards the onrushing Gassama, and while Ogbeta did well to get in front of him he could only bundle the ball past goalkeeper Conor Hazard.\nWednesday should have been 2-0 up seven minutes later when Shea Charles side-footed wide from 15 yards after intricate build-up play from Josh Windass and Ingelsson.\nThe pair provided more good build-up play to set up Wednesday's second goal, when Patterson slotted in from six yards from Ingelsson's pass into the box from the left.\nArgyle made a triple change at half-time with Ryan Hardie, coming on up front along with defender Victor Palsson and left wing-back Tymoteusz Puchacz, but they failed to make an impact in a quiet first quarter of the second half.\nWednesday went further ahead when Windass played a lovely ball through to Gassama, who got on the wrong side of Palsson and calmly finished from the corner of the six-yard box.\nSmith should have made it 4-0 nine minutes later when Nikola Katic made a mistake at the back to allow the substitute to break through on goal, but Hazard did well to stop his low effort.\nAnd Smith had an even better chance in stoppage time when he found himself unmarked 12 yards out, but he contrived to fire wide.\nThe win for Wednesday, who thrashed Argyle 4-0 in the reverse fixture on the opening day of the season, added more fuel to the reports that their boss Danny Rohl could join Premier League strugglers Southampton - as the German coach saw his side snap a three-game losing streak.\nSheffield Wednesday head coach Danny Rohl told BBC Radio Sheffield:\n\"Except for the first six or 10 minutes I think we dominated the game against a difficult one.\n\"How they play, their structure against the ball, it's not easy to create so many opportunities.\n\"But we controlled the game, kept the ball in the right areas, we were aggressive against the ball and our counter-pressing was much, much better.\n\"I must say at first the back four, and then the back five, did a good job today.\n\"It was important that we kept a clean sheet today, even after going 3-0 up, and in the end we could have scored four or five goals - we had some good chances.\"\nPlymouth Argyle head coach Miron Muslic told BBC Radio Devon:\n\"I think we started well in the first 10 or 12 minutes, showed the desire and showing the fans that we are ready to fight, that we are ready to attack.\n\"Then the first positive action for them, the first negative action for us, the own goal, and you just felt that the pressure was on and we collapsed.\n\"Pressure can do a lot of damage and it was unbelievably difficult for us as the momentum suddenly changed.\n\"The first action of Sheffield and then the own goal gave them this momentum, and then you visibly could see it had a hard, hard effect on us.\"", "url": "https://www.bbc.co.uk/sport/football/live/c15qn552x9kt"}