{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:40:19", "date_modify": "2025-04-26 07:40:19", "date_publish": "2025-02-27 12:24:53", "description": "'All the Bayern players were talking about Daizen' - Carter-Vickers", "filename": "sport_articles_ckgnn32vlnxo_1745653219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4fb0/live/a2b598f0-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckgnn32vlnxo_1745653219.html", "title": "'All the Bayern players were talking about Daizen'", "title_page": "'All the Bayern players were talking about Daizen' - Carter-Vickers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's not just Celtic fans who can't enough of Daizen Maeda - the Bayern Munich squad think highly of him, too.\nThe in-form forward will be in the running for plenty of awards come the end of the season having already scored 25 goals.\nOne of those came in the first leg of the Champions League play-off against German giants Bayern, while he was instrumental in setting up Celtic's goal in the second leg of the agonising last-gasp defeat.\n\"After we played Bayern I was talking to Eric Dier, just having a general chat about the two games and stuff like that,\" Celtic defender Cameron Carter-Vickers recalled.\n\"He said that after the first leg, all the Bayern players were talking about Daizen and how much he runs and the kind of energy he puts into a game. It is incredible.\n\"He said they got the running stats up in their changing room and everyone was just talking about how much high-speed distance he'd done and stuff like that.\n\"Physically, in terms of his running power and capacity, I don't know if anyone in the [Celtic] squad could get to that level to be honest.\"\nMaeda, who joined Celtic from Yokohama F Marinos in 2022, keeps a low profile and rarely gives interviews to Scottish media but Carter-Vickers offered an insight.\n\"Obviously his English has improved since he's been here,\" he said. \"I don't know if he just decides not to talk or what, but he's a funny guy actually, he's quietly funny.\n\"He's a little bit of a prankster. Just little things, like I say, he doesn't necessarily talk too much, but his mannerisms and stuff like that, he definitely likes a little laugh.\"", "url": "https://www.bbc.co.uk/sport/articles/ckgnn32vlnxo"}