{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-19 14:26:05", "date_modify": "2025-05-19 14:26:05", "date_publish": "2015-04-17 12:20:03", "description": "Kevin Mirallas scores the winner and Ross Barkley misses a penalty as Everton beat Burnley, who have Ashley Barnes sent off.", "filename": "sport_football_32262279_1747664765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/82407000/jpg/_82407398_mirallasgoal.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_32262279_1747664765.html", "title": "Everton 1-0 Burnley", "title_page": "Everton 1-0 Burnley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kevin Mirallas scored the winner as Everton sent 10-man Burnley to the bottom of the Premier League.\nMirallas finished off James McCarthy's cross at the second attempt after Ross Barkley's 10th-minute penalty had been saved by Burnley goalkeeper Tom Heaton.\nThe visitors did not recover once Ashley Barnes had been sent off for his second booking just before half-time.\nDanny Ings missed a late header for Burnley, who have now gone almost six and a half hours without scoring.\nAaron Lennon has impressed for Everton recently and it was his run that earned the hosts their spot-kick.\nContact from David Jones seemed to be marginally outside the box but it didn't matter as Heaton dived to his right to save Barkley's penalty.\nWith a record of 14 successful penalties from the 15 he has taken in the top flight for Everton, it was a surprise Leighton Baines had not been asked to take it, especially as striker Romelu Lukaku was on the bench.\nBaines was soon firing towards goal, although his angled effort was saved by Heaton at the second attempt.\nLennon was just wide with a 20-yard effort before Mirallas made the breakthrough.\nThe Belgian needed two attempts to finish off McCarthy's cut-back, eventually netting his first Premier League goal in 2015.\nJones wasted a glorious chance to equalise immediately when he blazed over with just Tim Howard to beat.\nIn between needing two bouts of treatment, Danny Ings, without a goal since 11 February, was denied a clear shooting opportunity by Gareth Barry's perfectly-timed sliding challenge.\nBarnes had already been booked for sliding in dangerously on McCarthy, although there was no actual touch, when he caught Seamus Coleman just before half-time and was shown a second yellow card.\nIt meant the player who had committed the most fouls in the Premier League this season was sent off for the first time, meaning he will be suspended for next Saturday's crucial encounter with Leicester.\nBurnley's players were unhappy and defender Michael Duff had to be pulled away from referee Mike Jones as the teams headed for the tunnel at the end of the half.\nThe mood of Clarets boss Sean Dyche was not improved when Mirallas caught George Boyd with a nasty-looking tackle at the start of the second period.\nThe challenge was described as \"disgraceful\" and \"a leg-breaker\" by former Blackburn and Celtic striker Chris Sutton on BBC's Final Score, but the Belgian was only booked.\nMcCarthy, Lennon and Barkley all failed to take opportunities as Burnley found it difficult to exert any pressure.\nIngs had their best chance but headed Kieran Tripper's cross over and Everton claimed their fourth win in five games and their fifth clean sheet in seven.\nKevin Mirallas on his future after previously saying he wants a new challenge:\n\"A lot of people have talked about my future.\n\"I am in my best form of the season. When it is finished I will talk to my partner, the president, the trainer and manager.\n\"But I am confident here and I like to play for Everton.\"", "url": "https://www.bbc.com/sport/football/32262279"}