{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:27:23", "date_modify": "2025-05-20 14:27:23", "date_publish": "2023-07-29 10:08:01", "description": "French winger Allan Saint-Maximin confirms he is leaving Newcastle United, saying his \"greatest trophy\" was playing for the club.", "filename": "sport_football_66347973_1747751243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/585A/production/_130581622_gettyimages-1492460159.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347973_1747751243.html", "title": "Allan Saint-Maximin confirms Newcastle departure before expected Saudi Arabia move", "title_page": "Allan Saint-Maximin confirms Newcastle departure before expected Saudi Arabia move - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "French winger Allan Saint-Maximin has confirmed he is leaving Newcastle United, saying his \"greatest trophy\" was playing for the club.\nSaint-Maximin, 26, is expected to join Al-Ahli in the Saudi Pro League, run by the country's Public Investment Fund (PIF) - which also owns Newcastle.\nHe scored 13 goals in 124 games after joining in August 2019 from Nice.\n\"Even though this chapter has ended, the story never stops. Newcastle is home now,\" he said.\n\"I'll continue to be your biggest supporter.\"\nNewcastle finished fourth last season and will return to the Champions League for the first time in 20 years.\nThey have been transformed since manager Eddie Howe took charge of the club, a month after the PIF takeover in October 2021.\nIn an emotional social media post, Saint-Maximin wrote: \"I fell for Newcastle, I had great opportunities to leave during dark days, but that was too late I was already in love, I wanted, I needed, I had to stay for helping my team to save the club from Premier League relegation because it meant the world for me.\n\"Of course during those dark days some may have had their doubts, but I always believed in this club and look where we are today, it's just so beautiful. I'm leaving Newcastle as it should always have been and that's my greatest trophy because I was a part of it.\"\nNewcastle sporting director Dan Ashworth said last year that the club must be open to selling players in order to comply with spending restrictions.\nThis summer, Howe has been able to bring in Italy midfielder Sandro Tonali from AC Milan for £55m and England winger Harvey Barnes from Leicester for £38m.\nReports have claimed rival Premier League clubs are concerned that Saint-Maximin's transfer fee could be inflated, which would help Newcastle comply with Financial Fair Play regulations.\nBut Howe has said the anticipated transfer to Saudi \"will satisfy the Premier League\", while the league's chief executive Richard Masters say its rules are \"robust\".", "url": "https://www.bbc.com/sport/football/66347973"}