{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:46:10", "date_modify": "2025-05-21 03:46:10", "date_publish": "2025-02-09 11:38:20", "description": "Glentoran's successful January - which included their County Antrim Shield triumph - earns Declan Devine the manager of the month honour.", "filename": "sport_articles_cdd9q758966o_1747799170.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bec/live/7e1b2ab0-e316-11ef-9df3-cfedcee51a2b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdd9q758966o_1747799170.html", "title": "Declan Devine: 'A lot left to achieve'", "title_page": "Declan Devine: 'A lot left to achieve' - Glentoran boss is manager of the month  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran manager Declan Devine says his side have \"a lot of goals left to achieve\" after clinching their first silverware for five years when they lifted the County Antrim Shield by beating Larne in the decider at Seaview in January.\nThe Shield triumph helped Devine win the January Northern Ireland Football Writers' Manager of the Month award.\nThe Glens lie second in the Irish Premiership table, 17 points behind leaders Linfield but with two games in hand, as they aim to secure the runner-up spot which would guarantee them European qualification.\nThe east Belfast side are well in the running to increase their trophy haul this term, as they will face Cliftonville in the BetMcLean Cup final on 9 March and have reached the last eight of the Irish Cup, in which they will play Bangor on 28 February.\n\"There are good opportunities and we want to take every opportunity afforded to us,\" said Devine.\n\"At a club of the magnitude of Glentoran it's an expectation [to win trophies]. We were delighted [to win the Shield] but it comes with the territory. It was an amazing night and seeing the supporters, a lot of supporters haven't seen Glentoran lift a trophy in a long time.\n\"Some of the players were playing in their first final and collecting their first winners' medal. A lot of young players there, three or four players that have come through the academy.\"\nIn addition to collecting the Shield during January, the Glens progressed through two rounds of the Irish Cup, including a dramatic last-16 win over Belfast 'Big Two' rivals Linfield, won two BetMcLean Cup ties to reach the March final and took a win and a draw from the two league matches they played.\n\"It's been frantic to say the least. We've had a lot of high intensity games and difficult games,\" said Devine.\n\"Between the players and the backroom team they have all worked so hard to get through a really difficult period – winning a trophy and still going unbeaten. It's testimony to the group.\"", "url": "https://www.bbc.com/sport/articles/cdd9q758966o"}