{"authors": ["Rob Gurney", "www.facebook.com"], "date_download": "2025-05-21 05:30:55", "date_modify": "2025-05-21 05:30:55", "date_publish": "2025-01-31 18:04:32", "description": "As statement-of-intent signings go, Matt Grimes is right up there with any The Sky Blues have made in recent years, certainly in a January transfer window.", "filename": "sport_football_articles_cwypx3n5343o_1747805455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ab8/live/8b423670-dfe2-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwypx3n5343o_1747805455.html", "title": "Coventry City: Expert view", "title_page": "Coventry City: Expert view - Matt Grimes a statement of intent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As statement-of-intent signings go, Matt Grimes is right up there with any The Sky Blues have made in recent years, certainly in a January transfer window.\nI appreciate the bitterness from the Swansea end, but timing in life isn't always ideal, is it? Whatever you do for a living, or even outside of your professional environment.\nThe offer may not have still been there in the summer, and I know Coventry are a Championship team as well, but they're clearly clubs who appear to be on different trajectories at the moment.\nSwansea had back-to-back play-off heartbreaks against Brentford in 2020 and 2021; since then though, they've finished 15th, 10th and 14th.\nBy comparison, The Sky Blues were promoted as League One champions in 2020, and were a penalty kick away from the Premier League in 2023, only to be robbed of the greatest FA Cup comeback of all time in the semi-final against Manchester United by a hairline VAR decision nine months ago.\nThe pull of Frank Lampard can't be underestimated either – one of the greatest England midfielders of his generation, who has tangibly improved Victor Torp already, has clearly been a big factor for Grimes.\nWhat's not to like about getting the opportunity to work daily with someone of his pedigree?\nAnd then there are Grimes' own numbers – top of every passing metric in the Championship, as well as carrying the ball the most, and the furthest.\nSwansea's loss is undoubtedly Coventry's gain; whether the immediate benefit will be felt this season, or next, he's a player with all the traits that many of his contemporaries don't have.\nHe may well be a better version of Ben Sheaf – but that's a story for a different day…", "url": "https://www.bbc.com/sport/football/articles/cwypx3n5343o"}