{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 05:09:51", "date_modify": "2025-05-21 05:09:51", "date_publish": "2025-01-23 10:33:43", "description": "Everton manager Brian Sorensen spoke to the media ahead of facing West Ham in the Women's Super League on Sunday afternoon", "filename": "sport_football_articles_c6276y7exkno_1747804191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b88a/live/533bbe40-d975-11ef-a5c8-1da73bd59591.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c6276y7exkno_1747804191.html", "title": "Everton press conference: West Ham vs Everton preview", "title_page": "Everton press conference: West Ham vs Everton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton manager Brian Sorensen says new signing Kelly Gago will cause problems for all defenders in the Women's Super League.\nFrench forward Gago, 26, made her debut for the Toffees as a substitute in last Saturday's 1-1 draw at home to Aston Villa after signing from Nantes last month.\nSpeaking on Gago's impressive cameo ahead of Sunday's WSL trip to West Ham (15:00 kick-off), Sorensen heaped praise on her new signing and tipped her to be a challenge for opponents up and down the division.\n\"She's going to be a hard one for every defender in the league I think,\" said Sorensen.\n\"She has that physicality and speed at the same time, it's a rare thing to find actually. She's impressed me with her technical ability, I think that from the research I was doing on her, that was the area that I thought was lacking but having her in here with the others, in tight spaces she's quite good.\n\"For her, it's just about learning, connecting with team-mates and understanding what we want when we defend, but also when we attack.\n\"I think she's going to give defenders a headache for sure.\"", "url": "https://www.bbc.com/sport/football/articles/c6276y7exkno"}