{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:19:22", "date_modify": "2025-05-21 05:19:22", "date_publish": "2025-04-03 22:48:53", "description": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?", "filename": "sport_football_articles_cn4wx7jv92mo_1747804762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30a7/live/8ead8a40-10dd-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4wx7jv92mo_1747804762.html", "title": "Troy Deeney's Team of the Week: Jack Grealish, Sandro Tonali, Anthony Elanga, Emi Martinez, Curtis Jones", "title_page": "Troy Deeney's Team of the Week: Jack Grealish, Sandro Tonali, Anthony Elanga, Emi Martinez, Curtis Jones - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After every round of Premier League matches this season, BBC football pundit Troy Deeney will give you his team and manager of the Week.\nHere are this week's choices. Do you agree? Give us your thoughts using the comments form at the bottom of this page.\nEzri Konsa (Aston Villa): He has grown from strength to strength and become one of the best centre-backs in English football. This is really hard to say because I am a Birmingham fan and he is a Villa player, but he has been exceptional.\nMurillo (Nottingham Forest): He was a monster for Nottingham Forest, an absolute powerhouse. He loves defending and you have seen that with his last-second clearance off the line. He doesn't over-egg things, just defends.\nNeco Williams (Nottingham Forest): He has been excellent all season for Forest and never gets spoken about. He moved across from left-back to right-back against Manchester United, dealt with it and just delivered again.\nCurtis Jones (Liverpool): That was a midfielder playing at right-back against Everton in the Merseyside derby and he handled it exceptionally well. Showed a very mature performance.\nRyan Yates (Nottingham Forest): He was the best player on the pitch for Forest. Did all the nasty, horrible things well. Understood the game, a captain marvel.\nSandro Tonali (Newcastle): What a year this guy has had. From being banned, to coming back and being so solid. He does all the right things and what a goal that was against Brentford.\nEnzo Fernandez (Chelsea): I have not been a big lover of Enzo, he has floated in and out of games. But he is starting to grow on me more and more. That Chelsea midfield is starting to click and he will have a decent end to the season.\nJack Grealish (Manchester City): It's been well publicised that he is probably going to leave City this summer, but he has handled himself so well. He came on against Bournemouth in the FA Cup and did really well - and then did well against Leicester, scoring the opening goal.\nLiam Delap (Ipswich): Scored a massive goal in a monumental game for Ipswich. I was desperate to put Marcus Rashford in for the first time but he only played 65 minutes so that will have to wait.\nAnthony Elanga (Nottingham Forest): Wow, what a performance. Not only the goal but everything he did ran Manchester United ragged. How do you get rid of that player and keep Antony if you are Man Utd? That is the question a lot of people will be asking.", "url": "https://www.bbc.com/sport/football/articles/cn4wx7jv92mo"}