{"authors": ["Andy Campbell", "www.facebook.com"], "date_download": "2025-05-21 06:10:24", "date_modify": "2025-05-21 06:10:24", "date_publish": "2024-12-24 12:26:18", "description": "When the Christmas Day leftovers are in the fridge and the wrapping paper is heading to the recycling bin, there's a full Boxing Day Scottish Premiership fixture card to be savoured.", "filename": "sport_football_articles_c74xvwdwpllo_1747807824.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dafd/live/1530f710-c1fa-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74xvwdwpllo_1747807824.html", "title": "Scottish Premiership picks: Edinburgh derby kicks off Boxing Day action", "title_page": "Scottish Premiership picks: Edinburgh derby kicks off Boxing Day action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When the Christmas Day leftovers are in the fridge and the wrapping paper is heading to the recycling bin, there's a full Boxing Day Scottish Premiership fixture card to be savoured.\nWith action from lunchtime right through until evening, here are some names and games hoping to make a festive flourish.\nBoxing Day kicks off with a festive cracker at Tynecastle as Edinburgh's big two, Hearts and Hibernian, meet for the second time this season.\nLast time out, it was 1-1 draw at Easter Road, with Hearts striking late to deny Hibs.\nThe city rivals have largely struggled this season but both have improved of late, particularly Hibs. David Gray's side left Aberdeen's Pittodrie with all three points on Saturday - their third win in four league games.\nHearts moved off the foot of the table and sent St Johnstone bottom by beating the Perth side 2-1 at home on Sunday. European games may have been a distraction for Neil Critchley's side this season but it is just domestic games from here on in this term.\nVictory for the hosts and they will move above David Gray's Hibernian. Should Hibs win, they will increase the gap between the sides to five points. Four of the past five meetings have ended drawn and the last two wins in the fixture have been by a solitary goal.\nTo save their league season, both teams really need to be pushing into the top six and Thursday's game could be just the springboard if one of them can pick up all three points.\nAberdeen started December as leaders Celtic's closest challengers. Six games without a win later and they are third, trailing Rangers by a point and having played a game more.\nThings were looking up for the Dons on Saturday when Topi Keskinen scored a deflected opener against Hibernian but Hibs roared back with three goals to claim all three points.\nThe Finnish winger, 21, was one of Aberdeen's top performers during the Dons' impressive start to the season and has scored five goals since his summer arrival from HJK, also providing a couple of Premiership assists.\nKilmarnock play host to Aberdeen on Thursday, having lost 2-0 at Pittodrie back in August.\nFormer Aberdeen manager Derek McInnes' Killie side may have designs on the top six but Jimmy Thelin's Dons are in need of inspiration to get their season back on track and Keskinen is just the type of player that can stretch teams.\nAnd the winger could do with a strong start to 2025 too if he wants to force his way back into the Finland side, with their World Cup qualifying campaign starting in March.\nOne of the Premiership's newest managers, Simo Valakari, is facing a big challenge at St Johnstone.\nWith just one point from a possible 12 so far in December, the Perth side are a point adrift in 12th place.\nHowever, Saints supporters will know their three defeats so far this month have been by a margin of one goal, while the point they picked up away to Aberdeen came only after the Dons had battled back from a goal down.\nThe short version is that it's tight in this league and Valakari's side need to find a way to end up on the right end of marginal games.\nDundee United are their Boxing Day visitors, aiming for their second straight win over Saints.\nWith three wins and a draw out of 11 so far, Finnish former Motherwell player Valakari has not enjoyed the strongest of starts at McDiarmid Park but he's not alone. Hearts' Neil Critchley has five wins from 15 while David Gray at Hibernian has only recently pushed his win percentage in to the high 20s.\nAgain, it's tight in the Scottish top flight but that also means a win can go a long way and Valakari still has it within his gift to guide St Johnstone off the bottom of the table in time for the New Year.", "url": "https://www.bbc.com/sport/football/articles/c74xvwdwpllo"}