{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:54", "date_modify": "2025-05-19 14:41:54", "date_publish": "2017-08-20 14:48:58", "description": "Former Aberdeen captain Alex McLeish predicts his old club will pip Rangers to runner-up spot behind Celtic in the Premiership.", "filename": "sport_football_40992977_1747665714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6757/production/_97455462_12110976.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40992977_1747665714.html", "title": "Alex McLeish tips Aberdeen for second place in the Premiership", "title_page": "Alex McLeish tips Aberdeen for second place in the Premiership - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Aberdeen captain Alex McLeish predicts his old club will this season again finish runners-up to Celtic in the Scottish Premiership.\nHowever, he describes it as the \"mission\" of Rangers, the team he managed to a domestic treble in season 2002-03, to halt champions Celtic.\n\"I see the Dons being second,\" the 58-year-old told BBC Radio Scotland.\n\"Derek McInnes has made good acquisitions and it is there for Rangers to try to usurp him.\"\nMcLeish, who also enjoyed success in charge of Motherwell and Hibernian, joked that Rangers fans would be \"ganging up\" on him for tipping the club for whom he played in central defence almost 700 times.\nBut, as Celtic target a seventh consecutive title, the former Scotland manager thinks the Reds have the edge over Pedro Caixinha's Rangers team when it comes to being runners-up.\nHe is impressed with the standard of players to have arrived at Pittodrie over the summer, such as Kari Arnason, Greg Tansey, Ryan Christie, Stevie May, Greg Stewart, Nicky Maynard and Gary Mackay-Steven.\nMcLeish continued: \"I still think Aberdeen are the favourites. They still have a really good chance of finishing second.\n\"Derek McInnes has bought wisely again. If you look at the guys he's recruited, there is good experience there. Stevie May - what a buy that is.\n\"Being first, that's the only thing that Rangers fans crave but common sense would tell you that they should be accepting second.\n\"People talk about 'let's stop 10 in a row'. They've got to stop seven in a row. That is their mission this season.\n\"I've said Aberdeen could finish above them but Rangers have still got to pull out all the stops to try to beat Celtic this season.\"\nMcLeish describes the treble-winning Celtic boss Brendan Rodgers as an \"all-round terrific package\", with a successful blend of man-management and coaching skills.\n\"Brendan came to Birmingham when he was out of work,\" he recalled. \"I invited him in for a day's training.\n\"I knew he was an educated guy. I think he learned a lot about man-management over maybe a sacking or two and going on to manage players like Steven Gerrard (at Liverpool) and doing it with great aplomb.\"", "url": "https://www.bbc.com/sport/football/40992977"}