{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-04-26 03:52:54", "date_modify": "2025-04-26 03:52:54", "date_publish": "2025-03-03 09:45:17", "description": "The NFL could soon have its own two-way superstar, but Draft prospect Travis Hunter is such a rarity that teams are unsure what to do with him.", "filename": "sport_american-football_articles_c1w03dq3l3ro_1745639574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8321/live/2088e570-f81c-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_american-football_articles_c1w03dq3l3ro_1745639574.html", "title": "Travis Hunter: Which NFL team will draft him? And what is a two-way player?", "title_page": "Travis Hunter: Which NFL team will draft him? And what is a two-way player? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Shohei Ohtani is known as baseball's \"unicorn\" for his rare ability to play as both an elite hitter and pitcher.\nThe NFL could soon have its own two-way superstar.\nTravis Hunter may be the first overall pick in this year's Draft after being named college football's best player in 2024.\nThe NFL has not had a Draft prospect like him in 27 years, a player who has excelled on both offence and defence.\nHunter is arguably college football's greatest two-way player in history, yet NFL teams are unsure what to do with him.\nBBC Sport looks at why the 21-year-old is so special and the dilemma facing NFL scouts as they prepare for the Draft.\nHunter was the country's top-ranked recruit after playing cornerback and wide receiver at high school in Georgia.\nHe committed to play college football at Jackson State in 2022 so he could play under Deion Sanders, who won two Super Bowls as a two-way player in the 1990s.\nWhen Sanders became Colorado coach in 2023, Hunter followed, and continued to progress on both sides of the ball.\nIn his third and final college season he became the first player to win the awards for best defensive player of the year and best receiver.\nHe also became the first two-way player to win the Heisman Trophy for best player since Charles Woodson (1997), ensuring he will be one of the first players selected at the Draft, which takes place from 24-26 April.\nNFL teams got a chance to assess the best of this year's Draft prospects over the weekend at the Scouting Combine.\nAlthough Hunter chose not to take part in any of the drills, he spoke to team officials and the media, making it clear he wants to keep playing full-time on offence and defence.\nLast season he played all 13 of Colorado's games, claiming four interceptions and 96 receptions for 1,258 yards and 15 touchdowns. He played 714 (87%) of their offensive snaps and 748 (83%) of their defensive.\nBut few have played both regularly in the NFL. Chuck Bednarik is the last true two-way player, having played centre and linebacker for Philadelphia from 1949-56.\nSince 2006, Patrick Ricard is one of six players to have played 200 offensive and 200 defensive snaps, but the Baltimore full-back has seldom played on defence since 2019.\nWilliam 'the Refrigerator' Perry, Troy Brown, Mike Vrabel and Julian Edelman also played both, but none did both regularly in the same season, as Sanders did with the Dallas Cowboys in 1996.\nAfter being drafted, Woodson played almost entirely on defence, and Sanders has told teams not to draft Hunter if they do not plan on giving him the chance to play both.\n\"They say nobody has ever done it the way I do it, but I tell them I'm just different,\" said Hunter.\nHunter says his role in the NFL is \"still up in the air\" and \"up to the organisation\" which drafts him, as each seems to have a different idea of how best to utilise him.\nThe Tennessee Titans have the first pick of the Draft. Last week general manager Mike Borgonzi called Hunter \"special\", while head coach Brian Callahan said he is \"unique\".\nBoth said they see Hunter starting as a cornerback, with Callahan adding: \"Then you find ways to interject him into the offence as he gets more comfortable.\" He even suggested Hunter could also return punts.\nThe Cleveland Browns have the second Draft pick, and general manager Andrew Berry said Hunter is \"a unicorn\" who would play \"receiver primarily first\".\nNew England have the fourth pick, and their executive Eliot Wolf said: \"He's probably going to major in one [position] and minor in the other.\"\nHunter is adamant he wants to do both full-time, adding: \"That's not my job to figure it out.\"\nHunter averaged 111.5 snaps per game with Colorado - 40 more than the highest NFL snap count last season - but he hopes to emulate baseball star Ohtani and show that two-way players can \"become a thing\" in the NFL too.\n\"I do a lot of treatment,\" he said. \"People don't get to see that part - what I do for my body to make sure I'm 100% each game.\n\"I did it at college level, where you rarely get breaks. There are a lot more breaks in the NFL, so I know I can do it.\"", "url": "https://www.bbc.co.uk/sport/american-football/articles/c1w03dq3l3ro"}