{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-05-21 07:49:23", "date_modify": "2025-05-21 07:49:23", "date_publish": "2024-12-23 16:13:16", "description": "Iain Carter embarks on a round to represent 2024 with, in no particular order, 18 of the key memories from the year.", "filename": "sport_golf_articles_cvg7rjn827do_1747813763.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db13/live/daa5d620-c13a-11ef-a8c2-37ad53d91ed7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cvg7rjn827do_1747813763.html", "title": "Scheffler & Korda dominate, McIlroy's miss and a Woods ace - 2024 in review", "title_page": "Scheffler & Korda dominate, McIlroy's miss and a Woods ace - 2024 in review - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How should we gauge the golfing year in 2024? Politically, turbulence continued with little sign of resolution, while executives came and went with unusual regularity.\nAmericans swept the men's majors, bringing more heartbreak for Rory McIlroy, while Nelly Korda dominated a women's tour that lost some of its biggest names.\nGreat Britain and Ireland were brilliant winners of the Curtis Cup, but the US finally caved in to player pressure for Ryder Cup team members to receive payment.\nIn a sense, those two headlines summed up the game; there was still room for heartwarming romance despite much of the elite end being swept along a largely unchecked river of greed.\nThere were some truly great performances yielding significant highs but there were also some worrying and tragic lows.\nLet's embark on a round to represent 2024 with, in no particular order, 18 of the key memories from the year.\nWhile Scheffler set the standards in the men's game, Nelly Korda did similar on the women's circuit. Korda beat Lydia Ko at the Drive On Championship in late January to signal a run of five consecutive wins, culminating in the 26-year-old's second major win at the Chevron Championship. Korda was the first to win five in a row since Annika Sorenstam in 2004/5. She would go on to be the first player since Yani Tseng in 2011 to win seven tournaments in an LPGA Tour season.\nProving world number ones were not immune from left-field shocks, Scheffler was arrested on his way to the second round of the US PGA Championship. He drove past a policeman to escape a traffic jam at the entrance to Valhalla. The officer alleged assault and Scheffler was taken to jail in handcuffs. The world number one warmed up in a cell, was sprung on bail and fired a 66. All charges were later dropped. You couldn't make it up.\nDeChambeau atoned for missing out at Valhalla with the year's most dramatic major victory, beating Rory McIlroy for the US Open at Pinehurst. McIlroy led by two with five to play and his decade-long barren run in the big four seemed over. But he bogeyed 15, missed a tiddler on 16 and devilish short one on 18 to open the door for a ragged DeChambeau.\nThe unconventional American fired the shot of the year from a fairway bunker to get up and down for a winning par at the last. It was LIV's and his second major win. McIlroy's haunted and shellshocked face in the recorders' area was image of the year. McIlroy went on to win a sixth Race to Dubai but he would have swapped that for a fifth major.\nStill the number of majors won by Tiger Woods and that tally never looked like altering in 2024. Indeed, this maybe the year when we conclude he will not win again.\nWoods battled to make the cut at Augusta but never came close to playing the weekends of the remaining three majors before undergoing yet more back surgery. He turned down the US Ryder Cup captaincy which surprisingly went to Keegan Bradley, to concentrate on PGA Tour talks with Saudi Arabia.\nThe best shot struck by a Woods this year was son Charlie's hole-in-one at December's family-friendly PNC Championship.\nSadly the game lost too many fine names in 2024, with deaths announced for two Ryder Cup stalwarts, Englishman Peter Oosterhuis (aged 75) and the 'Welsh Bulldog' Brian Huggett (87). Both were great men of golf, architects of the modern game, who will be greatly missed.\nThe sport was shocked by the tragic loss of PGA Tour winner Grayson Murray at the age of 30 and the popular former pro turned broadcaster Mark Carnevale (64). Legend Chi Chi Rodriguez died aged 88, hall of famer Susie Maxwell Berning (83), former R&A head pro Jim Farmer (76) and the respected and much loved American writer Jeff Babineau (62) were also mourned in 2024.", "url": "https://www.bbc.com/sport/golf/articles/cvg7rjn827do"}