{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:02:57", "date_modify": "2025-05-20 15:02:57", "date_publish": "2023-07-27 11:54:54", "description": "Chelsea: Who could still leave as Mauricio Pochettino makes 'tough' decisions?", "filename": "sport_articles_c72r7dl1lq4o_1747753377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b395/live/351db1e0-2c6d-11ee-b1c9-1dd55dd6407d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72r7dl1lq4o_1747753377.html", "title": "Chelsea: Who could still leave as Mauricio Pochettino makes 'tough' decisions?", "title_page": "Chelsea: Who could still leave as Mauricio Pochettino makes 'tough' decisions? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nat Hayward, BBC Sport\nMauricio Pochettino's assertion on Wednesday that Chelsea need to sign \"at least one more midfielder\" - coupled with comments about needing to make \"tough\" decisions on his \"massive\" squad - indicate the club will still push for significant outgoings before the end of the transfer window.\nDespite ushering through a number of impressive - and frankly necessary - sales so far this summer, the Blues' hierarchy still have a way to go before their bloated squad is trimmed to the Argentine's liking.\nChelsea have rejected a reported £40m bid from West Ham for Conor Gallagher, Levi Colwill is wanted by Brighton and Liverpool, and attempts to offload Romelu Lukaku are thus far proving difficult.\nThen there is the question of loans. Ian Maatsen has impressed during pre-season but is surely still behind Ben Chilwell and Marc Cucurella at left-back, not to mention fellow youngster Lewis Hall who was a rare bright spot when called upon last season.\nBoth Maatsen and Hall could both be in line for moves away - as could young midfielders Cesare Casadei, Carney Chukwuemeka and wingers Andrey Santos and Diego Moreira, who have all featured heavily so far in pre-season.\nWhile the vision of transfer director Paul Winstanley and co-owners Behdad Eghbali and Todd Boehly to fill the club with young players can still prove shrewd, none of the players mentioned would benefit from a season limited to fleeting substitute appearances.\nAs Pochettino has said, arrivals in midfield still look likely - with interest in Brighton's Moises Caicedo a saga looking likely to rumble on and Ajax's Mohammed Kudus reportedly keen on a move to the club - but this must be balanced and a number of loan moves would therefore be unsurprising.\nYou would also be brave to bet against twists in the futures of Raheem Sterling - who endured a tough first season at the club - and Kepa Arrizabalaga if Pochettino decides he wants to look elsewhere for a number one goalkeeper.\nChelsea have so far had the busiest summer of any Premier League side and the scattergun approach to signings over the past 18 months means that is unlikely to change anytime soon.", "url": "https://www.bbc.com/sport/articles/c72r7dl1lq4o"}