{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:28:40", "date_modify": "2025-05-20 12:28:40", "date_publish": "2023-08-04 06:57:24", "description": "Phoenix Mercury guard Diana Taurasi makes WNBA history as she became the first player to score 10,000 career points.", "filename": "sport_basketball_66403398_1747744120.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/46F4/production/_130646181_dianataurasi.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_basketball_66403398_1747744120.html", "title": "Diana Taurasi: Phoenix Mercury guard becomes first WNBA player to score 10,000 career points", "title_page": "Diana Taurasi: Phoenix Mercury guard becomes first WNBA player to score 10,000 career points - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phoenix Mercury guard Diana Taurasi made WNBA history on Thursday when she became the first player to score 10,000 career points.\nTaurasi, 41, reached the milestone with a three-point shot in the third quarter during Mercury's 91-71 home win against Atlanta Dream.\nShe finished with 42 points to also became the oldest player in WNBA history to produce a 40-point game.\n\"I just felt good and they were looking for me,\" Taurasi told ESPN.\nTaurasi, a three-time WNBA champion and two-time WNBA finals Most Valuable Player, ended the night with a total of 10,024 career points.\nShe added: \"Sometimes [the shots] go in because they go in, because it's your day. And [this] was my night.\"\nTaurasi started the game knowing 18 points would take her to the 10,000 mark and scored 10 by half time, before quickly adding a two-point lay-up and a three-pointer to her tally.\nOn the Mercury's next possession, Taurasi took a pass from Moriah Jefferson and successfully completed the shot to the delight of the crowd.\nWNBA commissioner Cathy Engelbert congratulated Taurasi and said she \"continues to author new chapters in an illustrious WNBA career\".\n\"We are honoured to witness this milestone,\" Engelbert said, adding Taurasi's achievement was \"testament to her skill, determination, and unwavering dedication to the game\".", "url": "https://www.bbc.com/sport/basketball/66403398"}