{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:23:43", "date_modify": "2025-05-21 07:23:43", "date_publish": "2025-03-28 16:01:05", "description": "Bournemouth news: Iraola praises new training complex", "filename": "sport_football_articles_cwygyx4ey7zo_1747812223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bd7/live/9261da50-0be8-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwygyx4ey7zo_1747812223.html", "title": "Bournemouth news: Iraola praises new training complex", "title_page": "Bournemouth news: Iraola praises new training complex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth boss Andoni Iraola believes his side have \"the best tools\" to progress after moving into a new state-of-the-art training centre.\nThe Cherries made the most of the international break, moving into a £32m training facility which will be used by the men's first team, the women's team and the academy.\nIt meets the requirements for Category Two status and has an indoor dome as well as outdoor full-sized pitches and rehabilitation facilities across the 57-acre site.\nThe project was first approved in October 2019 and its completion comes at a time when Bournemouth are on the up.\nThe club collected silverware last weekend when they were crowned FA Women's National League Division One South West champions following a 2-0 win against Bristol Rovers at Vitality Stadium.\nIraola's side host Manchester City this weekend in the quarter-finals of the FA Cup and could reach the semi-final stage for the first time in their history.\nThey sit 10th in the Premier League table but are just five points away from fourth spot and have European ambitions.\nThe Spaniard held his first press conference at the new training base and said: \"It's a big change for us, it's very new, we still have to familiarise but obviously it is a big improvement for the team, for the club.\n\"The pitches are perfect, we have all the tools we need but at least we cannot use any other excuses now because we have the best tools.\"\nThe Cherries finished 12th in their first season under Iraola, who joined from Rayo Vallecano in the summer of 2023, and look set to significantly improve on that position this campaign.\nAsked about his future at the club, Iraola said: \"I want to do my job the best I can. I don't know how far we can go, where we will finish.\n\"I'm really happy here. We have a great opportunity to make history and it would be amazing for me personally, for the club to achieve new heights but we know that we have to be realistic.\"", "url": "https://www.bbc.com/sport/football/articles/cwygyx4ey7zo"}