{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:19", "date_modify": "2025-05-21 05:34:19", "date_publish": "2025-04-02 15:42:58", "description": "Newcastle news: Should Kieran Trippier be offered a new contract?", "filename": "sport_football_articles_crkx4njykyyo_1747805659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/688f/live/07969a50-0fd0-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crkx4njykyyo_1747805659.html", "title": "Newcastle news: Should Kieran Trippier be offered a new contract?", "title_page": "Newcastle news: Should Kieran Trippier be offered a new contract? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Newcastle defender John Anderson says he would have \"no hesitation\" in offering Kieran Trippier a new deal this summer.\nTrippier's contract expires at the end of next season but the 34-year-old has been linked with a move away from St James' Park before he is available to leave on a free transfer.\n\"Trippier is huge for Newcastle,\" Anderson told BBC Radio Newcastle. \"The experience he's got at international level, the move to Spain with Atletico Madrid, playing Champions League football - all that comes through.\n\"He's talking to people all the time. He's pulling players into areas. He's dragging people around the pitch. That's the way he does it - he's just a good talker. There's nothing aggressive about it - some players just need that and he does it great.\n\"It will be interesting to see what the club do with him in the summer. I would have no hesitation at all in giving Trippier a new contract.\n\"It will be down to the player because he may well feel now that he's played in the cup final and was exceptional but, at the start of next season, [Tino] Livramento and [Lewis] Hall will be the two who start at full-back.\n\"He has decisions to make about what he wants.\"", "url": "https://www.bbc.com/sport/football/articles/crkx4njykyyo"}