{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 11:56:29", "date_modify": "2025-05-20 11:56:29", "date_publish": "2023-07-25 14:37:09", "description": "After being described as a \"horrible team to play against\", can the Republic of Ireland shock Canada in the Women's World Cup?", "filename": "sport_football_66255626_1747742189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EC69/production/_130512506_inpho_02294459.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66255626_1747742189.html", "title": "Women's World Cup: Can Republic of Ireland, a 'horrible team to play against', cause a shock?", "title_page": "Women's World Cup: Can Republic of Ireland, a 'horrible team to play against', cause a shock? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Republic of Ireland may still be in the group stages of this tournament, but make no mistake - this is now knockout football.\nWhile the Irish don't need to beat Canada in their second World Cup match, defeat by the Olympic champions would spell the end of their tournament hopes.\nA draw may be enough to get through and a win would keep their own fate in their own hands. Regardless, a positive result means their destiny would be decided in the final group game with Nigeria.\nThe Republic's World Cup opener against Australia showed positive signs but ended in defeat. Canada, on the other hand, were held by Nigeria and also need a strong result in Perth on Wednesday.\n\"What we saw from Ireland against Australia was everything we've scouted coming into the tournament,\" said Canada boss Bev Priestman, who led the Maples to Olympic glory in 2021.\n\"Whenever they've played, we've seen that from them - that shape, that resilience, that doing whatever it takes not to concede mindset.\n\"They're a team full of heart, spirit and passion. So when you compare that to Canada and what we're known for, it's going to make for a great game.\n\"I think from my perspective we have to match it and hope that our quality shines through but, first and foremost, match that passion and hard work.\"\nPriestman added the Irish are \"a horrible team to play against\" and they have nothing to lose when they face the Canadians.\n\"That's what we pride ourselves on, so we one million per cent have to match that first,\" she said.\n\"Ireland know that about Canada too. It's probably a two-way street.\n\"Ultimately, we must stay with the process and what we think it will take to beat this Irish team. And stay clear-headed, because there are parts of the Irish team where if you're not careful you can be drawn into that and it can take you down a route that can take you off-task.\n\"We've got the experience in the team to correct that and bring out our quality when it matters.\"\n\"Winning starts with not losing. That is very cliched but it is very much true,\" said Pauw.\n\"If you play a game like this, against the Olympic champions, then you have to stay realistic.\n\"It is clear that we want to go through this group and we need a result.\n\"If we win we have it in our own hands. If we draw then we are dependent on other results.\"\nAfter days of glorious sunshine, rain hit Perth on Tuesday afternoon and was expected to linger in the air for matchday.\nIt won't dampen the spirits of the Irish fans, who were expected to descend upon Australia's west coast and dominate the atmosphere, but they will hope, come full-time, the wet weather won't reflect the mood around the Irish team.", "url": "https://www.bbc.com/sport/football/66255626"}