{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-20 11:42:09", "date_modify": "2025-05-20 11:42:09", "date_publish": "2023-08-06 16:25:27", "description": "Jersey's Luke Holmes wins triathlon gold at the Commonwealth Youth Games in Trinidad and Tobago.", "filename": "sport_triathlon_66422079_1747741329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9233/production/_130672473_lukeholmesgoldcommythgamesgetty1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_triathlon_66422079_1747741329.html", "title": "Luke Holmes: Jersey triathlete wins gold at Commonwealth Youth Games", "title_page": "Luke Holmes: Jersey triathlete wins gold at Commonwealth Youth Games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey's Luke Holmes has won triathlon gold at the Commonwealth Youth Games in Trinidad and Tobago.\nHolmes, 16, finished the super sprint race in a time of 29:47, 16 secs ahead of Scotland's Alex Robin and 51 secs in front of Australia's Alex Latham.\nIt is the first time Jersey have struck gold at the event since 2004 when swimmer Dan Halksworth won the 400m individual medley in Australia.\n\"Its just amazing that this has happened,\" Holmes told BBC Sport.\n\"This was the plan, but plans don't often go to plan so it's amazing that I executed the race and am able to say that I am the Commonwealth Youth champion.\"\nHolmes, who is a student at Hautlieu School in Jersey, helped the island win mixed team triathlon gold at the Island Games last month in Guernsey, and says he could not have had a better race.\n\"It was pretty much perfect. I was second out of the swim and then we formed a bike group of three.\n\"I was always up at the front end, I had a quick transition and got into the run first and just didn't look back, I just ran my own pace and hoped no-one would come round me.\n\"No-one ever passed me on the run and it was a race out front, and that's what I love doing, racing out front.\"", "url": "https://www.bbc.com/sport/triathlon/66422079"}