{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:52:44", "date_modify": "2025-04-26 03:52:44", "date_publish": "2025-03-03 09:56:44", "description": "Young Exeter fly-half Ben Coen draws praise after an impressive full debut for the Chiefs in the Premiership Rugby Cup quarter-final.", "filename": "sport_rugby-union_articles_ce30vglzqkqo_1745639564.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b6e/live/e8201b20-f813-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ce30vglzqkqo_1745639564.html", "title": "Ben Coen: Young Exeter Chiefs fly-half impresses on debut", "title_page": "Ben Coen: Young Exeter Chiefs fly-half impresses on debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Young Exeter fly-half Ben Coen has drawn praise after an impressive full debut for the Chiefs in their Premiership Rugby Cup quarter-final.\nThe England Under-20 playmaker played a big part in his side's 50-14 win over Sale on Saturday.\nThe 20-year-old, who has been with Exeter's academy since he was 15, signed his first professional deal last summer.\n\"He's been in and around our training ground and he's been in and around within the squad,\" assistant forwards coach Ross McMillan told BBC Radio Devon.\n\"People talk about opportunities, it's not about that for me with these kids.\n\"A lot of them are outstanding rugby players, but they're outstanding young men, and all they need is guidance, they need tutelage, not just from coaches but within the group itself.\n\"What I'm really pleased with is the whole group, from staff to players, made sure today was a day Ben Coen remembered for a lot of positive reasons.\n\"I think he'll go on and on and on.\"\nHaving been poor in a 22-14 home loss to Gloucester in their final Cup pool fixture, McMillan said he was pleased Exeter put in such a good showing in their opening knockout game.\nChiefs scored seven tries as Tommy Wyatt and Paul Brown-Bampoe each notched twice to set up a semi-final at home to Championship leaders Ealing this Saturday.\nThe cup represents a chance for a positive end to the season for Exeter, who have been poor in the league and Europe this term.\nThe ninth-placed Chiefs have won just twice all season in the Premiership and lost all four of their pool matches in the Champions Cup.\n\"I think we earned a little bit of trust and a little bit of respect back from the fans,\" McMillan added.\n\"We want to build on that and make sure that continues, because the reality is we're all in this together. We've not got things right all the way through this year and we know that as players, as coaches.\n\"It's been tough, but at the same time it is true what they say - when you go through times of adversity, times of things not going your way, the bounce of the ball, the odd decision, bits and pieces, whether or not that's in life or in rugby, you realise a little bit about your own character and the people around you.\n\"I think we started to really see that and understand that.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ce30vglzqkqo"}