{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:01:46", "date_modify": "2025-05-21 07:01:46", "date_publish": "2025-03-29 00:00:00", "description": "Middlesbrough boost their play-off hopes as they fight back to beat Oxford United at the Riverside Stadium.", "filename": "sport_football_live_c20lwlw1d2lt_1747810906.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66c7/live/ad093760-0cbd-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c20lwlw1d2lt_1747810906.html", "title": "Middlesbrough 2-1 Oxford United", "title_page": "Middlesbrough 2-1 Oxford United - Play-off chasers Boro claim late winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Middlesbrough boosted their play-off hopes as they fought back to beat Oxford United at the Riverside Stadium.\nMichal Helik put the U's ahead when Boro failed to deal with Will Vaulks' long throw and the defender lashed a fine shot into the bottom-left corner.\nHaving been denied by the woodwork before the break, Kelechi Iheanacho levelled soon after the restart, sweeping home Samuel Iling-Junior's low ball across the six-yard box.\nThe turnaround was complete late on when Iling-Junior provided his second assist as another low ball in from the left found Neto Borges, who flicked an audacious back-heel into the right-hand corner.\nBorges' 80th-minute winner, twinned with defeats for sixth-placed West Brom and Bristol City, moved Middlesbrough up to seventh and outside the play-off places on goal difference only.\nOn the flip side, a sixth defeat in nine matches left Oxford three places and four points above the bottom three.\nStarting the weekend three points outside the top six, Middlesbrough could ill afford a slip-up against a side with just one away win to their name this term, but Michael Carrick's side had to work hard for their 10th home success of the season.\nBoro dominated possession, but struggled to add a final pass to their neat build-up and unlock Oxford's stubborn rearguard which blocked and frustrated the hosts.\nLargely restricted to shots from distance, Middlesbrough failed to produce a shot on target in the first half as Oxford carved out easily the better chances.\nPrzemyslaw Placheta's early close-range effort was saved by Boro goalkeeper Mark Travers, low to his left, and Matt Phillips poked a close-range shot wide before Helik slotted his fifth of the season.\nIheanacho almost replied within four minutes when he smacked a shot against the bar following Finn Azaz's defence-splitting pass, but didn't have long to wait for his first Boro goal - and his first in English football since October 2023.\nTommy Conway's far-post header was kept out at point-blank range by U's keeper Jamie Cumming, and the hosts breathed a huge sigh of relief as Borges' claimed his first Middlesbrough goal.\nMiddlesbrough manager Michael Carrick told BBC Radio Tees:\n\"It was a good second half. Credit to the boys, it's not easy when you're having a slow one.\nIt was a bit sticky, bit frustrating first half. We spoke about it at half-time, the importance of staying positive.\n\"It's easy to get down and frustrated and pick out the problems but I thought there were chances for us to create and we stayed positive and that's what I liked the most.\n\"I thought we chased the game well, controlled it, kept counter-pressing, kept the ball in their half and I thought we fully deserved the win in the second half.\"\nOxford United manager Gary Rowett told BBC Radio Oxford:\n\"I think the frustration is we started the game really well. I thought the formation caused them a lot of problems early on.\n\"We score a goal and have three absolutely huge chances on the back of that.\n\"We probably need to be more clinical knowing that the forwards Middlesbrough have got, at some point there's an opportunity with the one bit of quality gets them back in the game.\"", "url": "https://www.bbc.com/sport/football/live/c20lwlw1d2lt"}