{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 03:56:45", "date_modify": "2025-05-21 03:56:45", "date_publish": "2025-04-07 12:54:12", "description": "Arsenal take on Real Madrid in their Champions League quarter-final on Tuesday, with a refreshed Bukayo Saka.", "filename": "sport_football_articles_c5yr05ww9p7o_1747799805.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2649/live/496c8630-13b6-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yr05ww9p7o_1747799805.html", "title": "Bukayo Saka: Arsenal forward says injury break was \"really good\" for him mentally", "title_page": "Bukayo Saka: Arsenal forward says injury break was \"really good\" for him mentally - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's Bukayo Saka says his enforced break with a hamstring injury was \"really good\" for him mentally.\nSaka was introduced at half-time against Everton at the weekend as he builds up his fitness from an injury that kept him out for 101 days.\nSaka, 23, scored on his return in Arsenal's win against Fulham last week before his 45 minutes of football at the weekend.\nArsenal boss Mikel Arteta said Saka would be in a \"much better place\" to start against Real Madrid in their Champions League quarter-final on Tuesday night.\n\"I think mentally it was really good for me.\" Saka said of the enforced break.\n\"Obviously it was really tough for me initially to find out the extent of my injury and that I was going to have surgery but once it was done and successful I was just focused on coming back stronger.\n\"The past five years I've been playing game after game so it was the first proper break I've had. It was really good for me. I got to do a lot of things that I don't normally do.\n\"It's really nice to be back and I feel fresh mentally.\" Saka said.\nThe England international will be into the final two years of his contract this summer but played down any worries about his future.\n\"I want to win and I want to win wearing this badge so I think it's pretty clear,\" he said.\n\"The fans know how much I love them and you saw on Tuesday I think they loved me back so it's a good relationship and I'm really happy to be here. I'm just focused on winning.\"\nThe Gunners have reached this stage of the competition just twice in the last 15 years and host serial winners - and holders - Madrid who have lifted the European Cup 15 times in their history.\nArsenal, like other sides, have been hit with injuries to key players this season and Arteta has to name a side without centre-back Gabriel Magalhaes, who has been ruled out for the season alongside fellow defender Riccardo Calafiori who is out with a knee injury and Kai Havertz who had his season ended by a hamstring injury.\n\"There are things that we cannot control,\" Arteta said. \"What they [Real Madrid] are going to prepare, what they can do. We have to focus and our energy has to be on understanding our strengths, weakness and the direction that we want to play in the game.\n\"Obviously the intention of the team is very clear, we want to achieve tomorrow and we are going to go for it.\"\nThe Arsenal boss made five changes for the 1-1 draw with Everton at the weekend and rested key players Martin Odegaard, Gabriel Martinelli, Thomas Partey, Jurrien Timber and Bukayo Saka.\n\"At 8pm tomorrow night, [it is] 11 players and 60,000 people, [I am] really super convinced that we are ready to win and to beat them,\" he said. \"That's the mindset that I want.\n\"Be the team that we have been the last quarter of the season, with all the ups and downs and things that we have had to deal with. [We must] continue to do that because that's our super strength.\"\nFormer Chelsea goalkeeper Thibaut Courtois has missed the Spanish club's past three matches with a knee injury but says he is available for the tie.\nBack-up Andriy Lunin is also injured, so Real had to play 19-year-old Fran Gonzalez in their surprise 2-1 weekend defeat by Valencia.\nCourtois said: \"I am fully fit and I feel good.\n\"It was not a big issue so I could train in the gym, and I have been on the pitch for the last day so I feel fine and 100%.\n\"I have a lot of respect for Arsenal and a lot of friends who support Arsenal.\n\"They play well, have a young team and a nice blend of experienced players, too. They defend well, press high, are good at the low block and are quick on the counter - and have players who can score easily.\n\"They are doing great, and it is only a matter of time before they win another trophy. But hopefully not in the Champions League this year.\"\nReal's former Chelsea and Everton boss Carlo Ancelotti said: \"There are lots of teams that do things well, but not many that do so many things as well as Arsenal do.\n\"They are near the top of the Premier League and are in the quarter-finals of the Champions League. The team is stronger than in the past, and they will be stronger in the future.\"", "url": "https://www.bbc.com/sport/football/articles/c5yr05ww9p7o"}