{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:36:28", "date_modify": "2025-05-20 11:36:28", "date_publish": "2023-08-07 06:23:16", "description": "Lionel Messi scored twice to help Inter Miami beat MLS rivals FC Dallas and reach the quarter-final of the Leagues Cup", "filename": "sport_football_66425957_1747740988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9247/production/_130674473_gettyimages-1597739274.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66425957_1747740988.html", "title": "Lionel Messi: World Cup winner hits double as Inter Miami reach Leagues Cup quarter-finals", "title_page": "Lionel Messi: World Cup winner hits double as Inter Miami reach Leagues Cup quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lionel Messi's stunning double helped Inter Miami seal a dramatic victory against FC Dallas to reach the quarter-finals of the Leagues Cup on Sunday.\nFC Dallas led 4-2 with 10 minutes left but two late goals took the game to a penalty shootout.\nMiami won the shootout 5-3 at Toyota Stadium in Frisco, Texas.\n\"Being 4-2 down in the 80th minute and then coming back, we are very happy with the result,\" Miami manager Gerardo Martino said.\n\"But the fact that we have gone through shouldn't let us lose sight of the things that we have to improve.\"\nMiami were winless in 11 before Messi's arrival but have now won four in a row.\nThe former Barcelona and Paris St-Germain forward opened the scoring after six minutes, sweeping a curling shot inside the near post from outside the penalty area, but Dallas were 3-1 ahead with just over an hour played.\nMidfielder Benjamin Cremaschi reduced the deficit for Miami but a Robert Taylor own goal restored Dallas' two-goal cushion.\nMiami were given hope in the 80th minute when Marco Farfan headed a Messi cross into his own net, before the 36-year-old World Cup winner curled home a stunning free-kick to level the tie five minutes later, taking his tally to seven goals in four appearances.\nMessi set Miami on their way in the penalty shootout with former Barcelona team-mate Sergio Busquets also keeping his cool from 12 yards as Paxton Pomykal's miss for Dallas proved costly.\nInter Miami are the first club to secure a place in the quarter-finals of the Leagues Cup, which debuted in 2019 and involves teams from the United States and Mexico competing in a knockout format.", "url": "https://www.bbc.com/sport/football/66425957"}