{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:13:21", "date_modify": "2025-05-21 06:13:21", "date_publish": "2025-01-05 00:00:00", "description": "Reaction after Sunderland beat 10-man Portsmouth to keep pace at the top of the Championship.", "filename": "sport_football_live_cwy85yyz1r7t_1747808001.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwy85yyz1r7t_1747808001.html", "title": "EFL LIVE: Coverage of Sunderland v Portsmouth, plus League Two action", "title_page": "EFL LIVE: Coverage of Sunderland v Portsmouth, plus League Two action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you tomorrow night\nFT: Sunderland 1-0 Portsmouth\nRight,\nTime to wrap up warm and hit the road for home.\nIf you want more reflections on a vital win for Sunderland then you can read my colleague Adam Lanigan's report here.\nAnd we've got all the Championship news too.\nIn League Two Crewe are up to second with their 4-1 hammering of Bromley.\nWe're back tomorrow night with another treat from the Championship as QPR host Luton Town.\nSee you then...\nTransfer window open for business\n#bbcefl\nWho does your side need to sign to maintain their challenge, escape mid-table or climb out of trouble?\nThe January transfer madness is well under way and we've already had a club record signing for Oxford United today with forward Ole Romeny joining from Dutch top-flight club Utrecht.\nThere have also been plenty of moves elsewhere in the Championship, League One and League Two.\nYou can keep up to date right here on the BBC Sport website and app with our dedicated transfer page - it's sure to get even busier before we hit February!\nWhat a difference a year makes for Luton\nQPR v Luton (Monday, 20:00 GMT)\nAt the end of January 2024, Luton Town thrashed Brighton 4-0 to move out of the Premier League's relegation zone.\nAt the start of January 2025, the Hatters are two points above the bottom three in the Championship.\nManager Rob Edwards has said he will not walk away from the challenge ahead, despite conceding there is understandable anger from a section of supporters about the club's current position.\nOn Monday, Luton face a QPR side that has taken 19 points from their past 10 Championship games to move six points clear of the bottom three.\nFollow live text coverage of the game on the BBC Sport website and app.\nNervy for Portsmouth\nFT: Sunderland 1-0 Portsmouth\nGoals scored is the only stat keeping Portsmouth out of the relegation zone and they really do need to do something about their awful away form.\nIt's putting more and more pressure on them to keep an excellent home run going.\nAfter an FA Cup trip to Wycombe there's a tricky league game at Blackburn to tackle.\nNow, there's a long way to go but I will just mention Pompey's final match of the season is at home....to Hull City...\nSunderland in the mix\nFT: Sunderland 1-0 Portsmouth\nIt looks like two from four for the automatic promotion places doesn't it?\nThat was a vital win for Sunderland to stay within reach of the top three and keep the chasing pack at arms length.\nThere's a break for the FA Cup next week but the Black Cats next league game is the small matter of a trip to Burnley on 17 January - now that's what I call a Friday night thriller.\n'They did enough to win'\nFT: Sunderland 1-0 Portsmouth\nGary Bennett\nEx-Sunderland defender on BBC Radio Newcastle\nCredit to Portsmouth, everyone expected them to get beaten by a few, but they stuck in.\nThat’s two wins in two this year for Sunderland, they did enough to win in the end.\nFrom our side, I think there will be a few changes for the FA Cup game next week.\nAnother clean sheet and the three points for Sunderland, that’s the important part.\nFULL-TIME\nCrewe 4-1 Bromley\nA very happy Sunday afternoon for Crewe Alexandra, who have gone second in League Two with a convincing home win.\nOmar Bogle's two goals and a third from Jack Lankester put the Alex in command, with Jamie Knight-Lebel completing the scoring with a tidy header late on.\nMichael Cheek's penalty to make it 2-1 had given Bromley brief hope but Andy Woodman's side fall to their first league defeat since mid-October and they are six points off the play-offs.\nFULL-TIME\nSunderland 1-0 Portsmouth\nSunderland move back to within two points of the Championship's automatic promotion places while it's now only goals scored keeping Portsmouth out of the relegation zone.\nWilson Isidor's seventh minute goal - slipping the ball past an out of position goalkeeper Nicolas Schmid was enough in the end but it should have been a lot more comfortable.\nIsidor had a second rightly disallowed when he was inches offside and he also sent a second-half effort narrowly over the bar.\nEliezer Mayenda wasted a glaring chance by hammering a shot into the side netting and then saw Rob Atkinson block his goalbound effort from no more than two yards.\nPortsmouth offered very little in attack - failing to make the most of Sunderland's wastefulness in front of goal.\nThe visitors' task was made all the harder on 67 minutes when Marlon Pack's error of judgement meant he had to haul down Isidor and the ensuing red card was inevitable.\nSunderland still unbeaten at home while Portsmouth have lost four on the bounce away for the first time since November 2014.", "url": "https://www.bbc.com/sport/football/live/cwy85yyz1r7t"}