{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:49", "date_modify": "2025-05-21 03:52:49", "date_publish": "2025-04-07 09:47:07", "description": "Man Utd 0-0 Man City: City fan views on Manchester derby draw", "filename": "sport_football_articles_cdjlywndwpdo_1747799569.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdjlywndwpdo_1747799569.html", "title": "Man Utd 0-0 Man City: City fan views on Manchester derby draw", "title_page": "Man Utd 0-0 Man City: City fan views on Manchester derby draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's Premier League game between Manchester United and Manchester City.\nHere are some of your comments:\nAndy: A shambolic performance against poor opposition. United's tactics were known before kick-off, yet we picked a team that would be easily contained. It was nonsensical to continue with Ruben Dias walking out of defence with the ball. Substitutions made us worse - what was Jeremy Doku told to do? Not once did he attack his full-back. I was a strong advocate that Jack Grealish should start, but when he came on, he continually threw himself to the ground. Immensely disappointing!\nMike: Absolutely awful. We were lucky United couldn't finish. Based on this performance, I predict we will finish seventh. Newcastle, Chelsea and Aston Villa are all better than us.\nBrian: Derby games are always full of nerves. This was cautious in the extreme and United had the better chances in a dull, uninspiring game. But City kept a clean sheet and held their nerve at the back. Guardiola also played for a draw. Overall, a result we would have taken at any stage in any previous season.\nGene: Overall, a flat performance in a must-win situation against the across-town rivals who haven't shown much this season. The introduction of pace was too late and there's still a lack of creativity. While the defence is improving, the offense is still spluttering.", "url": "https://www.bbc.com/sport/football/articles/cdjlywndwpdo"}