{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:33:08", "date_modify": "2025-05-19 15:33:08", "date_publish": "2015-02-04 15:12:43", "description": "Italy coach Jacques Brunel says his team must take full advantage of their three home games in the Six Nations.", "filename": "sport_rugby-union_31132414_1747668788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80781000/jpg/_80781068_brunelitaly.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31132414_1747668788.html", "title": "Six Nations: Brunel says Italy must make most of three home fixtures", "title_page": "Six Nations: Brunel says Italy must make most of three home fixtures - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Italy coach Jacques Brunel says his side's three home Six Nations fixtures offers them an opportunity to atone for a poor 2014 campaign.\nAfter two wins in a promising 2013 season, the Azzurri took a step backwards last year, with five defeats earning them the Wooden Spoon.\n\"I'm convinced we're not that far off,\" Brunel said ahead of Saturday's opener against Ireland in Rome.\n\"We have three home games, so we owe it to ourselves to win at home.\"\nAfter Saturday's game against the defending champions, Italy will face England and Scotland away before hosting France and Italy in their final two matches next month.\n\"For us to win, we need 100% precision and 100% efficiency - we can't afford to be at 70 or 80%,\" added Brunel, who is without lock Quintin Geldenhuys for the entire tournament but can call on star number eight Sergio Parisse.\nBrunel's side suffered 10 defeats in 2014, their only victory coming against Samoa in November.\nHowever, their performances included a narrow 20-18 defeat by Argentina while they also battled well against South Africa before losing 22-6.\n\"Over the past two years we suffered two last-minute defeats to Scotland, two narrow defeats to Argentina, pushed England to the brink at Twickenham, and in June suffered defeat to Japan and Fiji in matches we should have won,\" Brunel added.\n\"We had the chance to beat Argentina, against South Africa we were trailing only 15-6 at half-time and on a par with the second best team in the world.\n\"That makes about six or seven games we lost out on through our lack of efficiency. There is a very thin line between the 2014 we had and what it could have been.\"", "url": "https://www.bbc.com/sport/rugby-union/31132414"}