{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:40:14", "date_modify": "2025-04-26 04:40:14", "date_publish": "2025-02-28 08:44:20", "description": "Leicester City news: Fan views on Premier League defeat", "filename": "sport_football_articles_crewwrwjzjwo_1745642414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crewwrwjzjwo_1745642414.html", "title": "Leicester City news: Fan views on Premier League defeat", "title_page": "Leicester City news: Fan views on Premier League defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views after relegation-threatened Leicester City fell to their 11th defeat in 12 Premier League games against West Ham United.\nHere are some of your comments:\nWes: Disgraceful. How difficult is it to play in the other team's half of the field? Stop passing backwards and play with heart - these are not difficult tasks.\nNeil: \"Still in the fight\". Are you joking, Ruud? The players have given up. It is a really sad demise. Do they realise that fans pay good money to go and watch whatever that was? Where has the pride gone? 'Foxes never quit' - well they certainly did here.\nAndy: Our performances are deteriorating, with comical defending costing us dearly. On the evidence shown in this game, this group of players will struggle in the Championship next season.\nTom: Just awful. Those at the top of the club need to swallow their pride and admit they made a massive mistake in appointing Ruud van Nistelrooy. The players have downed tools and are accepting defeat from the first whistle. We have a manager who refuses to try anything new, even after so many losses and goals conceded. Insanity is ruling the roost at this club right now.\nJonathan: Utter rubbish - disconnected, naive and toothless. The players are way below their best levels. Ruud is way out of his depth. He must be sacked so the team has one final chance to turn it around, or it's certain to be Championship football next season and possibly for several seasons after that. Neil Lennon would be worth a short-term contract until the end of the season, then review.", "url": "https://www.bbc.co.uk/sport/football/articles/crewwrwjzjwo"}