{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:39:40", "date_modify": "2025-04-26 04:39:40", "date_publish": "2025-02-28 09:05:53", "description": "Chelsea news: Co-owner Todd Boehly speaks out on fan criticism", "filename": "sport_football_articles_cpq220v49d9o_1745642380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/24fb/live/81e3d2b0-f5b2-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpq220v49d9o_1745642380.html", "title": "Chelsea news: Co-owner Todd Boehly speaks out on fan criticism", "title_page": "Chelsea news: Co-owner Todd Boehly speaks out on fan criticism - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chelsea co-owner Todd Boehly has shrugged off criticism from the club's fans, saying it is \"par for the course\" and something he can accept as long as things at Stamford Bridge are \"trending in the right direction\".\nThe American billionaire formed part of a consortium to takeover the Blues in May 2022.\nFans gathered to protest the club's ownership on Tuesday night, prior to their 4-0 home win against Southampton, with seismic spending and inconsistent performances on the pitch forming the basis of much of the frustration.\nBoehly was asked about receiving criticism from fans at the FT Business of Football Conference in London, to which he replied: \"I think it is just par for the course.\n\"The reality is that the sooner you learn you can't keep everyone happy all the time, then freedom comes from that.\n\"You are just trying to execute a plan, but you recognise things aren't linear. As long as you are trending in the right direction, then you feel better. I think the trend is in the right direction and that's the thing that matters.\n\"In June, it will be three years - and it isn't a lot of time. As a 60-year-old, especially in an industry with so little downtime, it's a whirling dervish of activity when you step on.\n\"It's a steep learning curve, but I think that's a good thing.\"\nOn Chelsea's recent form, Boehly added: \"December was peak but, eight weeks out, things are a little different now.\n\"If you look at the foundations being built, new management team, new academy leadership, sporting director leadership and player mindset. All that's there and now it is about cultivating the development of the team.\n\"You are always going to try to get better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cpq220v49d9o"}