{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:18:32", "date_modify": "2025-05-21 07:18:32", "date_publish": "2025-01-31 00:00:00", "description": "England face Australia on day two of the Test in the Women’s Ashes – follow score updates, radio commentary and video highlights.", "filename": "sport_cricket_live_cgl9r2l9ldet_1747811912.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cgl9r2l9ldet_1747811912.html", "title": "Annabel Sutherland and Beth Mooney put Australia into driving seat against England", "title_page": "Annabel Sutherland and Beth Mooney put Australia into driving seat against England - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us on day three...\nAnother gruelling day in the Women's Ashes for England. Scroll down to watch the highlights and read all the reaction following the close of play.\nHas Ffion Wynne held back in her match report? Not a bit of it. Make sure you read that before you leave this page and go about your day.\nWe will of course be back at 03:15 GMT on Saturday with live text commentary and ball-by-ball coverage from the Test Match Special team for day two.\nBetween now and then here's some stories which might be of interest:\nEngland beaten by India in U19s World Cup semi-final\nAmbanis & Brady group agree Hundred deals\n'Warne-esque' Alana shines at the King's HQ\n'Never say never' - Mott on coaching England women\n'We’ll try to get as far ahead as we can'\nAustralia all-rounder Annabel Sutherland on her century: \"It was pretty special. To have a Test match here at the G, have a good time and score some runs, it’s pretty special. I got to do it in front of family and friends.\n\"I love batting. Anytime I get a chance I try and cash in. I know how important it is to get ahead in the game. We’ve kept them out there and we’ll try to get as far ahead as we can.\"\nOn Australia's position: \"I think we were pretty keen to get more of a lead. Ideally we'll only bat once and look to take 10 as fast as we can.\"\nOn Beth Mooney: \"She’s pretty chill, she’ll rock up five minutes before the warm-up and hopefully tick it over to three figures.\"\nOn the conditions: \"There was still a bit in it. They [England] bowled well in patches. In the morning, they created a lot of chances but couldn't convert them.\"\n'We all know we're better than this'\nEngland fast bowler Lauren Fileron England's performance: \"We're happy with how we bowled. We attacked them and they were patient, fair play to them. We'll just go again tomorrow. We don't want to be a team that gives up. We want to keep pushing and fighting to better ourselves on the pitch and as people.\"\nOn talk about the team: \"It's not been the tour we wanted. We all know we're better than this, we don't need reminding. There's messages going on, it's hard to hear but we understand that we haven't performed the way we wanted to. Hopefully over the next few days we can show what we're made of.\"\nOn the dropped catches: \"We know we need to work on some stuff in the field. We're all human. Dropped catches do happen, probably more often than we'd like but we can work on it tomorrow.\"\nOn training: \"We work really hard to test ourselves. In a game, it's a completely different scenario, there's an additional pressure. It's [catches] something we need to get better at. It's hard to replicate it in training.\"\nOn the MCG: \"I'm pleasantly surprised about the crowd. The birds have surprised me the most. It's an amazing stadium and a great place to play cricket.\"\n'Have to keep moving on'\nEngland bowler Ryana MacDonald-Gay, speaking to TNT Sports: \"I am really happy with how it went today [getting that first Ashes wicket] because Annabel Sutherland batted really well. So to get her wicket was pretty amazing.\n\"The message [from England captain Heather Knight] was to just bowl line and length, hit the stumps, and try to do that for as long as I can.\n\"With the bat yesterday it was hard. They have some really good bowlers but I found the longer I was out there the easier it was. They were quite on it at the start and the longer we kept them out there the more they wore down a bit more.\"\nOn making her Ashes debut: \"I was nervous but I'm very competitive and don't want to be shown up by anyone else, That's where the grit and determination comes from.\"\nOn dropped catches costing England: \"That was unfortunate but we have to keep moving on. Australia have some good batters, and still have some good batters to come.\n\"The only way to keep going was to forget about it and keep buzzing around. The pitch is playing okay, and there's a bit in it for the batters and a bit for the bowlers.\"\n'Embarrassing and a hard watch'\nMark Robinson\nWarwickshire first-team coach on TNT Sports\nDo England look psychologically gone in the field? Yes, they do. It's been infectious hasn't it? One goes down, confidence goes and people don't really want the ball.\nThey had spells in the game where it got embarrassing and it was a hard watch. The headlines will be about the catching and fielding and quite rightly so. I thought they did actually do some things well.\nI think Heather Knight has had a good game as captain which looks and sounds ridiculous when you see the scorecard. The bowlers have delivered to a large extent.\n'England's worst day of the series'\nGeorgia Elwiss\nEngland all-rounder on TNT Sports\nWas this arguably England's worst day of the Women's Ashes? I think so.\nFrom my point of view, the position they came into this Test match they wanted to show heart, fight and give a good account of themselves.\nUnfortunately, today, they have shown anything but that, especially in the field. The bowlers did well in the morning, stuck at it, and created chances but fielders let them down.\nCatches an international side should take have gone down and Australia made England pay.\nClose of play - Aus 422-5\nMooney 98, McGrath 9\nThe crowd aren't happy but Beth Mooney is all smiles - OK, there might have been a hint of a grimace, too - as she walks off unbeaten on 98.\nA day of utter Australian dominance. Annabel Sutherland led the way with a magnificent 163 before Mooney took over later in the day.\nAs for England, well, catching practice is in order after they shelled seven in the day, including Sutherland twice in the 30s and three when Mooney had very few.\nAustralia lead by 252 runs and 16-0 is looking pretty good from here.\nAus 414-5\nLead by 244\nLauren Filer is going to the short stuff late in the day and changes the angle to round the wicket to Tahlia McGrath.\nJust a single from that one.\nBeth Mooney will be on strike to start the next, she needs seven for a maiden Test hundred. With just five minutes left in the day, will she get there tonight?", "url": "https://www.bbc.com/sport/cricket/live/cgl9r2l9ldet"}