{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:56", "date_modify": "2025-05-21 07:46:56", "date_publish": "2024-12-23 16:28:55", "description": "Arsenal news: Fan views on coping without Bukayo Saka", "filename": "sport_football_articles_c20nkxm54emo_1747813616.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20nkxm54emo_1747813616.html", "title": "Arsenal news: Fan views on coping without Bukayo Saka", "title_page": "Arsenal news: Fan views on coping without Bukayo Saka - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you how Mikel Arteta can replace Bukayo Saka in Arsenal's starting side after the winger was ruled out \"for many weeks\" with a hamstring tear.\nHere are some of your comments:\nPaul: I thought Gabriel Martinelli was far more effective operating on the right after Saka had to go off. Keep him there and play Leonardo Trossard on the left.\nJohn: With Saka out injured, it is time to call on Ethan Nwaneri. Play him wide or up front. Martinelli and Trossard will also have up their game.\nRobin: Martinelli on the right, Jesus on the left with Havertz in the middle. As alternatives, use Trossard on the left and Nwaneri on the right, with either Jesus, Havertz or Martinelli through the middle. Effectively rotate those five up front and hope nobody else gets injured.\nOkumu: Pay enough money to buy Nico Williams or Ademola Lookman, otherwise Arsenal will finish behind Chelsea and no silverware again this season.\nInnes: This is a good opportunity for a young star like Nwaneri to get a chance or, alternatively, it means we can fit the in-form Gabriel Jesus into the frontline with Kai Havertz.\nJC: Bring in Nwaneri - he is another fearless young lad, just like Saka when he burst into the league.", "url": "https://www.bbc.com/sport/football/articles/c20nkxm54emo"}