{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-20 13:05:40", "date_modify": "2025-05-20 13:05:40", "date_publish": "2023-08-02 16:22:04", "description": "Wrexham have made bids for players says manager Phil Parkinson, with key striker Paul Mullin set to be out for up to two months.", "filename": "sport_football_66388694_1747746340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3CE7/production/_130619551_gettyimages-1575481215.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66388694_1747746340.html", "title": "Paul Mullin: Wrexham bid for forwards as star striker recovers from injury", "title_page": "Paul Mullin: Wrexham bid for forwards as star striker recovers from injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Phil Parkinson says Wrexham have made bids for players with leading striker Paul Mullin set to be out for up to two months.\nMullin, 28, suffered a punctured lung during the club's US tour.\nParkinson said he was already in the market for a forward ahead of the club's return to the EFL before Mullin's injury\n\"That's proving difficult because teams don't want to sell their best players, it's as simple as that,\" he said.\n\"The market has become inflated but everyone's finding that.\n\"We've got bids on the table for one or two players and we're trying everything we can to get a player in as soon as possible.\n\"But when you're going for a player who's a key player at a football club, it's not easy.\nMullin, who scored 47 goals across all competitions last season, is currently unable to fly home due to the nature of his injury in which he suffered a punctured lung and four broken ribs after a collision with Manchester United goalkeeper Nathan Bishop.\nHe is currently recovering at the home of one of the club's Hollywood owners, Rob McElhenney, in California.\n\"I spoke to Paul yesterday, obviously enjoying the Californian sun,\" Parkinson told BBC Sport Wales.\n\"It's not the worse place to be but he'd rather be back here.\n\"He's in a lot of pain but the owners are making sure it's as comfortable a stay as possible.\n\"There's not much treatment he can have out there. It's dealing with the pain management at the moment.\n\"When he can come back, which is in a week's time, we'll assess him again and do everything in our power to get him back on the pitch as soon as possible as long it's safe for him.", "url": "https://www.bbc.com/sport/football/66388694"}