{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 04:35:54", "date_modify": "2025-05-21 04:35:54", "date_publish": "2025-04-04 17:07:14", "description": "The NBA fines Memphis Grizzlies guard Ja Morant $75,000 for twice using a finger-gun gesture during a victory against the Miami Heat.", "filename": "sport_basketball_articles_cn8vg30yxnqo_1747802154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8bc0/live/fde8bea0-1175-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cn8vg30yxnqo_1747802154.html", "title": "NBA: Ja Morant fined over finger-gun gesture during game", "title_page": "NBA: Ja Morant fined over finger-gun gesture during game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Memphis Grizzlies guard Ja Morant has been fined $75,000 for twice using a finger-gun gesture during a game.\nMorant made the gestures during the Grizzlies' 110-108 victory against the Miami Heat in Florida on Thursday.\nThe NBA says the 25-year-old was previously warned by the league office that the finger-gun gesture could be interpreted in a negative light.\nMorant - who scored a team-leading 30 points on Thursday - has twice been suspended by the NBA for showing a handgun on social media.\nHe was banned for eight games without pay in March 2023 for brandishing a firearm in an Instagram Live video.\nMorant was also given a 25-game suspension to start the 2023-24 season after a video of him posing with a firearm surfaced online.\nAfter the first incident, he apologised and said he took \"full responsibility\" for his actions.\nHe said he would \"work on learning better methods of dealing with stress and my overall wellbeing\" and that, after reflection, he realised \"what I have to lose\".\nMorant also had counselling while he was suspended.\nThe two-time All-Star has played for Memphis since they selected him with the second pick of the 2019 NBA Draft.\nThe Memphis Grizzlies are sixth in the Western Conference with a 45-32 record.\nBBC Sport has contacted the Grizzlies for comment.", "url": "https://www.bbc.com/sport/basketball/articles/cn8vg30yxnqo"}