{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:33", "date_modify": "2025-05-21 07:20:33", "date_publish": "2025-05-20 08:31:16", "description": "Uncapped Adelaide United forward Erin Healy is called up to the Republic of Ireland squad for the upcoming Women's Nations League matches against Turkey and Slovenia.", "filename": "sport_football_articles_cz9yyx2veqno_1747812033.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c82f/live/7548b6b0-3554-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz9yyx2veqno_1747812033.html", "title": "Women's Nations League: Adelaide United striker Erin Healy earns Republic of Ireland call-up", "title_page": "Women's Nations League: Adelaide United striker Erin Healy earns Republic of Ireland call-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Uncapped Adelaide United forward Erin Healy has been called up to the Republic of Ireland squad for the upcoming Nations League matches against Turkey and Slovenia.\nSan Diego-born Healy, who qualifies through her Monaghan-born grandfather, scored eight goals in her first A-League season and was named Adelaide's player of the year.\nLouise Quinn has been included despite announcing her retirement last month. The Football Association of Ireland (FAI) says Quinn will \"bring her leadership to the squad ahead of retiring this summer\".\nMegan Connolly is recalled after missing the wins over Greece in April because of injury, but Heather Payne, Leanne Kiernan, Tara O'Hanlon, Jamie Finn, Lily Agg and Jess Ziu are sidelined.\nCaptain Katie McCabe will link up with the squad following her involvement with Arsenal in Saturday's Champions League final against Barcelona.\nThe Republic of Ireland face Turkey away on 30 May before hosting group leaders Slovenia in Cork on 3 June (both 17:00 BST) in their final Nations League game.\nUnder new boss Carla Ward, the Irish have beaten Turkey at home and secured back-to-back wins over Greece, but lost 4-0 to Slovenia.", "url": "https://www.bbc.com/sport/football/articles/cz9yyx2veqno"}