{"authors": ["Jonty Colman", "Callum Matthews", "www.facebook.com"], "date_download": "2025-05-21 07:56:54", "date_modify": "2025-05-21 07:56:54", "date_publish": "2024-12-23 17:28:46", "description": "Former champion Rob Cross is knocked out of the 2025 World Darts Championships as a record number of seeds fall in the second round at Alexandra Palace.", "filename": "sport_darts_articles_cvg612k9d6ko_1747814214.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/985f/live/ec6977f0-c189-11ef-b4d4-2d9bcb19a929.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cvg612k9d6ko_1747814214.html", "title": "PDC World Darts Championship 2025 results: Rob Cross knocked out as record number of seeds fall", "title_page": "PDC World Darts Championship 2025 results: Rob Cross knocked out as record number of seeds fall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former champion Rob Cross became the latest high-profile casualty as a record-breaking 14th seed exited the PDC World Darts Championship in the second round.\nThe number five seed was beaten 3-1 by close friend Scott Williams, who will face Germany's Ricardo Pietreczko in round three.\nCross, who won the event on his debut in 2018, took the opening set but failed to reach anywhere near his best as he suffered his third second-round exit.\nHe was joined by number six seed David Chisnall, who was beaten 3-2 in a sudden-death leg by Ricky Evans, who came into the tournament 46th in the PDC's Order of Merit.\nThe 2021 semi-finalist won the opening set, but then found himself 2-1 down to an inspired Evans, who was cheered on relentlessly by the Alexandra Palace crowd.\nHe forced the game into a deciding set and faced match dart but Evans missed bullseye by the width of the wire.\nChisnall then missed his own match dart on double tops, before he made a miscalculation when attempting to checkout 139 at 5-4 down.\nNo real harm was done with a sudden-death leg forced but he was unable to hold off Evans, who reaches the third round for the third time in the last five years.\n\"It's not even what it is, again I've played a world-class darts player. I've played quite well and won,\" Evans told Sky Sports.\n\"Look at this [the crowd], wow. I don't understand it, why are they cheering me on?\n\"I don't get this reception in my household. Thank you very much. You've made a very fat guy very happy.\"\nEvans will face unseeded Welshman Robert Owen when the third round starts after the three-day Christmas break.\nIn the afternoon session, Welsh number seven seed Jonny Clayton also needed sudden death to pull off a sensational final-set comeback against Mickey Mansell in.\nHe was a leg away from defeat twice to his Northern Irish opponent, but came from behind to win the final set 6-5 in a sudden-death leg to win 3-2.\nClayton, who will play Gurney in round three, lost the opening set of the match, but fought back to lead 2-1, before being pegged back again by 51-year-old Mansell, who then missed match darts on double tops in the deciding set.\n\"I was very emotional. I've got to be honest, that meant a lot,\" said Clayton, who is in the favourable half of the draw following shock second-round exits for former world champions Michael Smith and Gary Anderson.\n\"I had chances before and Mickey definitely had chances before. It wasn't great to play in, not the best - I wouldn't wish that on my worst enemy.\n\"There is a lot of weight off my shoulders after that. I know there is another gear or two in the bank, but I'll be honest that meant a lot to me, it is a tester and will try and make me believe again.\"\nClayton was 2-0 down in the fifth set after consecutive 136 and 154 checkouts from Mansell, but won three legs on the trot in 15, 12 and 10 darts to wrestle a 3-2 lead.\nHe missed three darts for the match, before his unseeded opponent held and broke Clayton's throw to lead 4-3.\nMansell missed a match dart at double 20, before Clayton won on double five after two missed checkouts.\nElsewhere, Northern Ireland's Josh Rock booked his place in the third round against England's Chris Dobey with a 3-0 win over Wales' Rhys Griffin.\nMartin Lukeman, runner-up to Luke Littler at the Grand Slam of Darts last month, is out after a 3-1 loss to number 21 seed Andrew Gilding.\nThe final day before the Christmas break started with Poland's number 31 seed Krzysztof Ratajski recording a 3-1 win over Alexis Toylo of the Philippines.", "url": "https://www.bbc.com/sport/darts/articles/cvg612k9d6ko"}