{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 07:38:58", "date_modify": "2025-05-21 07:38:58", "date_publish": "2025-01-04 00:58:22", "description": "Why Luke Littler's historic world title win at Ally Pally felt 'inevitable', even if it wasn't.", "filename": "sport_darts_articles_cvg6yv5zz4ro_1747813138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9abd/live/33b32e40-ca2b-11ef-b9d6-efe2f3150059.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cvg6yv5zz4ro_1747813138.html", "title": "Luke Littler's world darts title win at Ally Pally felt 'inevitable', even if it wasn't", "title_page": "Luke Littler's world darts title win at Ally Pally felt 'inevitable', even if it wasn't - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It would be easy to say that it all felt so inevitable.\nLuke Littler, the runner-up last year, came into this year's PDC World Championship as the favourite and left having won it in dominant and breathtaking fashion.\nAmong the fans arriving at Alexandra Palace for the final there was an air of expectation.\nSuper Mario, Buzz Lightyear and Woody, the Spice Boys - they were coming not so much to see a darts match as to witness history.\nEven up against a three-time world champion in Michael van Gerwen, few even contemplated the idea Littler might not win.\nThe 17-year-old was going to become darts' youngest ever world champion.\nYet nothing about this should be seen as inevitable.\nLittler has enjoyed an incredible year since his sensational run to the final 12 months ago, winning 10 PDC titles including the Premier League and the Grand Slam of Darts, but returning to Ally Pally brings a whole different level of scrutiny.\nThe success he enjoyed only brought more pressure to go one better than he did in 2024.\nArguably no darts player before him has had to deal with such attention and it would have been easy for the teenager to crumble.\nInstead, still a couple of weeks out from his 18th birthday, Littler calmly made his way through the rounds and then put in a display as mature as it was astonishing to vanquish Van Gerwen.\nSomething that has stood out since Littler's rise to prominence has been his assuredness in even the most stressful moments and that was more apparent than ever in his second world final.\nWhile Ally Pally was at fever pitch in the moments leading up to the walk-ons, Littler was an image of calm.\nThere was no frenetic energy and no eagerness to get up to the stage and get on with it as he stopped and shook hands with a number of fans wearing his shirt, before eventually sauntering up the stairs towards the oche.\nRemarkably though, the new world number two looked even more at ease once the action started.\nA break of throw in the opening leg - bringing an almighty roar from the fans - no doubt helped but the way in which he proceeded to blow Van Gerwen away in the first four sets was nothing short of spectacular.\n\"Tonight and throughout the tournament, I just needed to get off to a quick start,\" Littler told Sky Sports.\n\"Earlier today, I watched all of the game back against Luke [Humphries, in last year's final] and I had the visions.\"\nWhatever those visions were, even in his wildest dreams, he could not have expected to make such a blistering start and find himself 4-0 up having dropped only three legs.\nIt is often said that younger sportspeople don't have the same fear that can hold back their older counterparts but the trade off is supposed to be an impetuousness that leads to mistakes, or at least a degree of inconsistency.\nBut there was none of that. His scoring was as relentless as ever and for a time it seemed he simply could not miss his favoured double 10.\nRather than the young upstart, it was the 35-year-old former champion and legend of the sport pressured into costly errors.\nVan Gerwen's disbelief at what was happening was matched only by the crowd, who quickly realised they might not get to see a thriller but watching a masterclass could be just as fun.\n\"It's almost like a cat toying with a mouse from Luke Littler, make [Michael van Gerwen] think he's doing OK then smash him with a 180 and get to a finish first,\" said John Part, a three-time world champion, on Sky Sports.\n\"This is cruel stuff.\"\nThat Prime Minister Keir Starmer, external congratulated Littler shows the scale of the teenager's achievement.\n\"Mesmerising performance from @LukeTheNuke180 to win the World Darts Championship,\" he wrote on X.\n\"Congratulations Luke on being the youngest ever PDC World Darts Champion. An inspirational performance under such pressure to lift the trophy.\"\nLittler has already inspired a new generation of darts fans and, in time surely, darts players.\nPerformances like his in this final will only inspire more.\nBy the time Littler was 6-2 up, any doubt over the result was gone. As is so often the case, a rendition of Robbie Williams' Angels indicated the end of the night was nigh.\nThe crowd belted it out, safe in the knowledge that what they had come to witness would soon come to pass.\nThat Van Gerwen nicked another set before Littler clinched it was the only surprise.\nBut clinch it he did, the emotions came out, the fans vociferously chanted his name and Littler held the trophy aloft.\nShortly afterwards, he stood next to his prize, not entirely sure what to do next. It was the first time all night he had looked in the least bit uncomfortable.\nNone of this was inevitable. But how natural Littler has made making history, you could certainly be fooled into thinking otherwise.", "url": "https://www.bbc.com/sport/darts/articles/cvg6yv5zz4ro"}