{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:27", "date_modify": "2025-05-20 11:41:27", "date_publish": "2023-08-06 17:26:43", "description": "Pakistan will participate in October and November's 50-over World Cup in India, ending months of uncertainty.", "filename": "sport_cricket_66424063_1747741287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/407B/production/_130670561_gettyimages-1244168710.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66424063_1747741287.html", "title": "Cricket World Cup 2023: Pakistan confirm they will send team to India", "title_page": "Cricket World Cup 2023: Pakistan confirm they will send team to India - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pakistan will send a team to India for October and November's 50-over World Cup, ending months of uncertainty about their participation.\nThe two sides have only played in World Cups and neutral venues since 2013 because of political tensions.\n\"Pakistan has consistently maintained that sports should not be mixed with politics,\" a Pakistan foreign office statement said.\nThey will meet in the Asia Cup on 2 September in Kandy, Sri Lanka.\n\"Pakistan believes that the state of bilateral relations with India should not stand in the way of fulfilling its international sports-related obligations,\" the statement added.\nThe neighbours have fought three wars and have had a number of military clashes in recent years. The two both control parts of the disputed Himalayan region of Kashmir but claim it in full.\nThe statement did not confirm, though, whether Pakistan are content to play India in Ahmedabad on 15 October as planned or whether they will ask for a change of venue.\nIt did say Pakistan has \"deep concerns\" about security, adding: \"We are conveying these concerns to the International Cricket Council and the Indian authorities.\n\"We expect that the full safety and security of the Pakistan cricket team will be ensured during its visit to India.\"\nThe World Cup starts on 5 October, with Pakistan's first game against the Netherlands on 6 October.", "url": "https://www.bbc.com/sport/cricket/66424063"}