{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-21 06:42:21", "date_modify": "2025-05-21 06:42:21", "date_publish": "2025-01-31 09:50:37", "description": "Ross McCausland believes Rangers can go all the way in Europa League", "filename": "sport_articles_czdlg39g07po_1747809741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/402c/live/c4bbe740-dfb8-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czdlg39g07po_1747809741.html", "title": "Ross McCausland believes Rangers can go all the way in Europa League", "title_page": "Ross McCausland believes Rangers can go all the way in Europa League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Ross McCausland believes Rangers can go all the way in the Europa League after their 2-1 win over Union Saint-Gilloise earned a top-eight finish in the table.\nThat secured safe passage to the last 16 where they will face one of Bodo/Glimt, Anderlecht, Twente or Fenerbahce in March depending who progresses from their play-off fixtures.\nGoals from Nicolas Raskin and Vaclav Cerny proved decisive despite late scares in a thrilling finale at Ibrox.\n\"We're absolutely delighted,\" McCausland said. \"When the draw first came out, people probably doubted us getting this situation so, now we're in this situation today and we're chuffed to pieces.\"\nAsked if he thought Rangers - who were runners-up in 2022 - were capable of going all the way in the competition he responded, \"Yes, definitely, 100%.\"\nIt had seemed an unlikely outcome to finish in the top eight with Rangers relying on other results even if they won. As it turned out, they joined four of the teams they faced in the league phase in the top eight.\n\"That says it all,\" added the Northern Ireland international. \"That shows the quality we have within our squad and how good we are in Europe. Now we've put ourselves in a very good situation.\n\"We've had a lot of injuries and that goes to show that it doesn't knock us down and we have the squad depth to be able to counter that. Everyone's put their hard work in in training each day and it shows.\n\"We've played a lot of big teams. You go back to the Old Trafford game, obviously, unlucky not to gain a point. You go back to the Spurs game, how incredible the boys were, and just even any of the other games.\n\"How we've handled them in different scenarios. Teams play a lot of very different ways, come from different countries, different style of football. So, for us to go and adapt and show what we can do is amazing.\"", "url": "https://www.bbc.com/sport/articles/czdlg39g07po"}