{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:23:41", "date_modify": "2025-05-21 06:23:41", "date_publish": "2025-01-22 23:11:27", "description": "Sheffield Wednesday boss Danny Rohl speaks to BBC Radio Sheffield after the Owls were denied victory by a late Bristol City equaliser in Tuesday's 2-2 draw.", "filename": "sport_football_articles_cn57y65gl6zo_1747808621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b553/live/97b2c1f0-d915-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn57y65gl6zo_1747808621.html", "title": "Sheffield Wednesday: Boss Danny Rohl reacts to Bristol City draw", "title_page": "Sheffield Wednesday: Boss Danny Rohl reacts to Bristol City draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday boss Danny Rohl spoke to BBC Radio Sheffield after the Owls were denied victory by a late Bristol City equaliser in Tuesday's 2-2 draw at Hillsborough.\n\"If you're leading two times at home, then you want to win the game,\" Rohl said.\n\"The first half was good. We were the better team. They got an equaliser in the second half but we came straight back – it was a good reaction.\n\"But the last 40 minutes was too passive. And, I must say, our strength in the past was the impact we made with the subs. Today, we didn't do that.\n\"I had a feeling at half-time that I would take a 1-0 win and no entertainment in the second half. That's our problem. We had this against Millwall, too. This is our issue and we have to find a solution for this.\n\"It's about running, closing down, doing all the right things, and I take the responsibility for the last 40 minutes that I couldn't help the team on the pitch. I am disappointed for the result, but also for my decisions.\n\"I decided to make substitutions. You hope the subs will give you fresh legs and help the team, but that didn't happen. Sometimes people can't understand why I make subs, but I have more information to hand. Even so this is difficult to take, especially with how we played in the second half.\n\"It's hard to take – but that's football. And Saturday is a new game.\"", "url": "https://www.bbc.com/sport/football/articles/cn57y65gl6zo"}