{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-04-26 04:12:56", "date_modify": "2025-04-26 04:12:56", "date_publish": "2025-03-04 12:10:53", "description": "Hibs and Hearts dominate Jane Lewis' SWPL team of the week", "filename": "sport_articles_cpv4k87dk7ko_1745640776.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c7d4/live/9a2ea650-f8f1-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cpv4k87dk7ko_1745640776.html", "title": "Hibs and Hearts dominate Jane Lewis' SWPL team of the week", "title_page": "Hibs and Hearts dominate Jane Lewis' SWPL team of the week - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Erin Clachers (Hibs): Celtic may not have overly worked the Hibs goalkeeper but when called upon she held on to the ball well. A big win for Hibs and as Celtic threw players forward, she played a vital part.\nSam van Diemen (Glasgow City): Comfortable at the back in the win against Motherwell and at ease venturing forward. The Dutch defender did really well as she raced down the wing to provide the ball in for Natalia Wrobel to score City's third goal.\nJess Broadrick (Aberdeen): Helped her team to a crucial win as she made some timely blocks to keep Spartans at bay.\nStacey Papadopoulos (Hibs): Stood up really well against Celtic, making vital blocks and tackles as the visitors pushed for the equaliser that never came.\nJackie Richards (Hearts): Was at the heart of everything Hearts did well in the draw with Rangers, especially in the first half. As well as clearing a shot off the line, the American was impressive driving forward to set up attacks.\nHolly Daniel (Montrose): Provided the assist for Neve Guthrie to put re-establish Montrose's lead in victory over Dundee United.\nTegan Bowie (Hibs): Terrific energy and pace from the winger in driving Hibs forward. The 21-year-old showed great persistence as she beat her marker to send in a brilliant cross for Eilidh Adams' winning goal.\nLaura Berry (Rangers): Managers hope their subs make an impact - Berry did exactly that. Her goal was class as she ran on to the ball and finished wonderfully. Her ball in for Rio Hardy's equaliser was inch perfect.\nBrenna Lovera (Glasgow City): Scored the opener to set the tone against Motherwell. Also provided the assist for their second, scored by Lisa Forrest, as City earned a significant win to regain top spot.\nEilidh Adams (Hibs): Started and finished the move for the only goal against Celtic. It wasn't easy to keep that ball down, despite the quality of the delivery, but she showed determination and composure to secure a statement victory for Hibs.", "url": "https://www.bbc.co.uk/sport/articles/cpv4k87dk7ko"}