{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:39:35", "date_modify": "2025-05-21 04:39:35", "date_publish": "2025-04-04 15:26:42", "description": "Four Real Madrid players, including Kylian Mbappe and Vinicius Jr, are cleared to face Arsenal in their Champions League quarter-final despite three being punished by Uefa.", "filename": "sport_football_articles_cvgpx32emreo_1747802375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b4f/live/b19d9c20-1169-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgpx32emreo_1747802375.html", "title": "Real Madrid: Kylian Mbappe and Vinicius Jr cleared to face Arsenal in Champions League", "title_page": "Real Madrid: Kylian Mbappe and Vinicius Jr cleared to face Arsenal in Champions League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four Real Madrid players have been cleared to face Arsenal in their Champions League quarter-final despite three being punished by Uefa.\nLast month, European football's governing body opened an investigation into allegations of indecent conduct by Antonio Rudiger, Kylian Mbappe, Vinicius Jr and Dani Ceballos during their last-16 win against Atletico Madrid.\nThe four allegedly made gestures towards the home fans after Real beat their city rivals on penalties to book their place in the last eight.\nUefa said on Friday that no disciplinary proceedings were brought against 24-year-old Brazil winger Vinicius.\nThe other three Real players were found to have violated \"the basic rules of decent conduct\" under article 11(2)(b) of Uefa's disciplinary regulations.\nFrance striker Mbappe, 26, and Germany defender Rudiger, 32, were both given a suspended one-match ban and fined £25,000 (30,000 euros) and £35,000 (40,000 euros) respectively.\nSpain midfielder Ceballos, 28, was fined £17,000 (20,000 euros).\nArsenal face Real in the first leg of their quarter-final at Emirates Stadium on 8 April, with the second leg at the Bernabeu on 16 April.", "url": "https://www.bbc.com/sport/football/articles/cvgpx32emreo"}