{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:45", "date_modify": "2025-05-21 04:09:45", "date_publish": "2025-04-06 12:41:34", "description": "Hull KR boss Willie Peters says the club will not know the severity of Mikey Lewis' groin injury until he has had a scan.", "filename": "sport_rugby-league_articles_cm2510j7jnro_1747800585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4352/live/9cfa62a0-12de-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cm2510j7jnro_1747800585.html", "title": "Mikey Lewis: Hull KR unsure on half-back's injury layoff until scan", "title_page": "Mikey Lewis: Hull KR unsure on half-back's injury layoff until scan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull KR boss Willie Peters says the club will not know the severity of Mikey Lewis' groin injury until he has had a scan.\nThe reigning Man of Steel came off just 15 minutes into the Robins' Challenge Cup quarter-final win against city rivals Hull FC on Saturday.\nDespite his absence, KR rallied and sealed a 32-16 win, but Peters said the worst case scenario would be that Lewis is out for up to two months.\n\"There's a groin issue there, I'm not 100% sure to the extent - I don't think it's that bad but we'll know when he gets a scan,\" Peters told BBC Radio Humberside after the win.\n\"There's different parts – sometimes if you do a certain part [of the groin] then it's serious and you could be out for six to eight weeks.\n\"We're hoping it's an area that's not so serious but I don't know enough about it and we'll have to wait to get a scan.\"\nAny absence for Lewis is bound to be a blow to the current Super League leaders, but Peters says they did not want to rush a return to action for the 23-year-old in the second half of yesterday's tie.\n\"I didn't want to risk it – he would have needed an injection to do that and obviously if you do that then it could cause further damage,\" Peters added.\n\"He [Lewis] said he possibly could [come back on] but we didn't want to go down that track if we didn't have to.\n\"We had to overcome some adversity. We handled it today, we've handled it previously but we've got to keep doing it. We've got a group that can handle it and who train for it. They do scenarios in training where Mikey has come and Jez [Litten] has gone into the halves.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/cm2510j7jnro"}