{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:10:13", "date_modify": "2025-05-20 12:10:13", "date_publish": "2023-08-05 00:00:00", "description": "Follow all the action as the new Scottish Premiership season kicks off.", "filename": "sport_live_football_66200171_1747743013.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66200171_1747743013.html", "title": "Lyons fires Kilmarnock into lead against Rangers", "title_page": "Lyons fires Kilmarnock into lead against Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you tomorrow...\nThat's all from us after a headline-grabbing end to a long opening day of the Scottish Premiership season.\nRemember those highlights on the BBC Scotland channel right now. If you miss it, it's repeated on BBC One Scotland at 22:20.\nMeanwhile, join us tomorrow for the final top-flight match of the weekend as Hibs return from progress in Europa Conference League qualifying to host St Mirren.\nJoin us then.\n'Very poor opening day' - Beale\nFT: Kilmarnock 1-0 Rangers\nRangers manager Michael Beale tells BBC Sportsound: \"Kilmarnock defended extremely well. They had a game plan. They were dangerous on the counter all day. They were comfortable in the game.\n\"It's a very poor opening day for us. We need to move forward very quickly. There's 37 games to go, let's not get carried away.\n\"The excitement over the summer is going to be tempered. We have to show the fans and excite them and they have to get behind us, it works both ways.\n\"I expect us with the quality we have to execute in the moments we had. If we don't, I expect a hard-fought away draw rather than coughing up a really poor goal.\"\nWe'll get better - McInnes\nFT: Kilmarnock 1-0 Rangers\nKilmarnock manager Derek McInnes tells Sky Sports: “You have got to do so much right to beat a team with Rangers’ quality.\n“We spoke at half time about strike the first blow against Rangers to have something to hold on to but to plant that seed of doubt. We knew, if we did that, we’d have a real good chance.\n“We had to show a different version of ourselves against the Old Firm this season. Rangers will get better, but I think we’ll get better as well.\n\"Our level of performance had to be really good today, but we delivered that. It’s a really strong start.”\nCan Beale do a Postecoglou?\nFT: Kilmarnock 1-0 Rangers\nIt must be remembered that Ange Postecoglou suffered a stuttering start to his first season as Celtic manager two seasons ago before turning it round and winning his first of two consecutive titles.\nHowever, it was the manner of defeat for Michael Beale's side that will worry Rangers fans as much as anything.\n'Ibrox can be graveyard'\nFT: Kilmarnock 1-0 Rangers\nLee McCulloch\nFormer Rangers midfielder & Kilmarnock manager on BBC Sportsound\nRangers' new signings will realise it is not going to be easy. They have got to take the flak that is coming their way on their shoulders and try to prove everyone wrong. Walter Smith used to say that there's a graveyard of international players at Ibrox who could not handle playing for Rangers and there were hints of that today.\n'Rangers were awful'\nFT: Kilmarnock 1-0 Rangers\nI felt that Michael Beale and Rangers had to get to the winter break still in touch with Celtic. There's going to be bumps on the road, simply because there is so much change. He's failed at the first hurdle and he's three points behind. The heat is on. It's the worst possible start. They were awful.\nWorrying times for Rangers\nFT: Kilmarnock 1-0 Rangers\nWhat can we deduce from Rangers' first competitive fixture?\nDefeat by Kilmarnock has followed others in friendlies against Newcastle United and Olympiacos, but they also drew with Hoffenheim and beat Hamburg.\nWhat you can say is that they have a lot of improving to do - and they need to do it fast if they are to keep pace with a Celtic side who look to be carrying on from where they left off last season after their 4-1 defeat of Ross County earlier.\nFULL-TIME Kilmarnock 1-0 Rangers\nA famous win for Kilmarnock. A deeply damaging one for Rangers even if it is only the opening day of the Premiership season.\nMichael Beale's rebuilt visitors crumbled under the pressure at Rugby Park and already reigning champions have established a three-point gap with their likeliest title rivals.\nKilmarnock deserved their victory, thanks to Brad Lyons' goal. They outfought - and out thought - their more illustrious visitors.", "url": "https://www.bbc.com/sport/live/football/66200171"}