{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:48", "date_modify": "2025-05-20 12:20:48", "date_publish": "2023-08-04 18:53:58", "description": "Catch up with all of the team news and stats and choose your team's preferred XI for the return of the Scottish Premiership.", "filename": "sport_football_66406026_1747743648.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2784/production/_130661101_-2b8a33c3-9d31-4745-8dde-95973996f3f4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66406026_1747743648.html", "title": "Scottish Premiership team news, stats & selectors", "title_page": "Scottish Premiership team news, stats & selectors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n4 August 2023\nIt's back! The opening round of the new season in the Scottish Premiership takes place this weekend.\nCatch up with the latest team news and stats and pick your starting XI.\nAll matches kick-off on Saturday at 15:00 BST unless stated.\nCeltic v Ross County (12:30 BST)\nCeltic forward Daizen Maeda is suspended, while right-back Alistair Johnson, centre-half Yuki Kobayashi and forwards Mikey Johnston and Marco Tilio miss out through injury.\nCentre-half Cameron Carter-Vickers and right-back Anthony Ralston will be assessed after returning to action following lay-offs during Tuesday's friendly with Athletic Bilbao.\nRoss County manager Malky Mackay can pick from the same squad he had at his disposal for last weekend's Viaplay Cup game against Kelty Hearts.\nBen Purrington, Jordy Hiwula and Matthew Wright are close to returning but unlikely to feature, while Ross Callachan and Ben Paton are out with long-term injuries.\nDid you know? County have never beaten Celtic in the league but did come away from Glasgow with a victory in the League Cup in the 2020-21 season.\nSorry, we can't display this part of the article any more.\nSorry, we can't display this part of the article any more.\nDundee v Motherwell\nDundee are at full strength for their return to the top flight.\nFormer Motherwell goalkeeper Trevor Carson could make his debut after signing from St Mirren in midweek.\nWell have doubts over midfielder Harry Paton and Jonathan Obika, but fellow striker Conor Wilkinson looks set to shake off a head wound.\nTwo more strikers - Theo Bair and Mika Biereth - signed this week and will hope for debuts, but defender Calum Butcher is out with a foot injury.\nDid you know? Dundee beat Motherwell twice at home in the season they were relegated - to end a six-game winning streak for the Steelmen in all competitions at Dens Park.\nSorry, we can't display this part of the article any more.\nSorry, we can't display this part of the article any more.\nLivingston v Aberdeen\nLivingston goalkeeper Shamal George is suspended, while winger Dan MacKay could go into David Martindale's squad after signing on loan from Hibernian.\nLiverpool loanee Rhys Williams will miss out on his Aberdeen debut because of a back injury, but fellow centre-back Angus MacDonald is battling to feature after a knee problem.\nDid you know? The last four games at Tony Macaroni Arena between Livingston and Aberdeen have finished 2-1 - with two wins apiece.\nSorry, we can't display this part of the article any more.\nSorry, we can't display this part of the article any more.\nSt Johnstone v Heart of Midlothian\nDefender Callum Booth, forwards Nicky Clark and Chris Kane, plus midfielders Ali Crawford and Cammy MacPherson are all out for St Johnstone and defender James Brown is doubtful.\nWingers Drey Wright and Graham Carey hope to prove their fitness in time after recent niggles, while former Chelsea centre-half Sam McClelland and former Liverpool defender Oludare Olufunwa are in line for debuts.\nKyosuke Tagawa, the striker signed from Tokyo, could make his Hearts debut if his international clearance comes through in time, while midfielder Alex Lowry has just arrived on loan from Rangers.\nMidfielder Calem Nieuwenhof and defender Frankie Kent are also in line for their first competitive appearances.\nStriker Liam Boyce and midfielder Beni Baningime are back in contention after long-term knee injury lay-offs.\nHowever, Barrie McKay, Craig Gordon and Craig Halkett remain out through injury, while defender Alex Cochrane is suspended.\nDid you know? Hearts beat St Johnstone in all three of the league games last season, scored three times in each one.\nSorry, we can't display this part of the article any more.\nSorry, we can't display this part of the article any more.\nKilmarnock v Rangers (17:15 BST)\nSorry, we can't display this part of the article any more.\nSorry, we can't display this part of the article any more.\nHibernian v St Mirren (Sun, 15:00 BST)\nHibs have a goalkeeping dilemma after David Marshall pulled out of their European tie against Inter d'Escaldes with a hamstring issue in the warm-up and Jojo Wollacott suffered a thigh injury early in the game.\nMax Boruc could continue after coming on for his debut, while 18-year-old Murray Johnson has been temporarily recalled from a loan spell with Queen of the South.\nCentre-half Rocky Bushiri begins a two-match domestic ban, while right-back Chris Cadden and striker Harry McKirdy are long-term absentees.\nSt Mirren centre-half Charles Dunne will be assessed after returning to training following a calf injury, while two recent signings - forward Stav Nahmani and defender James Bolton - are doubtful.\nDid you know? More than one goal has separated Hibernian and St Mirren in only one of their last 10 games - last October's 3-0 Easter Road win for the home side.\nSorry, we can't display this part of the article any more.\nSorry, we can't display this part of the article any more.\nAround the BBC\nBBC Sport Scottish Football\nBBC Sport Scottish Football\nRelated internet links\nSPFL\nSPFL\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/football/66406026"}