{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 06:14:10", "date_modify": "2025-05-21 06:14:10", "date_publish": "2025-01-22 23:36:51", "description": "Plymouth Argyle forward Morgan Whittaker misses his side's 5-0 loss to touted transfer destination Burnley as he \"did not show up\" in time.", "filename": "sport_football_articles_c3e15wj25glo_1747808050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b03d/live/68af94e0-d916-11ef-af7e-1b8cd76fd4b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3e15wj25glo_1747808050.html", "title": "Morgan Whittaker: Plymouth Argyle forward 'didn't show up' for Burnley game", "title_page": "Morgan Whittaker: Plymouth Argyle forward 'didn't show up' for Burnley game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle forward Morgan Whittaker missed his side's 5-0 Championship loss to touted transfer destination Burnley as he \"did not show up\" in time for the game.\nThe 24-year-old has been linked with a £5m-plus move to the Clarets during the current transfer window.\nHe had been picked by head coach Miron Muslic to start the match, but was not in the team or among the substitutes for Wednesday night's defeat.\nWhittaker, who scored Argyle's winning goal in the FA Cup third-round tie at Brentford this month, was spotted in the stands during the game.\n\"Morgan didn't show up,\" Muslic, who had recently praised Whittaker's professionalism amid ongoing rumours over the player's future, told BBC Sport.\n\"We had a game today and he was in the selection and he wasn't there.\"\nAustrian coach Muslic took over from Wayne Rooney less than two weeks ago and the former Cercle Brugge boss says he has never had a situation where a player picked in the line-up was not at the ground in time.\nHe reiterated that Whittaker, who has also been linked with Middlesbrough, was still an Argyle player until a club pays a fee Plymouth feel is appropriate.\n\"It shows the mentality, or even the lack of mentality,\" Muslic added of the forward, who has scored 24 goals in 72 games since moving to the club permanently in 2023.\n\"I think you always have your responsibilities and you are under contract.\n\"You have to be professional, you have obligations, not only towards Argyle as an organisation, you have an obligation towards your team-mates and you don't let your team-mates down, never.\"", "url": "https://www.bbc.com/sport/football/articles/c3e15wj25glo"}