{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:11:13", "date_modify": "2025-04-26 04:11:13", "date_publish": "2025-03-05 00:00:00", "description": "Reaction as Chelsea beat Leicester to go eight points clear at the top of the Women's Super League as Manchester City are held to a draw by West Ham.", "filename": "sport_live_c863653vylet_1745640673.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/311b/live/0dcdfae0-fa08-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_live_c863653vylet_1745640673.html", "title": "WSL: Chelsea win to go eight points clear as Man City held by West Ham", "title_page": "WSL: Chelsea win to go eight points clear as Man City held by West Ham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "That's all for tonight\nFT: Chelsea 3-1 Leicester\nThanks for tuning into our coverage tonight as Chelsea carried on their unbeaten run by beating Leicester and West Ham snatched a late point against Manchester City.\nThat's all from us, but we'll be back at the weekend to talk you through all of the action in the Women's FA Cup quarter-finals.\nYou can follow our Women's Super League page to ensure you stay across all the latest news and views from across the division.\nSee you soon!\n'We did give them some trouble'\nFT: Chelsea 3-1 Leicester\nLeicester City\nLeicester boss Amandine Miquel speaking to Sky Sports: \"We played well in and out of possession. The attitude and character we showed tonight is important.\"\nOn how they caused Chelsea problems: \"We had a plan to overload one side, to use better than we have lately the double pivot and defensive midfield. To take advantage of counter attacks also, we did that quite well. We did give them some trouble and that's the most important thing.\"\nOn if she is making steady progress with Leicester: \"When you take a new club it is a new way of organising and a lot of changes and it takes time. Now we are doing a bit better and the players are understanding what we want to do.\"\nOn how Ruby Mace is after she was taken off on a stretcher: \"We don't know. We prefer not to say anything until we have a scan and more information. We hope she will be fine.\"\n'We are ready mentally, physically and in all the aspects'\nFT: Chelsea 3-1 Leicester\nChelsea\nChelsea boss Sonia Bompastor, speaking to Sky Sports: \"Really important. This result means a lot. When you just dropped points it's really important to win the game after and the reaction was good from my players, but I was expecting that.\"\nOn the performance: \"We were able to score really quickly. We had a lot of opportunities. We could have been more clinical in the box. When we were 2-0 up we cannot concede the goal we conceded. When you are winning 2-0 you need to control more things and we gave the goal to Leicester. We need to control the game in that aspect.\"\nOn what is harder than earlier in season: \"I don't think it's confidence. We have been rotating the squad a lot and sometimes we are less fluid than in the beginning of the season. I'm not too worried, I know the quality of my squad and the talent in my team. We will need that for the bigger games coming up, but it was really important to score three goals.\n\"I have depth in my squad and it is nice to rotate because it gives the opportunity to every player in my squad to show the qualities that they have. I think we've missed a little bit of chemistry at times in the team.\"\nOn big games coming up: \"We are ready mentally, physically and in all the aspects. We are really looking forward to those moments. It is in these big games you can win titles.\"", "url": "https://www.bbc.co.uk/sport/live/c863653vylet"}