{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:53", "date_modify": "2025-05-21 03:52:53", "date_publish": "2025-04-07 09:41:09", "description": "Swansea City: Derby County to address Jerry Yates' future in summer - John Eustace", "filename": "sport_football_articles_cz0134lkndno_1747799573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68a1/live/8e1c3960-1393-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz0134lkndno_1747799573.html", "title": "Swansea City: Derby County to address Jerry Yates' future in summer", "title_page": "Swansea City: Derby County to address Jerry Yates' future in summer - John Eustace  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "John Eustace says Derby County will address Jerry Yates' future at the end of the season.\nYates has enjoyed a positive campaign having joined Derby on a year-long loan from Swansea last summer.\nThe striker is the Rams' leading scorer this season having netted eight times in 36 appearances.\nAs things stand, Yates will return to Swansea at the end of the season, as he is under contract at the Welsh club until at least 2026.\nWhen asked whether he would like to keep Yates beyond the summer, Derby boss Eustace said: \"I think Jerry has done very well - that is something we will discuss at the end of the year.\"\nYates is thought to be one of the higher earners at Swansea having joined from Blackpool in a deal worth about £3m in 2023.\nWhat comes next for the former Rotherham United player is likely to depend to some extent on who is in charge at Swansea, with caretaker boss Alan Sheehan only in place - for the moment at least - for the remainder of this campaign.\nYates was ineligible to feature as Sheehan's Swansea beat Derby 1-0 on Saturday.\nWhen asked whether Yates' absence had been a factor in Derby's first defeat in five games, Eustace added: \"Jerry's been great.\n\"He scored on Wednesday [against Preston] but [Kayden] Jackson came in and did well, he worked his socks off as the rest of the group did.\"", "url": "https://www.bbc.com/sport/football/articles/cz0134lkndno"}