{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:08", "date_modify": "2025-05-19 15:06:08", "date_publish": "2015-02-09 07:17:53", "description": "Win was no shock to Christian Nade and Gough in plea to Rangers fans...", "filename": "sport_football_31287929_1747667168.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/75814000/jpg/_75814058_gossip_promo_sportfootball(2).jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31287929_1747667168.html", "title": "Monday's Scottish gossip", "title_page": "Monday's Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goal hero Christian Nade insisted Raith Rovers' 2-1 Scottish Cup win over Rangers at Ibrox on Sunday was no shock as far as the Stark's Park side are concerned. (Scottish Sun)\nAnd Nade said hearing Rangers players arguing with each other left him in no doubt that Rovers would secure the win. (Daily Record)\nRangers caretaker manager Kenny McDowall apologised to the club's fans for the defeat to Raith as they were knocked out of another cup competition. (Various)\nRaith manager Grant Murray says the win at Ibrox meant as much as beating Rangers in the Challenge Cup final. (Scottish Sun)\nRyan Conroy, who scored Raith Rovers' opener against Rangers, feared the use of vanishing spray would scupper his chances of netting the free-kick that made it 1-0. (Scottish Sun)\nFormer Rangers captain Richard Gough wants fans to stay away from the club's upcoming EGM in London, insisting he fears a huge turnout will lead to the board seeking an adjournment. (Herald)\nCeltic midfielder Stefan Johansen believes his in-form side are ready to storm to the treble and beat Inter Milan in the Europa League. (Daily Record)\nDundee United manager Jackie McNamara has challenged two-goal Scottish Cup hero Ryan Dow to become the next big thing at Tannadice. (Scottish Sun)\nAnd Dow believes Dundee United are on track for another appearance in the Scottish Cup final. (Daily Record)\nFormer Scotland goalkeeper Andy Goram has backed the new Uefa Nations League, and believes national manager Gordon Strachan will embrace the tournament. (Scottish Sun)\nQueen of the South's Paul Burns watched footage of the club's Scottish Cup final appearance in 2008 to motivate him for Saturday's game against St Johnstone, in which the men from Dumfries knocked out the Cup holders. (Scottish Sun)\nGraeme Shinnie reckons Marley Watkins can fill the void left by striker Billy McKay at Inverness Caley Thistle. (Scottish Sun)\nPartick Thistle goalkeeper Paul Gallacher fears his side will be hammered by Celtic in midweek if they play like they did in the defeat to Inverness. (Scottish Sun)\nPeter Pawlett says being left out of the Aberdeen side on Saturday inspired his sensational second half display after coming on as a substitute. (Scottish Sun)\nStephen Hendrie has assured Hamilton fans he will give his all for the club despite having agreed to join West Ham in the summer. (Scottish Sun)\nAlexei Eremenko reckons the Kilmarnock board will have to give Gary Locke the manager's job if they secure a top six finish this term. (Scottish Sun)\nDavid Gray has backed Hibernian to see off Rangers on Friday night, insisting the Easter Road men are a better side now than when they beat the Ibrox outfit 4-0 last year. (Daily Record)\nScotland's Barry Bannan insists the chance to play for \"legend\" Neil Lennon prompted his loan switch from Crystal Palace to Bolton. (Scottish Sun)\nScotland's Preston Mommsen has called on cricket's governing body to do more to help the Associate nations compete with the game's major forces. (Scottish Sun)\nStuart Hogg has backed Scotland to recover from the defeat to France by continuing to play an exciting brand of rugby under head coach Vern Cotter. (Daily Record)\nAnd Hogg has identified Finn Russell as the man to lead Scotland's Six Nations revival. (Daily Star)", "url": "https://www.bbc.com/sport/football/31287929"}