{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:15:05", "date_modify": "2025-05-20 14:15:05", "date_publish": "2023-07-29 17:49:33", "description": "DIGIONLY", "filename": "sport_cricket_66350567_1747750505.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66350567_1747750505.html", "title": "England set up chance to level Ashes series", "title_page": "England set up chance to level Ashes series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England gave themselves a golden opportunity to level the Ashes series with a joyful batting display on the third day of the fifth Test against Australia at The Oval.\nThe home side piled up 389-9, a lead of 377, as Australia were once again hit by some thrilling strokeplay.\nAlmost all of the top order made contributions. Zak Crawley set the tone by driving Mitchell Starc's first ball of the day for four, laying the platform for an opening stand of 79 with Ben Duckett.\nCrawley made 73 and Duckett 42, the same score as captain Ben Stokes, who was promoted to number three in place of the injured Moeen Ali.\nWhen England endured a slight wobble in losing two wickets for nine runs, Joe Root and Jonny Bairstow combined for a fifth-wicket stand of 110. Root fell nine runs short of a deserved century, while Bairstow was out for 78.\nMoeen, batting at number seven, added a cameo of 29, but was part of a flurry of England wickets late in the day. Starc picked up 4-94 and off-spinner Todd Murphy 3-110 as England lost 4-19.\nBy that stage, England had already got to the stage where Australia would need to complete the highest-ever successful chase in a Test on this ground.\nThere is rain forecast for Sunday, though not enough bad weather across the final two days to match the ruined end of the drawn fourth Test at Old Trafford.\nEngland are looking to draw the series 2-2, while Australia are looking for the 3-1 win that would give them a first success in this country for 22 years.", "url": "https://www.bbc.com/sport/cricket/66350567"}