{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-20 11:52:26", "date_modify": "2025-05-20 11:52:26", "date_publish": "2023-08-05 19:27:20", "description": "Wrexham's 5-3 defeat to MK Dons in their first game back in the EFL after a 15-year absence is a \"reality check\" says manager Phil Parkinson.", "filename": "sport_football_66418693_1747741946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4EDA/production/_130668102_gettyimages-1578443843.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66418693_1747741946.html", "title": "Wrexham defeat to MK Dons 'a reality check' says boss Phil Parkinson", "title_page": "Wrexham defeat to MK Dons 'a reality check' says boss Phil Parkinson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Parkinson says Wrexham's 5-3 defeat to MK Dons in their first game back in the EFL after a 15-year absence is a \"reality check\".\nWrexham were promoted to League Two after a record breaking season in which they won the National League title.\n\"It wasn't the day we wanted,\" Parkinson said.\n\"Everyone's talking about ourselves as favourites and sometimes you need a day like this, like a reality check to reassess things.\"\nParkinson added: \"It's one to review but not to get too down as a group.\n\"We just looked like our decision making in all areas, on the ball and off the ball, were a long way off where it needs to be.\n\"We've had a lot of praise and a lot of expectancy on us, today's the day where it's reality check time and we come back on Monday morning.\"\nEoghan O'Connell's own goal and Mo Eisa gave the visitors a 2-0 lead inside the opening 10 minutes and although Jacob Mendy replied, Jonathan Leko's second-half brace put MK Dons further ahead.\nDaniel Harvie scored Dons' fifth in between Wrexham late goals from substitutes Jordan Davies and Anthony Forde to seal a 5-3 win.\n\"We looked like we could score today despite being a long way off how I know we can play,\" Parkinson added.\n\"We had chances and few other moments where I felt we should have made the goalkeeper work at the very least.\n\"But that's the difference in levels. They got chances and they were absolutely clinical when the moments came for them.\n\"You go up a level and you've got to be better in all departments and we were short today. We've got to accept that.\"\nWrexham host Wigan Athletic in the first round of the Carabao Cup on Tuesday evening.\nParkinson said he would make \"a lot of changes\" for the game against the League One side.\n\"The players that didn't play today need minutes because we've lacked minutes in pre-season as everybody knows for different reasons,\" Parkinson added.\n\"We need to utilise that game to get all this squad up to speed.\n\"If you look at the lads today we looked like a team that needed the game and Tuesday there will be a lot of changes.\n\"It's not disrespecting the tournament at all it's just because of the pre-season we've had we already had this game in mind where players need some minutes and we'll definitely be doing that.\"", "url": "https://www.bbc.com/sport/football/66418693"}