{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:29:17", "date_modify": "2025-05-21 06:29:17", "date_publish": "2025-04-02 00:00:00", "description": "Derby continue their impressive resurgence by beating Preston to claim a fourth successive Championship win and climb out of the relegation zone.", "filename": "sport_football_live_czx7x33wxzgt_1747808957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0a3/live/10777760-0ffe-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_czx7x33wxzgt_1747808957.html", "title": "Championship: Derby County 2-0 Preston North End", "title_page": "Championship: Derby County 2-0 Preston North End - Rams climb out of relegation zone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All black and white on the night for Rams and Magpies\n#bbcefl\nPhew. After a slow start it all came to life, but not in glorious Technicolor, tonight it was all black and white...\nDerby County look to have found their groove at the perfect time under new boss John Eustace to give themselves every chance of avoiding the drop from the Championship.\nCardiff are the new tenants in the drop zone, for a few days at least, while Preston look adrift on the seas of mid-table for another season.\nIn League Two, Notts County have waded into the thick of the title race with a comprehensive win over MK Dons, who might well start browsing summer holiday brochures soon too.\nNo holidays for us - we're back on Friday night to see John Eustace's former employers, Blackburn, taking on Middlesbrough.\nThank you for your company this evening, we'll see you back here soon!\nWhat a way to finish...\nFT: Derby 2-0 Preston\nTwo goals for Derby, and both trademark striker's goals too.\nOf course the first of them came from evergreen centre-back Craig Forsyth, who took a couple of tidy touches in the box before pulling a shot back across his body, through a crowd, into the corner.\nJerry Yates then popped up in the right place at the right time to guide Nat Phillips' downward header past Dai Cornell to double the lead just four minutes later.\nMagpies fly into contention\nFT: Notts County 3-0 MK Dons\nBack-to-back wins for Notts County have taken them right into the mix in League Two with only six games remaining.\nIn a promotion race which has slowed to more of a crawl in recent weeks, they might just be clicking at the right time.\nNot in the picture, MK Dons remain 18th, but still surely too far clear of danger, with a 10-point lead over the bottom two.\n'Things are looking up'\nFT: Derby 2-0 Preston\nMalcom Christie\nBBC Radio Derby\nIt's a collective effort, this is what we have wanted. John Eustace is loving it, as are the fans, and so they should.\nThings are looking up, not down at the moment. We've finally got something to put smiles on our faces.\nEverybody should be so proud and pleased with the past few weeks, we'll be going into the next game full of confidence.\nFULL-TIME\nDerby 2-0 Preston\nJohn Eustace lost his first three games as Derby boss, without his side scoring a goal.\nThey have since won four in a row in the Championship, for the first time in nearly five years, and are now out of the relegation zone.\nIn a blistering opening to the second half Craig Forsyth's low shot into the bottom corner and Jerry Yates' poacher's second were enough to secure a win which had looked unlikely in a dour first 45 minutes.\nThe Rams are looking up, whereas Preston have endured four days to forget and look destined for mid-table obscurity once more.", "url": "https://www.bbc.com/sport/football/live/czx7x33wxzgt"}