{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 06:05:06", "date_modify": "2025-05-21 06:05:06", "date_publish": "2025-04-01 15:11:43", "description": "Liverpool entertain Everton on Wednesday and Toffees boss David Moyes would have every reason to be a bit worried about the match.", "filename": "sport_football_articles_cvgpddl311mo_1747807506.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0865/live/ec6fe500-0f03-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgpddl311mo_1747807506.html", "title": "Liverpool v Everton: Can David Moyes end his Anfield misery?", "title_page": "Liverpool v Everton: Can David Moyes end his Anfield misery? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For David Moyes, Anfield has become the stuff of nightmares.\nTwenty one matches managed there, no wins, 14 defeats and 36 goals conceded - and the Everton boss isn't expecting life to get any easier when the Toffees visit runaway league leaders Liverpool in the Premier League on Wednesday.\nMoyes, 61, whose Everton side are 36 points behind Liverpool, said: \"We might be further away from Liverpool than we have ever been at the moment.\n\"When we left here, we were much closer to Liverpool, we were competitive, competing around the same areas in the league. At the moment it is probably the biggest gulf between the two clubs.\"\nA look at the history books shows Moyes is right. With him as Everton manager, this is the biggest points gap there has ever been before a Merseyside derby.\nBefore this season, the biggest points gap before a Merseyside derby that Moyes was involved in was the 18 points Everton trailed the Reds by back in March 2006, and this will only be the sixth time the difference has been in double figures.\nMoyes' Everton have actually been ahead of Liverpool before eight of those 19 derbies, with them level going into both derbies in 2010/11.\nThere has only been a bigger points difference than this before any Merseyside derby twice in Premier League history, with Liverpool leading Everton by 47 points in April 2022 and by 45 in June 2020.\nEverton also trailed Liverpool by the same 36-point margin in April last season.\nIn terms of finances, the gulf is also pretty big, with Everton's squad costing in the region of £200m to assemble - compared to Liverpool's circa £550m.\nMoyes' 19 Premier League games without a win at Anfield is also the longest any manager has gone in the competition without victory at the ground.\nA dozen of those matches came during his first spell in charge of Everton, with his side gaining seven draws and five defeats. He also lost in his only match at Anfield when Manchester United boss and again when in charge of Sunderland.\nWhile West Ham manager, he was in charge of seven games at Liverpool, losing them all, with his most recent visit there seeing the Reds secure a 5-1 thrashing in the quarter-finals of the Carabao Cup in December 2023.\nHe said: \"Yeah. I don't want it [the record]. I want to win. I want to make sure I get rid of it.\n\"Everytime we go there, it presents another chance to do so.\n\"I would be lying if I said I look forward to going there all the time because it is such a hard place to get results. It is nothing to do with the surroundings or the pitch, they have always produced good teams.\"\nMoyes began his second spell in charge of Everton in January, replacing the sacked Sean Dyche with the Toffees 16th in the Premier League - one point clear of the relegation zone - with only three wins from 19 games.\nThey lost 1-0 at home in Moyes' first league game since his return, but his side have been unbeaten since then, apart from a 2-0 home loss to Bournemouth in the fourth round of the FA Cup.\nWins against Tottenham, Brighton, Leicester and Crystal Palace, along with five draws, have taken Everton 17 points clear of the relegation zone with the team almost guaranteed to be playing in the top flight when they move to their new stadium at Bramley Moore Dock for the beginning of the 2025-26 season.\nOne of those draws was an incredible 2-2 in the last Merseyside Derby to be staged at Goodison Park as James Tarkowski's equaliser in the eighth minute of added time earned Everton a draw.\nSince Moyes' return to the club, Everton have gained 17 points, the fifth highest in the Premier League, although runaway leaders Liverpool, with 23 points in the same period, also sit on top of that table.\nBut does Moyes have any special plans to stop the Premier League's form player Mohamed Salah?\n\"We could try and build a wall or something to stop him but he is such a talented player but we done quite a good job on him in the first game,\" he said.\n\"We will have to hope we can do something similar in this game.\n\"He is having an unbelievable season for Liverpool but we are talking about one of the top Premier League players of this generation.\"", "url": "https://www.bbc.com/sport/football/articles/cvgpddl311mo"}