{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 07:47:17", "date_modify": "2025-05-21 07:47:17", "date_publish": "2025-05-18 19:47:22", "description": "Max Verstappen reminded everyone in Imola that he cannot be ruled out of the championship fight but the maths still favour McLaren, writes Andrew Benson.", "filename": "sport_formula1_articles_cx2rv5303ndo_1747813637.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a64/live/2392d850-33ec-11f0-96f3-ab1a2b7558e0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cx2rv5303ndo_1747813637.html", "title": "Emilia-Romagna Grand Prix: How Max Verstappen caught McLaren by surprise in Imola", "title_page": "Emilia-Romagna Grand Prix: How Max Verstappen caught McLaren by surprise in Imola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen caught McLaren by surprise at the Emilia-Romagna Grand Prix to seal his second win of the year and lay down a reminder - as if one was needed - that he cannot be ruled out of this year's Formula 1 championship fight.\nThe surprise came in two forms - firstly, by the spectacular move the Red Bull driver pulled to take the lead from McLaren's Oscar Piastri at the first corner; and then by the pace Verstappen showed once out in front\nIn Miami two weeks ago, Verstappen also led the early laps, but he was devoured by the McLarens of both Piastri and Lando Norris in the first 20 laps of the race and then left far behind.\nNot so this time.\nVerstappen never looked like losing the race once he was in the lead. And while McLaren were left to rue some of what Piastri described as \"wrong calls\" during the race, they were also realistic enough to know that none of them would have made a difference to the outcome.\nThe decision to pit early for fresh tyres cost Piastri in the context of the way the race unfolded, with first a virtual safety car and then an actual one. And the season's protagonists finished in reverse championship order, with Norris second and Piastri third.\n\"It was the best result I thought we could really achieve today,\" Norris said. \"I probably just didn't expect the Red Bull to be quite as quick as they were.\"\nPiastri still leads the championship from Norris and Verstappen, but the gaps have compressed as the drivers head to Monaco this weekend. Where form may shift again.\nFirst, though, that move. It was delicious.\nOn the run to the first corner, Verstappen had actually dropped to third, with Mercedes' George Russell edging ahead on his inside and Piastri apparently comfortably in the lead.\nBut, in the middle of the track, and not on the ideal line, Piastri braked earlier than he should have done, and it was all the invitation Verstappen needed.\nHe \"sent it\" around the outside with full commitment, and caught Piastri - an instinctive and clinical racer himself, normally - unawares.\n\"Yeah,\" the Australian said. \"I thought I had it pretty under control, and it was a good move from Max. So, I'll learn for next time, clearly.\n\"Definitely would have done something different (in hindsight). I would have braked 10 metres later probably. Yeah. That's all. Live and learn.\n\"But at that point, I wasn't overly concerned to not be in the lead. But then our pace just wasn't as strong as I expected.\"\nThe move even impressed Verstappen.\n\"I was quite far back,\" he said. \"At the time before braking, I was basically in P3. But, of course, I was on the normal braking line, but I still had to come from far.\n\"And as soon as I braked late and then came off the brakes, I felt like: 'OK, there might be a move on.' So, I just carried the speed in. And, luckily, it basically was sticking. It's not an easy move to make but, luckily, everything went well.\"\nHad McLaren shown the pace advantage they had in Miami, or Bahrain, or China, or Australia, it might not have mattered, even on a track where overtaking is as notoriously difficult as Imola.\nBut they didn't. Piastri could hold Verstappen for a while, but then began to feel his tyres going away, and McLaren decided to pit him.\nIt was the wrong decision - on this day, the tyres went through a phase where they felt like they were going off, but then came back again. But all it did was change which McLaren finished second and third.\nVerstappen believed that there were two combined explanations for his improved form. Red Bull had brought some upgrades, and they had worked. But there was also the track itself.\nAs at Suzuka - his other win this year - or Jeddah, where Verstappen went toe-to-toe with Piastri, the track, as Verstappen put it, \"has quite a few high-speed corners, which I think our car likes\".\nHe added: \"It's very track specific. I mean, every time that we have been really competitive, it's been high-speed tracks, high-speed corners.\n\"We still have work to do, but I do think it's been a very positive weekend for us.\n\"Friday was very difficult still, but then I think we found a better set-up for Saturday. And I just hope that we can use that a bit more often because it definitely brought the car in a better window.\"\nNorris said: \"That's where we've suffered the whole season so far, the high-speed corners. So we have to work in that area, and maybe that's proved to hurt us a little bit more this weekend.\n\"We said it from the beginning that we have to keep working hard. Max has out-qualified us several times, and their pace just converted today into Sunday.\n\"Sometimes they've been ahead, but their pace on Sunday has not been too strong. They've maybe worked on some things, and their pace was better today. That's the price we pay for not being quick enough.\"\nSeven races in, and a pattern is developing. On a high-speed track, the Red Bull and McLaren are a match for each other. But at a different speed range, the McLaren has a decisive advantage.\nSo the pendulum may keep swinging. Monaco this coming weekend is as slow as they come. It should favour McLaren.\nVerstappen said: \"Monaco is, of course, very, very different. So, let's see how we are going to perform there. You know, last year was very difficult for us. I don't expect it to be a lot easier this time around because there's, of course, a lot of low speed, but we'll see.\"\nThe following weekend comes Spain, where the Circuit de Barcelona-Catalunya is full of long, medium and high-speed corners. Red Bull territory. Except that tyre degradation is high there, which should help McLaren.\nOverall, though, the trend, the maths, still favour McLaren.\nBecause on the tracks where the cars are pretty equal, either team can win. Piastri beat Verstappen in Saudi Arabia, for example. And then there are tracks where McLaren are simply better. Red Bull will, on current form, need McLaren to screw up to win on those.\nBut what there have not been - at least so far - are any tracks on which the Red Bull is dominant in the way the McLaren has been at about half the events so far.\nAlthough Piastri is by nature a down-to-earth personality, who lets nothing apparently ruffle his sang-froid, he may have been thinking of this when he summed up his feelings on his third place.\n\"Honestly, given people had fresher tyres at the end, hanging on to a podium is not a bad result,\" Piastri said. \"And you're going have tough days in the championship, and this is clearly one of them.\"", "url": "https://www.bbc.com/sport/formula1/articles/cx2rv5303ndo"}