{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:30:17", "date_modify": "2025-04-26 07:30:17", "date_publish": "2025-02-27 17:41:49", "description": "Gillingham boss John Coleman says a video of his players acting jovially released a day after the 2-1 loss to Fleetwood was \"unacceptable\".", "filename": "sport_football_articles_c5y22jvvg60o_1745652617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7fd4/live/304f5160-f52e-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y22jvvg60o_1745652617.html", "title": "Leaked Gillingham video \"unacceptable\", says boss John Coleman", "title_page": "Leaked Gillingham video \"unacceptable\", says boss John Coleman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gillingham boss John Coleman says a video of his players acting jovially released a day after their 2-1 League Two loss to Fleetwood Town was \"unacceptable\".\nThe video, which Coleman claims was recorded on Monday but leaked on Wednesday, shows the players laughing and dancing in the club's gym.\n\"We're seeing players laughing and joking when we are probably 12, 14 hours after we've got a defeat at home that we are all hurting from,\" Coleman told BBC Radio Kent.\n\"The players have been told in no uncertain terms that going out on social media or the public domain, people laughing and joking after we've got beat, it doesn't look good.\n\"But on the same token, we want people to go to the gym and work hard and enjoy that aspect. We've suffered a defeat we are all a bit raw about but I want the players full of confidence.\"\nThe loss to Fleetwood extended the Gills' winless run to 13 games, leaving them in 19th place in the League Two table, nine points clear of Saturday's opponents, Morecambe, in 23rd.\n\"We've got to realise the threat of relegation is there and we don't want to be drawn into that,\" Coleman added.\n\"But we've got to be aware that if we don't pick up results, we will be.\"\nHowever, despite the run of poor results, Coleman insists performances from his players are improving.\nThe 62-year-old took over as Gillingham boss in January following the dismissal of Mark Bonner.\n\"We are making opportunities now, which we weren't when I first came,\" he added.\n\"There were lots of fans who were disappointed in the output from the players. I'm getting the output from the players that I require now.\n\"I think we are close to a win.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c5y22jvvg60o"}