{"authors": ["Russell Fuller", "www.facebook.com"], "date_download": "2025-05-21 05:24:25", "date_modify": "2025-05-21 05:24:25", "date_publish": "2025-04-03 14:23:07", "description": "The top 20 ATP and WTA tennis players send a letter to the four Grand Slams asking for more prize money.", "filename": "sport_tennis_articles_c1mel1y998eo_1747805065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b427/live/3bfa3430-1095-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c1mel1y998eo_1747805065.html", "title": "Top-20 men's and women's players ask Grand Slams for more prize money", "title_page": "Top-20 men's and women's players ask Grand Slams for more prize money - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The top 20 men's and women's players have sent a letter to the four Grand Slams asking for more prize money.\nThe letter, which was first reported by French newspaper L'Equipe, requested a meeting to discuss players receiving a greater share of the revenue generated by the Australian Open, French Open, Wimbledon and US Open.\nWorld number 11 Emma Navarro cited \"unfair pay ratios\" as a reason for putting her name to the letter.\n\"I talked a little bit to the other players about it and felt like it was a good idea to sign\", the 23-year-old American said on Wednesday.\n\"I think it's a good cause to come together as players and make sure we're getting treated fairly.\"\nPrize money at last year's Wimbledon was £50m, exactly double the amount offered in 2014. In that 10-year period, prize money for first-round losers increased from £27,000 to £60,000.\nBut players have frequently pointed to the vast revenues generated by the Grand Slams, and feel they deserve a significantly larger return.\nIn the year up to July 2023, the All England Club (AELTC) had a turnover of £380m. But once the costs of running the Championships were deducted, the operating profit was just under £54m.\nNearly £49m of that went to the LTA, as the AELTC has agreed to pay the governing body 90% of its annual surplus until 2053.\nCosts include prize money, employing more than 8,000 seasonal staff, preparing and developing the site and supporting other grass court events.\nOlympic champion Zheng Qinwen said increased prize money would be particularly welcomed by lower-ranked players, who can struggle to make ends meet at other times of the year.\n\"I think that's going to benefit all the players, not only the top players, especially those that work hard during the year and need to get paid from the Grand Slams and have to survive,\" added the Chinese world number eight.\n\"We try to do what we can, and then let's see what the gods bring to us. But at least we're trying.\"\nIt comes little more than two weeks after the Professional Tennis Players' Association (PTPA) launched legal action against tennis' governing bodies, citing \"anti-competitive practices and a blatant disregard for player welfare\".\nThe lawsuit by the players' group, which was co-founded by Novak Djokovic, seeks an end to what it describes as \"monopolistic control\" of the tennis tour, as well as financial compensation from the ATP, the WTA, the International Tennis Federation (ITF) and the International Tennis Integrity Agency (ITIA).", "url": "https://www.bbc.com/sport/tennis/articles/c1mel1y998eo"}