{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:43:51", "date_modify": "2025-05-21 05:43:51", "date_publish": "2025-04-02 23:14:18", "description": "World number one Judd Trump goes out of the Tour Championship at the quarter-final stage in Manchester following a 10-5 defeat by Barry Hawkins.", "filename": "sport_snooker_articles_clyq2119819o_1747806231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1065/live/890f0a60-1014-11f0-992e-13a2fb1a4046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_clyq2119819o_1747806231.html", "title": "Tour Championship: Judd Trump loses to Barry Hawkins in quarter-finals", "title_page": "Tour Championship: Judd Trump loses to Barry Hawkins in quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Judd Trump is out of the Tour Championship following a 10-5 quarter-final defeat by Barry Hawkins in Manchester.\nTrump started well, taking a 2-1 lead before Hawkins won the next six frames to sail ahead.\nTrump pulled one back with a break of 103 but he could not halt Hawkins' momentum, with neither player stringing back-to-back frames together from that point.\nThe 45-year-old Hawkins triumphed with breaks of 121 and 81 to wrap up a superb victory.\nThe victory continues a fine run of form for Englishman Hawkins after he thrashed Shaun Murphy 10-1 to reach the last eight.\n\"I'm just trying to concentrate on what I do that makes me play well,\" he said.\n\"I'm over the moon. It wasn't quite the same performance as against Shaun but I still felt like I was solid enough.\n\"I took most of my chances when they came along - it's not easy to beat the world number one.\"\nHawkins will play either John Higgins or China's Xiao Guodong for a place in the final.\nHiggins holds a 5-3 overnight lead thanks to three century breaks, including 137 and 126 to claim the last two frames of the first session.\nIn the other side of the draw, Mark Selby won six consecutive frames to open up an imposing 7-1 lead over Australia's Neil Robertson.", "url": "https://www.bbc.com/sport/snooker/articles/clyq2119819o"}