{"authors": ["Oluwashina Okeleji", "www.facebook.com"], "date_download": "2025-05-19 14:55:07", "date_modify": "2025-05-19 14:55:07", "date_publish": "2017-07-04 14:46:48", "description": "Ex-Nigeria keeper Vincent Enyeama, Zambia's Stoppila Sunzu and Ivory Coast's Junior Tallo are among those who are no longer required by new Lille coach Marcelo Bielsa.", "filename": "sport_football_40496148_1747666507.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BCAC/production/_96800384_596428382.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40496148_1747666507.html", "title": "Nigerian keeper Vincent Enyeama's Lille future is in doubt", "title_page": "Nigerian keeper Vincent Enyeama's Lille future is in doubt - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Nigeria goalkeeper Vincent Enyeama is one of 11 players who has been told they are no longer required by new Lille coach Marcelo Bielsa.\nThe French club's new Argentine boss has also sent messages to Zambia's Stoppila Sunzu, Tunisia's Naim Sliti and Ivory Coast's Junior Tallo saying they are not part of his plans.\nEnyeama, who played 101 times for the Super Eagles, only signed a new deal last season and could choose to follow the lead of Tallo.\n\"As for me, I'm under contract. I will respect the two years I have left. I'm in no hurry,\" the Ivorian told French Newspaper L'Equipe.\n\"I want to establish myself at Lille.\n\"It's the club that wants me to leave. We'll see if they find a solution between now and the end of the transfer window. I'm calm. It's a bit bizarre, but I'm handling it OK.\n\"I was informed like the others, by text. We're under contract, the club does what it wants.\n\"We would have liked to have had a discussion. But it's a business choice made by the bosses.\nThe club has already made some summer signings including Burkina Faso international goalkeeper Herve Koffi following Lille's disappointing 11th place finish in Ligue 1 last season.\nBut the African quartet, former captain Rio Mavuba, Eder, Julian Palmieri, Marko Basa, Éric Bauthéac, Lenny Nangis and Marvin Martin have been ordered to stay away from the rest of the squad as pre-season started on 3 July.\nEnyeama, who joined Lille in June 2011 and has made 164 appearances, welcomed the signing of Koffi last month.", "url": "https://www.bbc.com/sport/football/40496148"}