{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 12:52:21", "date_modify": "2025-05-20 12:52:21", "date_publish": "2023-08-03 11:02:40", "description": "England defender Lucy Bronze says she can help keep Lauren James' \"feet on the ground\" and has formed a strong bond with the Chelsea star.", "filename": "sport_football_66381037_1747745541.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3590/production/_130621731_gettyimages-1539784628.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66381037_1747745541.html", "title": "Lucy Bronze: 'I can help keep Lauren James' feet on the ground'", "title_page": "Lucy Bronze: 'I can help keep Lauren James' feet on the ground' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England defender Lucy Bronze says she can help keep Lauren James' \"feet on the ground\" and has formed a strong bond with the Chelsea star.\nJames, 21, has been one of the standout performers at the Women's World Cup, producing a stunning performance in the 6-1 win over China on Tuesday.\nShe has three goals and three assists in as many games and manager Sarina Wiegman said she did \"special things\".\n\"We have formed a bond. We are in similar situations,\" said Bronze.\n\"I was thrust into the limelight in a different way, but I can help give her advice. I can help keep her feet on the ground, but she is good at that anyway.\n\"She's someone, like myself, who gets misinterpreted a little bit by other players or the media because she hasn't always got a smile on her face.\n\"When she came into her first camp she was already asking me a lot of questions about things that other players didn't ask.\n\"She reminds me so much of myself when I was younger. She is shy, but she believes in herself a lot.\"\nBronze, 31, has won almost every trophy in her club career and has appeared in five major tournaments for England, making 108 appearances.\nShe made a name for herself at the 2015 World Cup when she scored crucial goals en route to the last four, claiming the right-back spot from Alex Scott in the process.\n\"I can't expect LJ (James) to score in every game and turn in performances like she did against China every game. She is still young and she's still getting to grips with playing at the highest level,\" said Bronze.\n\"But you have seen her at Chelsea and she has delivered some fantastic performances. I know how much quality she has. She has definitely announced herself on the world stage, but this is just the beginning.\"\nJames' success against China was the highlight of an exciting performance by England, who switched to an unfamiliar set-up of three at the back to combat the absence of injured midfielder Keira Walsh.\nThe Lionesses played with the same starting XI in every game at Euro 2022, but Bronze believes they have adapted to deal with tougher opposition in Australia.\nThere are only six players from that side currently available with striker Ellen White retiring, as well as injuries to Leah Williamson, Fran Kirby, Beth Mead and Walsh.\n\"People wanted it to be the same, but it was never going to be. We've had to be adaptable and we have shown we can be,\" said Bronze.\n\"Keira is irreplaceable and there isn't anyone who can do what she does in the world. So it's not just tearing up the formation.\n\"But you could see in the first two games that we needed to spruce things up a bit. We have shuffled things about a little bit and it keeps other teams on their toes.\n\"They don't know what to expect - it makes us unpredictable. If Keira does come back and plays, who is to say how we will play? We might keep this formation with her in it.\n\"We needed to be unpredictable. We needed to refresh things. You need that in the knockout rounds.\"", "url": "https://www.bbc.com/sport/football/66381037"}