{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:40", "date_modify": "2025-05-20 14:07:40", "date_publish": "2023-07-30 15:14:40", "description": "World number one Iga Swiatek claims her fourth title of the season at the Poland Open, while Germany's Alexander Zverev wins on home territory at the Hamburg Open.", "filename": "sport_tennis_66355125_1747750060.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3190/production/_130588621_bbc-sport-index-imagery-2-split-images-gradient-abbb2095-911a-4977-8222-dc9610707803.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66355125_1747750060.html", "title": "Iga Swiatek wins Poland Open as Alexander Zverev claims Hamburg title", "title_page": "Iga Swiatek wins Poland Open as Alexander Zverev claims Hamburg title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Poland's Iga Swiatek and Germany's Alexander Zverev claimed titles at their home opens on Sunday.\nWomen's world number one Swiatek beat Germany's Laura Siegemund 6-0 6-1 in Warsaw to win the Poland Open.\nMeanwhile, Zverev defeated Serbia's Laslo Djere 7-5 6-3 in the final of the Hamburg Open.\nSwiatek only completed her semi-final earlier in the day after play was suspended on Saturday night because of bad light.\nThe 22-year-old was 6-1 5-5 up against Yanina Wickmayer at the time, and she eventually claimed a 6-1 7-6 (8-6) victory over the Belgian when the match was resumed.\nShe raced through the championship match against Siegemund in just 68 minutes without facing a single break point.\n\"It's not easy to play in Warsaw, but I'm so happy that we could manage and do everything we could today, after a pretty tiring day yesterday,\" said Swiatek, who didn't drop a set throughout the tournament.\n\"I wanted to put it all in and go for it. I'm pretty happy that I did.\"\nIt is a fourth title for the Pole this season, having won in Doha and Stuttgart before picking up her third French Open title at Roland Garros in June.", "url": "https://www.bbc.com/sport/tennis/66355125"}