{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:41", "date_modify": "2025-05-20 14:38:41", "date_publish": "2023-07-28 12:35:08", "description": "Sheffield United podcast: Iliman Ndiaye's future amid Marseille links", "filename": "sport_articles_cx7y0qxnl44o_1747751921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ced0/live/7daaaa30-2c95-11ee-b72c-5d125591510e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cx7y0qxnl44o_1747751921.html", "title": "Sheffield United podcast: Iliman Ndiaye's future amid Marseille links", "title_page": "Sheffield United podcast: Iliman Ndiaye's future amid Marseille links - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Sheffield's Adam Oxley and former Blades striker Carl Asaba have been discussing striker Iliman Ndiaye's future on the Blades Heaven podcast, amid reports of interest from French club Marseille.\nOxley said: \"We know he was close to signing a new deal, we know that there's a new deal on the table, and it seems like we can't go a day now without a report emerging about blocks in talks or something about Marseille.\n\"Sheffield United fans right now just want some clarity about whether he is going to be part of this season, because he's such a vital player.\"\nAsaba added: \"All I can say is that I see Iliman, I see him about the group, and he's not causing problems, he's working his socks off, the management love him, he's not complained, and it's just difficult.\n\"We're obviously offering him a good contract. There's other people offering him contracts. But from where I am and what I know about football, it won't be to do with Sheffield United or Marseille, it will be the agents and third parties who stand to earn money. Agents don't earn as much if you sign again for the same club.\n\"If Iliman goes for the most money we can get, that's great, as long as it comes to us. The club and [Paul] Heckingbottom are operating on a medium-sized Championship budget, not even a big-sized budget. That's not being disrespectful to the ownership, the owners are acting in the very best interests of the club.\"\nListen to the full podcast on BBC Sounds", "url": "https://www.bbc.com/sport/articles/cx7y0qxnl44o"}