{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:29:02", "date_modify": "2025-04-26 06:29:02", "date_publish": "2025-02-27 11:18:54", "description": "Nottingham Forest news: Robert Earnshaw and 'underdog mentality'", "filename": "sport_football_articles_cr422n5w59yo_1745648942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9027/live/f053e070-f4ed-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr422n5w59yo_1745648942.html", "title": "Nottingham Forest news: Robert Earnshaw and 'underdog mentality'", "title_page": "Nottingham Forest news: Robert Earnshaw and 'underdog mentality' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nottingham Forest love having the \"underdog mentality\", says former striker Robert Earnshaw.\nHaving lost their past two Premier League games, Forest halted the recent slide with a well earned point against second-placed Arsenal on Wednesday night.\nThe result kept them third in the table, one point above Manchester City, and still on course for European football next season.\n\"It was an excellent draw, because you've got to have the bigger context, the bigger picture. Nottingham Forest are fighting for Champions League now and fighting for the title,\" Earnshaw told BBC Radio 5 Live Breakfast.\n\"They will give chances to the other team, but they love this underdog mentality.\n\"They kind of play on the fast break a little bit and transition where they'll sit back and then just hit you with their pace and their finishing. Chris Wood had a couple of little moments [against Arsenal] where you thought, 'oh, this is it'.\n\"I was there for the Liverpool game a few weeks ago, at the City Ground, and you always feel like Forest will have the chance. It's just whether they can take it and, to be honest, nine times out of ten, they take it. Last night, it just wasn't to be.\n\"They will take that [point] and the Forest fans will take that. They understand the position that they're in, they understand where Arsenal are.\n\"Any more points as they go towards the end of the season now, it just takes them further and further into that Champions League spot. It just makes it stronger.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr422n5w59yo"}