{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:20:59", "date_modify": "2025-04-26 04:20:59", "date_publish": "2025-03-03 15:16:16", "description": "Derby County fans share their views on the Rams' chances of avoiding relegation after they dropped to the bottom of the Championship table.", "filename": "sport_football_articles_cp8ydpn5nv6o_1745641259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/097c/live/885de8c0-f82c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp8ydpn5nv6o_1745641259.html", "title": "Derby County fans' views on Rams' chances of avoiding relegation", "title_page": "Derby County fans' views on Rams' chances of avoiding relegation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After Derby County dropped to the bottom of the Championship table, we asked Rams supporters for their views on the club's chances of survival with 11 matches remaining.\nDerby's dire run of 10 defeats in a 12-game winless league run - in which they have managed to score just four goals - has apparently left fans with little hope.\nBelow is a selection of what supporters had to say...\nSimo: The season is over. I just can't see Derby collecting any more points let alone stringing a set of results together. So much optimism before the season began - however, for whatever reason, it's turned into one to forget. Start making plans for League One as we aren't getting out of this mess any time soon.\nLes: I'm resigned to relegation sadly.\nPaul: Mathematically it is still possible, so there is still hope. In reality, though, I cannot see it happening. Individual defensive errors and a total lack of ability to score mean we will struggle to win another game. Even if we cut out the defensive errors you can't win games if you don't score. Perhaps Kemar Roofe will find a way, but I doubt it. My heart hopes we do survive but my head says we'll be relegated... but League One champions next season?\nJohn: If we can manage 10 points from our next four games, we may have a chance. It's a big ask...but a needed one with the safety gap now four points. We can't rely on the others dropping points.\nKris: Still a lot to play for but the lack of confidence is ruining the side at the very first concession - it's like watching the ill-fated Premier League side [2007-08] again in that respect. Plenty of sides in the mix, and we only need to be above three of them come May, but if Mr Clowes doesn't get the level of investment we need to be competitive in this ever-improving Championship then we'd only be delaying the inevitable if we were to escape the drop. We go on in hope rather than expectation.\nGinge: Can't see where the next win is coming from. These remaining games are do or die. Need a win and a win fast, got to be more aggressive towards the opposition and get stuck in.\nRob: Thoughts at the start of the season was happy with fourth bottom, this could now be best case scenario! Main confusion lies with how we have gone from convincing wins, especially against Bristol City and Portsmouth, to apparently being devoid of talent, goals or confidence, in [the space of] a quarter of a season.\nChris: Confidence is lacking across the board. Unless we get a goal soon it's going to be a struggle to avoid relegation. Injuries have hindered us without a doubt but other teams have their woes. We badly need investment so we can compete with our peers at least. I m resigned to relegation happening, unless we get a miracle. But I'll still support my team.\nHarry: Relegation is inevitable at this point, we offer no attacking threat in the final third. I think if we do go down, we need to invest and rebuild the team for the long-term goals of promotion next season and keeping Championship status after that.\nDom: We have the players and the manager to stay up, and the teams around us aren't pulling up trees either. But the confidence doesn't look to be there, and our goalscoring record is atrocious. I'll be amazed if we avoid relegation.\nDave: The squad simply isn't good enough for the Championship. Those who think it is or who think we will stay up need to have a word with themselves. The midfield, in particular, is too slow and lacks creativity - a total overhaul is needed in the summer. I suspect we will be in League One for a while, unfortunately.\nAndy: Not enough talent, not enough fight. We'll finish bottom. Hopefully keep Eustace so he can pay the fans back on his promises.", "url": "https://www.bbc.co.uk/sport/football/articles/cp8ydpn5nv6o"}