{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:39:00", "date_modify": "2025-05-21 05:39:00", "date_publish": "2025-01-14 12:10:30", "description": "Defender Dion Sanderson says he's pleased to be reunited with former Birmingham boss John Eustace at Blackburn Rovers.", "filename": "sport_football_articles_c391n3j0g1ro_1747805940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1991/live/5d7f5970-d26d-11ef-bab6-05d1916ca3e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c391n3j0g1ro_1747805940.html", "title": "Dion Sanderson: Defender pleased to link up with Blackburn Rovers", "title_page": "Dion Sanderson: Defender pleased to link up with Blackburn Rovers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers defender Dion Sanderson says he couldn't wait to be reunited with boss John Eustace.\nThe 25-year-old moved to Ewood Park on loan from Birmingham City last week and is back working under Eustace who he spent time with at both Blues and QPR\n\"It all happened quite quickly, my agent told me there was interest from Blackburn and straight away I was like, get me down there,\" Sanderson told BBC Radio Lancashire.\n\"I've got nothing but good memories under John - at Birmingham we had a strong half season and he built that connection with the players\"\nBlackburn are currently seventh in the Championship, one point outside the play-off places and Sanderson believes Eustace has all the qualities to manage at the top level.\n\"To me he's a great person first of all. He's really ambitious, dedicated to his job and will hammer down on the basics and there's no cutting corners which is how it should be.\n\"I'm glad to see him doing well here and I'm glad to be here to help.\"\nThe defender is in line to make his Rovers debut in Wednesday's Championship match at home to Portsmouth.", "url": "https://www.bbc.com/sport/football/articles/c391n3j0g1ro"}