{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-04-26 07:31:33", "date_modify": "2025-04-26 07:31:33", "date_publish": "2025-02-27 17:12:06", "description": "Burnley manager Scott Parker says he needs to \"think hard\" about picking Hannibal Mejbri for Saturday's FA Cup fifth-round tie at Preston.", "filename": "sport_football_articles_cvg14znd408o_1745652693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/703e/live/3520dbb0-f433-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg14znd408o_1745652693.html", "title": "Will Hannibal Mejbri and Milutin Osmajic play in Preston v Burnley FA Cup tie amid racism claim?", "title_page": "Will Hannibal Mejbri and Milutin Osmajic play in Preston v Burnley FA Cup tie amid racism claim? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Burnley manager Scott Parker says he needs to \"think hard\" about whether to play midfielder Hannibal Mejbri in Saturday's FA Cup fifth-round tie at rivals Preston North End, with a racism allegation overshadowing the fixture.\nLess than two weeks ago, Hannibal accused Preston forward Milutin Osmajic of racially abusing him during a goalless Championship draw between the two sides.\nPreston said Montenegro international Osmajic \"strongly refuted\" the claims.\nThe Football Association investigation is not expected to be concluded before Saturday's fixture, meaning both players could feature in the Lancashire derby at Deepdale.\n\"It is tough and one which I need to think hard and long on,\" Parker said in his pre-match news conference on Thursday.\n\"Fundamentally I want to protect Hannibal, but then why should he miss out? That is a decision I will have to make.\n\"I will make the best decision that feels right for Hannibal, explaining the situation and seeing where he is comfortable. I will have those conversations on Friday morning.\"\nMeanwhile, Preston boss Paul Heckingbottom suggested he had not considered the idea of leaving Osmajic out and, when asked whether he was taking an 'innocent until proven guilty' approach, Heckingbottom replied \"Yes, exactly, 100%\".\nThe Preston boss added: \"My problem with what happened, and a lot of the fallout and people's comments after the game, it belittles a serious incident from both sides about what has been said.\n\"Scott [Parker] spoke really well in front of some poor questioning. Agendas and people not understanding the situation, but it is a game of football for us now, that situation has been and gone past and people are dealing with it.\"\nThe FA is still investigating the incident, with interviews to be conducted with both players, several club staff and any witnesses. If found guilty, Osmajic faces a minimum ban of six games.\nBurnley will have the whole 5,600 allocation of the Kop stand behind one goal at Deepdale, however ticket sales for home fans appear to be slow, with thousands of seats still available when checked by BBC Sport on Thursday.\nThe fixture two weeks ago was live on Sky but played in front of almost 20,000 supporters in the 23,400-capacity ground.\nSaturday's match will be broadcast live on the BBC iPlayer and BBC Sport website.\nAfter a report of racism from \"within the crowd\" at the previous game, Lancashire Police said they will carry out \"a full risk assessment\" with the \"appropriate policing plan put in place\", as they do with all other fixtures.\nThe match on 15 February was delayed for several minutes in the second half when Hannibal reacted furiously to something that appeared to be said to him by Osmajic.\nThe Tunisian then spoke at length to referee Andrew Kitchen and Burnley said the alleged incident was reported during and after the game to officials, who registered the complaint with the FA.\nThere were some reports that Burnley players wanted Osmajic to be substituted after the alleged incident, but this has not been verified by BBC Sport.\nBurnley sources told BBC Sport a Preston player approached the Burnley changing room at full-time to check on Hannibal's wellbeing.\nThe Professional Footballers' Association (PFA) has also contacted Burnley to offer its support.\nIn a post on Instagram after the game, former Manchester United player Hannibal said he \"will not be silent\" and \"will always call out racism\", adding: \"I am a strong person but nobody should have to experience this disgusting abuse on the pitch.\"\nIn the days after the incident, Preston boss Heckingbottom criticised \"nonsense put online\" and said Osmajic, 25, was \"upset\" and \"did not sleep\" after the game.\nThe Lancashire rivals are separated by just 26 miles. Both Championship meetings this season have been goalless draws.\nIf both Hannibal and Osmajic are given starts, then the pre-match handshake might be one to keep an eye on and could provide an indication of how the rest of the game might unfold.\nForward Osmajic has 12 goals from 30 appearances in all competitions this season, including two in the FA Cup, while combative midfielder Hannibal has provided two assists in 28 games.\nOne or both players could be substitutes - 14 of Osmajic's 25 Championship appearances have been from the bench this season.\nAnd either manager could choose to leave out one of the players, potentially taking the sting out of the tie.\nAsked about the atmosphere and players keeping their cool on Saturday, Heckingbottom added: \"It is an FA Cup game and if it adds a bit of spice I welcome that totally. That is all it should add, we look forward to seeing what atmosphere that brings.\"\nTroy Townsend, the former head of player engagement at anti-discrimination charity Kick It Out, backed Parker's approach and said: \"Most importantly it is about how Hannibal is feeling, how he wants to approach the game.\n\"Fans are tribal. This is an accusation against the player at their football club... of course I expect comments.\n\"If those comments cross the line [then] I would expect the officials to be aware of this situation and take the appropriate action.\n\"The officials for the league game were lauded for the approach they took, for the manner in which they took the situation seriously.\n\"I'd imagine he'd be booed throughout the whole of the game, if he starts, touches the ball, if he comes on, he'd be warming up and down the touchline as a sub. So they need to be aware that he is a target, full stop.\"\nBurnley boss Parker was also asked if it was \"sad\" that the match had been overshadowed by talk of what happened in the previous game. He told BBC Sport: \"Of course it is, sometimes that is the way it is. A brilliant competition and one we are getting to the back end of.\n\"It is a live TV game at 12:15pm against our local rivals in the FA Cup, we shouldn't be discussing and I shouldn't be having to make decisions on an incident that took place.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvg14znd408o"}