{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:15:43", "date_modify": "2025-05-20 13:15:43", "date_publish": "2023-07-24 16:31:57", "description": "Glamorgan captain David Lloyd faces two vital Championship games against Derbyshire, the county he will join for 2024.", "filename": "sport_cricket_66293882_1747746943.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D516/production/_130505545_cdf_130523_cf_glamorgan_v_worcs_034.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66293882_1747746943.html", "title": "County Championship: David Lloyd leads Glamorgan against future employers Derbyshire", "title_page": "County Championship: David Lloyd leads Glamorgan against future employers Derbyshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan captain David Lloyd faces a double date against Derbyshire, the side he will join in 2024, as he tries to steer his current employers to promotion.\nThe vagaries of the fixture list mean the two counties are yet to meet this season.\nBut the two encounters against Division Two's bottom side could determine whether Glamorgan achieve promotion.\nThe first game starts on Tuesday at the Incora County Ground in Derby.\nThe two sides meet again in the County Championship in Cardiff on 26 September in the final round of games.\nDerbyshire captain Leus du Plooy is also moving, to Middlesex.\nWith former skipper Billy Godleman likely to leave, Lloyd will fill a major experience gap at Derby, while leaving a hole at Glamorgan after 12 years in the first-team squad.\nHe has cited a desire to be closer to family in Wrexham as his own young family expands.\nSo how does he see the dates of destiny the fixture list has thrown up, soon after the announcement of his move?\n\"Typical, but my focus is on Glamorgan and what we set out to achieve this year,\" Lloyd told BBC Sport Wales.\n\"People may not have much (in the way of) good things to say about me, but we go there with batters in good form and for the bowlers, we'll see what needs to be done for the team selection.\"\nLloyd believes there is potential at Derbyshire despite their struggles in 2023.\n\"They're quite a young team and they've got some really talented players coming through. It's hard for me to talk about them now, but it's a different challenge and one I'll be looking forward to next year.\" Lloyd said.\nGlamorgan coach Matthew Maynard believes his captain will be able to put aside this future move.\n\"It's a professional sport, David will be a Glamorgan player until the end of the season and he'll give his utmost for the club in that time,\" Maynard said.\n\"David will be very keen to get one over Derby as I will. They promised a lot, they may have disappointed a little bit with how they've gone but Mickey (Arthur) has got them scrapping hard and I fully respect everything he's doing.\"\nGlamorgan, who have only a one-day gap from their draw against Gloucestershire, are six points off the promotion places.\nThey are likely to recall seamer Jamie McIlroy after resting him at Cheltenham, with spinner Prem Sisodiya released from the squad to play 50-overs warm-up games, while Ben Morris and Rhodri Lewis have travelled as cover.\nDerbyshire are without batter Wayne Madsen and spinner Mark Watt because of World Cup T20 qualifiers for Italy and Scotland, while paceman Suranga Lakmal is not yet fit to return.\nDerbyshire (from): Ali, Reece, Came, Du Plooy (c), Guest, Wood, Wagstaff, Dal, Thomson, Chappell, Potts, Conners, Scrimshaw.", "url": "https://www.bbc.com/sport/cricket/66293882"}