{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:05:20", "date_modify": "2025-05-20 15:05:20", "date_publish": "2023-07-27 09:51:11", "description": "Leicester City podcast: Enzo Maresca, Conor Coady, Jamie Vardy", "filename": "sport_articles_cd1j49xw2y8o_1747753520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58de/live/9562b690-2c59-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1j49xw2y8o_1747753520.html", "title": "Leicester City podcast: Enzo Maresca, Conor Coady, Jamie Vardy", "title_page": "Leicester City podcast: Enzo Maresca, Conor Coady, Jamie Vardy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City boss Enzo Maresca has given an update on Conor Coady, who was absent from their pre-season trip to Thailand, on BBC Radio Leicester's When You're Smiling podcast: \"Unfortunately it's not good. We need to wait. He's one of the new players that, since day one, has been involved in the process. But unfortunately now he's not here with us. We'll have to see how long he'll be out.\n\"They are scanning and they are trying to understand. We will see, in the next few hours we'll see. I don't know yet.\"\nOn leaving Jamie Vardy out of the playing squad: \"Jamie is OK. He just had a very small problem against OH Leuven last Wednesday. He wasn't in the game [1-0 win against Port FC] but he was on the next pitch running and training, so it's OK. It was just a small problem and hopefully he can be with us in the next few days.\"\nOn whether he is looking to bring in more new players: \"We are close to the first official game so, like every club, we hope to have almost the final squad. But we know that is difficult because there's all of next month also. So, there are many players that can arrive, many players that can leave.\n\"The important thing is to have the squad close, as soon as possible, and to work with all of them for the whole season.\"\nOn whether the club is close to bringing in another player: \"Yes, I hope so.\"", "url": "https://www.bbc.com/sport/articles/cd1j49xw2y8o"}