{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:10", "date_modify": "2025-05-20 11:54:10", "date_publish": "2023-08-05 18:21:52", "description": "Newcastle 2-0 Fiorentina: Sandro Tonali exerts control", "filename": "sport_articles_cp37pd2myl7o_1747742050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/59be/live/cccded60-33bc-11ee-a4fc-9b3410c23a98.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp37pd2myl7o_1747742050.html", "title": "Newcastle 2-0 Fiorentina: Sandro Tonali exerts control", "title_page": "Newcastle 2-0 Fiorentina: Sandro Tonali exerts control  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry De Cosemo, BBC Sport at St James’ Park\nNewcastle United looked in control in the first of two pre-season games at St James’ Park, winning 2-0 against Fiorentina.\nMiguel Almiron and Alexander Isak scored in either half for Eddie Howe’s men, with a different XI gearing up to face Villarreal on Sunday.\nThat team will likely include Bruno Guimaraes but it was notable, thanks to home debutant Sandro Tonali, just how much control Newcastle had in midfield.\nThat bodes very well, given they lacked that whenever the Brazilian was absent last season.\nLewis Miley and Elliot Anderson, two academy graduates, continued their impressive pre-season performances, with the latter gunning to start against Aston Villa next week.\nAnthony Gordon looked much more comfortable in his position from the left, but behind him was where the only issue lay.\nWith his signing from Southampton imminent, Tino Livramento was watching from the stands, but his proficiency at right-back has led to suggestions of a need for left-sided reinforcements.\nMatt Targett was caught out a few times and, with Eddie Howe looking for more incomings before the window shuts, one wonders if they should now be prioritising another option in that position.", "url": "https://www.bbc.com/sport/articles/cp37pd2myl7o"}