{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:33", "date_modify": "2025-05-19 15:13:33", "date_publish": "2015-02-27 09:47:01", "description": "The International Cycling Union requests that Astana, the team of Vincenzo Nibali, has its World Tour licence withdrawn.", "filename": "sport_cycling_31657795_1747667613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81282000/jpg/_81282136_nib-getty2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_31657795_1747667613.html", "title": "Astana: UCI wants World Tour licence revoked", "title_page": "Astana: UCI wants World Tour licence revoked - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The International Cycling Union has requested that Astana, the team of Tour de France winner Vincenzo Nibali, has its World Tour licence withdrawn.\nIt follows an independent audit and places Nibali's future in limbo.\nThe audit was ordered by the UCI after a number of anti-doping infringements by Astana and its feeder team.\nThe UCI said the reality of the team's policies and structures differs from what Astana told the licence commission during a review last December.\n\"After careful review of this extensive report, the UCI strongly believes that it contains compelling grounds to refer the matter to the licence commission and request the Astana Pro Team licence be withdrawn,\" a UCI statement, external said.\nThe Kazakh team was considering its response to the announcement.\nNibali became the sixth man to win all three Grand Tours - the Tour de France, Giro d'Italia and Vuelta a Espana.\nThe 30-year-old became the first Italian winner of the Tour de France since Marco Pantani in 1998.\nAstana said it was aware of the audit results being passed to the commission and that it would \"consult with its attorneys to prepare documents and testimony\" while reserving the right to appeal any decision to the Court of Arbitration for Sport.\nBritish road and track racing Paralympic champion Dame Sarah Storey told BBC Radio 5 live: \"The UCI said at the time, when they were criticised for giving the licence, that it was a probationary period and ultimately they're sticking to their word.\n\"It may prove difficult to withdraw it but they are taking a firm stance on doping.\n\"They've obviously found things in their investigation that they don't like and that sends out a very strong message to the rest of the professional teams.\"", "url": "https://www.bbc.com/sport/cycling/31657795"}