{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:53:49", "date_modify": "2025-05-20 13:53:49", "date_publish": "2023-07-26 07:46:25", "description": "West Ham United hold talks over Scott McTominay as Manchester United name price while Rangers close in on Danilo deal.", "filename": "sport_football_66310177_1747749229.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/069B/production/_130519610_mctominaygossip.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66310177_1747749229.html", "title": "Scottish Gossip: McTominay, Mebude, Danilo, Wright, Kukharevych, Rubezic, Bonetig, Kuol", "title_page": "Scottish Gossip: McTominay, Mebude, Danilo, Wright, Kukharevych, Rubezic, Bonetig, Kuol - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham United have held initial talks with Manchester United about signing 26-year-old Scotland midfielder Scott McTominay along with England defender Harry Maguire. (Sky Sports), external\nManchester United will not accept any less than £40-£45m for Scott McTominay as manager Erik Ten Hag is keen to hold on to the Scotland midfielder. (The Telegraph), external\nWest Ham United have been put off by Manchester United's £40m valuation of Scotland midfielder Scott McTominay. (Mirror), external\nManchester City have received bids from AZ Alkmaar and Westerlo for Scotland Under-21 winger Adedire Mebude on a permanent transfer, with a decision due to be made within days and the Premier League club retaining a buy-back clause for the former Rangers 19-year-old. (Fabrizio Romano), external\nRangers have had an offer of around £5m plus add-ons accepted by Feyenoord for Brazilian striker Danilo and the 24-year-old is expected to arrive in Scotland within days to undergo a medical before putting pen to paper on a five-year deal worth £39,000-per-week. (AD), external\nThere is confusion over the future of Scott Wright with the 25-year-old winger having been spotted back in training with Rangers days after being interviewed on Sky Sports on his way to Turkey to complete an expected £500,000 transfer to Turkish top flight newcomers Pendikspor. (Daily Record), external\nWestern City Wanderers centre-half Alex Bonetig is on trial with Celtic after the 20-year-old impressed the club's scouting team while in the UK with Australia's youth team. (Scottish Sun), external\nHibernian have refused to rule out a return for Mykola Kukharevych, whose loan spell at Easter Road was disrupted by injury last season, after a swap deal that would have led to the 22-year-old midfielder leaving Troyes for Girona fell through. (Edinburgh Evening News), external\nAberdeen are waiting for the Home Office green light to complete the signing of Serbian centre-half Slobodan Rubezic from Novi Pazar, with the Premiership club confident they have fought off several European rivals to land the 23-year-old for a significant six-figure fee up front. (Press & Journal), external\nAberdeen manager Barry Robson has vowed to \"double up\" in every position with summer transfers ahead of the new season. (Press & Journal), external\nSt Johnstone manager Steven MacLean wants at least three more signings after his side failed to qualify from the group stage of the Viaplay Cup after Tuesday's defeat at home to Ayr United. (The Courier), external", "url": "https://www.bbc.com/sport/football/66310177"}