{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:58:03", "date_modify": "2025-04-26 07:58:03", "date_publish": "2025-02-25 12:00:59", "description": "Former Sunderland defender Danny Collins thinks Simon Moore might replace under-fire Anthony Patterson in goal.", "filename": "sport_football_articles_c8j08879m8ko_1745654283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a047/live/d7229f50-f36d-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8j08879m8ko_1745654283.html", "title": "Sunderland: Should Anthony Patterson be replaced as goalkeeper?", "title_page": "Sunderland: Should Anthony Patterson be replaced as goalkeeper? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Sunderland defender Danny Collins thinks Regis Le Bris has a decision to make about under-fire keeper Anthony Patterson.\nThe 24-year-old was criticised for his part in Leeds United's late winning goal last week before fumbling Joe Gelhardt's near-post corner into his own net against Hull City on Saturday to make it two successive defeats for Sunderland for the first time this season.\nCollins - who won the Championship with the Black Cats in 2005 and 2007 - told BBC Radio Newcastle that back-up Simon Moore might start against Sheffield Wednesday on Friday (20:00 GMT) should Le Bris opt to take Patterson \"out of the firing line\".\n\"The spotlight's on him, coming off the back of the goals Leeds scored, balls coming into the six-yard box. Teams are going to have a look at that now, I'm sure Hull looked at it,\" he said.\n\"It's a flat ball that's whipped near-post. He tries to collect it and gather it in, he gets a glove on it, it goes through his hands and drops into the back of the net. It looks horrible, it is horrible, and it's cost Sunderland points.\"\nMoore, 34, started four games in October and November, keeping three clean sheets, when Patterson was sidelined through injury, having kept six clean sheets himself in Sunderland's opening 11 Championship matches.\nCollins added: \"I feel for Patto, he's come in for a little bit of flak in recent weeks, hopefully he can bounce back from it.\n\"His position is possibly under threat - I listen to what the fans are saying. Simon Moore came in earlier in the season and did quite well. He's an experienced goalkeeper.\n\"(Le Bris) may well think I'll just take him out of the firing line. He is still a young keeper and he might feel 'I'll just give him a little break and bring (Moore) in'.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c8j08879m8ko"}