{"authors": ["Celestine Karoney", "www.facebook.com"], "date_download": "2025-05-21 05:33:43", "date_modify": "2025-05-21 05:33:43", "date_publish": "2025-04-02 16:07:44", "description": "Olympic 200m champion Letsile Tebogo says he could have turned to a life of crime in Botswana had it not been for sport.", "filename": "sport_olympics_articles_c24q5nlgnz5o_1747805623.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c843/live/5bd34030-0faf-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_olympics_articles_c24q5nlgnz5o_1747805623.html", "title": "Letsile Tebogo: Olympic 200m champion 'would probably be criminal' without sport", "title_page": "Letsile Tebogo: Olympic 200m champion 'would probably be criminal' without sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Raised by a single mother in a village in southern Botswana, sport provided Letsile Tebogo with a route out of rural hardship.\nWithout his passion for football and athletics – which ultimately brought him the men's Olympic 200m gold medal last August – the 21-year-old sprinter admits his life could have been very different.\n\"Without sport, I [would] probably be a criminal by now,\" Tebogo told BBC Sport Africa.\n\"In the neighbourhood that I was growing up in, there were a lot of criminals. We thought that was the only way to survive.\"\nSporting pursuits in Kanye, some 80km from the capital Gaborone, helped to give structure to Tebogo's days.\nFirst it was as a left winger on the football field, before he transitioned to track events in primary school.\n\"I knew I had to go from school [to] training, and you are tired. You don't have plenty of time to roam the streets, to go into people's houses,\" he said.\n\"Once I discovered that, I tried to pull in a few friends of mine.\n\"They are now playing football and we always talk about how if this [sport] didn't work out, where would we be?\n\"Sport has really helped me a lot.\"\nGiven his own childhood experiences, Tebogo is now on a mission to use the transformative power of sport to inspire the next generation in partnership with World Athletics.\nHe has been named as ambassador for the governing body's Kids' Athletics programme, which aims to encourage children to be more active.\n\"Athletics has given me so many opportunities, and I want young people to believe in themselves, dream big and enjoy the sport,\" he said.\n\"It's basically showing them direction, because if we have plenty of free time, we tend to do unlawful stuff.\n\"We start robbing, doing drugs and all that.\"\nTebogo's talents were well known across the continent before he clocked a new African record over 200m at Paris 2024, becoming Botswana's first ever Olympic gold medallist.\nWorld Athletics president Lord Sebastian Coe believes Tebogo's personal qualities are just as valuable as a role model.\n\"When a talent like Letsile emerges, it shows other young talented athletes the pathway,\" Lord Coe said.\n\"Letsile is confident, determined and humble, and is already inspiring a whole generation of potential athletes and children.\"\nTebogo was back at one of his old training grounds, Mma Masire Grounds, on Wednesday taking part in a relay challenge with over 1,000 children.\n\"I always pass here after training,\" he explained.\n\"I go to the flashbacks that I came from here and now I'm a global star.\n\"You just have to capitalise on the little you have and make sure you pursue your goals.\"\nLast year was a bittersweet one for Tebogo as his victory in the French capital came months after the death of his mother Seratiwa.\nHis Olympic exploits brought Botswana to a standstill, with a national holiday announced to celebrate his feat and tens of thousands of people greeting him on his return.\nTebogo also anchored Botswana to a 4x400m relay silver medal at the Games behind the United States and was named as a World Athlete of the Year., external\nThe sprint champion says life has not been the same since.\n\"The Olympic gold has opened a lot of doors for the team, because I can't do this alone,\" he said.\n\"I was happy to hear and see a lot of youngsters [are] now more interested in doing sports, not just athletics, but want to venture into something and become the face of that particular sport.\"\nAfter his 200m win in Paris, Tebogo said he could not become the face of athletics as he is not an \"arrogant and loud\" person like American sprint star Noah Lyles, who took bronze over 200m and 100m gold at the Games.\nHe has clarified those comments and says the pair now have a friendly relationship.\n\"When you get on to the track, it's all about business,\" Tebogo said.\n\"When we finish, we become friends and then life goes on.\n\"But the 'arrogance'... he's good to sell our sport because he knows what to do. But with me, I'll always shy away from doing that because that's me.\"\nTebogo has begun the new season running the 400m in a bid to build endurance ahead of September's World Athletics Championships in Tokyo, and has won one of his four outings over the longer distance.\nHe will now shift his focus to 200m, with his first competitive outing of 2025 set to come on home soil in a continental tour meeting in Gaborone this weekend.\n\"It means a lot to me,\" he said.\n\"They want to see what I did at the Olympics and the 200m final, which is something that we are planning to give out to my people out here.\"\nNext year, Botswana will become the first country in Africa to host a senior World Athletics track event when it stages the World Relay Championships.\nTebogo believes the competition will give young athletes a tangible example of what is possible.\n\"It will inspire a lot of kids,\" he said.\n\"Maybe they [are] going to see new faces during the 2026 World Relays because right now there are a lot of people who I can see putting in so much work to see themselves doing it on home soil.\"", "url": "https://www.bbc.com/sport/olympics/articles/c24q5nlgnz5o"}