{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:39:40", "date_modify": "2025-05-20 14:39:40", "date_publish": "2023-07-28 16:44:50", "description": "Nottingham Forest are yet to 'settle' into pre-season", "filename": "sport_articles_c1d73dk9d0eo_1747751980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23f9/live/397ecbc0-2d62-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1d73dk9d0eo_1747751980.html", "title": "Nottingham Forest are yet to 'settle' into pre-season", "title_page": "Nottingham Forest are yet to 'settle' into pre-season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Nottingham's Colin Fray has been discussing Forest's pre-season loss to Leeds United on the latest Shut Up And Show More Football podcast: \"It wasn't great, I've got to be honest. I struggle to remember a really good pre-season friendly. People tell me that Arsenal v Barcelona in the week was pretty good but it wasn't quite like that at Burton.\n\"I think you can hear from Steve Cooper, when he was talking specifically about the game, that he wasn't best pleased. He talks about having pride with the football and pride in possession. They certainly didn't look as if they had a lot of that.\n\"The ball was given away an awful lot. The ball was sent long an awful lot.\n\"But that's what pre-season is for, getting the bad performances out of the way, you hope.\"\nOn Forest's pre-season so far: \"It does all look a bit strange. At the moment it all looks a bit like last season did, where we had new players coming in all the way through and it never quite looked settled.\n\"I had hoped that wouldn't be the case this year, but with so many players being injured and only just coming back, and not much happening in the transfer window yet, it still feels a little bit that way.\n\"There are players we haven't seen all the way through pre-season, in much the way that we didn't see Morgan Gibbs-White all the way through pre-season last year because he hadn't even signed.\"", "url": "https://www.bbc.com/sport/articles/c1d73dk9d0eo"}