{"authors": ["Ben Miller", "www.facebook.com"], "date_download": "2025-05-20 12:04:43", "date_modify": "2025-05-20 12:04:43", "date_publish": "2023-08-05 11:49:42", "description": "Stoke City win at home for the first time since March as Andre Vidigal scores twice in victory over 10-man Rotherham United.", "filename": "sport_football_66345302_1747742683.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65DC/production/_130667062_gettyimages-1594159620.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345302_1747742683.html", "title": "Stoke City 4-1 Rotherham United: Andre Vidigal scores twice in opening win for Potters", "title_page": "Stoke City 4-1 Rotherham United: Andre Vidigal scores twice in opening win for Potters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ki-Jana Hoever's sumptuous volley, Andre Vidigal's brace in first-half added time and Jacob Brown's late tap-in gave new-look Stoke City their biggest win on the opening day of the season for 20 years with victory over 10-man Rotherham United.\nMidfielder Hoever launched his second loan spell at Stoke from Wolves in glorious fashion by firing Josh Laurent's left-wing cross beyond Viktor Johansson via the crossbar, but the hosts struggled to match their dominance of possession and succession of corners with attempts on goal during the first 45 minutes.\nJuly signing Vidigal struck twice in six additional minutes, pouncing on Ben Wilmot's header and lashing in the rebound from a Johansson save to send Stoke on their way to victory on the opening day for only the second time in 14 seasons.\nHalf-time substitute Lee Peltier poked in for Rotherham shortly after the restart to deny on-loan Bournemouth goalkeeper Mark Travers, one of six players making their full debuts for Stoke, a clean sheet.\nVidigal could have had a hat-trick before Brown converted at the far post in the 90th minute to give Wilmot a second assist.\nMidfielder Ben Pearson - a loanee from the Cherries last season before completing a permanent move in July - joined Hoever in beginning his second stint for Alex Neil's side, who appealed for a red card over a challenge by Sean Morrison on Ryan Mmaee shortly before Vidigal's first.\nDefender Morrison was operating as part of a Rotherham side deprived of new striker Andre Green through injury, while centre-back Grant Hall also missed out on making his bow as a permanent Millers player because of a tight hamstring as his side's four-match unbeaten run in their first games of each campaign came to a comprehensive end.\nMillers manager Matt Taylor faced further problems when Peltier had to be replaced 10 minutes after coming on and debutant Cafu was dismissed with 21 minutes remaining for a second yellow card following a foul on Mmaee.\nTaylor's squad stretched their barren run on the road without a win to 14 games, last prevailing on their travels on 8 November at Sheffield United - their only away victory last season aside from a win at Stoke in October.\nStoke secured their first home win since 10 March and league win since 1 April following a run of five defeats and two draws at the end of the 2022-23 season.\nThe Potters last started their campaign with a three-goal victory when they won at Derby County in the second tier in 2003-04.\nStoke manager Alex Neil told BBC Radio 5 Live:\n\"Everybody knew it was going to be a big game for us. We've done a lot in the transfer market and there are high expectations. Some of those players have only been in for the best part of a week. To perform as they did speaks volumes of their understanding and the qualities they bring.\n\"It was a really complete performance - we were really comfortable on the ball, created really good chances and, in the main, were strong in defence. We had a little lapse for the set play but for that many lads to play their first game and win 4-1 is a great achievement. We looked like an exciting side.\n\"It didn't merit all the bookings [eight alongside Cafu's two]. It wasn't a dirty game and both teams competed really well. I had to take Ben Pearson off to make sure he didn't get sent off, which shouldn't have to happen if it's being officiated in a level manner. We can balance the needle a bit more.\"\nRotherham manager Matt Taylor told BBC Radio Sheffield:\n\"We paid the price for a poor start to the game.\n\"We couldn't cover the space and then it transcended into a difficult first half. We weren't good enough in any department. We were too sluggish in our movements and our brightness around the action. We actually got a bit of control, then two goals in quick succession killed the game off regardless of what we did during the second half.\n\"It's my responsibility; they played through, round and over us too often. It would be wrong to point the finger at certain positions. Those half-time team talks are almost irrelevant because the game is pretty much gone.\n\"We asked for pride, a bit more character and personality - the simple side of the game, nothing complicated. We saw that for a brief period, got the goal and felt better about ourselves, but to go down to 10 men against a team like Stoke was pretty brutal to watch.\"", "url": "https://www.bbc.com/sport/football/66345302"}