{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 04:49:27", "date_modify": "2025-05-21 04:49:27", "date_publish": "2025-01-23 13:12:00", "description": "Andy Murray refuses to be drawn on whether he will continue coaching Novak Djokovic after the 24-time Grand Slam champion's Australian Open exit.", "filename": "sport_tennis_articles_c0rq1xkgl0no_1747802967.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12cd/live/e52773d0-da33-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c0rq1xkgl0no_1747802967.html", "title": "Australian Open 2025: Andy Murray and Novak Djokovic to 'cool off' before discussing coaching partnership", "title_page": "Australian Open 2025: Andy Murray and Novak Djokovic to 'cool off' before discussing coaching partnership - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andy Murray refused to be drawn on whether he will continue coaching Novak Djokovic after the 24-time Grand Slam champion's Australian Open exit.\nThe 37-year-old Briton has been working with his long-time playing rival on a trial basis in Melbourne.\nMurray, who retired in August last year, took a surprise coaching role with Djokovic's team in late November.\nAfter overcoming injury to beat Spanish third seed Carlos Alcaraz in the quarter-finals, Djokovic was forced to retire from his semi-final against German second seed Alexander Zverev on Friday.\n\"Novak and I agreed that after the tournament we would speak - and we will do that,\" Murray said afterwards.\nDjokovic said the pair would need to \"cool off\" before discussing the future.\n\"We are still hot-headed and disappointed, so it's kind of hard to switch the page and start talking about what the next steps are,\" said the 37-year-old Serb.\n\"We are both disappointed with what just happened, so we didn't talk about the future.\n\"I'll definitely have a chat with Andy and thank him for being here with me.\n\"I'll give him my feedback, which is positive, and see how he feels and we will make the next step.\"\nIt is no secret that Djokovic is a challenging guy when it comes to his pursuit of greatness.\nAfter winning a men's record 23rd Grand Slam title at the 2023 French Open, Djokovic admitted he had been \"torturing\" his team during the tournament.\n\"He's not an easy guy, let's put it this way - especially when something's not going his way,\" said then-coach Goran Ivanisevic, who joked Djokovic \"chained\" his team \"with handcuffs\".\nMurray said before the Australian Open started that the work had already been \"demanding\" - despite having only linked up for a 10-day practice block in Spain and a few days in Melbourne.\nHe also knew it would become more \"stressful\" during the tournament.\nAfter Djokovic's run ended in unfortunate circumstances, Murray said the experience had been \"a steep learning curve\".\n\"I've certainly learned a lot but there's a lot more still for me to learn, that's for sure,\" the Scot added.\nWhether it is providing detailed insight about an opponent or carrying his racquets to the stringer, Murray has had Djokovic's back in Melbourne.\nThe former world number one was even chasing down drop-shots at the end of practice sessions.\nOver the past fortnight, Murray showed he was willing to do whatever it takes to help Djokovic win a record 25th Grand Slam title.\n\"They're in this together,\" Murray's former coach Dani Vallverdu told BBC Sport.\n\"It's the feeling of the older guys against the younger guys - that's what's driving them.\"\nBorn a week apart in May 1987, Murray and Djokovic first became acquainted as 12-year-olds at junior tournaments.\nThe rivalry continued into the senior game as they met in 36 tour-level matches, including seven Grand Slam finals.\n\"Having someone in his box, and the locker room, who has been through it all on the opposite side of the court gives Novak a feeling of familiarity,\" said Vallverdu, who was part of Murray's team when he beat Djokovic to win Wimbledon in 2013.\n\"There is someone who understands him and has understood him from the other side of the court.\"\nMurray also knows Djokovic's potential opponents inside out.\nMurray had played everyone Djokovic faced from the third round onwards in Melbourne - Tomas Machac, Jiri Lehecka, Alcaraz and Zverev - in the past four years.\n\"I know what the speed of their serve is like, what the top-spin on their shots is like, and hopefully have a decent understanding of their strengths and weaknesses,\" Murray said.\nDuring Djokovic's victory over Alcaraz, former British number one Annabel Croft spotted the Serb going low down the middle during the rallies.\nAsked afterwards by a small group of British reporters about his tactical input, Murray grinned.\nHe refused to take the credit, insisting it was all Djokovic's own work.\nBut given his meticulous attention to detail, it would be a surprise if Murray isn't studying hours of video footage and combing through statistics.\n\"When Andy played he was one of the more data-driven players out there,\" said former Australian player John Millman, who is working as an analyst, external with host television broadcaster Channel Nine.\n\"He felt better going into a match with that wealth of information. I'm sure he's brought that into the Djokovic camp.\"\nDuring practices, Murray watched every movement intently from close quarters.\nAfterwards they usually shared a warm hug and sometimes had a gentle knock.\nThen it was back to collecting Djokovic's racquets and taking them to the stringer.\n\"When I saw Andy walking through the corridors with all Novak's racquets, taking them to the stringer, you could see he is taking this job very seriously,\" Australian former world number four Sam Stosur told Channel Nine.\nDjokovic's pre-tournament practice sessions against Alcaraz, Jack Draper and Arthur Fils offered more insight.\nStanding close behind Djokovic and sometimes in the doubles alley, Murray constantly offered feedback, shouted praise after winners and made notes.\nHe also compared observations with Boris Bosnjakovic, who ran Djokovic's training centre in Belgrade before becoming part of the team last May after long-term coach Ivanisevic left.\n\"The team has done an incredible job over many, many years to allow him to still be competing at this level at the age that he's at,\" said Murray.\n\"They've all been really, really helpful to me. They really welcomed me. It's been great to be a part of.\"", "url": "https://www.bbc.com/sport/tennis/articles/c0rq1xkgl0no"}