{"authors": ["Tim Dellor", "www.facebook.com"], "date_download": "2025-05-20 13:59:39", "date_modify": "2025-05-20 13:59:39", "date_publish": "2023-07-31 08:31:14", "description": "What can we expect from a troubled Reading side in League One this season? BBC Radio Berkshire’s Tim Dellor gives his analysis.", "filename": "sport_football_66328334_1747749579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10DAB/production/_130553096_gettyimages-1562883811.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66328334_1747749579.html", "title": "Tim Dellor column: Reading fans 'crying out' for a distraction to off the field issues in 2023-24", "title_page": "Tim Dellor column: Reading fans 'crying out' for a distraction to off the field issues in 2023-24 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the 152 summers of Reading FC's existence, this year's has been the most turbulent by some distance - what a mess!\nThe chaos stemming from the owner, Dai Yongge, for loyal supporters, hard-working staff, ambitious players and everyone connected to the club is incomprehensible.\nWhere should we start? Relegation to League One was avoidable.\nA six-point deduction after financial recklessness turned out to be the straw that broke the camel's back, but we mustn't lose sight of some inept performances on the field.\n\"We are where we are\", as managers like to say, so now it is all about the future. The issue continues to be the financial management, the owner's conduct and the ongoing turmoil.\nThe club seems to move in and out of transfer embargoes every week, slapped upon them by the English Football League, which is becoming increasingly exasperated.\nPolitics, and a waning enthusiasm, means Dai Yongge is unable to shift money across from China via Hong Kong and to the UK, as he could a few years back.\nEvery month payments stall, because money just isn't here in the UK to cover the expenses. Some months there is enough to pay players, but not the tax. Some months they can pay loan clubs for players, but can't cover other expenses.\nStaff at Reading are in the hideous position of having to helplessly wait for money to drop into the club's account, and then select which bills to pay and which must wait. That is no way to run a business.\nA change of owner is the obvious solution, but why would a man who has pumped more than £200m into the club over the last six years sell up? Nobody is going to pay anything like enough to take the club off his hands, without him incurring a massive loss.", "url": "https://www.bbc.com/sport/football/66328334"}