{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-05-21 05:15:55", "date_modify": "2025-05-21 05:15:55", "date_publish": "2025-01-14 19:54:32", "description": "Holstein Kiel boost their survival hopes, stunning Borussia Dortmund with three first-half goals in a brilliant Bundesliga win.", "filename": "sport_football_articles_cp82xez6m8no_1747804555.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/103b/live/eafdc810-d2a2-11ef-9108-d56750e10430.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp82xez6m8no_1747804555.html", "title": "Holstein Kiel 4-2 Borussia Dortmund: Hosts stun Dortmund in superb home win", "title_page": "Holstein Kiel 4-2 Borussia Dortmund: Hosts stun Dortmund in superb home win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holstein Kiel boosted their survival hopes as they stunned Borussia Dortmund with three first-half goals in a brilliant Bundesliga win at Holstein-Stadion.\nThe newly promoted side took the lead through a brilliant finish from Shuto Machino into the top corner after 27 minutes.\nPhil Harres then headed home from a wicked Lasse Rosenboom cross to create a two-goal lead, much to the delight of the home fans.\nJust before the break Harres turned provider to find Alexander Bernhardsson, who slotted in from close range.\nDortmund attempted to stage a late comeback, substitute Giovanni Reyna striking from the edge of the box with 20 minutes remaining and Jamie Gittens cutting inside to fire into the top corner.\nGoalkeeper Gregor Kobel came up for a corner deep into added time as the away side searched for an equaliser but Kiel got on the break as Fiete Arp raced clear and slotted the ball into the net from just inside the Dortmund half to seal a famous win.\nThe match was suspended just a minute into the second half after pyrotechnics were let off, to add to the foggy conditions, with the players having to leave the pitch while they waited for visibility to improve.\nSubstitute Lewis Holtby was shown a straight red card just 10 minutes after coming on to the pitch when he lunged at Felix Nmecha, with the home side forced to see out the remaining four minutes with 10 men.\nHolstein Kiel's victory moves them two points behind Heidenheim, who are in the relegation play-off position.\nMarcel Rapp's side are playing in the Bundesliga this season for the first time in their history and this is undoubtedly their best win so far.\nDortmund, who confirmed the departure of forward Donyell Malen to Aston Villa before kick-off, were soundly punished for a lacklustre display which leaves them ninth in the league.", "url": "https://www.bbc.com/sport/football/articles/cp82xez6m8no"}