{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:41", "date_modify": "2025-05-20 12:23:41", "date_publish": "2023-08-04 13:49:38", "description": "'It wasn't about finance, it was about being able to reshape the squad'", "filename": "sport_articles_crg21e8dr90o_1747743821.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4869/live/58eb3c80-32cd-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crg21e8dr90o_1747743821.html", "title": "'It wasn't about finance, it was about being able to reshape the squad'", "title_page": "'It wasn't about finance, it was about being able to reshape the squad' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Beale is grateful to the Rangers board for giving him the “freedom” to revamp the squad and says the club’s “net spend will be very small” by the close of the summer window.\nFashion Sakala is poised to join the flurry of departures – the Zambia striker is in talks with a Saudi Arabian club – while Jose Cifuentes has become the ninth new signing at Ibrox.\n“Fashion is talking to one of the Saudi clubs,” said Beale. \"He is a boy and a player that I have a fantastic relationship with but sometimes in football an opportunity comes up and you discuss it with the player and from there something can happen.\n\"As we stand now we are no further ahead in our wage structure than what we were.\n\"What we have been able to do is maybe re-energise the squad with motivation and quality. Our squad size will be slightly smaller and our budget will remain the same by the end of the window so I am really happy.\n\"We have recruited a strong squad with good balance and it is important that this team grows together and I am delighted with the support of everyone at the club because of the speed we moved at.\n\"I am extremely satisfied [with the board's backing]. I felt a lot of freedom in terms of being able to recruit the players. I think by the end of the window you will find our net spend will be very small.\n\"It wasn't about asking the board for finance, it was about being able to reshape the squad and I was able to do that.\"", "url": "https://www.bbc.com/sport/articles/crg21e8dr90o"}