{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:51:48", "date_modify": "2025-05-20 14:51:48", "date_publish": "2023-07-27 15:42:18", "description": "Larne and Newcastle United's Academy announce strategic partnership in youth development.", "filename": "sport_football_66328876_1747752708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17845/production/_130552369_leroy.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66328876_1747752708.html", "title": "Larne link up with Newcastle United youth academy", "title_page": "Larne link up with Newcastle United youth academy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Larne and Newcastle United's Academy have announced a strategic partnership in youth development.\nThe link between the Irish Premiership champions and EPL giants includes developing talent, coach development, scouting and recruitment.\nIt will facilitate the potential for young players to move between the clubs in either direction.\n\"We're excited to see what the future holds as we work together,\" said Larne owner Kenny Bruce.\nHe added: \"It is clear both Newcastle United and Larne are clubs moving in the right direction and we feel this affiliation will play a huge part in helping to grow that momentum.\n\"We have been involved in extremely positive discussions with Newcastle United for some time over a strategic working relationship, which we feel can be mutually beneficial.\nWomen's football is another key area for both clubs - Newcastle have become the first fully professional side in the FA Women's National League while Larne are now in the top tier of Northern Irish football after a number of promotions in the last five years.\n\"We are very pleased to be working alongside Larne Football Club as we develop and expand our talent pathway,\" said Dan Ashworth, sporting director at Newcastle United.\n\"I have been hugely impressed by Kenny Bruce and his team, and this will be a great opportunity to share best practice and innovations that will benefit both clubs.\n\"Our next generations of talent will only support and sustain both clubs' future successes and we look forward to supporting one another on our respective journeys.\"", "url": "https://www.bbc.com/sport/football/66328876"}