{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:18:03", "date_modify": "2025-05-19 15:18:03", "date_publish": "2017-07-07 00:00:00", "description": "Listen to live BBC local radio commentary from Friday's action in the Super League.", "filename": "sport_live_rugby-league_40450496_1747667883.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_rugby-league_40450496_1747667883.html", "title": "Friday's Super League", "title_page": "Friday's Super League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Team news\nWarrington Wolves v Leigh Centurions\nBen Westwood returns to the Warrington side for the first time since breaking a bone in his hand in May.\nTom Lineham and Declan Patton also return, while centre Ben Pomeroy is set to make his debut after arriving from Lezignan Sangliers in June.\nLeigh Centurions prop Jamie Acton misses out as he waits on the decision from a disciplinary hearing.\nCentre Ben Crooks is suspended for one game but hooker Mickey Higham and back-rower Samisoni Langi return.\nActon faces a minimum eight-game ban if found guilty of a Grade F offence of \"other contrary behaviour\" on Tuesday, 11 July.\nHe appeared to grab the shirt of Catalans Dragons' Greg Bird, lift him and push him back to the floor while he lay injured during the Centurions' 40-36 defeat last weekend.\nTeams news\nSt Helens v Hull FC\nSt Helens have included 20-year-old Danny Richardson in their squad to face Hull FC, replacing scrum-half Matty Smith, who has undergone eye surgery.\nMatty Lees comes in for suspended captain Jon Wilkin, while Mark Percival returns, but Jack Ashworth is out.\nHull FC have named the same 19-man squad selected for the narrow defeat at league leaders Castleford.\nCarlos Tuimavave, a late withdrawal last week because of a toe infection, is fit to play.", "url": "https://www.bbc.com/sport/live/rugby-league/40450496"}