{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:37:06", "date_modify": "2025-05-21 04:37:06", "date_publish": "2025-01-18 00:00:00", "description": "Arsenal have a late goal disallowed as they drop two points in the Premier League title race after throwing away a two-goal lead at home to Aston Villa.", "filename": "sport_football_live_c8edk17w448t_1747802226.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c8edk17w448t_1747802226.html", "title": "Arsenal 2-2 Aston Villa: Visitors fight back from two down to draw in Premier League", "title_page": "Arsenal 2-2 Aston Villa: Visitors fight back from two down to draw in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal had a late goal disallowed as they dropped two points in the Premier League title race after throwing away a two-goal lead at home to Aston Villa.\nKai Havertz thought he had found the winner with a minute left in normal time but the goal was disallowed after replays showed he handled Mikel Merino's shot.\nThe hosts had claimed a two-goal lead, with Gabriel Martinelli opening the scoring after taking advantage of some slack defending from Villa left-back Ian Maatsen to bundle home Leandro Trossard's cross.\nThe Belgian turned provider again for Arsenal's second, as Havertz netted his 13th goal of the season from the former Brighton winger's cross ten minutes after half-time.\nBut Villa staged a stunning comeback, halving the deficit through Youri Tielemans' header from Matty Cash's cross on the hour mark, and equalising eight minutes later with a volley by striker Ollie Watkins.\nThe result leaves Arsenal six points behind leaders Liverpool in the Premier League, having played a game more than Arne Slot's side.\nVilla move into seventh, two points shy of fourth-placed Newcastle in the final Champions League slot.\nWilliam Saliba missed the draw in north London through injury and manager Mikel Arteta said he fears Arsenal could be without the France defender in the coming weeks.\n\"Tomorrow we will have more information, but am I worried? Yes, for sure,\" said Arteta.\n\"Especially with the numbers that we have in the squad and looking at our bench.\"\nIt is the sort of day that will have Liverpool fans convinced this is their title to lose.\nFor an hour at Emirates Stadium it looked like Arsenal would produce a spirited response to Liverpool's last -gasp victory at Brentford earlier in the day.\nDarwin Nunez scored two stoppage-time goals in west London to put the Reds seven points clear at the top of the Premier League.\nLiverpool's late win could have been enough to burst Arsenal's bubble before kick-off, but they were deserving of their two-goal lead after an hour.\nWhat happened next - and the nature of it - was so unexpected it could have lasting implications on Arsenal's title bid.\nVilla had barely laid a glove on their hosts until Tielemans fired his header past David Raya with 60 minutes played.\nThe Belgian nearly equalised moments later, only to see his effort from the edge of the box cannon against the post.\nIf that was a warning for the Gunners, they did not heed it.\nThomas Partey, playing at right-back as Jurrien Timber covered for the injured Saliba in central defence, left Watkins unmarked at the back post - and the England striker made no mistake by volleying home an equaliser.\nIt was an eight-minute period that turned the game on its head, and left Arsenal stunned.\nThe Gunners looked short on ideas in search of a winner but thought they had found it when Merino's effort deflected past Villa goalkeeper Emiliano Martinez in the 89th minute.\nBut replays showed Havertz handled the ball, and it was chalked off following a video assistant referee (VAR) review.\nThe sense of agony around the Emirates at full-time was palpable.\nAt one stage this afternoon it looked like Arsenal would have the chance to reduce Liverpool's lead at the top. By the end of the day they were even further behind.\nVilla manager Unai Emery will likely be angered by the nature of the goals his side conceded.\nWhile Maatsen will take the blame for sleeping at the back post for Martinelli's opener, Trossard was given too much space to whip in his cross.\nArsenal's second also came via Trossard, with Villa once again giving the Belgian too much room to find Havertz in the middle.\nClearly, the goals forced Villa to play with more ambition.\nBut that intent was already there when Emery took off Maatsen for Lucas Digne at half-time.\nThe Frenchman provided the quality that had been missing for an hour when his cross found Tielemans, who headed home from close range.\nAfter scoring 27 goals in 53 games last season, Watkins' form has been below par this term and there has been growing frustration from supporters over the striker's 'big chance' misses.\nBut there are signs Watkins' form is returning, with the England forward making it three goals in his past five appearances.\nVilla's goal-rate from last season - when they averaged two goals per game in the Premier League - has slowed to 1.5 goals this term.\nWith a goal difference of -1 after 22 matches, it is clear Villa must improve in defence to clinch a Champions League place.\nBut the same must be said of their attack. For that, they need Watkins to keep up this form.", "url": "https://www.bbc.com/sport/football/live/c8edk17w448t"}