{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:14:51", "date_modify": "2025-05-21 07:14:51", "date_publish": "2025-01-22 11:46:51", "description": "Luke Williams says Swansea City must improve the Swansea.com Stadium's \"brutal pitch\" to help his team.", "filename": "sport_football_articles_c1m5ggr3mjzo_1747811691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94cb/live/e1bee900-d8b5-11ef-89b6-372b2b3acad8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1m5ggr3mjzo_1747811691.html", "title": "Swansea City must 'sort out allotment-like' pitch", "title_page": "Swansea City must 'sort out allotment-like' pitch - Luke Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams says Swansea City must improve the Swansea.com Stadium's \"brutal pitch\" because it is making it harder for his team to thrive in the Championship.\nThe playing surface cut up badly during Swansea's 2-1 home defeat by Sheffield United on Tuesday.\nIt is not the first time this season the turf has shown signs of wear and tear, and Williams believes the time has come for the club to take action.\n\"We need to sort that out - we can't go on with that,\" the Swansea head coach said.\n\"It was like walking across an allotment at the end of the game.\n\"That's got nothing to do with the ground staff, by the way. It's just the volume of traffic that the pitch has had on it with football and rugby. The climate has also been challenging.\"\nSwansea share their ground with rugby side Ospreys, as they have done since the Swansea.com Stadium - previously known as the Liberty Stadium - opened in 2005.\nThe surface has won various awards for its quality, most recently in 2019, the same year in which the Swans spent more than £500,000 on renewing the pitch at base level for the first time since the stadium was built.\nYet the surface had to be relaid midway through the 2020-21 season with the club indicating it had been hit by disease the previous autumn.", "url": "https://www.bbc.com/sport/football/articles/c1m5ggr3mjzo"}