{"authors": ["Dave Woods", "www.facebook.com"], "date_download": "2025-05-20 12:47:44", "date_modify": "2025-05-20 12:47:44", "date_publish": "2023-08-03 07:00:39", "description": "The Southern hemisphere will host the next Rugby League World Cup in 2026 after France withdrew for financial reasons.", "filename": "sport_rugby-league_66390816_1747745264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9544/production/_130621283_rugbyworldcupinengland.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66390816_1747745264.html", "title": "Rugby League World Cup: Southern hemisphere to host in 2026 after France withdrawal", "title_page": "Rugby League World Cup: Southern hemisphere to host in 2026 after France withdrawal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Rugby League World Cup will be held in the southern hemisphere in 2026.\nThe Ashes Test series has also been reinstated with England's men and women set to tour Australia in 2025.\nThose are two highlights of a new International Rugby League calendar that has been announced after a meeting in Singapore.\nSignificantly, the IRL say they have the backing of the NRL and the players' union in Australia, the RLPA, to guarantee a new era for the world game.\nThe next World Cup was due to be staged in France in 2025 but they withdrew after failing to get guaranteed backing from local and national government.\nNew Zealand signalled their intention to step into the breach by offering to host in 2025 instead.\nThe International Rugby League, the game's global governing body, now say they want to wait until 2026 to ensure the tournament has the best chance of success.\nThey say two potential hosts in the southern hemisphere have made bids.\nThey are likely to be New Zealand and Australia, with a combination of Pacific Nations involved. The IRL say they will not reveal the bidders yet, for commercial reasons, but will choose one of the options available by the end of the year.\nThe 2026 World Cup will feature a pared back men's tournament, comprising 10 teams. The quarter finalists from RLWC21 - Australia, Samoa, New Zealand, England, Tonga, Fiji, Lebanon, and Papua New Guinea - will qualify automatically.\nThe likes of France, Scotland, Wales, Ireland and Italy will have have to go through a yet-to-be-devised qualification process.\nThe women's and wheelchair competitions will have eight teams each.\n\"The IRL board has made these decisions to create more compelling content and secure the financial future of the international game,\" IRL Chair Troy Grant said.\n\"The cancellation of France 2025 has given us an opportunity to refresh the structure of the World Cup and associated tournaments as part of a long-term international calendar that all in the game have been desperately seeking.\"\nThe World Cup - men's and wheelchair - will work on a four year cycle going forward, with the following tournament held in 2030.\nFrom 2028 the women's World Cup will be a stand alone event to recognise the \"phenomenal rate of growth\" in the women's game. The first of those tournaments is likely to staged in the southern hemisphere as well.\nPlans for years outside the World Cup cycle include England's men and women to tour Australia in 2025.\nIt will be the first full Ashes series between an England or Great Britain side and Australia since the Kangaroos toured in 2003, when they secured a three-game whitewash against GB.\nNew Zealand will tour England in 2027 and the Kangaroos will return for a full series for the first time in a quarter of a century in 2028.\nThe international cycle begins this year when England entertain Tonga in the autumn, and World Cup finalists Samoa are likely tourists next year.\nThe IRL said it hoped to place greater emphasis on regional championships and World Cup qualifying tournaments for the Americas, Asia-Pacific, Europe and Middle East-Africa.\nPlans for a World Series format are also being developed.\n\"It is no secret that the Achilles heel for international rugby league for far too long has been the absence of an international calendar,\" Grant said.\n\"The ad hoc nature of tournaments and international matches, and the absence of any clarity for nations, players and fans to plan their seasons, is over.\"", "url": "https://www.bbc.com/sport/rugby-league/66390816"}