{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:23:30", "date_modify": "2025-05-21 07:23:30", "date_publish": "2025-05-20 06:30:41", "description": "Liverpool news: Arne Slot - 'A great game of football but not result we wanted'", "filename": "sport_football_articles_czx00g100r2o_1747812210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b887/live/a533c600-3543-11f0-b0a8-0d69e851e1e1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx00g100r2o_1747812210.html", "title": "Liverpool news: Arne Slot", "title_page": "Liverpool news: Arne Slot - 'A great game of football but not result we wanted' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool boss Arne Slot, speaking to BBC Match of the Day: \"Two very good teams wanting to play football with no time wasting and no diving. Momentum changed in the game and I waited for us to score the third, as that would have killed the game, but they made it 2-2.\n\"It was a great game of football but not the result we wanted.\n\"These moments at this level do make a difference. Just before that miss Mohamed Salah gave a similar chance to Federico [Chiesa] and it was very well blocked. We played eighth in the Premier League and they were able to bring on Karou Mitoma. That shows you about the strength of this league.\n\"If you don't score the third one then it's hard to win a game at this level, especially away from home. We cannot miss chances like we did if you want to win the game.\"\nOn fringe players getting their chance to play: \"They have played their part in certain games and played their part on the training ground. They deserve playing time. Many of them have to go to the national team so it's important for them to have their playing time and that's why we've rotated a bit. That's not why we've dropped points to Chelsea and Brighton because they are good teams.\"\nDid you know?", "url": "https://www.bbc.com/sport/football/articles/czx00g100r2o"}