{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:28", "date_modify": "2025-05-21 07:38:28", "date_publish": "2025-03-28 12:12:50", "description": "New deal at 'magnificent' Ross County 'felt right' for Jordan Amissah", "filename": "sport_articles_cjd37pl9x1go_1747813108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/572d/live/e9fc0320-0b03-11f0-bc4a-91a0d2ae40b4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cjd37pl9x1go_1747813108.html", "title": "New deal at 'magnificent' Ross County 'felt right' for Jordan Amissah", "title_page": "New deal at 'magnificent' Ross County 'felt right' for Jordan Amissah - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County goalkeeper Jordan Amissah says it \"felt right\" to extend his stay at the club.\nThe 23-year-old's contract extension will run until the summer of 2027 and he has hailed the club as a \"magnificent\" place to play.\nGerman-born Ghanaian Amissah, who has kept four clean sheets in 13 appearances since joining on an initial short-term deal in December, said: \"It's been quite a good time really ever since coming up.\n\"I've enjoyed my time here so far and it just felt right to extend my stay.\n\"I'm a big people person so it's for me being on the pitch, things have to go well obviously to get settled in. But it's the people around the club, especially the kind of club Ross County is [with] a lot of people making this club work and the staff, the boys in the changing room, we've got a very, very good group.\n\"The boys made me feel welcome from the get-go. Obviously I knew Kacper [Lopata] from my time at Sheffield United with him so it made it really easy. It's just been magnificent really, it's just been so easy and obviously playing as well, it's been a big help.\"\nThe Staggies are four points clear of the relegation play-off spot and four adrift of sixth place, and Amissah is looking forward to playing Dundee United on Sunday as it is the only side he is yet to face in the top flight.\n\"We've been taking it pretty much game to game, there's no point looking to much ahead and thinking if we do this and this and this and then this can happen,\" he added.\n\"I think it's the only team I've not been involved in a game against yet.\n\"Following Scottish football, you know Dundee United, it's a big club, so it's going to be an exciting occasion and I'm really looking forward to it.\"", "url": "https://www.bbc.com/sport/articles/cjd37pl9x1go"}