{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-19 15:32:20", "date_modify": "2025-05-19 15:32:20", "date_publish": "2017-07-03 17:58:24", "description": "Twenty-five wickets fall on day one as Glamorgan build a second-innings lead of just 35 against Gloucestershire in the County Championship.", "filename": "sport_cricket_40455890_1747668740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15F35/production/_96790998_norwell.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40455890_1747668740.html", "title": "Gloucestershire v Glamorgan: 25 wickets fall on day one at Cheltenham", "title_page": "Gloucestershire v Glamorgan: 25 wickets fall on day one at Cheltenham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan finished an extraordinary day one on 59-5 in their second innings, 35 runs ahead of Gloucestershire, after 25 wickets crashed at Cheltenham.\nThey collapsed for a second time against Liam Norwell (3-14) having ended the first innings 24 runs behind.\nAneurin Donald's 39 was the top score in Glamorgan's first-innings 117, with David Payne claiming 3-37.\nGloucestershire struggled to 141, with three apiece for Marchant de Lange, Timm van der Gugten and Michael Hogan.\nThe pitch showed inconsistent bounce, with several wickets falling to deliveries from the Chapel end which kept low, while most batsmen struggled to time the ball.\nBut it could not account for the extent of the seamers' complete dominance all day, with eight wickets in the first session, nine in the second and eight in the third.\nKieran Noema-Barnett (34) played a key role in getting Gloucestershire into the lead and also claimed important wickets in both innings to leave the home side favourites for a two-day victory.\nGloucestershire coach Richard Dawson told BBC Radio Bristol:\n\"We've just chatted about the pitch and we're not putting any blame on that, that's not the question mark.\n\"We know it's a fast-moving game at Cheltenham and we've chatted about whether (in our innings) we played what happened in the first (Glamorgan) innings, rather than what was in front of us.\n\"But we come back in a position where the last hour of bowling has helped us out, and the lead that Kieran (Noema-Barnett), Craig (Miles) and David Payne got us has helped as well.\"\nGlamorgan bowler Timm van der Gugten told BBC Wales Sport:\n\"it was an interesting day, I don't think I've been involved in one quite like that before, but wickets seemed to fall consistently and it didn't seem to stop.\n\"It was one of those wickets where you didn't feel you were ever in, hopefully we can put on a bit of a partnership with Salts (Andrew Salter) and I, and get a bit of a lead., then we've still got some recognised batters in Chris Cooke and Graham Wagg.\n\"It's actually a nice-looking wicket, it's a strange one where one might nip back or bounce a bit more, or stay a little low, it's got a bit of everything in it.\"", "url": "https://www.bbc.com/sport/cricket/40455890"}