{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:39", "date_modify": "2025-05-21 07:24:39", "date_publish": "2025-03-28 15:10:59", "description": "Celtic goalkeeper Kasper Schmeichel is set for a spell on the sidelines after injuring his shoulder on international duty, boss Brendan Rodgers confirms.", "filename": "sport_football_articles_c1jpjp5506xo_1747812279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de93/live/4151a6c0-0bbd-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1jpjp5506xo_1747812279.html", "title": "Celtic: Brendan Rodgers waits for news on 'top-class' Schmeichel injury", "title_page": "Celtic: Brendan Rodgers waits for news on 'top-class' Schmeichel injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic goalkeeper Kasper Schmeichel is set for a spell on the sidelines after injuring his shoulder on international duty, boss Brendan Rodgers has confirmed.\nThe 38-year-old picked up the knock during Denmark's Nations League quarter-final second-leg loss in Portugal, but Rodgers is unsure of the extent of the injury.\nThe Danish captain, who has 81 caps, played on in Sunday's 5-2 loss which meant the Portuguese progressed 5-3 on aggregate.\nAsked if Schmeichel's season could be over, Rodgers replied: \"Don't know. We don't know how long he'll be out.\n\"We're still waiting to hear on that. He's obviously got some issues with his shoulder.\"\nSchmeichel's display in Portugal, which included saving a Cristiano Ronaldo penalty, attracted flak over his fitness in the Danish media, some of which led to complaints from the country's players' union.\n\"All I know is the reason I brought him here, knowing him so well, is because he's still a top-class keeper,\" said Rodgers.\n\"If you look at his performance level for us over the course of the season, he's been absolutely brilliant. In big games, he's made big performances. And for me, he still has that hunger and that desire to play.\n\"When criticism comes as a coach, manager, player, sometimes it's not civil. Sometimes, it's personal, sadly.\n\"But I know his character and mentality, and I know how determined he'll be to come back.\"", "url": "https://www.bbc.com/sport/football/articles/c1jpjp5506xo"}