{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:35:38", "date_modify": "2025-04-26 03:35:38", "date_publish": "2025-03-08 00:00:00", "description": "Ollie Watkins settles a hard-fought encounter against his former club Brentford as Aston Villa boost their hopes of a top-four Premier League finish.", "filename": "sport_football_live_cvgpdggz0e0t_1745638538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e47c/live/3f1e6890-fc52-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cvgpdggz0e0t_1745638538.html", "title": "Brentford 0-1 Aston Villa: Ollie Watkson nets winner against old club", "title_page": "Brentford 0-1 Aston Villa: Ollie Watkson nets winner against old club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ollie Watkins settled a hard-fought encounter against his old club Brentford as Aston Villa boosted their hopes of a top-four Premier League finish.\nThe 49th-minute winner moved the visitors up three places to seventh in the table and they are now just two points adrift of fourth-placed Manchester City, although Unai Emery's side have played a game more.\nA largely uninspiring contest was sparked into life by Watkins when he raced on to Jacob Ramsey's pass down the left and cut inside to drive a low effort that flicked off Nathan Collins and past home goalkeeper Mark Flekken.\nThe England forward, who spent three years with the Bees, almost turned provider just over a minute later.\nAgain he found space down the left channel as he teed up Morgan Rogers to dispatch another effort past Flekken, only for it to be disallowed after a video assistant referee (VAR) review found Watkins had just strayed offside.\nKeane Lewis-Potter struck the bottom of the right-hand post as Brentford went in search of an equaliser.\nHowever, with on-loan Chelsea defender Axel Disasi, particularly impressive in defence, Villa held firm to record their first league double over Brentford since 1947 and drop Thomas Frank's team from 11th to 12th place.\nVilla took a massive step towards the quarter-finals of the Champions League with their 3-1 victory at Club Brugge in midweek.\nHowever, with a number of heavyweights still in the competition and the prospect of a last-eight tie against Liverpool or Paris St-Germain – should they advance past the Belgians - this represented crucial progress domestically.\nVilla's post-Champions League struggles have been well documented this term.\nPrior to this fixture they had failed to win their previous seven matches played immediately after a European game, collecting just three points in the process.\nSo this was a very welcome end to that dismal run.\nAnd that they managed it without their influential goalkeeper Emiliano Martinez and forward Marco Asensio, while fielding nine of the side that started at Brugge, was all the more impressive.\nWatkins maintained his fine form in front of goal against the side he represented well until 2020 with his sixth goal in six games against Brentford - and 14th of the this season.\nWhile further back down the pitch Disasi celebrated several key tackles exuberantly to suggest he has fully bought into life with the Midlands club in just over a month.\nHowever, it proved a disappointing evening for Brentford, who delivered a rare flat display on home soil.\nWhile they applied some late pressure, boss Frank will likely be unhappy with what his team served up and their lack of chances.\nBrentford appeared too passive for long periods and Villa's winner arrived when Watkins was allowed to run unopposed into their penalty area by Collins, who was then stationary as the ball clipped off him and into the back of his own goal. Keeper Flekken might well feel he could have done better too.", "url": "https://www.bbc.co.uk/sport/football/live/cvgpdggz0e0t"}