{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:23:10", "date_modify": "2025-05-21 04:23:10", "date_publish": "2025-01-05 19:04:45", "description": "Liverpool 2-2 Man Utd: What Bruno Fernandes said", "filename": "sport_football_articles_czr3d418jppo_1747801390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a356/live/85bd2340-cb97-11ef-b5cd-c347d92cca11.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czr3d418jppo_1747801390.html", "title": "Liverpool 2-2 Man Utd: What Bruno Fernandes said", "title_page": "Liverpool 2-2 Man Utd: What Bruno Fernandes said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United captain Bruno Fernandes has been talking to Sky Sports following the draw: \"We have been criticised, and fairly. Our position in the table says it all, we have lost too many points. Even today we can't be happy with a point. We need the points and we could have won the game at the end, but it's a fair result. Both teams played good football.\n\"I'm pretty upset. If we show this level at Liverpool, first in the league, why can't we do this everywhere? It frustrates me.\n\"Also, finally I did a proper performance. We said we need much more from ourselves to get more from this season. Being 2-1 [down] then scoring, it is good to get a point but we need more.\n\"Now we have an FA Cup tie at Arsenal and it is going to be very tough but we want to get to the final again.\n\"We know how tough it is to play against Liverpool. We put in a real effort, playing with some passion and heart is what is going to give you something from the game. You have to put in effort and that's why we took something from today.\n\"It can't stop here. We have to bring this frustration to the next game to understand that this has to be the level. If we can do it an Anfield, we have to do it everywhere.\"", "url": "https://www.bbc.com/sport/football/articles/czr3d418jppo"}