{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:36:16", "date_modify": "2025-05-21 04:36:16", "date_publish": "2025-01-18 00:00:00", "description": "Veteran winger Matt Ritchie scores twice as Portsmouth come from behind to beat play-off chasing Middlesbrough.", "filename": "sport_football_live_cq6gl8y2gp9t_1747802176.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cq6gl8y2gp9t_1747802176.html", "title": "Portsmouth 2-1 Middlesbrough: Matt Ritchie double gives Pompey vital win", "title_page": "Portsmouth 2-1 Middlesbrough: Matt Ritchie double gives Pompey vital win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matt Ritchie scored twice as Portsmouth came from behind to beat play-off chasing Middlesbrough and secure a crucial three points in their battle to avoid relegation from the Championship.\nThe match at Fratton Park was delayed by 35 minutes to deal with a medical emergency involving a spectator in the crowd, who Portsmouth later announced had sadly passed away.\nBoro striker Emmanuel Latte Lath, the subject of interest from Major League Soccer side Atlanta United, put the visitors ahead.\nBut Ritchie, 35, was the main man as he levelled nine minutes into the second half before grabbing a late winner for his first-ever Pompey goals at Fratton Park.\nThe win moved John Mousinho's team up one place, to 22nd, but only outside the bottom three on goal difference, with a game in hand.\nIt was a costly afternoon for Boro as they suffered a first defeat in seven games and slipped out of the top six.\nAlmost as soon as referee Gavin Ward had blown his whistle to start the game it had to be stopped to treat the supporter, with kick-off delayed until 15:35 GMT.\nWhen the game did get under way, Latte Lath immediately tested keeper Nicolas Schmid, who pushed behind the Ivory Coast striker's volley.\nCallum Lang headed straight at Boro keeper Tom Glover and Freddie Potts dragged a shot wide as Pompey threatened, before Latte Lath showed why he is a man in demand.\nDelano Burgzorg slipped him through and he rounded Schmid before rolling in his 11th goal of the season.\nBut Pompey levelled when Potts played in Ritchie, who beat Glover.\nRoared on by the home crowd, they went looking for a winner.\nJosh Murphy shot wide with one chance for Pompey before Ritchie struck again, scoring with a right-footed effort which hit the far post on its way in.\nIt sealed a third straight home victory and will give Mousinho's side real belief that they can secure a second season of Championship football.\nAlthough it was only a first league loss since 10 December, the feeling persists that Boro, who have played out several draws in that time, are having a winter wobble.\nPortsmouth manager John Mousinho told BBC Radio Solent:\n\"I think it's one of our best wins of the season, with all the circumstances and the fact I think Middlesbrough are one of the best sides in the league. We've watched them tear sides apart.\n\"Going 1-0 down and dealing with the hammer blow of Wednesday night [a 3-0 loss to Blackburn], to pick ourselves up and put in that level of performance was superb.\n\"I thought it was a really good game of football and one that, on balance, we deserved to win.\"\nMiddlesbrough head coach Michael Carrick told BBC Radio Tees:\n\"We let the game get away from us again. It's something we've let happen far too often recently.\n\"Coming here, how they play and how they make the game feel, I thought we dealt with it first half and the start of the second half, we had chances to go 2-0 up which we didn't take and the game's always on a knife edge.\n\"We spoke about concentration and how the game can flip in one moment, and their first goal had a massive effect on things.\n\"So we're hurting about coming away with nothing after the position we put ourselves in.\"", "url": "https://www.bbc.com/sport/football/live/cq6gl8y2gp9t"}