{"authors": ["Tino", "www.facebook.com"], "date_download": "2025-05-21 07:42:47", "date_modify": "2025-05-21 07:42:47", "date_publish": "2025-05-20 13:28:45", "description": "Celtic fan voice: 'Why it's time to act on new deals for Rodgers & Forrest'", "filename": "sport_articles_ckgrr1kvvnwo_1747813367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/07ec/live/3dfe1050-357d-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgrr1kvvnwo_1747813367.html", "title": "'Why it's time to act on new deals for Rodgers & Forrest'", "title_page": "Celtic fan voice: 'Why it's time to act on new deals for Rodgers & Forrest' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For over a decade, Celtic have ruled Scottish football. Trophy after trophy, season after season - and at the heart of it all, two men stand tall.\nBrendan Rodgers and James Forrest. The club's most successful modern-day manager and its most decorated player.\nIf Celtic lift the Scottish Cup this weekend it will mark Rodgers' 12th and Forrest's 27th major honour - milestones that further etch their names into club legend.\nBut with both men entering the final year of their contracts, the question now is: how much longer will they grace the east end of Glasgow?\nRodgers has said he is \"200%\" committed to being at Celtic next season. Forrest looks fitter, hungrier and sharper than ever, even as he approaches 34.\nBut beyond the 2025-26 campaign? That's uncertain - and Celtic can't afford to leave it to chance. It's time to act.\nWhether it's Michael Nicholson, Dermot Desmond or anyone else calling the shots, securing new deals for both is non-negotiable.\nRodgers has brought stability, vision and silverware. Forrest - a one-club man - continues to deliver, driven by unseen hours of graft long after the final whistle has blown.\nTheir personalities couldn't be more different. Rodgers, composed and commanding; Forrest, quiet and unassuming. But their impact? Equally vital.\nCeltic fans will be hoping the season ends not just with silverware, but with the announcement of two contract extensions in the weeks ahead.\nIf so, it might just be the most important business the club does all summer.", "url": "https://www.bbc.com/sport/articles/ckgrr1kvvnwo"}