{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:38:56", "date_modify": "2025-04-26 06:38:56", "date_publish": "2025-03-02 16:59:30", "description": "Derry boss Paddy Talley says that his side are \"definitely behind\" Donegal after Jim McGuinness' side came from behind to win 1-22 to 1-19 in Ballyshannon.", "filename": "sport_articles_cddy29800n0o_1745649536.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c21/live/def6e180-f784-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cddy29800n0o_1745649536.html", "title": "Donegal 1-22 Derry 1-19: Development of squad 'bigger picture' for Talley", "title_page": "Donegal 1-22 Derry 1-19: Development of squad 'bigger picture' for Talley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derry boss Paddy Tally says that his side are \"definitely behind\" Donegal after Jim McGuinness' side came from behind to win 1-22 to 1-19 in Ballyshannon.\nDerry established an eight-point lead with 15 minutes remaining but that was wiped out as Donegal hit an unanswered 1-6.\nIt was a fourth defeat in five games for Derry, who are bottom of Division One with just one point and Talley admits there is plenty of work to be done before they meet Donegal again in their Ulster Championship opener in April.\n\"We're definitely behind Donegal, they have had vast amount of work done and they've been at it for a long time compared to us,\" he told BBC Sport NI.\n\"We're playing catch up, that's not an excuse though, there was a game to be won today.\"\nTally was pleased with his side's performance after their disappointing display in the defeat against Dublin at Croke Park last weekend, but was left frustrated they couldn't hold on for at least a point.\n\"I'm disappointed we didn't get the result, but I'm very pleased with the way the boys played,\" he added.\n\"Last week, we didn't play well, and we were all over the place. Today we looked much more like a team we could have got something out of it, but we didn't.\n\"I can't complain with the players' effort, but Donegal just got a march on us at the end of the game.\"\nDerry have two must-win games left against Mayo and Armagh as they bid to avoid the drop.\nTally doesn't believe that relegation would be disastrous in the long run, admitting he is focusing on having his team in prime condition for the preliminary round of the championship.\n\"We need other results to go our way, and we just have to keep going, staying in Division One would be fantastic, but the bigger picture is the development of the squad and we have to get the squad ready for championship.\"", "url": "https://www.bbc.co.uk/sport/articles/cddy29800n0o"}