{"authors": ["Fernando Duarte", "www.facebook.com"], "date_download": "2025-05-19 14:41:34", "date_modify": "2025-05-19 14:41:34", "date_publish": "2017-08-05 13:20:04", "description": "From struggling to put food on the table to negotiating the world record transfer - meet Neymar Sr, the man behind his son's £200m move to PSG.", "filename": "sport_football_40827185_1747665694.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BEDC/production/_97206884_neymar_neymar_sr_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40827185_1747665694.html", "title": "Neymar Sr: Meet the man behind Brazil forward's PSG deal", "title_page": "Neymar Sr: Meet the man behind Brazil forward's PSG deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The rush among Brazilian journalists did not go unnoticed by the locals attending a national team training session in Wroclaw, Poland in the autumn of 2012.\nBrazil were to face Japan in a friendly the following day and the reporters had all converged towards a middle-aged man, dressed in skinny jeans and a leather jacket, who had just taken a place at the stands.\nA Polish TV reporter asked: \"Who is that ex-footballer?\"\n\"That's no ex-footballer. He is a much richer guy,\" joked a member of the visiting media.\nThat man was Neymar Sr, supposedly merely watching his son take part in drills and exercises on the pitch, but in reality milking the buzz generated by the transfer talk around a player fiercely fought for by both Real Madrid and Barcelona.\n\"So, which club are you guys saying my son will be playing for this week,\" he quipped with a sarcastic smile.\nNeymar's father may also have been a professional footballer - but nothing he ever did on the pitch can compare to his work as the main adviser and influencer in Paris St-Germain's world record 222m euros (£200m) signing of the 25-year-old Brazil forward. And his dealings - often controversial - started many years ago.\nWhen Neymar Jr was born on 5 February 1992, his father's dreams of a career in football were a memory. Instead, he was trying to make a living in low-paid jobs in Mogi das Cruzes, a lower working-class district in Greater Sao Paulo.\nStruggling to put food on the table, Neymar Sr was forced to move his family - which also included daughter Rafaella - into a single room in his mother's house in the seaside town Sao Vicente, close to the more famous Santos - which lends its name to the local club who gave Pele to the world.\nOne of the few luxuries the family could afford was the fee to join Tumiaru, a humble social club where little Neymar would spend hours kicking a futsal ball around.\nSoon another working-class club, Gremetal, had spotted the boy and recruited him. At the age of 10, he was already playing against older kids at a place where Santos steelworkers and their families would wind down and making them look like fools.\nWord about this phenomenon started to spread and Portuguesa Santista, a feeder club in Santos, came knocking. That was when Neymar Sr demanded the club provided educational support for his son.\nIn the 1990s, one in five Brazilians over the age of 15 was illiterate, and even now the vast majority of footballers only studied to primary school level - according to the Brazilian Football Confederation.\nNeymar Sr was preparing himself for the eventuality that his son might not make it, or would end up playing at a low level like the majority of professional players in Brazil, where more than 80% earn less than the national average monthly income of £421.\nHis demands were met. Neymar Jr was granted a full scholarship to Liceu Sao Paulo, one of Santos' finest private schools.\nWhen the kid started shining in student sporting events, rival schools complained that he was merely being used to win games rather than gain an education. But they did not know Neymar Sr.\nUnlike many of his underprivileged neighbours, Neymar rarely bunked off school. His kickabouts were actually training sessions and games for Portuguesa. His father would make sure the boy toed the line as he was aware how the son could change the family's fortunes. The chance came sooner rather than later.\nIn 2005, Real Madrid were negotiating with Santos FC over Robinho - then the hottest property in Brazilian football - when the agent involved in the deal \"casually\" mentioned another prospect.\nLegend has it that Wagner Ribeiro told Real about the 13-year-old Neymar, who was earning little more than £100 in Santos' youth academy.\nA trial in Madrid soon followed, along with the offer of a house and jobs for both of Neymar's parents, but his father instead negotiated a hefty pay rise with Santos - £250,000 to stay and a monthly pay cheque of £5,000.\n\"The kid's father was already fierce in negotiations at that time. He was like a tractor,\" recalls a Santos director.\nThose earnings grew exponentially as Neymar reached the senior squad in 2009, but his father's modus operandi did not change.\nThe family were installed in a luxury apartment, and Neymar was permitted perks such as a credit card and a hefty allowance in the region of £2,500 a month.\nBut he had to earn extra indulgences - earrings and fancy clothes were subject to performances on the pitch.\nIn 2010, when Brazilian fans and media were already putting pressure on national team coach Dunga to take the boy to the World Cup in South Africa, Neymar wanted a car as an 18th birthday present. He got one, but only after reaching the target established by his father of winning the Under-20 South American Championships with Brazil and scoring at least twice in the final game.\n\"Just because we can afford things now, I will not simply allow him to burn his money,\" said Neymar Sr. \"He needs to learn the value of things.\"\nThat statement would come back to haunt Neymar Sr when details of his son's 2013 transfer to Barcelona emerged.\nAs well as documents showing Papa Neymar had conducted secret negotiations with the Catalan club that excluded Santos FC, he had also received an undeclared compensation payment of £33m to ensure the player joined Barca as well as £2m in agents fees.\nBoth Neymars are under investigation by the Spanish authorities and face accusations of tax evasion by the Brazilian Inland Revenue. Both have consistently denied any wrongdoing.\nThe media in both countries started describing Neymar Sr as a shady operator, especially after news that his dealings had expanded into working for Barcelona as a consultant for other signings.\nBut one thing has not changed - the kid worships his dad and tells the world about it via social media.\nHe does the job he is paid for. Despite stating publicly that he tried to persuade the player to stay at Barcelona, Neymar Sr followed his son's wishes by arranging the move to Paris and making sure both made a hefty profit as well.\nIs that not the job of a father/agent?", "url": "https://www.bbc.com/sport/football/40827185"}