{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 04:33:33", "date_modify": "2025-05-21 04:33:33", "date_publish": "2025-04-04 20:34:21", "description": "England defender Kyle Walker says he \"wanted to cry\" the day he joined AC Milan on loan from Manchester City.", "filename": "sport_football_articles_cpdzn6e4z4jo_1747802013.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/54f6/live/9445dfb0-1192-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdzn6e4z4jo_1747802013.html", "title": "Kyle Walker: Man City defender 'wanted to cry' after AC Milan loan move", "title_page": "Kyle Walker: Man City defender 'wanted to cry' after AC Milan loan move - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kyle Walker says he \"wanted to cry\" the day he left Manchester City to join AC Milan on loan.\nWalker moved to Milan in January on loan until the end of the season after falling out of favour under City manager Pep Guardiola.\nSpeaking on The Kyle Walker Podcast, the England defender told of his sadness at saying goodbye to not only his City team-mates, but all the coaches and non-football staff at the club.\n\"The lady there, Emma, who would be behind the counter and serve you food and get you drinks - even when I looked over at her, I wanted to cry,\" Walker said.\n\"Every day I've said [good] morning to her and given her a cuddle and all of a sudden I'm not going to see her any more.\n\"You don't think about that when the [transfer] process is happening, but then when you come to say goodbye, it's hard.\"\nWalker insisted he holds nothing against City, with whom he won 13 major trophies, but said he could not turn down the Italian club.\n\"I've got no bad words, nothing negative to say whatsoever about City. What that club's done for me both on and off the field is incredible,\" he said.\n\"When you take yourself away from the bubble you think about how lucky you were. That's no disrespect to any of the other clubs I played for, but the seven years we had there, I don't think it will happen again in football.\"\nWalker explained that his lack of game time at City and desire to reach 100 England caps - he currently has 95 - were factors too.\n\"The only other black player to get 100 caps is Ashley Cole. If I can be the second black player to reach 100 caps it would be a great honour,\" said Walker.\n\"It was a big relief when [England manager Thomas] Tuchel gave me the call and we spoke. I even spoke about the move to AC Milan with him and said I wanted to stay in Europe because I do want to represent my country.\"", "url": "https://www.bbc.com/sport/football/articles/cpdzn6e4z4jo"}