{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:53:04", "date_modify": "2025-05-20 11:53:04", "date_publish": "2023-08-05 21:04:02", "description": "Ireland begin their three-match World Cup warm-up programme with a solid 33-17 victory over Italy in Dublin.", "filename": "sport_rugby-union_66419125_1747741984.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EF02/production/_130668116_inpho_02304891-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66419125_1747741984.html", "title": "Ireland 33-17 Italy: Grand Slam winners begin World Cup warm-up series with solid home win", "title_page": "Ireland 33-17 Italy: Grand Slam winners begin World Cup warm-up series with solid home win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland began their three-match World Cup warm-up programme with a solid 33-17 victory over Italy in Dublin.\nAfter a slow start, Andy Farrell's men impressed in the first half and led 21-3 at the break through tries from Dave Kilcoyne, man-of-the-match Caelan Doris and Stuart McCloskey.\nThe hosts' tempo dropped in the second half but they stayed ahead through a Cian Healy try and another from Doris.\nItaly's second-half tries came from Lorenzo Pani and Tommaso Menoncello.\nThere was one injury worry for Ireland and Farrell, with number eight Jack Conan going off with a foot injury after 35 minutes and being seen with a protective boot on his foot after the match, with Farrell saying afterwards that it would need to be assessed.\nWith Ireland head coach Farrell examining his 42-man squad before he reduces it to 33 for September's tournament, Ulster hooker Tom Stewart made his debut from the bench along with Leinster's Ciaran Frawley and Munster's Calvin Nash.\nUlster captain Iain Henderson wore the Ireland armband for the second time in his career and produced a strong performance before going off in the 56th minute.\nHis club team-mate Jacob Stockdale won his first cap for two years and looked good in flashes in the first half, particularly when making a great aerial take that almost helped create a try, but will perhaps feel he should have released wide to Stewart late on when he chose to go for the try himself and was tackled.\nDoris put in a man-of-the-match performance in the number seven jersey, Joe McCarthy impressed in the second row and Jack Crowley did nothing to dent his chances of deputising at fly-half if Jonny Sexton is unavailable at any stage.\nIreland took a while to play their way into the match, looking strangely subdued and slightly disjointed in the early stages as visiting full-back Tommaso Allan opened the scoring for Italy with a second-minute penalty.\nThe home side had a good chance of crossing for a try in the fifth minute when stand-in captain Henderson made a good break but a handling error a few yards from the line saw him lose possession under pressure.\nFarrell's men soon began to find their rhythm and scored their first try on 13 minutes when Kilcoyne drove over the line with help from Conan and Doris after a tap-and-go penalty, with Sexton's deputy Crowley adding the conversion.\nIreland were well in control of the game by the time they notched their second try just before the half-hour-mark - and also had a one-man advantage after Italy prop Toa Halafihi was shown a yellow card for dangerous play.\nIt was their well-oiled line-out maul that proved effective once again for the second try, with captain Henderson collecting the ball well from the throw-in and Doris driving over from close range for his fourth international try.\nDoris was then instrumental in making the third try as he delivered a fine tackle and applied strong pressure at the ruck, allowing Ulster centre McCloskey to capitalise and grab an opportunistic try, which saw Crawley maintain his 100% record with his third conversion.\nIt brought an end to a half which had started well for the visitors, but in which they were rarely allowed time to play the high-tempo possession style of rugby that they like to play.\nThe match became slightly ragged as both sides made changes in the second half, with Frawley coming on at the break in place of Jimmy O'Brien.\nThe Italians scored a deserved try 11 minutes after the break. A strong line-out maul set up a fine sweeping move from left to right that saw the ball land wide with Pani, and he held Stockdale off superbly to score.\nStewart came off the bench for his debut on 52 minutes and Nash did the same 10 minutes later, just before fellow substitute Healy scored his 12th try on what was his 124th Ireland appearance - though Crowley dragged his conversion wide.\nItaly did not give in, however, and grabbed their second try when Keith Earls, winning his 99th Irish cap, could not hold up Menoncello but Doris scored Ireland's fifth try from close range seven minutes from time.\nIreland are set to travel to Portugal to continue their training camp before welcoming England to Dublin for their second World Cup warm-up game in a fortnight.\nIreland: O'Brien; Earls, Henshaw, McCloskey, Stockdale; Crowley, Casey; Kilcoyne, Herring, O'Toole; Henderson (capt), McCarthy; Baird, Doris, Conan.\nReplacements: Stewart, Healy, Furlong, Beirne, Prendergast, Blade, Frawley, Nash.\nItaly: Allan; Odogwu, Brez, Menoncello, Ioane; Garbisi, Varney; Fischetti, Nicotera, Riccioni; Lamb, Ruzza (capt); Negri, Zuliani, Halafihi.\nReplacements: Bigi, Buonfiglio, Ferrari, Cannone, Lamaro, Cannone, Fusco, Pani.", "url": "https://www.bbc.com/sport/rugby-union/66419125"}