{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:38", "date_modify": "2025-05-21 07:52:38", "date_publish": "2025-01-03 23:54:24", "description": "west ham news: Julen Lopetegui backs Luis Guilherme to deputise for Jarrod Bowen", "filename": "sport_football_articles_c4gzvk4l77lo_1747813958.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f9c5/live/30934e40-c9f7-11ef-a4d4-c711ab7d41c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gzvk4l77lo_1747813958.html", "title": "west ham news: Julen Lopetegui backs Luis Guilherme to deputise for Jarrod Bowen", "title_page": "west ham news: Julen Lopetegui backs Luis Guilherme to deputise for Jarrod Bowen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham boss Julen Lopetegui has praised Luis Guilherme's \"very, very good\" mentality as he backed the 18-year-old Brazilian to help replace the injured Jarrod Bowen.\nForward Guilherme has played just 20 minutes of football in three substitute appearances for the Hammers so far, but is now set to feature more with Bowen out for up to six weeks and Michail Antonio a long-term absentee.\nWest Ham go into Saturday's game at Manchester City 13th in the Premier League, eight points above the relegation places.\n\"Step by step he's more ready to help us and he's going to take advantage of his opportunity,\" Lopetegui said of Guilherme.\n\"I have the feeling that, with time, he's going to become a very good player for the Premier League.\n\"He has one very, very good thing: his mentality. He's a hard worker. He's a very humble boy and a very smart boy. He wants to improve. That's why I think that he's going to have a good future.\n\"I would like that his future is as soon as possible because we want to take advantage of him. I have a good opinion about the future because of his condition, physical, technical and his mentality.\n\"Mentality is key in all the players. If you have the right mentality, you are able to survive in the Premier League.\"", "url": "https://www.bbc.com/sport/football/articles/c4gzvk4l77lo"}