{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:20:49", "date_modify": "2025-05-19 15:20:49", "date_publish": "2017-07-03 22:45:24", "description": "Former world number one Tiger Woods says he has completed an \"intensive\" programme to help him manage his medication.", "filename": "sport_golf_40489374_1747668049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BB39/production/_96792974_gettyimages-633486260.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_40489374_1747668049.html", "title": "Tiger Woods: Ex-world number one finishes programme to help him manage medication", "title_page": "Tiger Woods: Ex-world number one finishes programme to help him manage medication - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world number one Tiger Woods says he has completed an \"intensive\" programme to help him manage his medication for pain and sleep loss.\nThe 41-year-old, who has won 14 major titles, is recovering from a fourth back operation since April 2014.\nHe was breathalysed in Florida in May after being arrested on suspicion of driving under the influence.\n\"I am so very thankful for all of the support I've received,\" said Woods in a statement published on social media., external\n\"I will continue to tackle this going forward with my doctors, family and friends.\"\nWoods announced last month that he was getting \"professional help\" but has not provided any details of the programme, and has not said when he expects to return to golf.\nThe American has not won a tournament since 2013, while his title drought in major championships dates back to 2008.\nLast December, he came back after 15 months out injured but has not played since his back problems recurred in February.\nWoods was then arrested on 29 May near his Florida home. He denied alcohol was involved and said it was down to \"an unexpected reaction to prescribed medication\".", "url": "https://www.bbc.com/sport/golf/40489374"}