{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:46", "date_modify": "2025-04-26 06:59:46", "date_publish": "2025-03-02 00:00:00", "description": "Aoba Fujino nets a 78th-minute winner to snatch a Women's Super League victory for Manchester City against Tottenham.", "filename": "sport_football_live_crew8x5q979t_1745650786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1735/live/3692d8d0-f781-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_crew8x5q979t_1745650786.html", "title": "Tottenham 1-2 Manchester City: Late Aoba Fujino strike grabs victory", "title_page": "Tottenham 1-2 Manchester City: Late Aoba Fujino strike grabs victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aoba Fujino's late strike earned Manchester City an important victory and ensured they did not drop points in an otherwise underwhelming Women's Super League display at Tottenham.\nVivianne Miedema gave the visitors an 11th-minute lead, heading beyond Lize Kop after Japan international Fujino produced an excellent run down the right flank and delivered an inch-perfect assist.\nHowever, City's lead had come against the run of play and Spurs hit back to level in the 32nd minute.\nSubstitute Olivia Holdt snatched the ball from Laia Aleixandri and found Bethany England, who lofted a calm finish over Ayaka Yamashita's head.\nTottenham showed the most promise in the final third, staying true to their creative attacking style and creating chances around the City box.\nSwede Matilda Vinberg should have put the hosts in front but fizzed a shot wide when one-on-one.\nBut City nearly restored their lead when Miedema headed a Leila Ouahabi corner goalwards, but Spurs full-back Ashleigh Neville produced a spectacular acrobatic goalline clearance to send the ball off the bar and away from danger.\nThe introductions of Jill Roord, Mary Fowler and Jess Park from the bench finally gave City the energy they needed in the final third.\nThey fashioned the 78th-minute winner when Fujino collected an aerial ball from compatriot Yui Hasegawa, brought it down neatly and rifled past Kop for her first WSL goal of the season.\nSpurs boss Robert Vilahamn had urged his side to stay true to their tactical identity in Sunday's encounter and they did just that, producing a determined performance of exactly the kind he ordered - even if it ended in defeat.\nDespite going behind, they refused to sit back and instead pressed City intently, overturning possession and producing neat link-up play.\nForward England, who netted the equaliser, was a constant handful who jumped at every loose ball, made tempting runs and tried to muscle away City's defenders.\nHer goal made it eight in the WSL this season – the joint second-most in the division – and surely makes a statement to Sarina Wiegman about her intent to earn a spot in the Lionesses squad, given she was not called up for February's internationals.\nFor City, this marked the beginning of a hectic month where they will contest eight fixtures in 29 days and their already depleted squad looked shaky at the back and struggled to get going further upfield.\nThey were not at their fluid best and only managed to produce better chances when their substitutes came on against a tired Spurs backline.\nLaura Coombs, Lauren Hemp and Alex Greenwood are all due to return from injury for Gareth Taylor's side this month and having them back will be crucial if they are to achieve their goals.\nIn the end, though, it was two players who had very little time to prepare for this game who combined for the winner.\nJapan internationals Hasegawa and Fujino – who helped their national team win the SheBelieves Cup in the United States over the break – got the visitors what they needed in the fight for a Champions League place next season.", "url": "https://www.bbc.co.uk/sport/football/live/crew8x5q979t"}