{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:56:11", "date_modify": "2025-05-21 06:56:11", "date_publish": "2025-01-31 09:35:22", "description": "Bronny James - son of Los Angeles Lakers legend Lebron - is cheered by the Washington Wizards crowd as he scores a career-high five points against their own side.", "filename": "sport_basketball_articles_c360z42pg20o_1747810571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/228e/live/80f988d0-dfb0-11ef-88d3-dd7c96a87c10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_c360z42pg20o_1747810571.html", "title": "NBA: Washington crowd chant 'MVP' as Bronny James scores career-high points for Lakers", "title_page": "NBA: Washington crowd chant 'MVP' as Bronny James scores career-high points for Lakers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bronny James - son of Los Angeles Lakers legend Lebron - was cheered by the Washington Wizards crowd as he scored a career-high five points against their own side in the NBA.\nThe home support were chanting the 20-year-old's name before he even entered the game for the fourth quarter at the Capital One Arena.\nAs well as his five points, James also had two rebounds, two assists and a steal during his late cameo, with the crowd chanting \"MVP\" (most valuable player) as he rounded off the scoring with two late free throws.\nFather LeBron - who has been named MVP four times in his career - had left the game late in the third quarter after scoring a game-high 24 points with 11 assists, helping the Lakers to a comfortable 134-96 win.\n\"He [Bronny] has had eyeballs on him his whole life. He's used to it,\" said Lakers coach JJ Redick.\n\"He has handled everything with dignity, grace, class, all that stuff. He'll continue to grow.\"\nThe Lakers have won five of their past six games to sit fifth in the Western Conference. The Wizards are bottom in the East after a club record-equalling 16th successive defeat.\nBronny James joined the Lakers as a second-round draft pick from the University of Southern California in June.\nHe made history in October when he stepped off the bench to join LeBron and become the first father-son duo to share the court in an NBA game during the Lakers' season opener against the Minnesota Timberwolves.", "url": "https://www.bbc.com/sport/basketball/articles/c360z42pg20o"}