{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-20 12:21:24", "date_modify": "2025-05-20 12:21:24", "date_publish": "2023-08-04 06:07:35", "description": "Captain Luke Young says Wrexham are ready \"to hit the ground running\" ahead of their return to the Football League.", "filename": "sport_football_66395483_1747743684.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C276/production/_130628794_shutterstock_editorial_14032661j-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66395483_1747743684.html", "title": "Luke Young: Wrexham have 'no excuses' ahead of EFL return, says captain", "title_page": "Luke Young: Wrexham have 'no excuses' ahead of EFL return, says captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Club captain Luke Young insists Wrexham are ready \"to hit the ground running\" ahead of their return to the Football League.\nWrexham host MK Dons on Saturday in their first EFL game for 15 years.\nThe opening day of the League Two campaign comes only a week after Wrexham returned from the United States.\n\"We can't have any excuses - we can't use the America trip as an excuse,\" Young told BBC Sport Wales.\n\"It would be easy to use the excuse that we only got back a week ago but I know as a group we're not going to be using that as an excuse.\n\"We've got to use it as a bonus and as a stepping stone to come back and hit the ground running.\n\"We'll be fully ready to go come three o'clock on Saturday.\"\nNational League champions Wrexham faced Chelsea, Manchester United, LA Galaxy and Philadelphia Union II during their two weeks in the US.\nThe north Wales club are popular in north America due to their Hollywood owners Rob McElhenney and Ryan Reynolds and the Disney+ documentary Welcome to Wrexham.\n\"It takes you by surprise how big Wrexham are over there,\" Young added.\n\"To have the following that we have out there, it's phenomenal to say the least.\n\"You set foot in a different country that's the other side of the world and you're getting recognised and people stopping you for photos.\n\"You associate it with the Premiership sides, because they're going out there and everybody knows who they are.\n\"Now we're going out there and people know we are.\n\"You see so many Wrexham tops and you're seeing billboards and advertisements for Welcome to Wrexham documentary and different photos of players dotted around the place.\n\"Because of everything that's gone on here, the buzz around the town and that you are getting spotted in so many places, you kind of take it in your stride.\n\"It's not until you get back and you look back over the trip on you think 'Yeah, we're well known out there' and you think is it really happening?\n\"It's a definite eye opener to where the club have come from to where they are now.\"", "url": "https://www.bbc.com/sport/football/66395483"}