{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 03:38:12", "date_modify": "2025-05-21 03:38:12", "date_publish": "2025-02-10 20:38:33", "description": "World Athletics plan to introduce a swab test for elite athletes who wish to compete in the women's category at international events, tightening eligibility regulations for transgender and difference of sex development (DSD) athletes.", "filename": "sport_athletics_articles_cj91dr17d1no_1747798692.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6614/live/d43a7470-e7f1-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_cj91dr17d1no_1747798692.html", "title": "World Athletics plan swab tests set to decide female athlete eligibility", "title_page": "World Athletics plan swab tests set to decide female athlete eligibility - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World Athletics is set to introduce a swab test for elite athletes who wish to compete in the women's category at international events.\nThe \"pre-clearance requirement\" is one of several changes that will further tighten regulations concerning the eligibility of transgender and difference of sex development (DSD) athletes.\nIn March 2023 World Athletics banned transgender athletes who had gone through male puberty from competing in the female category in international competition.\nHowever, following recommendations from the World Athletics council, external the governing body is now set to revise its eligibility regulations for male-to-female trans athletes on the basis of fresh evidence it said shows there was a \"significant performance gap before the onset of puberty\".\nThe current rules for DSD athletes, meanwhile, require them to reduce their testosterone levels below 2.5 nmol/L for at least six months to compete in any female category event internationally.\nWorld Athletics has now proposed the rules for both DSD and transgender athletes should be the same because new evidence has \"clarified that testosterone suppression in 46XY DSD, external and 46XY transgender individuals can only ever partly mitigate the overall male advantage\".\nA World Athletics council meeting next month is expected to determine when the new regulations could be implemented.", "url": "https://www.bbc.com/sport/athletics/articles/cj91dr17d1no"}