{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:19:08", "date_modify": "2025-05-21 06:19:08", "date_publish": "2025-01-22 22:25:21", "description": "North West 200 organisers unveil a five-year commercial sustainability plan to grow the international road race event.", "filename": "sport_motorsport_articles_c62enve5l60o_1747808348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/defb/live/1acc1f20-d90a-11ef-b3df-5b8de1cd53ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_c62enve5l60o_1747808348.html", "title": "North West 200: Five-year commercial sustainability plan revealed", "title_page": "North West 200: Five-year commercial sustainability plan revealed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "North West 200 organisers have unveiled a five-year sustainability plan to further grow the event and help secure its future.\nAt a presentation to Causeway Coast and Glens Borough Council's Leisure and Development Committee, the tourism benefits and the 1.8 billion global media reach of the international road race meeting were emphasised by representatives of the NW200.\nCouncillors were informed that in excess of 100,000 were attracted to the event annually, 27% of those visitors from overseas, but were also told that there was a need for capital investment in the future to modernise infrastructure and sustain the event's profile.\nIt was said that the event generates an estimated £20m for the local economy and provided substantial international exposure for Northern Ireland.\nAmong the objectives for future investment were growing overseas markets across Great Britain, Europe, North America and the Republic of Ireland, plus developing international marketing and broadening event development and features for the Race Week Festival.\nRestorative upgrades to the paddock, improved signage, an infrastructure that showcases the North West 200's and the borough's heritage and an upgrade to the North West 200 Tunnel with \"Legends Murals\" are stated aims and initiatives.\nThe presentation mentioned a succession plan and detailed a newly expanded management structure.", "url": "https://www.bbc.com/sport/motorsport/articles/c62enve5l60o"}