{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-04-26 03:57:13", "date_modify": "2025-04-26 03:57:13", "date_publish": "2025-03-04 14:17:09", "description": "Wales scrum coach Adam Jones says all the pressure is on Scotland for the Six Nations match in Edinburgh on Saturday.", "filename": "sport_rugby-union_articles_c17qw5n9q94o_1745639833.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9923/live/087a2c50-f902-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c17qw5n9q94o_1745639833.html", "title": "Six Nations 2025: ''The pressure's on Scotland, not us'", "title_page": "Six Nations 2025: ''The pressure's on Scotland, not us' - Wales scrum coach Jones - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wales scrum coach Adam Jones says all the pressure is on Scotland for the Six Nations match in Edinburgh on Saturday.\nScotland have suffered defeats by Ireland and England following their opening-weekend win against Italy, while Wales lie bottom of the table after losing all three matches.\nThe Scots failed to convert numerous chances to add to their three tries at Twickenham as they went down 16-15, a defeat that ended any realistic title hopes.\nGregor Townsend's side now host a Wales side who, despite showing signs of improvement in interim head coach Matt Sherratt's first game in charge - a 27-18 defeat by Ireland - have lost their previous 15 Tests.\nFormer Scotland scrum-half Rory Lawson has said losing to Wales is incomprehensible this weekend with Jones saying the hosts are favourites.\n\"There's no pressure on us, there's pressure on Scotland,\" said Jones.\n\"This is probably one of the best sides they've ever had, if not the best side they've ever had.\n\"They'll be expecting to beat us pretty comfortably at home, against a team that's lost 15 times.\n\"We haven't put much of an underdog tag on us, but results probably dictate we are.\n\"They'll relish being favourites. They'll expect to win. They've got good coaches. My old friend Steve Tandy has done a brilliant job with the defence.\n\"But we'll certainly go up there to put the frighteners on them a bit. You can rattle good players and get stuck into them.\"\nJones says Wales can take confidence from their performance against Ireland.\n\"We showed we can go toe-to-toe with one of the best teams in the world and rattled them a bit,\" said Jones.\n\"We didn't get across the line, but we'll keep building on that with the confidence we've got.\"\nJones believes this Wales team can win at Murrayfield and record a first international victory since October 2023.\n\"There's no point going up there and being in awe of them,\" said Jones.\n\"They've got a good side with some standout players. You've just got to rip into them as much as you can and I'm sure the boys will.\n\"I know I said they're the best Scottish team ever, but there's a bit of confidence and feel-good factor now with us.\n\"We want to get the monkey off our back, we're going up there to win. We're not going up there to make up the numbers.\"\nJones says Wales sides have previously enjoyed playing in the Scotland capital.\n\"It's a good place to play, so let's get one over on them,\" said Jones.\n\"The Welsh travel well. Max Boyce wrote a song about it so they always travel well up there. Traditionally we've done well against them, home and away.\n\"I played 12 games against them and lost one, although that was a long time ago now. We're not going to go up there daunted.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c17qw5n9q94o"}