{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:14", "date_modify": "2025-05-20 12:20:14", "date_publish": "2023-08-04 21:32:03", "description": "Mikel Arteta says he weighed up his Arsenal future after last season's title blow before a \"big reflection\" convinced him to stay on.", "filename": "sport_football_66409342_1747743614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0BD2/production/_130662030_gettyimages-1530169598-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66409342_1747743614.html", "title": "Mikel Arteta: Arsenal manager considered his Premier League future after missing out on title", "title_page": "Mikel Arteta: Arsenal manager considered his Premier League future after missing out on title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikel Arteta considered his future as Arsenal manager after last season's title disappointment until deep \"reflection\" persuaded him to stay put.\nThe Gunners led the Premier League by five points from Manchester City before consecutive draws with Liverpool, West Ham and Southampton proved costly.\nArsenal's next game was a heavy defeat at City, who went on to win the title by five points from the London side.\n\"The first few weeks, very tough,\" said Arteta, looking back at his summer.\n\"The first thing you have to do is look in the mirror and understand - is there something that you should have done better or differently? If that is the case then learn from it.\n\"Judge yourself - 'are you still the right person to drive the club, the team, forwards in the way that you want and do you have that energy and that belief that you want to do it?'.\n\"It took a big reflection, but the answer is yes and I feel with a lot of energy and positiveness.\"\nDuring the title run-in, Arsenal led 2-0 at Liverpool and West Ham before being held to draws, with winger Bukayo Saka missing a penalty when his side were 2-1 up against the Hammers.\nArsenal then needed two late goals to salvage a 3-3 draw against a Southampton side who went on to be relegated, before sliding to a telling 4-1 defeat at City.\nAsked what was the difference between City and his team, Arteta said: \"Momentum. In the key moments when it should have gone one way - and in many situations in the season it went for us - it didn't go for us.\n\"It was one, two, three and then we lost momentum and they took momentum.\n\"You are talking about a team that if they need to win 25 games in a row, they have the capacity to do that, so the last thing that they need is momentum and belief and we gave them that.\n\"We had games that we didn't win, especially the three draws that we had when momentum shifted.\n\"We should have won those games and we had enough to win those games - it was in our hands.\n\"They were key moments when we just weren't ruthless enough, clinical enough, didn't have the luck or we made certain mistakes that allowed that to happen. We have to recognise that as well.\"", "url": "https://www.bbc.com/sport/football/66409342"}