{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 05:28:19", "date_modify": "2025-05-21 05:28:19", "date_publish": "2025-04-03 10:26:33", "description": "West Ham news: Opinion - Simon Stone on Graham Potter wanting to build", "filename": "sport_football_articles_c4g2x4v03xxo_1747805299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/498c/live/09aca4a0-1076-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g2x4v03xxo_1747805299.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - Simon Stone on Graham Potter wanting to build - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham fans are not on their own among the Premier League in wishing this season would come to an end.\nWhat was supposed to be a fresh start and a transition out of the David Moyes era has turned into a tortuous campaign, with Julen Lopetegui's arrival failing to have the desired effort and Graham Potter's not being accompanied by the new manager 'bounce' many had hoped for.\nInstead, the Hammers are stuck, in a little group of four – that includes Tottenham and Manchester United – in the bottom half of the table, wondering if they can catch Crystal Palace above them, or avoid being caught by Wolves behind. A return to Europe is as far off a target as a relegation battle in terms of reality.\nEven the remaining opposition, likely title winners Liverpool and basement boys Southampton are still to be played this month does not really offer a chance to reset as drawing definitive conclusions from either match is going to be futile given the extremes of their respective situations.\nAs we all know, Potter likes to build. The remaining weeks will be spent working out which players he wants for next season, those he does not and the best way to reset and go again next season.\nIt might not be an exciting or rewarding final eight games. But the unseen work going on should ensure the Hammers are in a better place by August.", "url": "https://www.bbc.com/sport/football/articles/c4g2x4v03xxo"}