{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:09:48", "date_modify": "2025-05-20 13:09:48", "date_publish": "2023-08-02 14:18:11", "description": "England manager Sarina Wiegman could spring more surprises in the Fifa Women's World Cup knockout stage, says Lionesses' record goalscorer and BBC Sport pundit Ellen White.", "filename": "sport_football_66373250_1747746588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10465/production/_130416666_ellenwhitecolumn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66373250_1747746588.html", "title": "Women's World Cup 2023: 'England manager Sarina Wiegman could have more surprises in store' - Ellen White column", "title_page": "Women's World Cup 2023: 'England manager Sarina Wiegman could have more surprises in store' - Ellen White column - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I already knew Sarina Wiegman was a genius from my time playing under her for England, but she showed it in a different way with her gameplan against China on Tuesday.\nWe were all wondering what Sarina would do without the injured Keira Walsh at the heart of her team, but she came up with a system that seemed to benefit every player on the pitch.\nEven when the Lionesses line-up was announced before kick-off, I wasn't sure what their shape would be but it turned out to be a 3-5-2 formation that allowed our individuals to thrive and for the team to play the free-flowing football we all wanted to see.\nWe are scoring goals now too - lots of them, which I am delighted about - and now we just need to take this momentum and confidence into Monday's last-16 tie with Nigeria.\nSarina could take this formation into that game too, but I think any team we face now will be worried about whether she makes any more changes and what else she might have up her sleeve, which might put them on the back foot.\nEngland usually play in a 4-3-3 shape under Sarina and I don't know whether some teams have started to figure it out a little bit. You'd see them double up on certain players, although it always freed up other people elsewhere.\nWhen we won last summer's Euros, we were very fortunate with injures and didn't change the starting XI or that system for any of our six matches - instead, Sarina made just tiny tweaks during matches, depending on how things were going.\nAgainst China, it was totally different - she tried something that I'd only really seen England do a couple of times in qualifying before. It was like she was toying with everyone, because no-one expected that.\nFor me, it underlines what an amazing manager she is, and shows the way she thinks and adapts.\nShe looks at the opposition and what they can do before deciding how England can dominate them, but she also understands her players so well, and gives them an opportunity to express themselves.\nThe flow and rhythm that the team played with against China was just so good to watch. The games only get harder from here, but it's exciting to think about what could happen next.\nIt was obvious we had worked a lot on this new system in training but, from my experience, doing that is very different to making it work effectively in an important international match.\nThe fact that this time it went so well, straight from the start, is largely down to Sarina and her coaching staff - she is always very good at getting her instructions across.\nIt meant the whole team had a clear understanding of their roles and responsibilities and, even when the substitutes came on in the second half, the intensity didn't drop.\nBut the players definitely deserve credit too, because they were the ones who executed the plan and completely controlled the whole game against very decent opposition - China are ranked 14th in the world, and were expecting to get out of Group D.\nI'm so proud of them all for that, especially because they have had a bit of criticism for what happened in the first two games, despite us winning both of those too.\nLots of people, myself included, have been saying we wanted to see a better performance and with more goals, because we know how talented this team is.\nInside the camp, they have probably had to shut out the noise a little bit, but it felt like they responded in this game and have said: \"OK, is that enough for you? We have hit six!\"\nLauren James scored two of our goals against China and it's incredible to see her continue to shine the way she is at this World Cup.\nHer technique for her first goal was superb, but that full-foot volleyed finish for her second was just phenomenal. She is a very special talent.\nIt was great seeing some other England players get among the goals too - I was really pleased to see Alessia Russo get off the mark in the tournament, and for Rachel Daly to find the net as well.\nI'd texted Rachel before the game and told her \"I reckon you are going to score\" and, when she did, I was like: \"Yes, it has come true!\"\nWe already know all about Rachel's versatility but it's so important that Sarina hasn't stifled her by asking her to play on the left instead of up front like she does for Aston Villa.\nWhatever formation we go with, she is allowed to get forward on that flank, as we saw when she was able to get on the end of Laura Coombs' cross at the back post to round off the scoring.\nJames is also given licence to roam and float into all these positions that she is so comfortable in, whether that is out on the left or more central.\nIt's great to see players given that freedom, but it's important we retain some defensive discipline too - and it's the same when we see Millie Bright surge forward from defence.\nShe was another player who seemed to fit the new formation perfectly, playing in the middle of the back three with Jess Carter and Alex Greenwood either side of her and covering her when she moved up into midfield.\nMillie played a big part in our first two goals by winning the ball and using it so well, and the way she controlled and guided our defence throughout was a real captain's performance.\nThere are bigger tests to come, starting against Nigeria. They can be a very direct team at times, and will be very dangerous. They are also far more fluid in their own formation than China were.\nWe have to be ready for all of that and make sure the defence has always got enough protection - I think we learned our lesson about that in the second game against Denmark, when there were times when Lucy Bronze was exposed on the right.\nThe knockout stage is all or nothing, and any mistake can be costly and mean you are going home.\nBut Sarina will have a plan that she can alter depending on whether we go ahead or fall behind in games, and we have the toolbox to get over the line in games now, that perhaps we lacked before we saw out the Euros final against Germany.\nI'm nervous, but I also feel like we are ready for anything and I am sure the players' attitude is the same - they will be thinking \"bring it on!\"\nEllen White was speaking to BBC Sport's Chris Bevan.", "url": "https://www.bbc.com/sport/football/66373250"}