{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 07:35:44", "date_modify": "2025-05-21 07:35:44", "date_publish": "2025-01-13 18:37:28", "description": "David Moyes press conference: Everton vs Aston Villa preview", "filename": "sport_football_articles_crm7znyrj22o_1747812944.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a963/live/8e719b70-d19f-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm7znyrj22o_1747812944.html", "title": "David Moyes press conference: Everton vs Aston Villa preview", "title_page": "David Moyes press conference: Everton vs Aston Villa preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moyes confirmed Dwight McNeil is still unavailable with an \"ongoing knee issue\", Armando Broja is awaiting another scan and Dominic Calvert-Lewin trained on Monday so \"should be OK\" for the game on Wednesday.\nThe returning Everton boss said he \"did not expect the job to come up\", but that the Toffees are \"a different beast\" and it was \"too big an opportunity to turn down\".\nOn previous comments after leaving West Ham about not wanting to return to managing a team in a relegation fight: \"Everton is different. A couple of weeks ago I didn't think Everton could be in a relegation battle, I thought they would be strong enough to get out of it. I've come into the seat now and I'm going to back that up and say we are going to be strong enough to get away from it. But, I'm not kidding myself, or anyone else, we will need everyone behind us.\"\nHe said he has had \"good conversations\" with the new ownership, adding: \"I have had privilege here to work under some great owners and people who have helped me. I've worked under people whose intentions were to build a better Everton. I think they did that, we did that in a period that wasn't easy either. This period is not going to be easy, but new ownership has big ideas and big hopes that they can make a big difference to the football club.\"\nOn first priorities: \"First priority is winning football matches. But there is other things of course, like building the club back up if possible. I don't think damage has been done by any managers but damage has been done through a long period of time. I had a great time here and I would love to be a part of making it better. The new stadium looks the business, it looks elite, now we need to get the elite players to give everyone something to shout about when we move.\"\nMoyes said that after his first training sessions with the team, they are \"in good spirits\" and that they \"had a bit of laughter, bit of fun as well\". He added: \"When things aren't as good, you need to find ways of keeping chins up and things bright.\"\nThe new boss also confirmed that under-18s manager Leighton Baines and his former staff at West Ham - Billy McKinlay and Alan Irvine - will be joining his coaching team as he wants to \"try and work quickly with people I know and trust\".\nHe revealed there had been \"three or four occasions\" when he nearly returned to the club since leaving in 2013, but was now nervous coming back for the first time since his departure and feels \"huge pressure\" to keep them in the league.", "url": "https://www.bbc.com/sport/football/articles/crm7znyrj22o"}