{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 05:26:18", "date_modify": "2025-05-21 05:26:18", "date_publish": "2025-04-03 11:45:27", "description": "On the eve of the new domestic cricket season, Surrey captain Rory Burns says English cricket needs to \"protect\" the County Championship.", "filename": "sport_cricket_articles_cy9vj2d7qxdo_1747805178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e39a/live/21ed5540-1077-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy9vj2d7qxdo_1747805178.html", "title": "Rory Burns: Surrey captain says English cricket needs to 'protect' County Championship", "title_page": "Rory Burns: Surrey captain says English cricket needs to 'protect' County Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Surrey's serial title-winning captain Rory Burns says English cricket must \"protect\" the County Championship as the new domestic season is set to get under way.\nThe first round of fixtures starts on Friday, with defending champions Surrey facing Essex at Chelmsford in their opening match.\nBurns said he was \"not really\" worried that the red-ball competition might not appeal to younger audiences compared to shorter formats, provided they felt compelled to \"still pick up a bat or ball and play cricket\".\nHowever, he believes the sport's stakeholders, including the England and Wales Cricket Board (ECB), need to safeguard the future of the Championship, which was first played as an officially organised competition in 1890.\n\"I think it's brilliant we have T20 and The Hundred,\" Burns said.\n\"We have to appreciate in the ecosystem of the game that's our cash cow, but we also need to protect what is the best format.\n\"You see Tests in day four and day five and they are going to the wire, people are fully engaged and watching, so it's how we use that as a gateway to getting eyeballs on our game and how we grow.\"\nBurns believes runs and wickets in the County Championship are still highly relevant for England Test selection, even if it is currently fashionable to pick on potential rather than weight of stats in domestic cricket.\nWarwickshire's Jacob Bethell and Somerset's Shoaib Bashir - the latter currently on loan at Glamorgan - have both been picked for England for their ability to play international cricket rather than their first-class records.\n\"It's down to the guys in those decision-making positions, how they want to pick the sides. I think the cycles that selection goes in, it generally flips round once people in the decision-making position change,\" said Burns, who has played 32 Tests for England.\n\"They have changed the way they are picking it for now and it will probably go in another cycle. It's like fashion, things turn around.\n\"For me, I'm still going to try to pump out 1,000 runs every year because there might be a faint hope the phone might ring.\"", "url": "https://www.bbc.com/sport/cricket/articles/cy9vj2d7qxdo"}