{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:26:56", "date_modify": "2025-04-26 07:26:56", "date_publish": "2025-02-27 21:44:39", "description": "San Antonio Spurs coach Gregg Popovich announces he will not return to the sidelines this season after he suffered a mild stroke in November.", "filename": "sport_basketball_articles_cy0dd586pgzo_1745652416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1f9d/live/1955aa70-f553-11ef-bf48-f1af4855b062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_basketball_articles_cy0dd586pgzo_1745652416.html", "title": "Gregg Popovich: San Antonio Spurs coach will not return this season after stroke", "title_page": "Gregg Popovich: San Antonio Spurs coach will not return this season after stroke - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "San Antonio Spurs coach Gregg Popovich has announced he will not return to the sidelines this season after he suffered a mild stroke in November.\nThe 76-year-old suffered a stroke on 2 November at the team's arena before a home win over the Minnesota Timberwolves.\nAssistant Mitch Johnson has led the NBA team to a 22-30 record since stepping in as interim coach in Popovich's absence.\n\"I've decided not to return to the sidelines this season,\" Popovich said on Thursday.\n\"Mitch Johnson and his staff have done a wonderful job and the resolve and professionalism the players have shown, sticking together during a challenging season, has been outstanding.\n\"I will continue to focus on my health with the hope that I can return to coaching in the future.\"\nPopovich, who has coached the Spurs since the 1996-97 season, is the oldest coach in NBA history.\nHe is the league's all-time leader in victories with 1,390 regular season wins and another 170 post-season triumphs.\nThe Hall of Fame coach has guided the Spurs to five NBA titles in his 29 seasons at the helm, while he led the USA to basketball gold at the Tokyo Olympics.", "url": "https://www.bbc.co.uk/sport/basketball/articles/cy0dd586pgzo"}