{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:18", "date_modify": "2025-05-21 05:55:18", "date_publish": "2025-01-31 15:39:51", "description": "Toby King celebrates 10 years as a Warrington player, something he feared might not happen when he fell out of favour in 2022.", "filename": "sport_rugby-league_articles_cg7zvek5ln7o_1747806918.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d59d/live/de648fb0-dfe2-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cg7zvek5ln7o_1747806918.html", "title": "Toby King: Warrington centre grateful to reach 10-year milestone", "title_page": "Toby King: Warrington centre grateful to reach 10-year milestone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England centre Toby King is grateful to Sam Burgess for reviving his Warrington Wolves career and helping him reach a 10-year milestone with the club.\nThe 28-year-old fell out of favour at the Wire in 2022 and looked likely to leave the Halliwell Jones Stadium.\nKing spent the 2023 season at Wigan and won the Super League title there, having been on loan to hometown team Huddersfield for part of the previous campaign.\nBurgess' arrival as head coach for 2024 opened the door for a return, and King will mark his decade at Warrington with a testimonial game against Leigh on Saturday.\n\"Hopefully the way it's panned out with Sam coming in, people can see how much I care and I love this club,\" King told BBC Sport.\n\"It was pretty sad really, I'd just signed a long-term deal and then personnel changed in the club and it didn't seem to work.\n\"That's absolutely fine, some coaches want to go down different paths. It could have been it.\n\"I went to Huddersfield on loan which I enjoyed, and then had a successful year with Wigan where I learned a lot.\n\"It was mad how I ended up coming back, I've been given this opportunity and it's nice really because it was almost tarnished that I had left and the way it happened, people never got to see the true side of the story. It's a proud memory that I've been here 10 years.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/cg7zvek5ln7o"}