{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-05-21 05:38:00", "date_modify": "2025-05-21 05:38:00", "date_publish": "2025-04-01 06:48:06", "description": "Southampton Q&A: Where has it gone wrong for Saints?", "filename": "sport_football_articles_c5yg888n3nzo_1747805880.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e156/live/caa329d0-0e3d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yg888n3nzo_1747805880.html", "title": "Southampton Q&A: Where has it gone wrong for Saints?", "title_page": "Southampton Q&A: Where has it gone wrong for Saints? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Throughout Tuesday, we're doing a special Q&A with BBC Radio Solent's Adam Blackmore. In the first part, he assesses the wreckage of the 2024-25 season.\nJack asked: I would be interested in hearing a breakdown of your thoughts. Where do you think it has gone wrong? What should the club have done differently? Were we always doomed? What needs to change next season?\nAdam: I do not think the club were always doomed. I think relegation was absolutely avoidable, and the relegation is a consequence of recruitment and managerial decisions.\nThere was a brain drain in recruitment following the departure of Jason Wilcox, and not replacing him quickly has been a factor. The summer recruitment was too much about buying potential at decent prices and hoping it would pay off. It did not.\nAnd that has been the biggest flaw for Sport Republic - trying to outsmart the market and failing consistently to do so over three years. The squad needed to be smaller and of higher quality, not bloated and average.\nUltimately, whoever the manager is, when the team is not good enough you are always going to be up against it. As for the managers, it is pretty subjective whether you think Russell Martin's style of football would have worked over time, but if you think back to December, it was impossible for it to carry on.\nThere is frustration that he and Ivan Juric both tried to impose a style of football on players in very different ways but with very similar outcomes.\nDavid asked: Why do you think our recent managers have not played to the players' strengths and decided to do it their way?\nAdam: It is a big question to answer and one that I can only take an estimated guess on because only Martin and Juric could answer this question definitively.\nAny manager has a preferred way of playing and that is generally what they trust because it has got them to the point they are at in their careers and any success they have had. I think when it starts to go wrong we all then wonder why they do not adapt.\nFor me, it is a failing of modern management that coaches 'stick to their principles', which are often based on wanting to deliver good analytics and stats. In my mind, that is ego-driven and not always for the betterment of the team or the club.\nOn the basis that I absolutely concur with what my football mentor and partner for many years Dave Merrington taught me - that a coach's job is to help his players - both Russell and Ivan have not done that. Even though they may say, justifiably, that they are trying to make the players better by teaching them to play 'their' way, the Premier League is not the place to practise something you cannot do, whether that is playing out from your own six-yard area, or trying to man-mark players all over the pitch.\nThere were lower-risk options that may well have led to Saints picking up more points, and gaining confidence along the way that could have helped them be better individually and give the team a hope of staying up.\nCome back later on Tuesday for part two where Adam explores if there are any positives from this season…", "url": "https://www.bbc.com/sport/football/articles/c5yg888n3nzo"}