{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:01", "date_modify": "2025-05-21 05:27:01", "date_publish": "2025-04-03 11:28:17", "description": "Preston North End boss Paul Heckingbottom says a poor start to the second half led to his side's downfall after a disappointing 2-0 loss to relegation battlers Derby County.", "filename": "sport_football_articles_cdxgv742gkdo_1747805221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0765/live/900ab570-107e-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxgv742gkdo_1747805221.html", "title": "It was as if we weren't prepared - Heckingbottom", "title_page": "PNE: It was as if we weren't prepared - Heckingbottom - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Preston North End boss Paul Heckingbottom says a poor start to the second half led to his side's downfall after a disappointing 2-0 loss to relegation battlers Derby County.\nThe Lilywhites started the game the better but were only able to muster one shot on target, while the Rams came out of the blocks in the second to gain a two goal advantage in the space of four minutes.\n\"The second half was a totally different game and as if we'd not prepared for the team we were playing against.\n\"It's horrible getting beaten but the frustration is how much I felt we were in control and dealing with their threats.\n\"In the second half all of a sudden we're not winning the duels, leaving men at set-plays and then we walk away from a second phase throw put in our box and all of a sudden we're outnumbered and one of their best headers is left free.\n\"That 10-minute spell just took the game away from us.\"\nPreston suffered five consecutive losses to conclude last season, finishing 10th overall and currently find themselves in 14th.", "url": "https://www.bbc.com/sport/football/articles/cdxgv742gkdo"}