{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:35:21", "date_modify": "2025-05-20 11:35:21", "date_publish": "2023-08-07 07:15:36", "description": "Alfredo Morelos wants to join ex-Rangers team-mate Ryan Kent at Fenerbahce, Malik Tillman windfall, plus more.", "filename": "sport_football_66426253_1747740921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/123FB/production/_130674747_-1441c55d-43f4-4809-afd8-c235cb753702.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66426253_1747740921.html", "title": "Scottish gossip: Alfredo Morelos, Carl Starfelt, Malik Tillman, Fashion Sakala, Jota", "title_page": "Scottish gossip: Alfredo Morelos, Carl Starfelt, Malik Tillman, Fashion Sakala, Jota - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alfredo Morelos wants to join ex-Rangers team-mate Ryan Kent at Turkish club Fenerbahce. (Nexus Sports via Scottish Sun), external\nRangers would earn between £1.2m and £1.4m if PSV Eindhoven make Malik Tillman's loan from Bayern Munich a permanent move. (Daily Record), external\nFashion Sakala has posted on social media with a message that appears to signal the end of the forward's two-year spell at Rangers. (Scottish Sun), external\nDundee and Dundee United briefly shook hands on plans to build a shared stadium in 2001. (Scottish Sun), external\nRangers will step up their search for a new director of football once manager Michael Beale has completed his summer recruitment drive, says CEO James Bisgrove. (The Herald), external\nBisgrove says Rangers expect to be granted an allocation of tickets for the second Old Firm game of the season - even if Celtic refuse to take up theirs for the upcoming Ibrox fixture. (Glasgow Times), external\nAl-Ittihad manager Nuno Espirito Santo has played down suggestions former Celtic winger Jota could be loaned out by the club he joined weeks ago. (Asharq Al-Awsat via Daily Record), external\nManager Lee Johnson admits the boos during Hibernian's game against St Mirren were fair and admits he may have got his team selection wrong. (The Scotsman), external\nMatt O'Riley says he is losing his best friends at Celtic with Carl Starfelt poised to join Jota in leaving the club. (Daily Record), external\nRangers manager Beale gave his blessing to Alex Lowry's loan move to Heart of Midlothian. (Daily Record), external\nGraham Shinnie praised Aberdeen's defence, but bemoaned the Dons' performance in the final third after they failed to register a single shot on target at Livingston. (Press & Journal), external", "url": "https://www.bbc.com/sport/football/66426253"}