{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 05:16:18", "date_modify": "2025-05-21 05:16:18", "date_publish": "2025-04-03 17:30:06", "description": "Can Dundee tighten up now 'all the defenders are back'?", "filename": "sport_articles_cy70dzxg0dvo_1747804578.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/05b7/live/85963e70-10b0-11f0-a687-87f1851e5d51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy70dzxg0dvo_1747804578.html", "title": "Can Dundee tighten up now 'all the defenders are back'?", "title_page": "Can Dundee tighten up now 'all the defenders are back'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tony Docherty hopes Dundee can tighten up now he finally has the full complement of defenders he has been \"striving for all season\".\nDespite scoring eight goals in their last three games the Dark Blues have conceded nine and suffered two defeats.\nThat has been a recurring theme for the Premiership's leakiest team, who are currently 11th in the table, just five points off the bottom.\nSpeaking prior to Saturday's visit of St Mirren, Docherty revealed \"we have had a real honest chat in training sessions this week\" about sorting their defensive issues.\nHe added: \"We are sitting top goalscorers in the league, as we were this time last year before the split, behind Celtic and Rangers.\n\"But we have been hampered a lot by injuries, particularly to experienced central defenders. The most pleasing thing for me now is, when I took training today everybody is back, all the defenders are back.\n\"Over the season I have missed Joe Shaughnessy for 31 appearances, Clark Robertson for 22, (Antonio) Portales for 11, (Billy) Koumetio for five, Jordan McGhee for 10. Trevor Carson comes into that and Ziyad Larkeche as well, so that hampers you, those injuries.\"\nDundee's season was summed up by their heartbreaking defeat at home to Rangers last weekend as they squandered a two-goal lead in the final 15 minutes to lose 4-3.\n\"I think you have seen all season, particularly in our last two league performances, how brave we are as a team, how front foot and attacking we are,\" said Docherty.\n\"But behind the ball is what has let us down, that is where we need to find further improvements.\n\"I always think the answers are in the building. They have been in the building but they have been in the treatment room, but now they are on the training pitch and that is where we hopefully can change really positive performances into positive results.\"", "url": "https://www.bbc.com/sport/articles/cy70dzxg0dvo"}