{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 05:41:18", "date_modify": "2025-05-21 05:41:18", "date_publish": "2025-02-08 21:19:57", "description": "It was a finale that defied logic and order, but, for the first time in a long time, England found a way through the final-quarter maelstrom to victory.", "filename": "sport_rugby-union_articles_cew5qnwpnd8o_1747806078.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/73b6/live/50210e80-e65f-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cew5qnwpnd8o_1747806078.html", "title": "Six Nations: England pluck victory from chaos against France", "title_page": "Six Nations: England pluck victory from chaos against France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Make some noise for your England!\"\nThe pitchside hype man needn't have worried.\nThe 81,000 inside Allianz Stadium had been doing exactly that for the final rounds of an epic, see-sawing contest and weren't about to stop as Maro Itoje, Tom Curry and their battle-battered team-mates used their last drop of energy to salute the stands.\nThere was jubilation, vindication and a fair bit of relief in the decibels.\nEngland fans are used to their teams putting them through the wringer.\nThree tries in the final 10 minutes? The lead swapping hands faster than an ambidextrous dog-walker? This is standard fare in the wild, wild south-west of London nowadays.\nThe last Six Nations match here was a victory over Ireland settled by a Marcus Smith drop-goal at the death.\nIn the autumn, George Ford was the width of a post from doing the same to New Zealand.\nA week later against Australia, the Wallabies won a 79-point, 10-try rafter-ripper on the final play.\nSome of the Twickenham scripts would have been shredded as too outlandish by a telenovela writers' room.\nBut, after six defeats in their past seven Tests, an England victory was the oh-so welcome twist this time around.\nFinally, England have the salve of victory to ease some tired bodies and minds.\nThe hosts' effort and commitment has been evident through that rotten run. Perspiration has come by the gallon. Inspiration coming in far shorter measures has been the problem.\nThere wasn't loads in this performance either.\nFrance, who carried further and made more line breaks, were the more consistently dangerous.\nThey were also criminally - and crucially - casual in their handling. Louis Bielle-Biarrey, scorer of two tries, butchered another with a nonchalant pass slung over the top of Peato Mauvaka.\nDamian Penaud juggled and spilled a dolly.\nEven in the build-up to their opening try, Mauvaka carelessly dropped the ball out his back pocket.\n\"We got the oopsies, didn't we?\" said France defence coach Shaun Edwards afterwards.\n\"Every time we got near the tryline, we seemed to just drop the ball.\n\"I've never seen that happen before. The French lads are normally magnificent handlers of a rugby ball.\"\nThe oopsies might translate to some rather sterner, sweary debrief behind closed doors.\nNone of that will matter to England though.\nFor once, the what-ifs are for someone else to chew over.\nBeauty is in the eye of the beholder and, for them, this guts-and-grit victory will look beautiful from every angle.\nIt wasn't a cunning plan coming together.\nThe final quarter, with momentum sloshing one way then the other, was too chaotic for that. It resisted order and planning.\nAll England could do was attempt to cling on and find a way. It called for bloody minds inside cool heads.\nAnd with the clock clicking past 79 minutes England, with their replacements and rookie fly-half to the fore, delivered.\nJamie George found fellow finisher Ollie Chessum with a knee-knocker of a line-out throw.\nCentre Ollie Lawrence fixed the first pod of defenders.\nFin Smith delayed his pass a crucial microsecond to allow Elliot Daly, gleaming in his fresh white shirt having only left the bench three minutes earlier, to slice through on a delicious wrap-around line.", "url": "https://www.bbc.com/sport/rugby-union/articles/cew5qnwpnd8o"}