{"authors": ["John Haughey", "www.facebook.com"], "date_download": "2025-04-26 07:35:54", "date_modify": "2025-04-26 07:35:54", "date_publish": "2025-02-27 15:03:24", "description": "Great Britain's double Olympic relay medallist Sam Reardon joins an already strong entry list for the Belfast Irish Milers Meet on 10 May.", "filename": "sport_athletics_articles_cwyjjkj4vy4o_1745652954.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/397c/live/466057f0-f507-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_cwyjjkj4vy4o_1745652954.html", "title": "Belfast Irish Milers Meet: GB's double Olympic medallist Sam Reardon to run at May event", "title_page": "Belfast Irish Milers Meet: GB's double Olympic medallist Sam Reardon to run at May event - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Great Britain's double Olympic relay medallist Sam Reardon has joined an already strong entry list for the Belfast Irish Milers Meet on 10 May.\nHis fellow Great Britain Olympic team-mate Phoebe Gill will lead the entries for the World Athletics Continental Tour meeting after her stunning performance at the Belfast event last summer.\nReardon, 21, was part of Great Britain's quartet that clinched third place in the mixed 4x400m relay final at last year's Paris Olympics and also helped his country secure bronze in the men's 4x400m relay at the Games.\nThe Londoner, who runs for the Blackheath & Bromley club, was a late call-up to the GB Olympic relay squads after smashing his 400m personal best when clocking 44.70 seconds at the London Diamond League meeting a week before the Games.\nThat performance cut 1.29 seconds off his previous fastest 400m produced at the Morton Games in Dublin earlier in July.\nReardon was fifth in the 800m final at the 2022 World Under-20 Championships in Colombia and has a 1:45.95 personal best for the longer distance but after combining the two events, opted to concentrate on the 400m last season.\nHis opponents at the Mary Peters Track will include Ireland internationals Jack Raftery, Callum Baird and Sean Doggett while event director Eamonn Christie is also holding out hope that recent national indoor champion Conor Kelly could be a late addition to the 400m field.\n\"It's great that an athlete of Sam's calibre, a double Olympic medallist, is keen to run at my meet and he knows full well he'll be coming to a track and a meet where fast times have been run in recent years,\" said Christie.", "url": "https://www.bbc.co.uk/sport/athletics/articles/cwyjjkj4vy4o"}