{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-04-26 03:50:39", "date_modify": "2025-04-26 03:50:39", "date_publish": "2025-03-05 12:34:19", "description": "Swansea City: A point gained at Preston but Swans will want more", "filename": "sport_football_articles_c2kg1w371jlo_1745639439.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb87/live/d4d600d0-f9bb-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c2kg1w371jlo_1745639439.html", "title": "Swansea City: A point gained at Preston but Swans will want more", "title_page": "Swansea City: A point gained at Preston but Swans will want more   - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The ultimate goal for Alan Sheehan is to become a manager in his own right, whether that is at Swansea City or elsewhere.\nHis short-term target is to ensure that whoever is in charge at Swansea come the summer is preparing for another season in the Championship.\nSwansea edged a little closer to guaranteeing survival on Tuesday night, with a battling draw at Preston North End ensuring the Welsh side are 10 points clear of the relegation places with 11 league games remaining this season.\nThe performance at Preston was not particularly convincing, but the result was a plus.\nSwansea have another point on the board - making it an impressive four from two games under caretaker boss Sheehan - and have maintained momentum heading into Saturday's home game against Middlesbrough.\nHaving bemoaned the \"difficult\" conditions at Preston, Sheehan will look forward to returning to the Swansea.com Stadium, scene of a thumping win over Blackburn Rovers in his first game in charge 11 days ago.\nSwansea outplayed a high-flying Rovers side, with their energy and desire producing plenty of forward momentum and three goals.\nIt looked in the early stages at Preston as if Sheehan's Swansea might once again be the dominant attacking force, only for the home side to seize control of the contest before finishing up frustrated that they had not won.", "url": "https://www.bbc.co.uk/sport/football/articles/c2kg1w371jlo"}