{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:08:14", "date_modify": "2025-05-21 04:08:14", "date_publish": "2025-01-15 10:20:16", "description": "Arsenal vs Tottenham: Mikel Arteta wants 'best atmosphere Emirates has seen' for Spurs visit", "filename": "sport_football_articles_c17ededx4w2o_1747800494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/64ee/live/31761b20-d321-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c17ededx4w2o_1747800494.html", "title": "Arteta wants 'best atmosphere Emirates has seen' for Spurs visit", "title_page": "Arsenal vs Tottenham: Mikel Arteta wants 'best atmosphere Emirates has seen' for Spurs visit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikel Arteta has called for Arsenal supporters to create \"the best atmosphere that the Emirates has seen\" for his side's vital north London derby against Tottenham on Wednesday evening.\nThe Gunners welcome their local rivals to Emirates Stadium on the back of consecutive home defeats which risk derailing their season - against Newcastle in the first leg of their Carabao Cup semi-final and an FA Cup third-round penalty shootout to Manchester United.\n\"There are a lot of things that happen which are very difficult to control and to understand,\" Arteta said. \"But there are ones that are in our hands. Let's create the best atmosphere that the Emirates has seen. This is something that is in our hands. And if we want it, we will create it.\n\"The players and staff are the first ones to embrace that and hopefully the fans will follow us because it is crucial for Tottenham and the rest of the matches this season.\n\"I cannot describe how much it helps the narrative, and the energy across the club. We have experienced it before: a negative one and a positive one. And what was the outcome? So it is our choice.\"\nPressure on Kai Havertz to rediscover his goalscoring form will increase after it was confirmed Gabriel Jesus will have surgery on an ACL injury.\nThe Germany international has scored 12 times across 27 matches this season but missed key chances against both Newcastle and Manchester United.\n\"What Kai brings to the team, like many other players this season, hasn't been as prolific in terms of the numbers we have scored,\" Arteta said. \"But they produce incredible things for the team, and certainly Kai is one of them.\n\"In terms of goals, if you look at the past 10 years, apart from (Cristiano) Ronaldo and (Lionel) Messi, there is not a single player who has been stable with expected goals and finishing quality.\n\"It's very volatile.\"", "url": "https://www.bbc.com/sport/football/articles/c17ededx4w2o"}