{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 04:12:30", "date_modify": "2025-05-21 04:12:30", "date_publish": "2025-04-06 10:18:20", "description": "Performances fuel Dundee belief, says Simon Murray after double against St Mirren", "filename": "sport_articles_cz95e1g5pvdo_1747800750.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1271/live/1bf9d220-12d0-11f0-b016-9502dca93ab5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz95e1g5pvdo_1747800750.html", "title": "Performances fuel Dundee belief, says Simon Murray after double against St Mirren", "title_page": "Performances fuel Dundee belief, says Simon Murray after double against St Mirren - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee's recent performances have fuelled belief they can avoid the drop from the Scottish Premiership, says Simon Murray.\nMurray, 33, scored twice in Saturday's 2-0 victory over St Mirren, giving the second-bottom side an eight-point cushion over St Johnstone.\n\"It's the performances over the last few weeks we have taken our confidence from,\" said Murray, who has 21 goals for the season including 15 in the league.\n\"At the same time we can't get carried away and need to keep doing the things we have been in recent weeks - that continuity of performance levels in recent weeks.\"\nMurray scored the opening goal within the first two minutes at Dens Park and added a second after the break.\n\"We have been starting games well over the past month to six weeks,\" added Murray. \"We just had to concentrate on our performance. We just had to start the game well and we did.\n\"We have the threat going forward but defensively I thought that was probably the best we have been this season.\n\"We know how good a team St Mirren are. We knew the importance if starting the game well.\"", "url": "https://www.bbc.com/sport/articles/cz95e1g5pvdo"}