{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-20 12:37:26", "date_modify": "2025-05-20 12:37:26", "date_publish": "2023-08-03 19:20:20", "description": "Jac Morgan prepares to lead Wales against England on Saturday having been earmarked for the job from an early age.", "filename": "sport_rugby-union_66394782_1747744646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11154/production/_130627996_cdf_040223_be_wales_v_ireland85.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66394782_1747744646.html", "title": "Jac Morgan: Destiny calls for new Wales captain", "title_page": "Jac Morgan: Destiny calls for new Wales captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is almost destiny that has brought Jac Morgan to the Wales captaincy.\nBorn in the same valley as one of the most respected and beloved of Wales leaders, this young and dynamic back-row has been earmarked for the armband from an early age.\nYet curiously it would be a word from a referee that would ultimately swing it.\nNow his first game as skipper comes against England in Cardiff - just as it did for Cwmtwrch native, Clive Rowlands, 60 years ago.\nThat he should lead Wales just days after Rowlands died adds even greater poignancy to his appointment.\nMorgan was born and bred in nearby Brynamman but with no junior side in the village for his age at that time, he went to play for Cwmtwrch.\n\"It means so much. I was fortunate enough to know Clive for years. I played with his grandson for Cwmtwrch juniors,\" said 23-year-old Morgan.\n\"Every Sunday, Clive would be down watching us boys play and had a great effect on us all. He was such a role model and what he's done for the village has been brilliant. It has been great to know him.\"\nHailing from the same school as Wales' all-time leading try-scorer Shane Williams - Ysgol Dyffryn Aman - Morgan has been on a seemingly relentless rise since those days playing in the Amman Valley, brushing off disappointments like opponents on the pitch.\nHe led Wales at under-18s and 20s level but was forced to switch from Scarlets to Ospreys following a contract dispute. He duly led the United Rugby Championship for turnovers in his debut senior season.\nHis potential was immediately recognised by Mike Ruddock, Ospreys development director and the man who famously delivered a Grand Slam in 2005.\n\"Jac has the potential to just keep growing and improving. He is still a young fella and without realising it, he has fantastic leadership qualities already,\" said Ruddock previously.\n\"He gives everything on the pitch and in training and earns respect. People will follow a guy like that.\n\"Things will come to him over time. If a coach puts his faith in him, I'm sure Jac can go to a completely new level.\"\nWarren Gatland has done just that, handing Morgan the first chance to stake a claim to the job at this year's World Cup in France on only his 10th Test appearance.\nGatland made a similar move in 2011 by making Sam Warburton the youngest captain in World Cup history, aged 22, and sees parallels between the pair.\n\"Jac is a good man, he's humble and though he doesn't say a lot, a bit like Sam Warburton, he does his talking on the pitch and leads by example,\" said the head coach.\n\"He's really well respected in the squad and that's a huge positive about him.\"", "url": "https://www.bbc.com/sport/rugby-union/66394782"}