{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:25", "date_modify": "2025-05-21 06:51:25", "date_publish": "2025-03-29 22:15:29", "description": "Antrim see off Clare 3-10 to 1-11 to secure the Camogie League Division 1B title at Abbottstown.", "filename": "sport_articles_cd9ldndkvk3o_1747810285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1784/live/fcd96650-0ce7-11f0-82e8-fdb57158af15.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd9ldndkvk3o_1747810285.html", "title": "Antrim see off Clare to secure Division 1B title", "title_page": "Camogie League: Antrim see off Clare to secure Division 1B title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three first-half goals into the wind proved crucial as Antrim defeated Clare 3-10 to 1-11 to clinch the Camogie League Division 1B title at Abbotstown.\nThe Ulster county led by two at the interval, 3-03 to 1-07, and kept the scoreboard ticking over to ultimately prevail by five.\nCaitrin Dobbin's sixth-minute goal put Antrim four ahead by that stage and Katie Molloy added the second by blasting into the roof of the net at the beginning of the second quarter.\nCaoimhe Cahill found the net for Clare in the 18th minute but Dobbin pounced on a mis-control by Rachel Daly to grab her second and Antrim's third goal in injury time.\nThereafter it was all about game management for Antrim as they had the elements in their favour.\nThe teams entered the final quarter with the scores level however but the Saffrons found another gear when they needed to, Roisin McCormick, making her first start of the season, landing a couple of frees to go with a score from play.\nCassie McArthur also shot three points from play and sub Eavanne Martin slotted over a beautiful score as Antrim pulled away to secure Division 1B camogie in 2026.\nAntrim: C Graham, C McKillop, K Lynn, C McNaughton, E Coulter, S O'Neill, S Heggarty, A Boyle, N McAtamney, M Kelly, R McCormick 0-03 (2f), D Cosgrove 0-01f, C McArthur 0-03, K Molloy 1-01, C Dobbin 2-01\nSubs: L McNaughton for Dobbin (37), E Martin 0-01 for Kelly (51), E Johnston for Cosgrove (57), J McIntosh for Heggarty (60+1)\nClare: R Daly, S Daly, M Powell, C Queally, L Daly, A Walsh, C Hehir, N Mulqueen, G Carmody, A Anderson 0-01, C Carmody 0-01, Á O'Loughlin, C Cahill 0-01, E Casey 1-01, Z Spillane 0-05f.", "url": "https://www.bbc.com/sport/articles/cd9ldndkvk3o"}