{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:31", "date_modify": "2025-05-21 05:48:31", "date_publish": "2025-01-14 14:00:02", "description": "Tottenham manager Ange Postecoglou says the abuse he received from a minority of Tamworth supporters was \"unacceptable\".", "filename": "sport_football_articles_cjex0pvply7o_1747806511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3db/live/63fd86d0-d279-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjex0pvply7o_1747806511.html", "title": "Ange Postecoglou: Tamworth abuse was 'vile and detestable'", "title_page": "Ange Postecoglou: Tamworth abuse was 'vile and detestable' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham manager Ange Postecoglou says the abuse directed at him by a minority of Tamworth fans was \"vile and detestable\".\nThe Australian was the target of chants from the home fans during Tottenham's 3-0 FA Cup third-round win against the non-league side on Sunday.\nA sold-out crowd of 3,270 filled the Lamb Ground to see Tamworth hold out the Premier League side during normal time, before conceding three in extra-time.\nWhile the majority of fans enjoyed the game in the right spirit, Postecoglou says there was an \"unacceptable\" minority who did not.\n\"Ninety per cent of the crowd were very good and enjoyed the banter. There was 10% who were pretty unacceptable,\" said Postecoglou.\n\"The stuff I heard was pretty vile and detestable, and getting things thrown at me, not a great experience, but we're expected to be the bigger person.\n\"I would have loved to have turned around and not be the bigger person in that moment, but you deal with it and go on.\"\nFifth-tier Tamworth sit 96 places below Spurs in the football pyramid.\nBut the non-league side held their own during normal time, forcing Spurs to survive a couple of huge scares.\n\"Credit to Andy [Peaks, the Tamworth manager] and his players and the people of Tamworth at the football club,\" added Postecoglou.\n\"I thought they did themselves proud on the day with the way they presented themselves.\"\nBBC Sport have contacted Tamworth and the Football Association (FA) for comment.", "url": "https://www.bbc.com/sport/football/articles/cjex0pvply7o"}