{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-05-21 06:04:26", "date_modify": "2025-05-21 06:04:26", "date_publish": "2025-04-01 15:32:26", "description": "Southampton Q&A: Building for the future", "filename": "sport_football_articles_cn91dd9e4wro_1747807466.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8658/live/dd463850-0e4e-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn91dd9e4wro_1747807466.html", "title": "Q&A: Building for the future", "title_page": "Southampton Q&A: Building for the future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the next part of our special Southampton Q&A, BBC Radio Solent's Adam Blackmore looks at how Saints build for the future.\nStu asked: How do you think, realistically, we build for the future in a sustainable way, so we can re-establish ourselves a solid Premier League team, envied by others for how we operate and the success we have as little old Southampton?\nAdam: This is a good question because so far under Sport Republic it has been feast or famine based on too many knee-jerk decisions under pressure that have either worked out or gone horribly wrong. And that applies to decisions on managers, players and staff and the timing of those decisions.\nThe problem is the fans and us in the media also have a part to play because it is hard to be sustainable and consistent in style and results in the long term if you do not allow for periods when the team has to endure growing pains.\nIf the side goes on a bad run and the manager comes under pressure, you have to hold your nerve if you genuinely think the rough spell is part of the game, and not because of the manager out of his depth.\nSupport for the team or Sport Republic should not be blind, they have to be accountable, and I think we would all buy in to a style and philosophy if they communicated better and did not lurch from a manager with a certain playing style to another with a completely different philosophy.\nHaving said all that, I am hopeful that Dragan Solak and Johannes Spors can put a new, better identity on the club, one that is based on shrewd recruitment and having the right people doing the jobs. I really hope Spors will show why having a proper recruitment expert makes a difference, and Saints get a consistent philosophy.\nToo many cooks have been involved with big decisions in the past two years. There is now a chance of consistency and growth.\nLuke: Do you think there will be a fire sale of players this year? We managed to keep a decent core the last time we were relegated, but with the some of the negative chants from the fans in recent games I am not sure how many will want to stay to get the team back up again.\nAdam answered: I did a recent episode of Goin' Home With Adam And Jo, which you can find on our Southampton page on Sounds, and in this I go into a lot of detail about the summer and what I think should or may happen.\nIn the summer I think the club could move out about a dozen players (sales, loans ending, players out of contract) and still compete at the top of the Championship by only bringing in three or four top signings, rather than eight to 10 average ones. The squad is way too big and needs a big trim!", "url": "https://www.bbc.com/sport/football/articles/cn91dd9e4wro"}