{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:15:16", "date_modify": "2025-05-21 07:15:16", "date_publish": "2025-03-29 07:13:57", "description": "Ulster head coach Richie Murphy praises the character of his side in recovering from 17-0 down early on to defeat the Stormers 38-34 in the United Rugby Championship.", "filename": "sport_rugby-union_articles_cp8v842mejro_1747811716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/285a/live/1c274980-0c27-11f0-a2bd-238d53d7a0f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cp8v842mejro_1747811716.html", "title": "Ulster 38-34 Stormers: Murphy praises Ulster 'character' in comeback win over Stormers", "title_page": "Ulster 38-34 Stormers: Murphy praises Ulster 'character' in comeback win over Stormers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster head coach Richie Murphy praised the \"character\" of his side in recovering from 17-0 down after just eight minutes to edge out the Stormers 38-34 in a thrilling United Rugby Championship game at Kingspan Stadium.\nThe Irish province were on level terms at 17-17 at the break and ended up running in six tries in a bonus-point victory against a South African side reduced to 14 men for much of the second half when skipper Neethling Fouche was sent-off for what was deemed a dangerous challenge on Ulster centre Ben Carson.\n\"It was an incredible game. I'm absolutely delighted with the win - I thought we showed some character,\" Murphy told BBC Sport NI after the game.\n\"Going 17 points down early on, some of it from very good stuff from the Stormers and a couple of mistakes from us, but I thought the lads really rolled their sleeves up and put up an unbelievable performance to get past a very good team.\n\"At times we've played well in spells in different games this season but we put more of it together tonight.\"\nMurphy believes the spirit of his side shone through as they completed three successive wins for the first time this season.\n\"I think you could see the hunger within the lads to fight back to 17-17 at half-time and put us into a good place in the second half.\n\"Five points keeps us in the hunt and looking forward to the next one.\"\nUlster's next game is their Investec Champions Cup last-16 meeting with Bordeaux-Begles in France on Sunday 6 April.", "url": "https://www.bbc.com/sport/rugby-union/articles/cp8v842mejro"}