{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:38", "date_modify": "2025-04-26 06:31:38", "date_publish": "2025-02-27 08:40:04", "description": "Man Utd 3-2 Ipswich: Fan views on Premier League game", "filename": "sport_football_articles_cy0555q0jjno_1745649098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy0555q0jjno_1745649098.html", "title": "Man Utd 3-2 Ipswich: Fan views on Premier League game", "title_page": "Man Utd 3-2 Ipswich: Fan views on Premier League game  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Manchester United's Premier League match against Ipswich.\nHere are some of your comments:\nMan Utd fans\nPeter: Not the start you'd hope for but after a little while Manchester United took control and played the best football for a long while. The sending off changed the game and it was all about heart and the will to fight which they showed in abundance.\nPaul: After I've made various comments about team performances and lack of effort, it's nice to get a win with a fighting performance when down to 10 men. But can I please make a request to Ruben Amorim to please, please drop Andre Onana he's just not of a standard for the Premier League.\nMike: Slightly better than previous games but against Ipswich, it should have been much better. Can't understand why Rasmus Hojlund wasn't taken off instead of Alejandro Garnacho.\nIpswich fans\nLindsey: We're just not quick enough or good enough in the last phase. I don't understand why Ipswich weren't trying to ping more balls into the box. Such good play on the counter then we just stop.\nOli: The stage was set and what a great opportunity that 2nd half could have been for Ipswich. However, their inability to defend a set-piece and being too slow to create anything in attack meant it was another missed opportunity (of which there are very few remaining).", "url": "https://www.bbc.co.uk/sport/football/articles/cy0555q0jjno"}