{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:39", "date_modify": "2025-05-21 04:15:39", "date_publish": "2025-04-05 19:02:27", "description": "Aston Villa 2-1 Nottingham Forest: What Morgan Rogers said", "filename": "sport_football_articles_c2lz09rdgxno_1747800939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7bac/live/7970bac0-1250-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2lz09rdgxno_1747800939.html", "title": "Aston Villa 2-1 Nottingham Forest: What Morgan Rogers said", "title_page": "Aston Villa 2-1 Nottingham Forest: What Morgan Rogers said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa attacking midfielder Morgan Rogers has been speaking to Sky Sports about the win: \"It's a nice moment. We knew it was a big game. They are doing really well in the league and they are a difficult team to play. We knew we had to start fast and we knew it was a must-win if we want to get where we want to get in the Premier League.\n\"We were outstanding and deservedly got in front. We knew they would come back into it. They have got that quality, but withstanding their pressure was massive for us.\"\nOn the impact of the January signings: \"That's what football is all about. The January signings have proved massive for us. We knew it was going to be important if we wanted to compete in the second half of the season, in all three competitions.\n\"We have made changes, but we all know our jobs. We were fully foucsed and the players who have come in have been outstanding. It was a good performance all around.\"\nOn his goal: \"I saw Morato not looking and, once Youri Tielemans got the ball, I had to make the move. He has the quality to pick me out from anywhere. I knew I had to make sure the first touch was right to get the opportunity. It fell perfectly and I'm happy to put it away.\n\"You could hear the crowd when the ball was coming over the top, so I had to be calm and composed.\"\nOn facing Paris St-Germain next: \"It's going to be a massive game. It's surreal to be in that game. We will go there with confidence because we are playing well at the moment.\n\"They are one the best teams in the world, there is no denying that. We are in the quarter-finals for a reason. We will go there and try to win the game as always and see where it takes us. I'm looking forward to it.\"", "url": "https://www.bbc.com/sport/football/articles/c2lz09rdgxno"}