{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:55", "date_modify": "2025-05-21 06:31:55", "date_publish": "2025-01-22 20:09:07", "description": "Ange Postecoglou press conference: Hoffenheim vs Tottenham preview", "filename": "sport_football_articles_cg5yvev1nmeo_1747809115.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5yvev1nmeo_1747809115.html", "title": "Ange Postecoglou press conference: Hoffenheim vs Tottenham preview", "title_page": "Ange Postecoglou press conference: Hoffenheim vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pape Matar Sarr is not available for the match after picking up \"a slight knock from the weekend\". However, Rodrigo Bentancur should be fit to return.\nHe also confirmed defender Cristian Romero has been back in training but has not travelled with the squad because he could be another \"week to 10 days\" away.\nOn the possibility of Tottenham not signing anybody this window: \"Potentially. The club is working hard to get some help for the players. As far as I'm aware, there's nothing imminent, but in the last week of the window things happen quickly.\"\nThe Spurs boss said the \"reality is, we don't have a lot of choice\" about rotating players as they only have \"about 13 first-team players who have travelled\" to Germany and does not want to just throw \"untried youngsters in there\".\nOn whether cup games have resulted in players taking their eyes off the Premier League: \"No. The players are giving everything every game. This has been a good, solid two months of us relying on a small group of players for every competition. It's great to be in all competitions, but it has a toll. The players are giving everything every game - they are not prioritising anything.\"\nPostecoglou said it is \"not manageable\" to keep a squad strong and healthy when competing in so many competitions: \"All these things take their toll. People may look at us and think it's unique. It is very extreme case, for sure, but I don't think it will be as uncommon as people think as we move forwards. There are warning signs there for others.\"\nOn whether this is a lesson for the club in recruitment: \"Squad numbers will stay the same. If the number of games are increasing then squad sizes should be increasing - that is my belief. It doesn't matter how many, or what strategies you have in place.\"\nHe added: \"The calendar has really ramped up in the past couple of seasons and there is going to be some issues we need to deal with if the game keeps changing this quickly.\"", "url": "https://www.bbc.com/sport/football/articles/cg5yvev1nmeo"}