{"authors": ["Dan George & Lewis Coombes", "www.facebook.com"], "date_download": "2025-05-21 06:48:48", "date_modify": "2025-05-21 06:48:48", "date_publish": "2025-03-28 20:26:55", "description": "American businessman and lawyer Rob Couhig has exclusively spoken to BBC South Today about his continued desire to buy Reading FC.", "filename": "sport_football_articles_c93k3dzvv6ro_1747810128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/000a/live/3c9ee9f0-0c06-11f0-a070-51c1461c0297.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93k3dzvv6ro_1747810128.html", "title": "Rob Couhig: American businessman still wants to buys Reading FC", "title_page": "Rob Couhig: American businessman still wants to buys Reading FC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "American businessman and lawyer Rob Couhig has described his attempts to take over Reading as \"exhausting\".\nThe ex-Wycombe Wanderers owner previously tried to buy the League One club and said that he would still like to do so.\n\"I have never seen or been involved in anything like this ever,\" Couhig told BBC South Today.\nLast week he was involved in a court proceeding where current owner Dai Yongge attempted to get an injunction against Couhig, claiming that he was blocking his attempt to sell the Royals.\nCouhig said that he was not blocking any transaction from being completed.\nThe request for a mandatory injunction by Yongge was not granted by the judge.\n\"Everyone has been consistently mislead in the kindest possible way to say it, by the club,\" Couhig said.\n\"I was never told why my deal never went forward, someone started bad-mouthing me, that happens, but most recently there has been a pressure exerted saying that somehow I am an impediment to a sale.\n\"The idea that the situation is close to closure but for Couhig is, as far as I can tell, the furthest thing from the truth.\n\"My reputation means a lot to me, people don't always love me but they always know they get the truth from me, that's what bothered me a little bit.\"\nIn a statement on Thursday, external, the club said that \"regarding the ongoing litigation case with Mr Couhig\" it was offering a proposal to him that it hoped would resolve the impasse between the parties, and help facilitate the sale of the club.\nBack in March 2024 Yongge committed to a letter of intent and since then a number of parties have entered into exclusivity as potential purchasers.\nIn recent years the club has been subject to relegation, points deductions and transfer embargos while Reading's women's side withdrew from the Championship to the fifth tier.\nReading have also been forced to sell some of their biggest assets in order to keep the club running.\nCouhig said that if he was able to complete the purchase of the club, it would enable him to embark on a rebuild project.\n\"I love a challenge,\" he said. \"Reading is a challenge of much bigger proportions than most people realise, when you start to turn the rocks over there are lots of snakes there.\n\"You need to get in there and really work hard and that's what I love doing, the idea of taking a troubled asset, making it better, and then walking away leaving it in better condition, that's what I live for.\n\"It has all the assets necessary to be a club that is customarily in mid-table of the Championship, with the potential of being in the Premier League, that certainly is not out of the realms in a three-to-five-year deal, it would be hard but it can be done.\"", "url": "https://www.bbc.com/sport/football/articles/c93k3dzvv6ro"}