{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-20 12:13:46", "date_modify": "2025-05-20 12:13:46", "date_publish": "2023-08-04 17:28:26", "description": "Great Britain continue their excellent start to the Cycling World Championships in Glasgow, winning four gold and five silver medals on day two.", "filename": "sport_cycling_66401331_1747743226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E246/production/_130662975_jodycundy.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66401331_1747743226.html", "title": "UCI Cycling World Championships 2023: GB win four gold and five silver medals on day two", "title_page": "UCI Cycling World Championships 2023: GB win four gold and five silver medals on day two - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain continued their excellent start to the Cycling World Championships in Glasgow, winning four gold and five silver medals on day two.\nAll nine medals were won by Para-cyclists, including Jody Cundy who clinched a 14th consecutive world title in the men's C4 1km time trial.\nThere were British one-twos in the men's C3 1km time trial, the men's B 1km time trial and women's B individual pursuit.\nBritain's medal total now stands at 14.\nOver the opening two days GB have won six golds, six silvers and two bronzes.\nNeil Fachie and Matthew Rotherham won Britain's first gold of the day, finishing 0.042 seconds ahead of team-mates James Ball and Steffan Lloyd in the men's B 1km time trial.\nSophie Unwin and Jenny Holl, who won the B 1km time trial on day one, took gold in day two's penultimate event, defeating British Paralympic champion Lora Fachie and pilot Corrine Hall in the B individual pursuit final.\nIn the C3 1km time trial, British defending champion Jaco van Gass won gold by finishing 0.236 seconds ahead of compatriot Fin Graham.\nGB's Daphne Schrager won silver in the women's C2 individual pursuit and Frances Brown claimed second in the women's C1 500m time trial.\nThere was seemingly a medal won in every event in the first half of Friday's evening session as Great Britain dominated the Para-cycling schedule.\nThe gold rush was triggered by Cundy and Fachie, with the two Britons boasting 40 world titles between them.\nCundy, 44, finished over a second ahead of Australia's Michael Shippley in the C4 1km time trial.\nThe eight-time Paralympic champion in cycling and swimming now has 23 world titles across both sports.\nIn the men's B time trial, Fachie and pilot Rotherham took gold after a tense final 750 metres, delivering Fachie his 17th world title.\nThe pair, who won the Commonwealth title for Scotland together in 2022, were off the pace with a lap to go but managed to edge ahead of compatriots Ball and Lloyd who took silver.\nBritain's Sophie Capewell, who won silver in the team sprint on Thursday, finished fourth in the women's elite 500m time trial - 0.122 seconds off a bronze medal.\nGB also missed out on bronze in the men's elite team sprint, narrowly losing out to France.", "url": "https://www.bbc.com/sport/cycling/66401331"}