{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 08:09:21", "date_modify": "2025-04-26 08:09:21", "date_publish": "2025-02-26 13:21:49", "description": "'Europe key to United's hopes of keeping Dalby'", "filename": "sport_articles_ce8vj5vp30do_1745654961.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a14/live/d2f97f40-f442-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ce8vj5vp30do_1745654961.html", "title": "'Europe key to United's hopes of keeping Dalby'", "title_page": "'Europe key to United's hopes of keeping Dalby' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Is Sam Dalby the signing of the season?\nHis goal against Motherwell at the weekend, to get Dundee United back to winning ways, aptly summed up the English striker's importance to this Tannadice side.\nHe tops the Premiership scoring charts with 12 goals - not a bad return from 24 league appearances. With 47 shots, Dalby boasts an accuracy rate of 55% and conversion rate of 26%.\nHe has been a key factor behind what has been an excellent campaign so for United. As he continues to add to his impressive stats the discussion about where his long-term future lies will continue.\nOn loan from Wrexham until the end of the campaign, when he also becomes a free agent, the 25-year-old will not be short of suitors – many of whom will be able to offer him greater riches than United can.\nBut one thing the Tangerines could have in their favour come the summer, which most (if not all) of those other teams eyeing Dalby won't, is the potential lure of European football.\nIf Jim Goodwin's team can land that prize it would certainly give their star striker plenty of food for thought.\nUntil now, Dalby has spent most of his career at clubs who won't get near the continental stage.\nShould that be an option with United next season, it could be a big factor when Dalby decides where his future lies.", "url": "https://www.bbc.co.uk/sport/articles/ce8vj5vp30do"}