{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:43", "date_modify": "2025-05-21 04:05:43", "date_publish": "2025-02-09 14:49:59", "description": "Wolfhounds moved four points clear at the top of the Celtic Challenge table after surviving a late scare to beat Gwalia Lightning.", "filename": "sport_rugby-union_articles_czrlxdj0em4o_1747800343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee43/live/8804e130-e6f2-11ef-81dc-2fe0c254f6bb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_czrlxdj0em4o_1747800343.html", "title": "Wolfhounds edge Gwalia Lightning in tight Celtic Challenge match", "title_page": "Wolfhounds edge Gwalia Lightning in tight Celtic Challenge match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolfhounds moved four points clear at the top of the Celtic Challenge table after surviving a late scare to beat Gwalia Lightning 21-15.\nAfter a scoreless first 20 minutes, the game burst into life as Wolfhounds scrum half Katie Whelan stretched the ball over the try-line having found a gap on the edge of the ruck.\nGwalia hit back immediately, first through a Carys Hughes penalty, and then Jenny Hesketh's try in the corner.\nBut Wolfhounds were ahead once more before half-time, this time the forwards enjoying success before Meabh Clenaghan powered her way over.\nWolfhounds moved 21-8 ahead when replacement Katie Corrigan scored the Irish side's third try of the game on 52 minutes.\nLightning huffed and puffed to find a way back into the game, and set up a grandstand finish when loosehead prop Maisie Davies scored their second try of the game with 10 minutes remaining.\nThe Welsh side kicked to the corner with a minute left, trailing by six points, and got to within a metre of the Wolfhounds try-line as the clock went red.\nBut as Alaw Pyrs crossed for what could have been a match-winning try, she was excellently held up by Wolfhounds, who in doing so secured the win.\nLightning do pick up a losing bonus point to go four points behind Wolfhounds in second place, as they lose for just the second time in this year's competition.", "url": "https://www.bbc.com/sport/rugby-union/articles/czrlxdj0em4o"}