{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:20", "date_modify": "2025-05-20 14:07:20", "date_publish": "2023-07-31 00:00:00", "description": "Reaction and highlights after England beat Australia by 49 runs to draw Ashes in thrilling style.", "filename": "sport_live_cricket_64959416_1747750040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0257/production/_130599500_broadpa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_64959416_1747750040.html", "title": "The Ashes LIVE: England vs Australia, fifth Test day five, Kia Oval", "title_page": "The Ashes LIVE: England vs Australia, fifth Test day five, Kia Oval - score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England win to level Ashes series at 2-2\nWhat a day and what a series! England win by 49 runs to ensure the series finishes all square at 2-2 and deny Australia a first away Ashes series win since 2001.\nBut that only tells you a fraction of the story...\nThe day started with England needing 10 wickets and Chris Woakes got them started when he removed David Warner - and then Usman Khawaja - in a fabulous opening spell.\nHowever, after losing three wickets in the first hour, Australia fought back through Steve Smith and Travis Head.\nWhen Ben Stokes' dropped Smith as he went to throw up the ball in celebration just before lunch, it looked like it wasn't going to be England's day...\nThe afternoon session was wiped out by rain but when play did resume, England were refreshed and a stunning spell saw them take four wickets for 11 runs in 19 balls.\nTwo each for Moeen Ali and Woakes with Smith among those to depart...\nThere was only one man who was going to finish it off for England, though.\nStuart Broad capped off a staggering career with his 603rd and 604th wickets in his last Test to seal the victory.\nThe first came after a bit more bail switching magic before he brought down the house with the match-clinching wicket of Alex Carey.\nEngland win, Ashes series drawn and Broad rides off into the sunset...\n'What Broad has achieved should never be forgotten'\nEngland's skipper Ben Stokes, speaking to BBC Sport about Stuart Broad:\"If you went to a bookies and asked that Stuart Broad is going to change the bails twice, you're going to get very good odds.\n\"This isn't the only ground where someone has retired and had an unbelievable day. That's Broady's career isn't it. He's more than a moments cricketer, it was written in the stars for him so bringing him on with the two left-handers out, this was his moment.\n\"There were so many plays and misses. I just told him: 'Don't get greedy and keep bowling the same ball and you will get the wicket.'\n\"I've played 97 games and there's a small handful of those that I've not been on the field with Broad, there's a lot of emotion knowing we're not going to walk out on the field together but that bloke has been incredible for England, the longevity of his career and what he has achieved should never be forgotten. I'm so glad that a lot of his friends and family were here to witness what happened today.\"\n'We talked the talk and walked the walk'\nEngland's skipper Ben Stokes speaking to BBC Sport: \"I think it's a fair reflection of two very, very good teams in a five-match series to be honest. Australia, World Test champions, full of quality players, coming up against a team that has been rejuvenated over the last 18 months.\n\"Completely different styles of cricket but each team tried to play the cricket which brought the best out of them as individuals and as a team. I think the series as a whole in terms of spectatorship and everything like that is what Test cricket needed. It's been an unbelievable series that has gone back and forth throughout.\n\"I think going 2-0 down in an Ashes series, I don't think many teams would be able to find a way back from that to not lose the series. It's all about mentality and mindset that we try to bring into this.\n\"Being in a do or die situation, most teams can shy away from it and hope that the results are going to go their way whereas we knew we had to try and force it from the second game onwards.\n\"You can look back and say a few things went our way and a few things went Australia's way. Hand on heart, I think 2-2 is a fair reflection of where the two teams are at in this moment.\n\"I think when I took over, to be stood here and be 2-2 going toe to toe with an unbelievable team, to think we would be stood here talking about this now from where we were quite some time ago is pretty special and you have to give a huge amount of credit for the way the team has responded.\n\"When I took over I had a clear message and clear way with how I wanted us to operate with our cricket and that lead us to this. The way we have played has reflected that.\n\"We didn't shy away from the momentous event the Ashes is and we talked the talk and we've also walked the walk out there, I'm very proud of this whole team and what they have accomplished over these weeks.\"\n'Proud but we fell a bit short of our goal'\nAustralia captain Pat Cummins, on whether 2-2 is a fair result: \"I think so. It was a two high-quality teams. It seemed like every session we shared the honours. 2-2 does seem fair and it was a wonderful series to be a part of.\n\"Drawing didn't even enter the conversation. From the start we said we were over here to win the Ashes. That is why we all start playing cricket, you want to play Tests and be out there for the last ball. It wasn't to be.\"\nOn if he has mixed emotions: \"In some ways. We can be hugely proud of retaining the Ashes. It's no easy feat against a high-quality England in their own conditions. But of course we wanted to come over here and win. It is a similar group to 2019 and we just fell a little bit short of the goal.\"\nProud of his players: \"There were so many moments throughout this series. I think that is what makes playing in an Ashes, particularly away from home, so difficult. It is not just what happens on the field but the crowd and the media. You get everything thrown at you. It's great, you wouldn't want it any other way. I'm really proud of how we've held strong. We've been pretty consistent throughout.\"\nOn key moments: \"You can probably find 100 and the other team would be the same. There's no point, the score is 2-2.\"\nOn Stuart Broad: \"He's been a great competitor. He always seems to save his best for Australia. There are plenty of flat days in Australia and you've got to grit your teeth and he just keeps running in. I think I've played a third of the games he's played and I can't fathom playing that many. Huge congratulations. I've loved playing against him. I wish him all the best.\"\n'Written in the stars' for Broad\nMore from Ben Stokes: \"I've played a lot of cricket and you know what it's like in fourth-innings chase. Australia got off to a good start and they played incredibly to walk off none down but turning up on the final day knowing they need 250 is always tough. The pressure should never be underestimated. The wickets came in clusters and that tends to happen. It was do or die again and that seems to suit our mentality and the way we go about cricket.\"\nOn Chris Woakes and Mark Wood: \"The way in which Woakesy has come in, not just with the ball but crucial runs down at eight, has been really good for us. Woody has put some unbelievable performances in the first two games but he could barely walk yesterday and today. He did an unbelievable job to show he wasn't sore and to run in like he did in those spells gives a huge testament to the warrior that is inside him. He just kept saying 'throw me the ball' and I'll run in as hard as I can and having people like that in your team is great to have.\"\nOn Stuart Broad: \"I've played with him for a long time. He has been an unbelievable performer for England over a long, long time. It was written in the stars he'd take last wicket with two left-handers.\"\nOn Moeen Ali: \"He came in because of an unfortunate injury. I chose him because I knew what he could do on his good days and when it really mattered he's produced one of his best days as an England player. He changed the game for us. To put in those performances has been incredible. We'll let him reflect on everything in the last six weeks and leave him to decide.\"\n'My lasting memories will be of pure joy and pure happiness'\nEngland's Stuart Broad speaking to BBC Sport: \"That was really special, we were just smiling upstairs. Harry Brook came to me and was like: \"Can you believe your last ball went for six and you got a wicket with your last ball.\" It was really cool.\n\"In the rain break I thought two great friends of mine who I have played so much great cricket with, Chris Woakes and Moeen Ali, were just magnificent. Breaking that game open.\n\"I think particularly Steve Smith's wicket has been a thorn in our side for many years, to get him was a real sort of moment when The Oval started to believe and the team started to believe they could do something. Woakes has bowled an amazing spell and then I came on and the ball was still swinging so it felt quite nice to bowl and great to pick up a few wickets on the back end and help seal an Ashes win.\nOn the bails trick: \"I've honestly just made it up in this game. I wish I would've started it ten years ago. I had a few play and misses, especially to Travis Head and because it was swinging away from the left-hander so I thought I would change the bails again and it managed to nick the next ball. It's absolute nonsense, maybe I should've tried it years before.\n\"It's special, it's always a difficult decision to walk away from a game you love but ultimately I wanted my last ball and my last bat to be playing in an environment that's so special and playing a sport that I still have a huge hunger for and I still love to bits because my lasting memories will be of pure joy and pure happiness and that's exactly how I feel right now.\"\n'Today up there with my best moments in Test cricket'\nPlayer of the match, England's player of the series as picked by Australia's Andrew McDonald, and the written press' player of the series, Chris Woakes said: \"It has been an amazing few games, nice to come in and contribute. The belief was there that we could still win at 2-0 down and that is the amazing belief in that dressing room. It's quite fitting that it finishes 2-2 I think really.\n\"I've not been a part of this squad and team for over 12 months so I was desperate to get back in and have a go. When you come into an Ashes series you want to perform and contribute to a team wins and I couldn't have asked for it to go much better really.\n\"Five Tests in six weeks meant it was always in the back of my mind that I might get an opportunity at some point and I didn't know when it was going to come but I just wanted to be as ready as soon as I was. I actually didn't feel in great rhythm when I came in so to deliver at Headingley was probably the most pleasing part.\n\"An early wicket settled the nerves. It calmed me down and from that moment on I did find a bit of rhythm and you need a little bit of luck and thankfully it went alright.\n\"Today is up there as one my favourite moments in the series and probably up there with my best moments in Test cricket. I'm delighted for Stuart [Broad].\n\"It's been nice to get big players in the series. You want to do it on the biggest stage and this is the pinnacle of Test cricket and cricket so it is amazing.\"\nOn the future and playing Test cricket abroad: \"We'll see. I'll leave that to Stokesy and Baz. I know what my record is like at home. I want to play as much cricket as possible for England, that is the main aim. You don't get the feeling like this anywhere else in the world.\"\n'Today spoke to the quality of the series'\nAustralia's player of the series, chosen by England head coach Brendon McCullum, Mitchell Starc said: \"It's been an incredible fie Test matches. There has been ebbs and flows throughout. The way it finished today probably spoke to the quality of the cricket and emotions of The Ashes.\n\"It happened quickly! It was much like the ebbs and flows of the whole series. For it to come down to the final session of day 25 - Stuart [Broad] probably couldn't have wrote it better than that so congratulations to him.\n\"It has been a fantastic tour. I've had good backing and it is a fantastic group to be a part of. We've had a pretty successful tour if you think of the six Test matches that we've played. We're a resilient group. We've got fantastic support staff. It's been a busy eight weeks for both teams but the quality of cricket has been fantastic.\n\"We saw two different brands of cricket and both teams stuck to it and ultimately we're here at 2-2. It is fantastic that Test cricket is thriving and we get the crowds we've had in this series.\"", "url": "https://www.bbc.com/sport/live/cricket/64959416"}