{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 14:33:28", "date_modify": "2025-05-20 14:33:28", "date_publish": "2023-07-28 19:16:56", "description": "England bowler James Anderson says he is ignoring any calls to retire because he \"has a lot more to give\".", "filename": "sport_cricket_66337179_1747751608.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/137B3/production/_130559797_gettyimages-1559846980.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66337179_1747751608.html", "title": "The Ashes 2023: England bowler James Anderson says he has \"no interest\" in retiring", "title_page": "The Ashes 2023: England bowler James Anderson says he has \"no interest\" in retiring - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England bowler James Anderson says he is ignoring any calls to retire because he \"has a lot more to give\".\nEngland's all-time wicket-taker, who turns 41 on Sunday, has taken only five wickets in the Ashes series.\n\"You pray that these lean patches don't come in one of the biggest series you could play in but unfortunately for me that is the case,\" Anderson told Test Match Special.\n\"I've still got another innings to try to do something for the team.\"\nAnderson bowled well on the second day of the fifth Test, but only had the wicket of Mitchell Marsh to show for it.\nEngland dismissed Australia for 295, the tourists taking a lead of 12 runs. England are looking to level the series at 2-2, with Australia seeking a 3-1 win for their first success in this country since 2001.\n\"I felt like today I bowled really well and on another day I could have got a couple more wickets,\" said Anderson.\n\"It felt like I challenged the forward defence a lot, which is what I've tried to do throughout my career.\"\nAnderson came into the series on the back of a groin injury sustained playing for Lancashire.\nHampered by unresponsive surfaces in the first two Tests, he took only one wicket at Edgbaston and two at Lord's as England were beaten on both occasions.\nHe missed England's win at Headingley, played on a lively pitch that would have been more suited to his bowling.\nWhen Anderson returned and took one wicket in the rain-affected draw at his home ground of Old Trafford, he extended a run that has seen him not play in a Test win against Australia since 2015.\n\"I don't feel like I'm bowling badly or losing pace or that I'm on the way out,\" said Anderson. \"I still feel I can offer a lot to this team.\"\nIn the fifth Test at The Oval, Anderson became the oldest man to open the bowling for England in an Ashes Test since Johnny Douglas in 1925.\nSince captain Ben Stokes and coach Brendon McCullum took charge of England last summer, Anderson has taken 50 wickets in 14 Tests at an average of 23.\nHowever, his bowling average in 2023 of 36 is the worst of any calendar in his career since 2007.\nFollowing the Ashes, Anderson's next chance to play a Test for England will not come until the series in India in January.\n\"As soon as you get into your 30s as a bowler, people are asking how long you've got left,\" he said.\n\"But in the past three or four years, I've bowled as well as I ever have. I feel like I've been in so much control, my body has been in a good place, my skills are as good as they ever have been.\n\"The numbers, the wickets, the selection side of it is a completely different issue. If Stokesy and Baz say 'you've not got the wickets we would have liked' then I'd be absolutely fine with that.\n\"In terms of retirement, I've got no interest in going any time soon. I feel like I've got a lot more to give.\"", "url": "https://www.bbc.com/sport/cricket/66337179"}