{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 13:50:34", "date_modify": "2025-05-20 13:50:34", "date_publish": "2023-07-31 20:58:46", "description": "Jessica-Jane Applegate leads home a British one-two-three on the opening day of the Para Swimming World Championships.", "filename": "sport_disability-sport_66366804_1747749034.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/526C/production/_130600112_gettyimages-1583468568.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66366804_1747749034.html", "title": "Para Swimming World Championships: Jessica-Jane Applegate leads British medal sweep", "title_page": "Para Swimming World Championships: Jessica-Jane Applegate leads British medal sweep - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jessica-Jane Applegate led home Bethany Firth and Louise Fiddes for a British one-two-three on the opening night of the Para Swimming World Championships.\nIt was the first global S14 200m freestyle title since 2013 for the 26-year-old from Norfolk.\n\"Ten years is a long time to wait, but it felt absolutely amazing,\" she told BBC Sport.\nHer gold was one of four for Great Britain, with Suzanna Hext, Ellie Challis and Stephen Clegg also winning.\nWilliam Ellard also claimed a silver on his major championship debut in the men's S14 200m freestyle final at the Manchester Aquatics Centre.\nApplegate was thrilled with her performance after a season where she tore a disc in her back and has been suffering sciatic pains, and also had a bout of illness ahead of the championship trials in March.\nBut the 2012 gold medallist, who also has a Paralympic silver and bronze in the event, rolled back the years, finishing in two minutes 9.09 seconds, ahead of Firth (2:10.05) and Fiddes (2:10.36).\n\"I can't quite believe that has happened because I've had a crazy season,\" she added. \"Trials were not great, so I am lucky to even be here.\n\"But after that I gave my training absolutely everything and I am so relieved it has paid off. But that last length was excruciating and I knew in the last 25m I had to find something extra.\"\nHext claimed her first world title in the S5 50m freestyle, finishing strongly in 36.71 ahead of Ukraine's Iryna Poida (36.73), after only coming out of hospital on Saturday.\nThe 34-year-old, paralysed after a horse riding accident in 2012, has struggled with illness and injury in recent times but admits her life has been transformed by receiving bilateral cochlear implants, which she was able to use in competition for the first time in Manchester.\n\"It felt strange in some ways coming out and hearing the crowd, but it lifted me for the final and hearing that roar pushes you that bit more and it definitely meant a lot being able to wear them,\" said Hext.\n\"I have been through a lot and have learned to deal with everything that gets thrown at me. You learn to bounce back and keep going and find ways to adapt - and everything I have been through has taught me something.\n\"It hasn't been easy but a gold medal here is pretty amazing.\"\nClegg retained his S12 100m backstroke title in 1:00.13 edging out rival Raman Salei, of Azerbaijan, who finished 0.70 behind, but the 27-year-old Scot will not be able to celebrate as his main 100m butterfly event follows on Tuesday.\n\"I'm glad my two big races are at the front end of the week,\" he said. \"But the job isn't finished until day six for me so I have to keep going.\n\"I would have liked to have gone a bit faster today. I maybe went off a bit too hard and felt it in my legs at the end. But after an up-and-down season I am happy to come here and retain my title.\"\nChallis also retained her SB2 50m breaststroke title at the start of a busy week where she will compete in six events.\nThe 19-year-old held off German Tanja Scholz, 39, to win gold - but missed out on beating her own world record of 1:04.33 by 1.39 seconds.", "url": "https://www.bbc.com/sport/disability-sport/66366804"}