{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:46:59", "date_modify": "2025-05-20 14:46:59", "date_publish": "2023-07-27 16:50:15", "description": "The 1958 Group, a Manchester United fan protest organisation, tells BBC Sport about its concerns over the continued involvement of the Glazer family.", "filename": "sport_football_66322345_1747752419.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10F10/production/_130529396_gettyimages.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66322345_1747752419.html", "title": "Man Utd takeover: Fan protest group fears 18-month process", "title_page": "Man Utd takeover: Fan protest group fears 18-month process - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Manchester United fans' group leading the current protests against the Glazer family's ownership of the club says any continued long-term involvement by the Americans at Old Trafford would leave \"a bitter taste\".\nNegotiations around the potential sale of Manchester United are still taking place, with Qatari banker Sheikh Jassim bin Hamad Al Thani submitting a fifth bid for 100% of the club last month.\nRival bidder Sir Jim Ratcliffe's Ineos Group is willing to secure a majority stake, which would allow current owners the Glazer family to retain representation in some capacity.\nThe 1958 Group is the fan organisation that arranged a number of 'strategic' protests against the Glazers at matches last season, including the EFL Cup final and FA Cup final. This summer, it held another at Old Trafford to coincide with United's kit launch.\nTwo leading members spoke to BBC Sport on the condition of anonymity, refusing to be named, they say, to stop their message being diluted.\nAmong their views were that some fans would be \"happy\" to see the club relegated from the Premier League if it meant a change of ownership, with concerns the takeover process could drag on throughout the coming 2023-24 season.\nBBC Sport approached Manchester United and the Glazer family for comment. They have previously not commented on the specific protests, but said they \"respect the right of fans to voice their opinions peacefully\".\nTwo members of the group spoke to the BBC podcast 'How To Buy A Football Club' to talk about their methods, which they are adamant are peaceful, and what will lead to an end to their campaign for change at the club.\n\"The fanbase is big and fractured,\" they told BBC Sport. \"Lots of people have lots of opinions. The minute someone puts their head above the parapet, you will be judged.\n\"This family have inflicted untold damage, generational damage, on our club. It is personal and real to us. It is community. It is family.\n\"A lot of United fans would happily see United go down if it meant that the Glazer family left. Look at what happened when the Glazers came in - some fans went on to form another club. That is the strength of feeling.\n\"Fans of other clubs might say we are spoiled but they wouldn't like the Glazers running their club.\"\nThe 1958 Group says it is \"not surprised at the length of time\" it is taking for the Glazers to reach a conclusion about the 'strategic review' they launched in November.\nIn addition to the Qatari and Ineos bids, a number of investment companies have offered funding in exchange for a minority stake.\nThe Raine Group are handling the sale process, which it had initially been thought would be concluded by the end of last season.\nAll parties are still waiting for a decision and say they have been given no guidance about when one will come.\nCo-chair Avi Glazer in particular has been visible around United in recent times, including watching the recent friendly with Arsenal at the MetLife Stadium, after which he refused to answer questions about the takeover.\nThe 1958 representatives told BBC Sport: \"Look at the length of time it took for Newcastle to go through.\n\"That was £300m and Mike Ashley wanted to sell. That took 18 months. This is possibly a £6bn takeover and you have got six Glazer siblings to please. [So far] it is eight months. It is frustrating - but it could be a year. It could be 18 months.\"\nThe 1958 Group has not objected to any of the potential new owners, with 'sportswashing' and 'greenwashing' concerns raised by campaign groups, saying it \"cannot question what a potential new ownership is now, without actually knowing what the new ownership is\".\nThe Glazers purchased United in a controversial £790m leveraged buyout in May 2005. The club has since spent more than £1bn on interest and loan payments, plus share dividends - the majority of which have gone to the American family.\nBut United have a net spend of 1.36bn euros (£1.18bn) on transfers under the Glazers, with only Manchester City having a higher figure in that period.\nHowever, the 1958 Group is dismissive of that massive transfer spend, saying that the players were bought \"by the club's own money\".\nIt added: \"If there is any involvement for the Glazers, in any minority, we will still push to get them out.\n\"But people have spent a lifetime protesting against this ownership. It would leave a bitter taste in the mouth to still have them there.\"", "url": "https://www.bbc.com/sport/football/66322345"}