{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:38", "date_modify": "2025-05-21 07:20:38", "date_publish": "2023-07-18 00:00:00", "description": "Football transfers latest & Women's World Cup build-up", "filename": "sport_football_live_c0wqr09p3jyt_1747812038.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c0wqr09p3jyt_1747812038.html", "title": "Football transfers latest & Women's World Cup build-up", "title_page": "Football transfers latest & Women's World Cup build-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's it for your Tuesday live page.\nThanks for all your dodgy away kit suggestions. One of our colleagues mentioned Partick Thistle's pink, grey, white and black camouflage kit from 2009. Outstanding.\nIf you're in Manchester, keep your eyes peeled for any sightings of Inter Milan goalkeeper Andre Onana.\nHere are some top stories to have a read over and we'll see you again tomorrow.\nManchester United agree £47m deal for Andre Onana\nLionesses to pause bonus talks until after World Cup\nWho will win the Women's World Cup?\nTeams encouraged not to fly at Euro 2024\nChelsea face Tottenham on WSL opening weekend\nHampden bids to host European final in 2026 or 2027\nSkinner in talks to become next West Ham boss\nChelsea confirm Fofana ACL surgery\nChelsea\nChelsea have just released this statement before we go:\n\"Defender Wesley Fofana has undergone anterior cruciate ligament reconstruction surgery.\n\"The 22-year-old did not travel to America for the club's pre-season tour due to specialist medical assessments, which unfortunately confirmed that an operation would be required.\n\"Wesley will now begin his recovery and work with the club's medical department at Cobham during his rehabilitation phase.\"\nPost\nFinal update from our reporter Simon Stone on Moises Caicedo, following Brighton's rejection of a second Chelsea bid of £70m for the midfielder:\n\"Caicedo will travel to the USA direct from Ecuador as he has been given extra time off. Brighton’s squad fly later today.\"\nPost\nNot the winning start Ange Postecoglou would have hoped for but hey, it's only pre-season.\nNext up for his Spurs side is a trip to Bangkok to face Leicester City at Rajamangala National Stadium on Sunday, 23 July at 11:00 BST.\nWest Ham are heading back to the UK and the glamour of the Chigwell Construction Stadium to take on Dagenham & Redbridge at 15:00 BST on Saturday, 22 July.\nYou can find Premier League club's pre-season fixtures here\n'There will be missteps' - Postecoglou\nTottenham 2-3 West Ham\nTottenham Hotspur\nAnge Postecoglou took charge of his first Tottenham match as manager earlier today but lost 3-2 to West Ham.\nWhen asked about their style of play, he said post-match: \"I'm talking about the intent. I'm trying to provide the security and structure for my players to play that kind of football.\n\"There will be missteps along the way but we've got to be all in. They were trying to do that but at times it wasn't working because they weren't sure yet what positions to be in but that's what we can show them and work on.\"\n'Tottenham were a good side' - Moyes\nTottenham 2-3 West Ham\nWest Ham United\nWest Ham boss David Moyes reflected on his team's opponent Tottenham after beating them 3-2 in a pre-season friendly.\n\"I think Tottenham were a good side [today].\" Moyes said. \"They have an amazing centre forward, probably the best in the world. When you've got an amazing centre forward you have always got the chance of winning games.\"\nWomen's World Cup podcast\nBBC Sounds\nWith just two days to go until the world’s biggest ever women’s sports event kicks off in New Zealand and Australia, World Football’s Mani Djazmi and Katie Smith are in Sydney, with Maz Farookhi in Auckland to preview the start of the tournament.\nThe team discuss the hosts, the favourites and the debutants, including in-depth interviews with the two-time World Cup winner with the USA, Carli Lloyd; Australia goalkeeper Lydia Williams, one of only two players of aboriginal descent in the Matildas squad; and Panama midfielder Riley Tanner discusses the nation’s World Cup debut.\nIt's now live on BBC Sounds\nBrighton reject second Chelsea bid for Caicedo\nSimon Stone\nBBC Sport\nBrighton have rejected a second Chelsea bid, believed to be around £70m, for midfielder Moises Caicedo.\nThe Ecuador international asked to leave Brighton in January amid interest from Arsenal.\nBrighton refused and Caicedo subsequently signed a new contract in March that runs to 2027.\nHowever, evidently, he remains of huge interest to a number of Premier League clubs, with Chelsea most keen to sign the player.\nIronically, Chelsea are due to meet Brighton in the opening game of the Premier League’s six-team pre-season tournament in Philadelphia on Saturday.\nGossip: Brighton think Caicedo is worth £100m\nChelsea thought £70m would be enough for Brighton to say 'yes' to handing over midfielder Moises Caicedo this summer - they were wrong.\nThe Seagulls have reportedly rejected an improved offer from the London club and according to Sky Sports (via Football Daily),, external if new Arsenal signing Declan Rice and Argentina midfielder Enzo Fernandez - who joined the Blues for a British record transfer fee in February - are worth £100m, then so is Ecuador international Caicedo.\nWomen's World Cup 2023: Fan reporters in Australia and New Zealand\nThousands of fans are heading to Australia and New Zealand to follow their national teams at the Women's World Cup.\nThroughout the month-long tournament, fans will give us a glimpse of their experiences as their teams progress - or fail to - in the biggest Women's World Cup to date.\nMeet our super-fan reporters - from Brazil to Zambia.\nWhere is your club playing this summer?\nWest Ham beat Premier League rivals Tottenham 3-2 at the Optus Stadium in Australia.\n\"The perfect ending to Perth as we put three past Spurs,\" the Hammers tweeted after the game.\n\"Plenty of positives to take after an exciting pre-season clash in Perth,\" was Spurs' response to the friendly defeat.\nNewcastle are also in action tonight. The Magpies face Rangers at Ibrox Stadium at 19:45 BST.\nNottingham Forest are in Spain to take on Valencia at Ciudad Deportiva de Paterna. That one is an 18:00 BST kick-off.\nWhere is your club playing this summer? Have a look at all the pre-season fixtures here", "url": "https://www.bbc.com/sport/football/live/c0wqr09p3jyt"}