{"authors": ["Alex Hoad", "Nick Barnes", "www.facebook.com"], "date_download": "2025-05-21 07:15:48", "date_modify": "2025-05-21 07:15:48", "date_publish": "2025-05-20 10:44:31", "description": "Romaine Mundle hopes Sunderland can get \"back where they belong\" with victory over Sheffield United in the Championship play-off final.", "filename": "sport_football_articles_cq54w78yd4eo_1747811748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b95/live/24b16bd0-34a9-11f0-aaa8-a7753dfe3850.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq54w78yd4eo_1747811748.html", "title": "Championship play-off final: Sunderland's Romaine Mundle aims to live out Wembley dream", "title_page": "Championship play-off final: Sunderland's Romaine Mundle aims to live out Wembley dream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Romaine Mundle hopes to live out a lifelong dream at Wembley on Saturday and is aiming to take Sunderland \"back where they belong\".\nThe 22-year-old winger endured an injury-hit first full campaign at the Stadium of Light but came off the bench in extra time to help inspire the Black Cats to a dramatic Championship play-off semi-final win over Coventry last Tuesday, sealed by Dan Ballard's last-gasp header.\nFormer Tottenham youngster Mundle appeared in the first 15 league games of the season but, after sustaining a hamstring injury in a draw at Coventry in November, made just seven further appearances.\nHe missed the final six games of the regular season and the first leg of the play-off semi-final after another hamstring problem suffered at West Brom in early April.\n\"I've worked hard in my time off the pitch, focusing on my rehab, but it's credit to the team in allowing me to be in that position to come back and play a part,\" Mundle told BBC Radio Newcastle.\n\"Tuesday was an unbelievable night for everyone at this club, the team, the staff and obviously the fans.\n\"It's one of the greatest nights of my life. It was fantastic, but you come in the next day and the focus is on the next game.\"\nSheffield United, who finished third in the table, now stand in the way of Sunderland ending an eight-year exile from the Premier League - half of which were spent in League One.\nMundle admitted to feeling the pressure on the game, but added: \"A lot of people deal with pressure differently. I think it's good if you feel a bit of pressure, it's good nerves. You can use it to fuel you. It shows you care.\n\"Hopefully we can just get this club back to where it belongs.\"\nMundle grew up 18 miles from Wembley but has never played under the arch. His most recent experience there was watching from the stands as Tottenham lost a Champions League tie to a Lionel Messi-inspired Barcelona in 2018.\nHe said: \"I'll have a lot of people watching, in the stands or on TV, it'll be a special moment for me.\n\"I've not played there before but whether you are brought up in London or not, for a lot of people their dream is to play at Wembley and mine could possibly come true on Saturday.\n\"It would mean everything to me to win at Wembley, especially with what's gone on this season with the injuries, but mainly just for the club.\n\"The club deserves to be back in the Premier League, the fans deserve it. The fans and the club are tight-knit, it's almost like a family club. I just hope we can repay them.\"", "url": "https://www.bbc.com/sport/football/articles/cq54w78yd4eo"}