{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:17:24", "date_modify": "2025-05-21 05:17:24", "date_publish": "2025-04-03 16:32:29", "description": "Graeme Lee is loving life as Spennymoor boss as the side prepares for their FA Trophy semi-final with Rochdale.", "filename": "sport_football_articles_cy8qnze6p18o_1747804644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58e8/live/e9d4fa70-10a6-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8qnze6p18o_1747804644.html", "title": "Spennymoor: Graeme Lee feels 'privileged' ahead of FA Trophy semi", "title_page": "Spennymoor: Graeme Lee feels 'privileged' ahead of FA Trophy semi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Graeme Lee says that he feels \"privileged\" to be Spennymoor Town manager as he tries to guide them to Wembley.\nThe National League North side are gearing up for their first FA Trophy semi-final away to Rochdale on Saturday as the lowest side left in the competition.\nThe Moors will be backed by over 800 fans as they attempt to bridge a gap of 28 places below Dale.\n\"When you come into the club, the people just love the club and they want to do the right thing for the club,\" Lee told BBC Radio Tees.\n\"It's a privilege to work for them. I enjoy being part of the club.\"\nFormer Hartlepool United boss Lee has been in charge at Brewery Field since January 2024, guiding the Moors to ninth last season\nHe again has them punching above their weight this term, sitting 10th, three points off the play-offs with notable victories over sides including Scunthorpe United and Chester City.\nThe trophy run has included wins over National League teams Boston United and Sutton United and now Lee has his eyes on getting to Wembley in May, as Spennymoor try to add to their FA Vase success of 2013.\n\"It's one of those clubs where you feel a big part of it and it gets under your skin,\" he said.\n\"I look at the fans we get week-in, week-out at home, 1,200, 1,300. For the size of our town, it's massive. Who we're challenging and where we are, old EFL clubs with 5-6,000 fans and we're going and beating them.\n\"It emphasises what we are as a club and a town.\"", "url": "https://www.bbc.com/sport/football/articles/cy8qnze6p18o"}