{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:55:46", "date_modify": "2025-05-21 04:55:46", "date_publish": "2025-04-04 14:17:50", "description": "Right-back Ryan Nyambe is awaiting the results of a scan to access his availability for Derby County's trip to Swansea City on Saturday.", "filename": "sport_football_articles_c1jx0nwz1ewo_1747803346.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fc75/live/d32f9620-115c-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1jx0nwz1ewo_1747803346.html", "title": "Derby County: John Eustace on Ryan Nyambe injury and nurturing club talent", "title_page": "Derby County: John Eustace on Ryan Nyambe injury and nurturing club talent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County right-back Ryan Nyambe is awaiting the results of a scan to access his availability for the Rams trip to Swansea City on Saturday (15:00 GMT).\nThe 27-year-old Namibia international was sidelined for 18 league games with a torn ligament injury earlier in the season before missing Blackburn Rovers' visit in March with a hamstring issue.\n\"It's really unfortunate for Ryan,\" boss John Eustace told BBC Radio Derby.\n\"He's a dedicated professional, he does everything super correct but, unfortunately, he's just having a bad time of it at the moment.\"\nEustace also sung the praises of midfielder and Derby academy product Liam Thompson.\nThe 22-year-old is becoming a regular feature under his new boss, joining the starting line-up for all four of the Rams' successive league wins.\n\"Liam is one of our own and he's came through the system, and I think his performances up until now have been very, very good,\" Eustace added.\n\"It's one of the reasons I came to the football club.\n\"I've got a really good record of developing young players, and I want as many young players coming through the system so we can really build.\"", "url": "https://www.bbc.com/sport/football/articles/c1jx0nwz1ewo"}