{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-21 06:23:52", "date_modify": "2025-05-21 06:23:52", "date_publish": "2025-01-31 12:52:43", "description": "Cerny on Clement handling pressure as he delivers Europa League last 16 spot", "filename": "sport_articles_cpvmdd87vj9o_1747808632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d30b/live/3b410fa0-dfbc-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpvmdd87vj9o_1747808632.html", "title": "Cerny on Clement handling pressure as he delivers Europa League last 16 spot", "title_page": "Cerny on Clement handling pressure as he delivers Europa League last 16 spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Winger Vaclav Cerny insists manager Philippe Clement is handling the pressure after guiding Rangers directly through to the Europa League last 16.\nThe Ibrox side will face one of Bodo/Glimt, Anderlecht, Twente or Fenerbahce in March, skipping the play-off round, after finishing eighth in the table thanks to the 2-1 win over Union Saint-Gilloise and other results falling in their favour.\nClement's future has come under intense scrutiny this season, but Czech international Cerny said: \"I think he's dealing with pressure every three days.\n\"He's dealing with it very good, as we are, because we play for a big club. That is how it should be.\n\"That's normal and I like the way that we stick together. We stick together no matter what and we can put in big performances.\"\nCerny scored what proved to be the winner, his 13th goal of the season, before the Belgian side staged a late, unsuccessful fightback that had Ibrox on edge.\nDirect entry to the last 16 is undoubtedly a significant achievement, particularly given four of Rangers' opponents finished in the top seven.\n\"It's a big one,\" Cerny added. \"That's what we wanted before it all started and we had some tough opponents.\n\"I think it's a very, very good achievement to go into the top eight.\n\"Obviously the dream of ours is to go as far as possible. We need to wait and focus for the very first opponent.\n\"I don't think we have had a bad game in Europe this season. We were just well prepared for every single game.\"", "url": "https://www.bbc.com/sport/articles/cpvmdd87vj9o"}