{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 06:25:10", "date_modify": "2025-05-21 06:25:10", "date_publish": "2025-01-04 15:26:44", "description": "Barcelona midfielder Dani Olmo and forward Pau Victor have been blocked from playing in the rest of the 2024-25 season by Spain's football authorities.", "filename": "sport_football_articles_cdek08gxr60o_1747808710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0eb3/live/aa0f9880-caa8-11ef-a078-37769e6d4b12.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdek08gxr60o_1747808710.html", "title": "Barcelona: Dani Olmo and Pau Victor registration rejected by La Liga", "title_page": "Barcelona: Dani Olmo and Pau Victor registration rejected by La Liga - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spain's football authorities have rejected Barcelona's attempt to register midfielder Dani Olmo and forward Pau Victor for the second half of the season.\nThe summer signings were initially only registered until the end of December because of the competition's wage-cap restrictions.\nBoth men may now be sidelined until the summer, with their careers on hold, while there has been recent speculation that the highly coveted Olmo could leave the club.\nOlmo, 26, has been a regular for Hansi Flick's team since joining from RB Leipzig in a deal worth about £51m after helping Spain to win last summer's European Championship.\nFormer Girona player Victor, 23, has featured almost entirely as a substitute in Spain's top flight this season.\nA joint statement from the Spanish Football Federation (RFEF) and La Liga confirmed they turned down Barcelona's request to register both players.\nThe statement read: \"The monitoring committee agrees not to grant the prior approval or the definitive licence requested by FC Barcelona for the players Daniel Olmo Carvajal and Pau Victor Delgado.\"\nRFEF and LaLiga said they were both satisfied with the club's improved financial position after recent efforts to bring in funds.\nHowever, league rules state that the same club cannot re-register a player in the same season in which their registration was cancelled, the joint statement said.\nRequests made by Barcelona to register the duo had previously been rejected by two courts.\nSpanish media reported that Barcelona still plan on filing a complaint to the Spanish government in a bid to extend the players' registrations, although the club have yet to comment on the latest outcome.\nBarcelona sit third in La Liga, five points behind leaders Real Madrid.", "url": "https://www.bbc.com/sport/football/articles/cdek08gxr60o"}