{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:26:41", "date_modify": "2025-05-21 05:26:41", "date_publish": "2025-01-15 17:11:46", "description": "Eddie Hearn remains determined that Katie Taylor achieves her ambition of fighting at Croke Park in a third bout with big rival Amanda Serrano.", "filename": "sport_boxing_articles_cqx982q9415o_1747805201.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fbf/live/355c9e20-d363-11ef-9159-33fc6bbd8ac5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cqx982q9415o_1747805201.html", "title": "Katie Taylor: Eddie Hearn wants Croke Park to stage Irish hero's third Serrano bout", "title_page": "Katie Taylor: Eddie Hearn wants Croke Park to stage Irish hero's third Serrano bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eddie Hearn says he remains determined that Katie Taylor achieves her ambition of fighting at Croke Park in a third contest with her big rival Amanda Serrano.\nTaylor, 38, edged out Puerto Rican star Serrano in a second classic contest in their rematch in Texas two months ago as the Irishwoman successfully defended her undisputed light-welterweight world title.\nPromoter Hearn has been attempting to set up a Taylor contest at the famous 82,000 capacity Gaelic Athletic Association (GAA) stadium in Dublin for several years but has been unable to agree terms with GAA bosses.\n\"There's a lot of money in that fight now. More money than ever before,\" Hearn told BBC Sport NI.\n\"And we know we're not going to harp on about the cost of Croke Park. It is what it is.\"\nPromoter Hearn added that Croke Park and Las Vegas bouts would \"tick off the list of boxes for Katie Taylor\" and joked that Jake Paul, who fought Mike Tyson in an exhibition bout on the same Texas bill as the Irishwoman two months ago, could be brought into the negotiations.\n\"People always say, would you really do 70,000 or 80,000? I've always believed yes. Without a doubt.\n\"Serrano and Taylor could fight 10 times. Every one would be a fight of the year. So maybe Mr Paul will get on a plane, come and see the Croke Park boys with me.\n\"I really want to deliver it for her. She's just the most incredible, incredible individual. Probably the greatest sportsperson I've ever worked with.\"", "url": "https://www.bbc.com/sport/boxing/articles/cqx982q9415o"}