{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:59:35", "date_modify": "2025-05-21 06:59:35", "date_publish": "2025-01-04 10:06:47", "description": "Swansea City must 'sort' Jon McLaughlin contract - Luke Williams", "filename": "sport_football_articles_c86wxgye98zo_1747810775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a315/live/0c181f60-c9f6-11ef-852a-9106f8ff2cbf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c86wxgye98zo_1747810775.html", "title": "Swansea City must 'sort' Jon McLaughlin contract", "title_page": "Swansea City must 'sort' Jon McLaughlin contract - Luke Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams says Swansea City need to \"sort out\" a new deal for Jon McLaughlin with the goalkeeper's short-term deal due to expire this month.\nMcLaughlin joined Swansea in August on as cover for the injured Andy Fisher.\nBut even after Fisher's return to fitness, 37-year-old McLaughlin has kept his place on the Swansea bench as understudy to Lawrence Vigouroux.\nWith McLaughlin's contract about to end, Williams wants the former Rangers man to sign an extension – and suggested he will soon be handed a Swansea debut.\n\"We need to sort that [contract] out pretty soon,\" said the Swans boss.\n\"He's been a very good addition to us and hopefully everyone gets to see him on the pitch in the near future.\"\nFirst-choice keeper Vigouroux's starting place has recently come into question for the first time since he joined Swansea last summer due to a dip in form.\nEven if the former Burnley player retains his spot in Williams' Championship side, McLaughlin could be given a chance to impress in the FA Cup tie at Southampton on Sunday, 12 January.\nWhen asked if the Scot is pushing for a start, Williams added: \"I don't see why not. He'd be more than happy to play - he's here to play.\"\nWhoever plays in goal against West Bromwich Albion on Saturday (12:30 GMT) will hope for a quieter afternoon than Vigouroux endured at Portsmouth in midweek, when Swansea suffered their heaviest defeat of the season.\nThey will attempt to find a response against an Albion side who remain firmly in play-off contention despite losing boss Carlos Corberan to Valencia over Christmas.\n\"They're a very good side, very well organised,\" Williams added.\n\"They have a very capable squad. There's no question it will be a very difficult game for us.\"", "url": "https://www.bbc.com/sport/football/articles/c86wxgye98zo"}