{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 07:51:03", "date_modify": "2025-05-21 07:51:03", "date_publish": "2025-05-18 09:15:07", "description": "FA Cup: 'Joy exploded for Crystal Palace elsewhere' - McNulty", "filename": "sport_football_articles_czj4ewdygkeo_1747813863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/831d/live/cc956a30-335b-11f0-a050-dd09e4c72b04.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czj4ewdygkeo_1747813863.html", "title": "FA Cup: 'Joy exploded for Crystal Palace elsewhere'", "title_page": "FA Cup: 'Joy exploded for Crystal Palace elsewhere' - McNulty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The greatest day in Crystal Palace's history was richly deserved and reward for faith in the work of Oliver Glasner, who has masterminded their superb run to FA Cup glory.\nPalace did not win their first Premier League game this season until 27 October, but faith in the Austrian never wavered and the payback is this big prize - as well as a place in the Europa League next season.\nEberechi Eze and Dean Henderson have been two standout heroes on the road to Wembley, and they inspired the Eagles once again as City were punished at one end and thwarted at the other.\nEze provided the moment of magic, as he did in the quarter-final win at Fulham and the semi-final win against Aston Villa at Wembley, pouncing ruthlessly on Munoz's cross to leave Stefan Ortega helpless.\nCity will forever believe Henderson should have seen red when he clawed the ball away from Erling Haaland in the first half, but VAR ruled otherwise and Henderson produced an otherwise faultless display in front of watching England head coach Thomas Tuchel.\nWhen he dived to his right to save Marmoush's penalty, Henderson became the first keeper to save a penalty in an FA Cup final - excluding shootouts - since Petr Cech for Chelsea against Portsmouth in 2010.\nCity may have held sway in possession, with 78% compared to Palace's 22%, but when it mattered Eze produced the goods again.\nDaniel Munoz was another standout performer for Palace, whose fans had to go through 10 agonising minutes of additional time before the memories of losing FA Cup finals in 1990 and 2016 could be banished.\nGlasner's reaction, like his management, was calm and measured, while joy exploded for Palace elsewhere.\nThere were tears of joy on the pitch and in the stands as Palace finally sampled the sweet taste of success.", "url": "https://www.bbc.com/sport/football/articles/czj4ewdygkeo"}