{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:06", "date_modify": "2025-05-21 05:25:06", "date_publish": "2025-01-31 21:44:15", "description": "Tottenham in Fikayo Tomori talks, Spurs enquire about Alejandro Garnacho after Mathys Tel rejection, Chelsea join Evan Ferguson race, plus more.", "filename": "sport_football_articles_cm23v5kdmd0o_1747805106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db6c/live/67341c40-e018-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm23v5kdmd0o_1747805106.html", "title": "Football gossip: Tomori, Tel, Garnacho, Ferguson, Gonzalez, Mitoma, Nunez", "title_page": "Football gossip: Tomori, Tel, Garnacho, Ferguson, Gonzalez, Mitoma, Nunez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham in Fikayo Tomori talks, Spurs enquire about Alejandro Garnacho after Mathys Tel rejection, Chelsea join Evan Ferguson race, plus more.\nTottenham are in advanced talks to sign England defender Fikayo Tomori, 27, from AC Milan. (Sky Sports), external\nMathys Tel has rejected a move from Bayern Munich to Tottenham after the clubs agreed a £50.1m deal for the 19-year-old French forward. (ESPN), external\nTel would prefer to make a loan move to Manchester United. (the i - subscription required), external\nAfter missing out on Tel, Tottenham have made an enquiry for Manchester United's Argentina forward Alejandro Garnacho, 20. (Mail), external\nChelsea have joined the race to sign Republic of Ireland striker Evan Ferguson, 20, from Brighton. (Guardian), external\nManchester City have made an approach to sign Spanish midfielder Nico Gonzalez, 23, from Porto before the transfer deadline. (Mail), external\nManchester City are unwilling to meet the £50m release clause for Gonzalez before the transfer deadline. (Telegraph - subscription required), external\nBrighton have rejected an improved bid of £75m from Al-Nassr for Japan winger Kaoru Mitoma, 27. (Sun), external\nDarwin Nunez wanted to speak with Al-Nassr before they signed Jhon Duran but Liverpool told them the Uruguay striker, 25, was not for sale at any price. (Sun), external\nEverton are working on a complex deal to sign English midfielder Carney Chukwuemeka, 21, from Chelsea before the transfer deadline. (Football Insider), external\nSunderland have rejected a bid from Brighton for 18-year-old English winger Tommy Watson. (Northern Echo), external\nArsenal are interested in Norway Under-21 midfielder Sverre Nypan, but the 18-year-old is expected to stay at Rosenborg until the summer. (Athletic - subscription required), external", "url": "https://www.bbc.com/sport/football/articles/cm23v5kdmd0o"}