{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:03", "date_modify": "2025-05-21 07:19:03", "date_publish": "2025-05-20 08:51:08", "description": "Hibs fan views: 'No team can achieve much without a Martin Boyle'", "filename": "sport_articles_c626jenxplro_1747811943.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4fc/live/8d08f250-34c9-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c626jenxplro_1747811943.html", "title": "Hibs fan views: 'No team can achieve much without a Martin Boyle'", "title_page": "Hibs fan views: 'No team can achieve much without a Martin Boyle' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you for you thoughts on Martin Boyle after the Hibs forward signed a one-year contract extension before taking his goals tally for the season to 20 with a header in the final-day draw with Rangers.\nHere's what some of you had to say:\nAlan: Total no-brainer. Since the November turnaround, Boyle been fantastic and scored pivotal goals to ensure third spot. The thought of Kieron Bowie and Boyle on form is a joy to think of. And then there is the returning Dylan Vente to ponder. With extended European games we need this quality... now get Rocky Bushiri to stay as well!\nDavid: Martin Boyle - Hibs legend. Most iconic Hibee in the 21st century!\nPhilip: No team can achieve much without a player like Martin. He's not so fast over distance but he's replacing that with short bursts of movement that his team-mates understand but nobody else does. I can see him ageing into a supersub, a bit like we've had from Dwight Gayle. These guys are so important. They turn draws into wins.\nMichael: An absolute no-brainer extending Squirrel's contract. He has been an outstanding servant to our great club and he will be mightily relieved at this outcome as well! What a great time to be a Hibby!\nMatt: Easiest decision to make this season - he's quality and still so dangerous. He'll be fired up next season for European football as well as keeping himself firmly in the Australia World Cup squad, so there's plenty more to come from Martin Boyle in a Hibs shirt. Now, get Rocky signed.", "url": "https://www.bbc.com/sport/articles/c626jenxplro"}