{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:22:10", "date_modify": "2025-04-26 04:22:10", "date_publish": "2025-03-03 14:23:21", "description": "Tottenham defender Cristiano Romero is named in Argentina's squad for upcoming World Cup qualifiers against Uruguay and Brazil, alongside Manchester City teenager Claudio Echeverri.", "filename": "sport_football_articles_cn8rzpkvp08o_1745641330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a99f/live/74ccaae0-f835-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn8rzpkvp08o_1745641330.html", "title": "Cristian Romero: Tottenham defender named in Argentina squad for World Cup qualifiers", "title_page": "Cristian Romero: Tottenham defender named in Argentina squad for World Cup qualifiers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Argentina have named Tottenham defender Cristian Romero in their forthcoming squad for World Cup qualifiers against Uruguay and Brazil.\nThe 26-year-old has not featured for his club since suffering a thigh injury during a 4-3 Premier League defeat by Chelsea on 8 December.\nSpurs have carefully managed Romero's recovery, given injuries have limited the defender to just 12 Premier League appearances this term.\nHe has resumed first-team training but is yet to make his competitive return.\nSpurs play four times - twice in the Europa League and twice in the Premier League - before the international break.\nWorld Cup holders Argentina are top of the Conmebol World Cup standings with a five-point lead, having won eight of their 12 qualifiers.\nThey travel to second-placed Uruguay on 21 March (23:30 GMT), before hosting Brazil in Buenos Aires on 26 March (00:00 GMT).\nManchester City's 19-year-old midfielder Claudio Echeverri, who signed from River Plate in 2024 but has only recently joined up with Pep Guardiola's side, earned his first call-up to the senior ranks.\nAston Villa goalkeeper Emi Martinez, Liverpool midfielder Alexis Mac Allister and Chelsea midfielder Enzo Fernandez have also been named in the preliminary squad by manager Lionel Scaloni.\nArsenal winger Gabriel Martinelli has been named in Brazil's 52-man squad.\nThe forward, 23, has not featured for the Gunners since a 2-0 EFL Cup semi-final defeat by Newcastle on 5 February.\nBrazil are fifth in the standings, having won five and lost four of their 12 fixtures.", "url": "https://www.bbc.co.uk/sport/football/articles/cn8rzpkvp08o"}