{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-21 03:38:06", "date_modify": "2025-05-21 03:38:06", "date_publish": "2025-01-14 14:34:38", "description": "Tyson Fury has announced his retirement - but after a history of calling it quits, should he be believed this time?", "filename": "sport_boxing_articles_cvge7301243o_1747798686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/032f/live/14e3d2a0-d27b-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cvge7301243o_1747798686.html", "title": "Tyson Fury retires: Dick Turpin, Oleksandr Usyk & Anthony Joshua", "title_page": "Tyson Fury retires: Dick Turpin, Oleksandr Usyk & Anthony Joshua - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tyson Fury went for a coffee and decided to record a retirement video in his car before beaming it out to the world.\nHe had not told his manager Spencer Brown of his intention, despite speaking to him the previous day. He had not told his promoter Frank Warren or his assistant coach and cousin Andy Lee.\nBrown's phone started to ring as he was making his way to a news conference in London. He was told Fury had just announced the news on his social media.\n\"Are you sure that's not a fake [video]?\" was his initial reaction. He immediately rang the former unified heavyweight world champion.\n\"I said 'thanks for telling me', laughing. 'Not uncharacteristic of you',\" Brown said on 5 Live Boxing with Steve Bunce.\n\"'Well I just went for a coffee and thought I would [announce it]'. And that's it. That's Tyson Fury all over.\"\nWith four retirements already under his belt before Monday, cynics have lined up to suggest Fury is not actually calling it quits.\nThe announcement caught his own team by surprise and came as talk of a long-awaited showdown with Anthony Joshua was beginning to ramp up.\nIs it a negotiating tactic or has Fury truly decided to end a glittering career, which includes two spells as world champion and winning every belt in the division along the way?\nFury's last retirement was in 2022, after he stopped Dillian Whyte at Wembley. He fought Derek Chisora five months later.\nCarl Froch, Tony Bellew, Barry Jones and Carl Frampton are just a few of the fighters who have questioned the veracity of the news.\n\"I don't really believe him to be honest. He's probably retired at least three times now. I think we might see him back,\" Frampton said.\nJones' initial reaction was similar: \"That's just Fury being Fury. What he says isn't what he'll think tomorrow.\"\nThe video itself was cryptic, making reference to infamous 18th Century highwayman Dick Turpin.\n\"Dick Turpin wore a mask\", Fury says in the video. It is a phrase sometimes used by people who think they have been robbed.\nWas Fury referring to his points loss to Oleksandr Usyk on 21 December? Certainly, he said he had been \"robbed\" and the Ukranian had received an \"early Christmas present\" after the verdict.\nHowever despite the naysayers, Bunce says Fury's family, including his wife Paris and their seven children, have wanted him to retire for some time following 25 years in the sport.\n\"When he's retired in the past it's because he's been in a dark place,\" Bunce added.\n\"Perhaps this is a reflective Tyson Fury. He tried his hardest but he lost [against Usyk].\n\"He's getting on now. There's just a chance that this might be it, this might be him riding off into the sunset.\"\nLee, who is a fixture in Fury's corner, says the announcement came as a shock but did not surprise him as the fighter had become \"pretty disillusioned\" with boxing since losing a close contest to Usyk.\nJoshua's promoter Eddie Hearn floated the idea on Monday that Fury might be trying to get the upper hand in potential negotiations with Joshua.\nNo talks have taken place, according to Brown, who said \"never say never\" when asked if Fury could fight again.\nJones believes Fury might be retiring to get some extra \"leverage\" in the talks with the Londoner.\n\"He's a clever guy and saying you're retired is leverage to get more money,\" Jones said.\nFrampton, however, is convinced Fury is bluffing.\n\"If he starts talking about an 'AJ' fight in the next month or two, I think reputationally it does affect him a little bit,\" Frampton said.\n\"You can't just keep retiring and coming back. If you make a statement, make it factual.\"\nWhile the debate will rage on about Fury's true intentions, there is little doubt the Briton has had a remarkable career.\nHe made his amateur debut in 2005, his professional bow in 2009 and has 34 wins, two losses and one draw on his professional record.\nThe only achievement that has eluded him is holding all four world titles at once.\nFury came back from a two-year drugs ban and a near-three year absence in 2018 during which he battled severe depression and added 10 stones in weight.\nThe losses to Usyk are unlikely to take too much shine off Fury's record, as he faced almost all of his direct rivals - excluding Joshua.\n\"Will he walk with the greats like Lennox Lewis, Muhammad Ali or a young Mike Tyson? No. But has he had a most amazing impact on global sport? Absolutely,\" Bunce said.\nLee and Brown both describe Fury as the premier \"character\" in boxing and praised him for everything he has overcome.\nBrown says his long-time friend has been \"marvellous\" for the sport and will go down as one of the best.\n\"Possibly the craziest story ever in boxing,\" Brown said.\n\"Without him, it's going to be a very quiet place. Who is going to fill the void? I don't think you can, can you?\"", "url": "https://www.bbc.com/sport/boxing/articles/cvge7301243o"}