{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:30", "date_modify": "2025-05-19 14:41:30", "date_publish": "2017-08-05 18:23:09", "description": "Britain's Tahnee Seagrave wins her second Downhill Mountain Bike World Cup race of the season in Canada.", "filename": "sport_cycling_40838617_1747665690.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/147E6/production/_97224938_gettyimages-454849792.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_40838617_1747665690.html", "title": "Downhill Mountain Bike World Cup: Briton Tahnee Seagrave wins second race of season", "title_page": "Downhill Mountain Bike World Cup: Briton Tahnee Seagrave wins second race of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Tahnee Seagrave won her second Downhill Mountain Bike World Cup race of the season in Canada.\nHaving clinched her maiden win in Austria in June, the 22-year-old secured the penultimate race of the calendar at Mont-Sainte-Anne.\nSeagrave stays third in the overall rankings, a place ahead of fellow Briton Rachel Atherton, the defending World Cup champion, who finished fifth.\nWorld Champion Danny Hart had to settle for third in the elite men's race.\n\"It doesn't feel real yet, it's a lot better than my first,\" Seagrave said.\n\"It all comes down to the last race now and that's not happened since I've been competing.\"\nFrance's Miriam Nicole finished second, 5.7 seconds behind Seagrave, to retain her World Cup lead with Australia's Tracey Hannah third.\nAtherton was undefeated for 15 consecutive races until May when a crash during a practice run at Fort William in Scotland left her with a dislocated shoulder and unable to compete.\nAnd in her third race back since the injury, she produced a sensational piece of handling to avoid yet another crash.\n\"I could hear the crowd gasping,\" she said. \"There was a massive rock and I couldn't change my line. I thought 'I can't crash, I'll fall to pieces'.\"\nThe final races of the season takes place at Val di Sole in Italy on 26-27 August.", "url": "https://www.bbc.com/sport/cycling/40838617"}