{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-05-21 03:49:26", "date_modify": "2025-05-21 03:49:26", "date_publish": "2025-04-07 15:04:28", "description": "Hampshire all-rounder Liam Dawson says his side need to be \"a bit more realistic with expectations\" after losing some key players.", "filename": "sport_cricket_articles_ckgxy80244do_1747799366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b14/live/54185f10-13bf-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckgxy80244do_1747799366.html", "title": "Liam Dawson: Hampshire all-rounder says side need to manage expectations", "title_page": "Liam Dawson: Hampshire all-rounder says side need to manage expectations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire all-rounder Liam Dawson says that his side need to be \"realistic with expectations\" this season despite getting off to a winning start in the County Championship.\nBowler Mohammad Abbas left the county in February and star batter James Vince announced his decision to only feature in white ball competitions, leaving them with a younger squad.\nDawson took 3-8 in the first innings and saw his county over the line with the bat in their five-wicket win over Yorkshire on Sunday.\n\"I'm desperate to try and win the Championship,\" Dawson told BBC Sport.\n\"This year it will be a bit different though with the players we have lost, it will be a bit harder to win it but across the next three years hopefully we can be up there.\n\"As a group we have to be a little bit more realistic this summer with our expectations, we have a lot of younger players coming through and that gives them great opportunities.\n\"But if we can make Southampton a real fortress then come September who knows where we'll be in the league?\"\nDawson signed a fresh contract at the start of 2025, extending his stay at Hampshire for another three years.\nHe has been at the county since 2007 and came through their academy, where he joined at the age of seven.\nThe 35-year-old has represented England 20 times in all three formats, and was part of the squad that won the 50-over World Cup in 2019, but is now focusing on his club.\n\"It's not something I even worry about anymore,\" Dawson said.\n\"I'm 35 now, if it comes then brilliant but I'm very realistic that those days are over.\"\nHampshire return to County Championship action on Friday when they take on defending champions Surrey at The Oval.", "url": "https://www.bbc.com/sport/cricket/articles/ckgxy80244do"}