{"authors": ["Charlotte Coates", "www.facebook.com"], "date_download": "2025-04-26 07:27:21", "date_modify": "2025-04-26 07:27:21", "date_publish": "2025-02-27 20:01:53", "description": "Chris Eubank Jr and Conor Benn are kept apart on Thursday by six security men after chaos during their first news conference two days earlier.", "filename": "sport_boxing_articles_cm2jje58rdvo_1745652441.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b28/live/63b14e70-f55e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cm2jje58rdvo_1745652441.html", "title": "Eubank vs Benn: Boxers kept apart by security but exchange verbal blows", "title_page": "Eubank vs Benn: Boxers kept apart by security but exchange verbal blows - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chris Eubank Jr and Conor Benn were kept apart on Thursday by six security men after chaos during their first news conference two days earlier.\nOn Tuesday, Eubank smashed an egg across his rival's face during their first face-off before their fight on 26 April.\nHowever, on Thursday at Tottenham Hotspur Stadium, they were kept at a distance.\nA scheduled fight between the pair in October 2022 was called off after Benn failed a voluntary drugs test, prompting a two-year battle with anti-doping authorities, before his suspension was lifted in November.\nBenn, 28, has always denied intentionally doping and both fighters are being tested by the Voluntary Anti-Doping Association (Vada) for the contest.\nAn independent report by the WBC in February 2023 said Benn's failed drugs test was not intentional and could have been caused by a \"highly elevated consumption\" of eggs.\nAfter the unsavoury scenes at the end of Tuesday's conference, the 35-year-old Eubank was scanned with an 'egg detector' on Thursday before taking his seat on stage.\nEubank told BBC Sport: \"Youngsters who see my response, when you're dealing with a drug cheat, I think it's good that the younger generation understand what can happen and the consequences of cheating.\n\"It doesn't go unpunished. I felt it was only right that I physically contaminated him with an egg. I felt that was the fair thing to do.\"\nBenn kept quiet while Eubank talked, until he took aim at his father Nigel Benn which promoted a furious response from Conor.\nAfter Eubank smashed an egg in Benn's face in Manchester, Nigel Benn appeared to grab him by the throat.\nFormer two-weight world champion Nigel Benn, 61, apologised for his actions with Eubank responding by accepting before saying: \"If your hand ever touches me again, you won't get it back.\"\nBefore Thursday's media event, Conor Benn told BBC Sport he was still \"fuming\" about what happened and said Eubank has \"poked the bear.\"\n\"Everyone loves a little push and a shove,'' Benn said. ''That's alright, no problem. But never raise your hands to somebody.\n\"But ultimately, he will pay the price. In the end, I will have the last laugh. The talking's done.\n\"He's done what he had to do, well done Chris on building up the fight. Now more people get to watch him get knocked out.\"\nEubank was unfazed by Benn's words, saying: \"Poking the bear? Good. That's what is needed to get into the minds of these people. I can't let him be comfortable around me.\n\"This is boxing. I'm not here to make friends. We are going to fight. We are going to hurt each other in this stadium in a few months time. Danger is what we do.\"", "url": "https://www.bbc.co.uk/sport/boxing/articles/cm2jje58rdvo"}