{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:38", "date_modify": "2025-05-21 05:27:38", "date_publish": "2025-04-03 11:06:52", "description": "Erin Cuthbert: Chelsea midfielder primed to make Scotland impact amid hectic schedule", "filename": "sport_articles_creqzlwzpndo_1747805258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ab2/live/b74d6590-107b-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_creqzlwzpndo_1747805258.html", "title": "Erin Cuthbert: Chelsea midfielder primed to make Scotland impact amid hectic schedule", "title_page": "Erin Cuthbert: Chelsea midfielder primed to make Scotland impact amid hectic schedule - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Erin Cuthbert is primed to make a positive impact on her Scotland return after thriving in a hectic period for quadruple-chasing Chelsea.\nThree wins over Manchester City in recent weeks saw Cuthbert's club side win the League Cup, remain on course to retain the Women's Super League title and progress to the Champions League semi-finals.\nThe WSL leaders also remain in the hunt for the FA Cup after booking a place in the last four.\nThat frantic spell has meant little rest for Cuthbert, but the 26-year-old is lapping up a change of scenery with the national team as they prepare for a Nations League double-header with Germany.\nCuthbert, who missed interim head coach Mick McArdle's opening two matches with a rib injury, said: \"I love the business end of the season, it's brilliant. I just love the games that matter the most, the most pressurised moments.\n\"I feel like it brings out a different Erin and the best of me. But the past couple of weeks I've not really had a great amount of sleep. I've had loads of travel.\n\"I think as an elite athlete in the business at the end of the season, you just accept you're not going to sleep, you're going to feel pressure. The pressure keeps you up at night. But it's what we love doing.\n\"If I didn't have any pressure, then what's the point doing it? I enjoy the pressure, I thrive upon it. I know it's a tough part of the season, but it's what every single person wants to be part of.\n\"I just love the refresh here at Scotland and hearing the Scottish accent, just being back with the girls in general. It's nice to break it up because amongst all the pressure at Chelsea, you just come here in a bit more of a relaxed environment.\n\"I'm excited for the games ahead. It's a new campaign, feels like a sort of fresh squad, fresh kit as well, fresh everything, so I'm looking forward to seeing what we can achieve.\"", "url": "https://www.bbc.com/sport/articles/creqzlwzpndo"}