{"authors": ["Charles Bannerman", "www.facebook.com"], "date_download": "2025-04-26 06:17:38", "date_modify": "2025-04-26 06:17:38", "date_publish": "2025-03-01 18:29:27", "description": "Kingussie, Newtonmore, Lovat and Fort William start the new Premiership season with victories, while Oban Camanachd and Kinlochshiel draw.", "filename": "sport_articles_ckg8rxeed81o_1745648258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8a2/live/ff244b10-f6ca-11ef-a811-cd286d96b2f6.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckg8rxeed81o_1745648258.html", "title": "Kingussie, Newtonmore & Fort William open with wins", "title_page": "Shinty: Kingussie, Newtonmore & Fort William open with wins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kingussie opened their defence of the Mowi Premiership title with a comfortable 3-0 home success over newly-promoted Beauly.\nFort William made a more convincing return to the top flight with a 3-1 victory against Kyles at An Aird.\nNewtonmore began with a 2-0 away success over Caberfeidh and Lovat edged visitors Skye 2-1, while Oban Camanachd and Kinlochshiel finished 1-1 at Mossfield.\nRoddy Young got an early opener for Kingussie who then had to wait until the last 10 minutes for a Eion Baikie double to seal the points.\nFort's breakthrough came from Lachie Shaw right at the start of the second half. Archie MacKinnon extended their lead on the hour and Scott MacDonald pulled one back for Kyles before Shaw's second in the penultimate minute buried the game.\nIain Robinson in the first half and Joe Coyle in the second secured the points for Newtonmore.\nLewis Tawse and Marc MacLachlan gave Lovat a 2-0 half-time lead as Ruaraidh MacLeod's response for Skye produced a grandstand finish.\nRoss Campbell opened for Oban Camanachd after just two minutes and Archie MacRae equalised before the half hour.\nThe first goal and the first hat-trick of the new season came in Lochaber's 7-1 National Division crushing of Col Glen in the early throw up at Spean Bridge. It came from Max Campbell, son of former Lochaber captain, motor neurone disease sufferer Lachlan Campbell, who is engaged in a major fundraising exercise on behalf of fellow victims.\nGlasgow Mid Argyll, with a Calum McLay hat-trick, overwhelmed Strathglass 4-0 at Yoker and Glenurquhart and Kilmallie shared four goals.", "url": "https://www.bbc.co.uk/sport/articles/ckg8rxeed81o"}