{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 14:45:47", "date_modify": "2025-05-20 14:45:47", "date_publish": "2023-07-27 17:35:53", "description": "England face a battle to level the Ashes after Australia enjoy the better of the first day of the fifth Test at The Oval.", "filename": "sport_cricket_66329980_1747752347.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C387/production/_130555005_starc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66329980_1747752347.html", "title": "The Ashes 2023: Australia edge England on first day of fifth Test", "title_page": "The Ashes 2023: Australia edge England on first day of fifth Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England face a battle to level the Ashes after Australia enjoyed the better of the first day of the fifth Test at The Oval.\nFinally winning the toss for the first time in the series, Australia pounced on the opportunity to put England in on a green-tinged pitch and dismissed the home side for 283 before moving to 61-1, 222 behind.\nHarry Brook held England together with 85 from 91 balls, adding 111 for the fourth wicket with Moeen Ali, who made 34.\nBut England were hurt by two clusters of wickets. At one stage they lost three for 11, on the other occasion four for 28.\nSimilarly, Australia were wasteful. They dropped five catches, most crucially Brook when he had scored only five. The tourists also missed the opportunity to run out Brook when he had 50.\nBrook eventually fell to Mitchell Starc, who claimed 4-82, with Australia then making an assured start to their reply through openers David Warner and Usman Khawaja.\nChris Woakes had Warner well held at second slip by Zak Crawley, leaving Khawaja unbeaten on 26 and Marnus Labuschagne on two.\nOf concern to England was a groin injury Moeen sustained while he was batting. The off-spinner did not take the field as he underwent an assessment. James Anderson, backed to play in this Test despite taking only four wickets in the series, bowled seven unsuccessful overs.\nAt 2-1 down, England know Australia have retained the urn, but are looking to protect an unbeaten home record in Ashes series that stretches back to 2001.\nBrook made his Test debut on this ground a year ago and has since established himself as the present and future of England's middle order. On this occasion he was the engine of a freewheeling England innings with his 11th score of 50 or more in 12 Tests.\nThe hosts thrilled and frustrated in equal measure. An opening stand of 62 between Crawley and Ben Duckett, who was busy for 41, belied the early conditions before both men and Joe Root fell in the space of 22 balls. Root's was the first in a string of limp dismissals from the middle and lower order.\nDuckett and Crawley both benefitted from being dropped and England would have been in huge trouble at 78-4 had Brook been held by diving wicketkeeper Alex Carey. Reprieved, he built the vital stand with Moeen.\nMoeen had been careful, scoring only 11 from 37 balls, before his injury. With restricted movement, he swung two sixes off Cummins before aiming one heave too many at recalled off-spinner Todd Murphy.\nBy this point, Brook was batting gloriously, scoring square of the wicket on both sides, playing handsome straight drives and picking up two leg-side sixes of his own.\nHowever, Moeen's dismissal sparked England's second mini-slump. Ben Stokes played across a very good delivery from Starc, Jonny Bairstow wafted an ugly chop on off Josh Hazlewood and Brook's airy drive ended in the hands of Steve Smith.\nEven after that, Woakes and Mark Wood continued the momentum. Wood sped to 28 before a hack at Murphy and Woakes, who was dropped twice and successfully overturned being given lbw, lofted a glorious straight six off Starc in his 36.\nAustralia have been on the back foot for most of the past two Tests and looked to still be suffering a hangover in a poor first hour when they wasted the conditions. Starc and Hazlewood were wayward with the new ball, Warner dropped Duckett at first slip and a flying Smith put down a very tough chance off Crawley.\nBut an excellent spell from captain Pat Cummins changed the momentum. After Mitchell Marsh had Duckett caught down the leg side, Cummins got his reward with extra bounce to Crawley and Australia gradually chipped away.\nIn the face of England's swift scoring, Australia kept the field spread and the boundaries protected.\nThough Cummins' throw missed the chance to run out Brook, the tourists had the fortune of the injury that contributed to Moeen's downfall and Starc followed up with a wonderful burst in the afternoon - the ball that bowled Stokes nipped away sharply to take off stump.\nWith the help of Murphy, it was Starc who mopped up the tail after tea, giving Australia around two hours to bat.\nWarner had failed to score when a tickle down the leg side off Stuart Broad went away off Bairstow's fingertips, a very hard chance. Warner also survived a review for caught behind off Broad and an edge off Wood that dropped short of Bairstow.\nThe opening stand was worth 49 when Warner fenced at Woakes, allowing Crawley to take the smart catch. Khawaja remained unmoved, leaving well and showing all the sound judgement that has made him Australia's leading run-scorer in the series.\nEngland batter Harry Brook, speaking to BBC's Test Match Special: \"We got up to a respectable total. I felt good today, I got that bit of luck early on, I just tried to put that pressure back on them and play like I have the last 12 months: positive, looking to always put the pressure on, backing myself.\"\nAustralia spinner Todd Murphy, speaking to Sky Sports: \"Winning the toss and bowling, the first objective is to bowl them out. We managed to do that, we created a lot of chances - it would've been nice if we could've held on to all of them but it's a good day, all in all. To be 61-1 at the end is nice.\"", "url": "https://www.bbc.com/sport/cricket/66329980"}