{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 07:49:11", "date_modify": "2025-05-21 07:49:11", "date_publish": "2025-05-18 17:41:50", "description": "England Test captain Ben Stokes says he has not had an alcoholic drink since the beginning of January.", "filename": "sport_cricket_articles_ce3vqzqp7vwo_1747813751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2040/live/fa699970-33e4-11f0-96f3-ab1a2b7558e0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ce3vqzqp7vwo_1747813751.html", "title": "Ben Stokes: England Test captain gives up alcohol to help injury recovery", "title_page": "Ben Stokes: England Test captain gives up alcohol to help injury recovery - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England Test captain Ben Stokes says he gave up drinking alcohol at the start of the year in the hope the abstinence would help with his recovery from injury.\nStokes, 33, had surgery on his left hamstring in December after suffering a tear during the third Test against New Zealand.\nHe was initially ruled out for at least three months but has not yet featured for Durham in the County Championship.\nEngland's international summer begins with a one-off Test against Zimbabwe at Trent Bridge from 22 May.\nAll-rounder Stokes sustained a similar injury during The Hundred last summer, but he said that he has changed his approach to rehabilitation this time, which included reflection on his relationship with alcohol.\n\"After my first major injury, I remember the shock of it and after the initial adrenaline had stopped I was thinking, 'How has this happened?'\" Stokes told the Untapped podcast, hosted by Spencer Matthews.\n\"[I thought] 'We did have a bit of a drink four or five nights ago, could that have played a part?' It wouldn't have helped.\n\"Then I was like 'OK, I need to start changing what I do'.\"\nAs a result, Stokes said he has not had an alcoholic drink since the beginning of January.\nHe added that it is unlikely that he will ever give up alcohol entirely but that he has learned to manage his behaviour with it.\nHe said that when he was younger, his drinking habits were \"all or nothing\", whereas he is now able to manage having \"a social drink\".\nStokes was found not guilty of affray in a high-profile trial in 2018, after being involved in a fight outside a nightclub in Bristol.\nHe told the court that he had been drinking but was not drunk.\nIn his podcast interview, Stokes described the differences in cricket's drinking culture in today's professional era compared with the past.\n\"In the 90s and 00s, there were unbelievable stories [about drinking]. It's definitely settled down a lot over the years,\" Stokes said.\n\"The game is more demanding on the body than it was then.\n\"There's so much more cricket, there's so much more in the schedule that it's just impossible for the body to be able to withstand all of that anyway - even without the downsides of what a couple of beers at the end of the day can do to you for the next day.\"\nStokes' recent injury record - which also included knee surgery at the end of 2023 - has led to questions surrounding his future and his ability to play as an all-rounder in England's Test side.\nBut he said he has been fully committed to this latest strict rehabilitation programme and has \"no interest in stopping\".\nIn recent weeks, Stokes has posted footage on social media that has showed him bowling in training with Durham, and he hopes to play a full role against Zimbabwe.\n\"I think the day I wake up and can't be bothered to do the training programme, that is getting towards the time you don't really want it any more,\" he said.\n\"But I haven't got any interest in stopping.\n\"It's just getting harder to do everything, hence why now I feel like I have to work so much harder away from the field, in the gym and all that kind of stuff to just give me the best chance of being out there to perform.\n\"But I'll keep going as long as I possibly can.\"", "url": "https://www.bbc.com/sport/cricket/articles/ce3vqzqp7vwo"}