{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 07:21:50", "date_modify": "2025-05-21 07:21:50", "date_publish": "2025-01-22 11:32:09", "description": "Bournemouth news: Opinion - Cherries in Europe 'a delicious thought' - Pat Nevin", "filename": "sport_football_articles_cdjdlj9regzo_1747812110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/be7a/live/d773f110-d839-11ef-ba26-ef826ed919d4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdjdlj9regzo_1747812110.html", "title": "Opinion - Cherries in Europe 'a delicious thought' - Pat Nevin - BBC Sport", "title_page": "Bournemouth news: Opinion - Cherries in Europe 'a delicious thought' - Pat Nevin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Teams seem to take it in turns to threaten Liverpool only to fall away meekly as soon as they get within striking distance.\nChelsea had a good run before collecting a measly three points from 15 prior to Monday's victory against Wolves. The Newcastle juggernaut was hammering along until it blew a gasket at the weekend and Arsenal, still the most likely, have stumbled just a little with four draws in their past eight league games.\nNottingham Forest are also staking a claim with a magnificent run of seven wins in eight games, but the next pretenders to emerge appear to be Bournemouth, who have tootled along in the background before taking centre stage with a 4-1 win at St James' Park on Saturday.\nWill they do the same as the others and freeze now that they have stepped into the spotlight?\nAgainst Newcastle, they looked fitter and sharper than Eddie Howe's team, a side who had been on a nine-game winning run, but suddenly it looked like they had played all those games back-to-back over one weekend.\nGood sense and experience suggests that the Cherries should wilt in the cold chill just about now. They have a mass of injuries and beyond the 11 players that blasted the Toon, there are few fit alternatives. That is not sustainable at the top end of the Premier League.\nOn the other hand, Andoni Iraola's team have no European football and have not lost in 11 matches - 10 of these in the league. This season they have beaten Arsenal, Spurs, Manchester United and Manchester City, so challenging for the top four is not a fluke.\nBournemouth in Europe with an 11,307 capacity stadium is a delicious thought - with many of us purist football fans hoping and praying it will happen.", "url": "https://www.bbc.com/sport/football/articles/cdjdlj9regzo"}