{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 04:30:18", "date_modify": "2025-05-21 04:30:18", "date_publish": "2025-04-05 08:48:47", "description": "All you need to know as the first men's major of 2025 gets under way at Augusta National Golf Club in Georgia.", "filename": "sport_golf_articles_ce829lr7n5no_1747801818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77ea/live/ef0d8d90-1164-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_ce829lr7n5no_1747801818.html", "title": "When is The Masters 2025? Dates, tee times, favourites & how to follow on the BBC", "title_page": "When is The Masters 2025? Dates, tee times, favourites & how to follow on the BBC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The general feeling in the golfing world is that if a player finishes above both Scottie Scheffler and Rory McIlroy this week then they will probably be donning the Green Jacket.\nAmerican Scheffler is the world number one and turning into something of a Masters specialist. He is looking for a third victory in four years, while McIlroy is seeking to win the title for the first time.\nScheffler had a standout year in 2024, winning nine events including the Masters, and while he has not enjoyed the same stellar start to 2025, he is yet to finish outside the top 20 in five previous appearances in the first men's major of the year.\nMcIlroy, ranked second, needs this title to become just the sixth player to win the career Grand Slam of all four majors. It will be his 11th attempt to join a pantheon of greats including Jack Nicklaus, Tiger Woods, Ben Hogan, Gene Sarazen and Gary Player.\nFor the first time, the Northern Irishman has won twice on the PGA Tour before arriving at Augusta, including last month's prestigious Players Championship, which has only intensified the hype.\nBut there are potential winners everywhere in the 96-man field.\nSwedish sensation Ludvig Aberg finished runner-up to Scheffler last year in a debut major to remember. Could he go on to emulate Jordan Spieth, who finished second in his debut year, before winning the title 12 months later in 2015?\nEngland's Tommy Fleetwood will be encouraged by his joint third last year, while his compatriot Matt Fitzpatrick is a proven major winner and Wolverhampton's Aaron Rai is making his Masters debut after rising through the rankings.\nScotland's Bob MacIntyre is making his first start in three years but made the cut in his first two attempts, with a best finish of joint 12th. He arrives in Augusta with five top-15 returns in 2025.\nXander Schauffele has had four top-10 finishes in his previous six Masters and is coming off the back of a breakthrough 2024 in the majors where he won his first and second titles.\nCollin Morikawa, ranked one place below Schauffele at fourth in the world, also enjoys Augusta and has had three top-10s in his past three starts, finishing joint third in 2024.\nUS Ryder Cup captain Keegan Bradley is enjoying something of a renaissance in his career and is 14th in the world rankings.\nThe 38-year-old has never finished inside the top 20 at Augusta but won his seventh PGA Tour title at last year's BMW Championship and has had two top-10s this season, making the cut in all seven events he has played.\nLIV Golf is well represented, with a dozen players from the Saudi-backed circuit heading to Georgia.\nJon Rahm won this title in 2023 and perhaps has a better chance of adding to his tally than Dustin Johnson (2020), Patrick Reed (2018) and Sergio Garcia (2017) who are all recent champions.\nChile's Joaquin Niemann has won twice on the LIV circuit this year and is once again being touted as a potential winner, while Bryson DeChambeau showed playing the 54-hole LIV tournaments had not harmed his major aspirations as he won his second US Open title last year\nAnd finally... although he is not a favourite to win, many eyes will be on Germany's Bernhard Langer this week as the 67-year-old makes his 41st and final start on the 40th anniversary of the first of his two wins.\nFive-time Masters champion Tiger Woods will not be playing at Augusta National this year because he is still recovering after rupturing an Achilles tendon in March.\nOn 1 April the 15-time major champion wrote on X: \"I can't believe I am saying this, but a few weeks after rupturing my left Achilles, the sleeping in a hyperbaric chamber plus the explosive lifts, my doctors and trainers have me ready to play the Masters next week! Can't wait! See y'all on the course.\"\nHowever, minutes later, he added the message: \"P.S. April Fools my Achilles is still a mess :)\"\nWoods had surgery on the injury, which also kept him out of the PGA Tour's flagship Players Championship, on 11 March.\nHe had been hoping to make his comeback at Augusta, having not competed in a PGA Tour event since last July's Open at Royal Troon.\nThe 49-year-old then had his sixth back procedure in 10 years in September 2024.\nWoods planned to return at the Genesis Invitational in February but withdrew following the death of his mother, Kultida.\nIt is arguably the most sought-after jacket in sport.\nThe great Bobby Jones, founder of the Augusta National Golf Club in 1933 and co-founder of the Masters which began in 1934, came up with the idea of a members' jacket.\nThe American amateur, who won seven majors, took his lead from Royal Liverpool, after winning The Open in 1927. He liked the red hunting jacket worn by the club's former captains.\nRed, yellow and 'Georgia peach' colours were all floated between Jones and his business partner Clifford Roberts before the latter, inspired by the colour of the leaves on the azalea bushes that dominate Augusta National, suggested green.\nThe idea was that members wore the jacket and were therefore easily recognisable by spectators visiting the course.\nSam Snead was the first Masters winner to be awarded a Green Jacket, in 1949.\nIt is made of an inexpensive wool-polyester mix and costs about £195 to make each one. The colour is known as 'Pantone 342'.\nEach jacket is kept permanently in the Champions Locker Room and only worn during Masters Week, strictly within the confines of Augusta National's clubhouse.\nInitially, only first-time winners were allowed to remove the jacket from the property and then just for the first 12 months. Recently, winners have been given a replica jacket they can take away.", "url": "https://www.bbc.com/sport/golf/articles/ce829lr7n5no"}