{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 06:00:44", "date_modify": "2025-05-21 06:00:44", "date_publish": "2024-12-24 14:32:30", "description": "Brian Barry-Murphy is due to be appointed Leicester's new assistant coach under Ruud Van Nistelrooy.", "filename": "sport_football_articles_c24ngr1mr5zo_1747807244.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bbc5/live/7c1660b0-c1fe-11ef-bf74-197c255fcbb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c24ngr1mr5zo_1747807244.html", "title": "Leicester City: Brian Barry-Murphy set to join Ruud Van Nistelrooy", "title_page": "Leicester City: Brian Barry-Murphy set to join Ruud Van Nistelrooy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brian Barry-Murphy is due to be appointed Leicester's new first team coach under Ruud van Nistelrooy.\nThe former head coach of Manchester City's elite development squad is available after leaving the club in the summer.\nThe ex-Sheffield Wednesday midfielder, who also managed Rochdale, is expected to link up with the Foxes once the move is finalised with the deal not yet signed.\nVan Nistelrooy said: \"It's not official yet but I can confirm, 99.9% is done on the contracts. I'm very happy to add him to the coaching team.\n\"It's a very important factor in the translation of the game model to the training pitch, developing the team, the unit and individual to the max. He is excellent in that and I'm very happy to add him to the team.\"\nLeicester go to Liverpool on Boxing Day after Sunday's 3-0 defeat to Wolves saw them miss the chance to go eight points clear of their relegation rivals.\nWolves, who occupy the final relegation spot, are now just just two points behind the 17th placed Foxes.\nVan Nistelrooy said: \"If you are going to evaluate it into a drama or success that's not the way to work as professionals,\" he said. \"It will be highlighted in the media and fans reacting, it's the world we live in.\n\"We know we're here for the long run and we know the end of the season is the finish line where we have to be in a position to stay in the league.\n\"I'm not going to create a drama every week or celebrate a win every week. Whatever occurs it's important to stay stable.\"", "url": "https://www.bbc.com/sport/football/articles/c24ngr1mr5zo"}