{"authors": ["Colin Moffat", "www.facebook.com"], "date_download": "2025-05-20 13:15:09", "date_modify": "2025-05-20 13:15:09", "date_publish": "2023-07-31 15:29:27", "description": "Scotland almost qualified for the 50-over World Cup then strolled into the T20 equivalent - but they have no fixtures in the diary and need to appoint a coach.", "filename": "sport_cricket_66347850_1747746909.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04C2/production/_130581210_t20qual_sco-v-ire_ij280725_063.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66347850_1747746909.html", "title": "T20 World Cup 2024: What lies ahead for Scotland?", "title_page": "T20 World Cup 2024: What lies ahead for Scotland? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's been a busy summer for Scotland men's team, including an agonising near miss to qualify for the 50-over World Cup and a stroll into the T20 equivalent.\nThey punched above their weight at the 50-over tournament in Zimbabwe - beating three Test nations along the way - only to falter at the last hurdle when defeat to Netherlands cost them a place at the big party in India on net run rate.\nThere was not much time to feel sorry for themselves though, with just one week off before Edinburgh hosted the European T20 qualifier event.\nScotland were big favourites to progress on home soil against some of the sport's minnows and duly delivered six wins from six.\n\"The time has really flown; it was just game, training, game,\" said interim head coach Doug Watson.\nBut what now? After a hectic few months for Watson and his squad, the action dries up.\nScotland do not have a single match in the diary and the South African coach is already back in New Zealand to resume working with the Auckland Aces.\nIt's an unwelcome pause after the side had gathered such good momentum.\nWatson's brief tenure opened and closed with victories over old rivals Ireland and an envious glance at their schedule only heightens the sense of frustration.\nIreland host India in August, tour England in September and are off to Zimbabwe before 2023 closes.\nIreland, who gained Test status in 2017, have a calendar packed with matches against top-tier opposition right through until early 2027.\nScotland have long harboured hopes of promotion to full member status, but how likely is that given the pressure that already exists on international fixtures from the growth of franchise cricket across the globe?\nWatson spoke of his own \"incredible experience\", stressing that the events in Zimbabwe and Edinburgh had been \"great for everyone's development\".\nWith stalwarts Kyle Coetzer and Calum MacLeod retiring and with county sides refusing to release Michael Jones, Brad Wheal and Josh Davey, supporters may have feared the worst.\nHowever, Brandon McMullen's decision to come to Scotland and study at Stirling University has provided a real boost.\nThe 23-year-old hit 364 runs from his seven innings in Zimbabwe as well as taking 13 wickets.\nRichie Berrington produced some up-and-down performances after replacing Coetzer as captain but showed his class as Scotland's second top-scorer at the World Cup qualifier with 291 runs.\nThe skipper and McMullen signed off for the summer with a fantastic 104-run partnership in Friday's win over Ireland at The Grange.\nBrad Currie, 22, made his international debut at the start of the T20 qualifier and ended the week with 12 wickets, including a stunning 5-13 against the Irish.\nChris Sole missed the action in Edinburgh through injury, having joined McMullen in the World Cup qualifier team of the tournament.\nThe 29-year-old bowled with real fire in Zimbabwe and has since been snapped up for a stint in the Caribbean Premier League.\n\"There is real quality in the squad,\" said Watson. \"The team is in a wonderful position, with some of the young guys coming through - and there are more pushing for places in the next couple of years. It's an exciting time for Scottish cricket.\"\nWhen Cricket Scotland do get round to appointing a new head coach, the unassuming Watson is sure to be at the top of their list.\nWhile there is talent to work with, unfilled vacancies at board level and uncertainty over fixtures makes that search all the more difficult.\nIf Watson was tempted to return, it might not be any time soon.\nBut if he does ever decide to come back, the 50-year-old won't have to bother learning Flower of Scotland.\n\"Singing the national anthem after every victory has been a real highlight for me,\" he said. \"Just being with the guys in the changing room and feeling the energy from that. I know all the words now!\n\"That's definitely been the highlight. And just watching the guys bond and support each other, that's been fantastic.\"", "url": "https://www.bbc.com/sport/cricket/66347850"}