{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:34", "date_modify": "2025-05-21 04:09:34", "date_publish": "2025-04-06 13:14:11", "description": "Luton Town manager Matt Bloomfield speaks of his pride over his side's performance in their 1-1 draw with Leeds United.", "filename": "sport_football_articles_cq67g0vvyg4o_1747800574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e1d/live/920c8470-12e5-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq67g0vvyg4o_1747800574.html", "title": "Luton Town: Matt Bloomfield praises performance in Leeds United draw", "title_page": "Luton Town: Matt Bloomfield praises performance in Leeds United draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town manager Matt Bloomfield said he was \"proud\" of his side's performance in their 1-1 draw with Leeds United.\nIsaiah Jones' opener was cancelled out by Dan James' strike in the first half at Kenilworth Road.\nAlthough the Hatters are still in the relegation zone, two points from safety, Bloomfield praised his players' showing against a promotion-chasing side.\n\"It's a performance to be proud of, and a point to be proud of, against extremely good opposition who we all expect to be in the Premier League next season,\" Bloomfield told BBC Three Counties Radio.\n\"The resilience we showed out of possession, the structure and discipline. We also created some good chances and the variety of our play was good, so there's a lot to be pleased about.\"\nBloomfield singled out the performance of striker Elijah Adebayo, who picked up an injury.\n\"Eli was fantastic today, his work out of possession, and the way he gives us a platform to build. Clicker [Jordan Clark] has a little bit of quality at the top end of the pitch and it was a nice finish from Izzy (Isaiah Jones), so it was a very good goal.\n\"He [Adebayo] twisted his knee and he has some ice on it, so we're not sure where it's at, so it was right at that time to get on some fresh legs.\"", "url": "https://www.bbc.com/sport/football/articles/cq67g0vvyg4o"}