{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 07:13:54", "date_modify": "2025-05-21 07:13:54", "date_publish": "2025-03-30 05:13:30", "description": "While Wales were encouraged by their showing in Scotland, their 11-try mauling by England was a timely reminder of just how much they need to improve.", "filename": "sport_rugby-union_articles_cvgn3xjj01go_1747811634.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce61/live/e5bed540-0cdd-11f0-a6b8-f91f29ac3e55.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvgn3xjj01go_1747811634.html", "title": "Women's Six Nations: We have to remember England are best in the world", "title_page": "Women's Six Nations: We have to remember England are best in the world - Sean Lynn - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While Wales were encouraged by their showing in Scotland, their 11-try mauling by England was a timely reminder of just how much they need to improve.\nThe Red Roses ran out 67-12 winners in front of a record crowd at the Principality Stadium as they stretched their winning run to 22 Tests.\nIt was only Sean Lynn's second game in charge of Wales, and while disappointed, he was quick to put the defeat into perspective.\n\"I think you've got to realise that you are playing the world's best,\" he told BBC Sport.\n\"Not many sides in the world can have 13 changes and full respect from England to come here with a full strength squad.\"\nAmong the changes was the return of the current world player of the year Ellie Kildunne who marked her 50th cap with a hat-trick of tries and a player of the match medal.\nLynn, who was used to being on the other end of big scorelines during a hugely successful spell at Gloucester-Hartpury, now has the gift of time during the tournament's fallow week.\nIt is something he has not had before having come into Wales camp the day after winning a third Premiership Women's Rugby (PWR) title, giving him just three sessions before the opening defeat against Scotland.\nLynn has two weeks before Wales travel to Brive to take on France, who like England have won two from two.\n\"We have to get better, every game we've got to be getting better,\" he said.\n\"We knew that there are going to be fixes, the defence system is something that we really need to be thinking about.\"\nWales missed 35 tackles in Edinburgh and 28 against England, which means new defence coach Dan Murphy has his work cut out.\n\"Dan has come in and he's brought a system in, it's just the girls getting that in place and also that trust as well,\" said Lynn.\nWales had led the Test after scoring an early try through Jenni Scoble, while Kate Williams crossed in the second half. It was the first time since 2019 that Wales scored two tries against England.\n\"I thought our attack looked really well today, very promising,\" added Lynn.\n\"Everything I've talked about is making sure we're always moving forward, I thought some of our attack today was outstanding but we just fell away.\n\"Just keep believing and lets keep moving forward. We're all in this together.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvgn3xjj01go"}