{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:50", "date_modify": "2025-05-21 05:55:50", "date_publish": "2025-02-08 18:23:07", "description": "Portsmouth manager John Mousinho tells BBC Radio Solent he was 'gutted' with the result but pleased with the performance away to Sheffield United.", "filename": "sport_football_articles_cn4zd71zd2no_1747806950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d23/live/62b78490-e649-11ef-83f8-35f434c6ab1c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4zd71zd2no_1747806950.html", "title": "John Mousinho - 'We didn't get what we deserved' - BBC Sport", "title_page": "Portsmouth: John Mousinho - 'We didn't get what we deserved' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth manager John Mousinho told BBC Radio Solent he was 'gutted' with the result but pleased with the performance in the defeat at Sheffield United.\n\"It's really difficult to take considering the performance and how well the boys played, how many chances we created, and how frustrated we made Sheffield United throughout the 90 minutes,\" he said.\n\"The only criticism I have of the boys is that we didn't put the ball in the back of the net more, that we weren't clinical enough in some of those moments.\n\"You could tell from some of the moans and groans from the Bramall Lane faithful that they were frustrated, but that was down to how well the lads were doing out there so I was really pleased with that.\n\"We created plenty by doing things really simply, defended the box really well when we had to, so there's loads of positives to take.\n\"I feel very positive about the performance now.\n\"We've been standing here after plenty of away games where the performance hasn't been good enough, the result's been dreadful and we've got what we deserved. Today we didn't get what we deserved.\n\"If we play like we did last week (a goalless draw with Burnley) and today we'll be absolutely fine, but that's the challenge, to be consistent in those moments and we have to try and find that.\"", "url": "https://www.bbc.com/sport/football/articles/cn4zd71zd2no"}