{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-05-21 06:00:59", "date_modify": "2025-05-21 06:00:59", "date_publish": "2025-04-01 23:03:31", "description": "There is a \"high degree of uncertainty\" over how much of the hundreds of millions of pounds lent to sports bodies during the Covid pandemic will be repaid, says an influential group of MPs.", "filename": "sport_articles_ckg5v04znnwo_1747807259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2584/live/c57109f0-0f2d-11f0-9959-7901c52f9c0e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg5v04znnwo_1747807259.html", "title": "Covid loans: Uncertainty over £400m yet to be paid back", "title_page": "Covid loans: Uncertainty over £400m yet to be paid back - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is a \"high degree of uncertainty\" over how much of the hundreds of millions of pounds lent to sports bodies during the Covid pandemic will be repaid, says an influential group of MPs.\nIn a report, the Public Accounts Committee (PAC) criticises \"severe weaknesses\" in the way the Department of Culture, Media and Sport (DCMS) handled the loans, and that it has been \"overly optimistic\" about repayments.\nBetween 2020 and 2022, the DCMS gave £474m to bodies in the sport and culture sectors to help them to survive lockdown, £218m was to sporting bodies with £124m supporting Premiership rugby union clubs.\nBut the cross-party PAC, which assesses value for taxpayers' money, says £400m is yet to be paid back, and less than half of borrowers had started repayments.\nNine bodies, which had collectively received £46m, have become insolvent.\nThat includes three rugby clubs - London Irish, Wasps and Worcester - with the DCMS saying it does not expect to recover up to £29m of the £41m it lent to them.\nAmid concerns over the finances of the remaining top-flight teams, the MPs say that \"future repayment is put at risk by the department's need to maintain the financial viability of the sectors to which it has given loans\".\nThe PAC warned of a \"gap in accountability to parliament\" over the money lent to rugby union, due to \"a conflict of interest\" involving a senior civil servant's connections with the sport.\nPAC chair Sir Geoffrey Clifton-Brown MP said it was \"right that government came forward with necessary support [but] not to provide a lifetime guarantee to institutions like rugby union which may be experiencing financial difficulties five years later\".\n\"DCMS is inherently conflicted in the management of its Covid loan-book,\" he said. \"As a lender, its priority will be to secure best value for the taxpayer from these loans. As a department, its priority is to do everything in its power to support a sector which has become its debtor.\"\nIn a statement, the DCMS said: \"This government will always protect taxpayers' money and we are committed to recovering funds paid out under the previous administration. We have recovered 97% of repayments due and we are set to see all borrowers begin their repayments by later this year.\n\"Ministers and the department continue to actively engage with the chief executives of the Rugby Football Union, Premiership Rugby and Championship Rugby to support the ongoing sustainability of the sport.\n\"We will take time to consider the full contents of the report and will respond in due course.\"\nLast month, government officials defended the loans to professional rugby union clubs.\nBut with both Newcastle and Exeter both recently seeking investment, they also admitted being increasingly pessimistic over the financial stability of the club game.\nThe last set of accounts filed by all Premiership clubs in 2022-23 showed that the sides collectively lost £30.5m and have net debts of more than £300m, amid fears that the finances of elite club are unsustainable.\nThe most senior DSMS civil servant - permanent secretary Susannah Storey - told the PAC that her department would use \"all financial levers\" to recover the money owed to it.\nHowever in its report, the PAC says that Storey has \"a conflict of interest regarding rugby union\", because her husband Pev Hooper is on the board of Premiership Rugby, and is also a director at CVC Capital Partners - a major investor in the sport.\n\"She has properly declared this conflict and recused herself from relevant discussions and decisions, and the department has put in place arrangements involving other staff to handle the conflict\", says the PAC.\n\"However, the department is most heavily exposed to rugby union in terms of both the amount of loans it has made and the financial health of the sport. The conflict of interest meant that we could not question the Permanent Secretary directly about the £124m that the department had loaned to top-tier rugby union clubs and its subsequent management of these loans.\"\nIt adds that \"this gap in senior oversight and accountability for such a significant amount of public money is concerning and avoidable. It strikes this committee as odd that the department has not taken steps to address this such as by asking another Permanent Secretary to provide scrutiny and assurance\".\nThe PAC published correspondence it had received from Storey in which she said that \"it is not accurate to state that there is a gap in accountability\" because relevant decision-making had been delegated to colleagues in line with guidelines.\nShe also said that it was wrong to say the DCMS was \"overly optimistic\" about recouping all the funding because it had made clear that as it expected 14% of borrowers to fail over a 10-year period.", "url": "https://www.bbc.com/sport/articles/ckg5v04znnwo"}