{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 03:47:25", "date_modify": "2025-05-21 03:47:25", "date_publish": "2025-04-07 17:00:00", "description": "Injury-hit Warwickshire draw with promoted Sussex in their County Championship Division One opener at Edgbaston.", "filename": "sport_cricket_articles_cgrg2jjx42go_1747799245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ead/live/f4229dc0-13d0-11f0-bf82-cb6aee90e3a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cgrg2jjx42go_1747799245.html", "title": "County Championship: Warwickshire draw with Sussex at Edgbaston", "title_page": "County Championship: Warwickshire draw with Sussex at Edgbaston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire began this season as they played out most of last season at Edgbaston - with a draw, this time against newly promoted Sussex.\nThe Bears drew all their first five County Championship matches in 2024, before ending the campaign in far more dramatic fashion with an innings victory over Kent, followed by an innings defeat by Essex.\nBut they reverted back into 'draw' mode again once Sussex, in their first match back in the top flight since 2015, had opted not to try and set the Bears a realistic target on a docile pitch.\nHaving resumed on 126-3 in their second innings, with a lead of 200, there was still something to play for on day four - and the wicket of Sussex first-innings centurion John Simpson for 22 on the stroke of lunch did potentially breathe life into the game.\nWarwickshire's first-innings centurion Rob Yates, who has now become more than a part-time spinner, bowled unchanged until 10 minutes before lunch, tidily taking three of the Sussex wickets to fall.\nAt that point, the visitors led by 288, with 66 overs left. But they instead delayed their declaration until they had reached 313-7, setting the injury-hit Bears a highly improbable target of 388 in 44 overs.\nWarwickshire made no attempt to go for victory, although Sussex did briefly cause a little alarm when West Indies paceman Jaydon Seales trapped Bears skipper Alex Davies and spinner Jack Carson bowled Hamza Sheikh.\nBut Yates (65 not out) and Sam Hain (26 not out) otherwise saw it out calmly as the Bears closed on 104-2.\nYates' half-century took his tally of runs for the match to 179 - second only to Simpson's 203, also for just once out.\nWarwickshire, who gave debuts to four players, Ethan Bamber, Vishwa Fernando, Kai Smith and Taz Ali - now head to Chester-le-Street on Friday to face Durham, while Sussex will host their first home game since promotion against Somerset at Hove.\nThe Bears will remain without last season's main strike bowler Olly Hannon-Dalby who is now expected to be out for the first month with a quad muscle injury, veteran paceman Chris Rushworth, England all-rounder Chris Woakes and New Zealand Test skipper Tom Latham, whose arrival has been delayed by a broken finger.\nSussex are likely to be unchanged after having had arguably slightly the better of this contest to help both former Bears cricket director Paul Farbrace and head coach Mark Robinson enjoy their return to Edgbaston.\nWarwickshire head coach Ian Westwood told BBC CWR:\n\"It was quite an emotional game in many ways. On the first day, there was so much going on, with it being Keith Cook's last day after 52 years at the club and us having four debutants. I felt pretty drained.\n\"But there are loads of positives for us to take from the game. We were disappointed not to get into a position to push for a win but overall I'm fairly pleased. If we are really critical I'd say we missed the chance on day one where the ball did enough for us and maybe with a bit of inexperience, having seen the pace and carry, we didn't capitalise on that.\n\"We tried to set the team up to give us the best chance of taking 20 wickets. Once the ball got a little bit softer on that first day batters have dominated so it was tricky to try and force the issue. But they really batted us out of it.\"\nSussex head coach Paul Farbrace told BBC Radio Sussex:\n\"It was a very good performance. The one thing we have talked a lot about is that we want to go into the fourth day of Championship games with a chance of winning and we had that chance.\n\"We said we would bat normally until lunchtime and then reassess, but we had a little period where it got harder to score and in the end we decided 15 points from the first game is a good return.\n\"If you look at Division One you will get more draws. When you are in Division Two you can look more at trying to set games up but when you've also got relegation to think about you know that if you can take 15 points from a game consistently you are going to put yourself in a really good position.\"", "url": "https://www.bbc.com/sport/cricket/articles/cgrg2jjx42go"}