{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:44", "date_modify": "2025-05-21 03:38:44", "date_publish": "2025-04-08 00:00:00", "description": "Sheffield United suffer a damaging home defeat in the race for automatic promotion as Josh Coburn's winner keeps Millwall in the hunt for the play-offs.", "filename": "sport_football_live_c62zwllylr7t_1747798724.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06f8/live/a9af7940-14b9-11f0-b1b3-7358f8d35a35.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c62zwllylr7t_1747798724.html", "title": "Sheffield United 0-1 Millwall: Josh Coburn secures win for Lions", "title_page": "Sheffield United 0-1 Millwall: Josh Coburn secures win for Lions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United suffered a damaging home defeat in the race for automatic promotion from the Championship as Josh Coburn's winner kept Millwall in the hunt for the play-offs.\nThe 22-year-old smashed the Lions in front on 21 minutes as the visitors had the better of the first half.\nThe Blades were much improved after the break but Millwall continued to have the better of the chances, with Mihailo Ivanovic missing a big opportunity to double the lead when found with time and space by his strike partner Coburn.\nUnited substitute Jesurun Rak-Sakyi saw his turn and shot from close range roll agonisingly wide, before Millwall keeper Lukas Jensen flung himself across to prevent an own goal from centre-back Tristan Crama, as the visitors hung on for victory at Bramall Lane.\nChris Wilder's side have now lost two games in a row and trail Leeds United and Burnley by two points in the race for a place in the top two.\nIt is four wins in six for Alex Neil's Millwall, who are now just three points below sixth-placed Middlesbrough, who were beaten on Tuesday by Leeds, with five games left to play.\nDespite having 65% possession and 25 shots, the Blades could not cut through a watertight Millwall defence that was missing Japhet Tanganga.\nFor much of the first half the hosts' attacks lacked any kind of cutting edge, with one of their best chances coming in the opening exchanges as the in-form Rhian Brewster flicked a corner just wide.\nFrom then on it was the visitors who had the better of the opening 45 minutes, with their specialist away goalscorer Coburn netting his sixth goal of the season and his fifth on the road.\nBilly Mitchell's line-splitting ball found Casper de Norre on the edge of the box, with the Dane's touch and swivel making its way to Coburn, who crashed it into the net beyond Michael Cooper.\nBen Brereton Diaz headed straight at Jensen and forced a big reflex stop from the Danish goalkeeper.\nThe Lions were value for their lead but with the half-time introduction of Rak-Sakyi the Blades began to tighten their grip in the game, with the Crystal Palace loanee scuffing wide at the end of a good team move.\nUnited goalkeeper Cooper was spared the blushes of what would have been a comical own goal when his left-foot pass across his own box almost nestled in the corner of the net, just missing the far post and being tidied up by Anel Ahmedhodzic.\nIvanovic was then guilty of one of the misses of the season as Millwall continued to hit the hosts on the break.\nCoburn's square ball on the break found the Serbian striker alone in space.\nHe had time to take a touch, possibly two, to steady himself, yet opted to shoot first time from outside the box, with his weak effort comfortable for Cooper to save.\nUnited continued to push for the equaliser but could find no way through Jensen, who produced a smart save to keep out substitute Tom Cannon's long-range hit after Coburn had headed over for the visitors.\nRak-Sakyi could not quite get enough on his late effort to divert it the right side of the post, before Crama had visiting fans' hearts in their mouths when he almost bundled the ball into his own net late on, as the Lions make a late charge at the play-off places.\nMillwall have now beaten all of the three automatic promotion chasers this season.\nSheffield United boss Chris Wilder told BBC Radio Sheffield:\n\"It's been a tough couple of games for us. We didn't do enough on Saturday and paid the price and just shot ourselves in the foot really.\n\"The first goal is massive in this division. The goal, from our point of view, there were so many things we could have done better to prevent that.\n\"I thought the energy from the team was good, we've created enough opportunities [and] we've got the ball where we wanted to get it.\n\"We've had 25 shots but really when you're looking for that little bit of quality that you need, when we got into those positions we never really found it and fair play to Millwall.\n\"The quality that we do possess has gone missing tonight at the top of the pitch.\"\nOn the automatic promotion race: \"I don't think anybody would have thought that we'd have lost the last two games. But we've done that, so we have to suffer and to own that and take that on the chin.\n\"I think I've got enough characters and quality in that group to get us back into a winning run, but it has to come soon and it has to come on Saturday [at Plymouth Argyle].\nMillwall boss Alex Neil told BBC Radio London:\n\"I thought we deserved it. I think if you look at the clearest chances in the game they fell to us.\n\"You do know that coming here you are going to have to take bits of pressure and see those bits out. You're going to have to rely on your keeper sometimes and defend well, but that's why Sheffield United have won more games than anyone else in this division so far.\n\"So we knew it was going to be a tough game, but we came with a game plan and I thought the lads executed it brilliantly.\n\"I thought we created some really good chances in the game for ourselves. We probably should have scored maybe two in the second half, even three, when you saw how clear cut they were.\n\"Unfortunately we couldn't put it to bed, which meant we had to put our bodies right to the last second.\n\"Great performance from us. [I'm] really delighted with how the players are doing at the moment, their application, not even just the starting XI but every single one that comes on the pitch.\"", "url": "https://www.bbc.com/sport/football/live/c62zwllylr7t"}