{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 13:14:01", "date_modify": "2025-05-20 13:14:01", "date_publish": "2023-08-01 05:56:50", "description": "Defending champions the USA miss out on finishing top of Group E thanks to an uninspiring draw against debutants Portugal at the Women's World Cup.", "filename": "sport_football_66369075_1747746841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0E88/production/_130602730_gettyimages-1584683152.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66369075_1747746841.html", "title": "Portugal 0-0 USA: World champions USA scrape into last 16", "title_page": "Portugal 0-0 USA: World champions USA scrape into last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Defending champions the USA suffered a huge scare against Women's World Cup debutants Portugal before scraping through to the last 16.\nThe Stars and Stripes are yet to fire at the tournament and, after being held by the Netherlands in their previous match, suffered another frustrating draw that raised questions about their hopes of winning the tournament for an unprecedented third time in a row.\nPortugal, who would have caused one of the greatest upsets in the competition's history had they won, hit the post through Ana Capeta in the 91st minute.\nIn the end the USA were relieved to hear the full-time whistle, the point enough to take them through as runners-up to the Netherlands, who thrashed Vietnam 7-0.\nHowever, the United States were once again far from their best as they struggled to break down a gritty Portugal defence, while keeper Ines Pereira produced two fine saves to deny recalled forward Lynn Williams.\nThe world's number one side will now face the winners of Group G, which will be decided on Wednesday with Sweden - the last nation to defeat the USA in a 90-minute game at the World Cup - set to finish top unless there is a 10-goal swing.\nOn a bitterly frustrating night for the four-time world champions in Auckland, midfielder Rose Lavelle was booked and will miss the next game after her second caution of the tournament.\nThe US came into this tournament as hot favourites to win it, but they have failed to impress in front of their thousands of travelling fans in New Zealand.\nThey finish the group stage with five points - two behind the Netherlands - and questions as to why they look a shadow of the team that conquered the world in 2015 and 2019.\nAfter missing a host of chances in their opening 3-0 win over debutants Vietnam, the US were held by the Netherlands in a repeat of the final four years ago.\nManager Vlatko Andonovski had named the same starting XI for the first two games but opted to made two changes as Lavelle, who has recovered from a recent knee injury, started after coming off the bench to provide the assist for Lindsey Horan to equalise against the Netherlands.\nForward Williams also got her first taste of this World Cup as Savannah DeMelo and Trinity Rodman dropped out.\nBut the changes failed to inspire the US, who failed to score in a World Cup game for the first time since being held 0-0 by Sweden in 2015.\nPortugal, who finished third in the group - one point behind the USA - exit the competition with their heads held high after going so close to causing an almighty shock.\nThey played 13 matches - 10 group games and three play-off matches - to reach their first World Cup and only secured a place with a 2-1 win over Cameroon in February.\nHaving lost narrowly to the Netherlands in their opening group game, Francisco Neto's side secured a historic first win on the global stage as goals by Telma Encarnacao and exciting young talent Francisca Nazareth defeated Vietnam 2-0.\nThe fact Portugal went into the third group game still in with a chance of qualifying for the knockout stage will be seen as progress.\nAgainst the United States, they were strong at the back and quick on the break, with Jessica Silva wasting a great chance in the first half before Nazareth went close.\nThe fourth official had just signalled a minimum of eight additional minutes when substitute Capeta struck the post.\n\"When Ana shot I was thinking it was a goal,\" said Neto.\n\"What I said to the girls is that I was very proud. Of course they are very sad because we are going home tomorrow.\n\"What this World Cup shows now is the women's game is growing a lot and all the teams are amazing. Because of that you have this kind of result.\n\"Before the World Cup nobody believed this kind of result would come.\"", "url": "https://www.bbc.com/sport/football/66369075"}