{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:42:19", "date_modify": "2025-05-20 11:42:19", "date_publish": "2023-08-06 13:49:47", "description": "Swansea City sign Excelsior left-back Nathan Tjoe-A-On on a three-year deal.", "filename": "sport_football_66421708_1747741339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E8C4/production/_130788595_athn_130823_nathan_tjoe_a_on_0795.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66421708_1747741339.html", "title": "Nathan Tjoe-A-On: Swansea City sign Excelsior's Dutch defender", "title_page": "Nathan Tjoe-A-On: Swansea City sign Excelsior's Dutch defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City have signed Excelsior left-back Nathan Tjoe-A-On on a three-year deal for a fee thought to be close to £300,000.\nBoss Michael Duff wanted to strengthen on the left following Ryan Manning's move to Southampton in the summer.\nJosh Key has been operating at left wing-back so far this season, including Swansea's 3-2 Championship loss at West Bromwich Albion on Saturday.\nThe loan signing of Chelsea defender Bashir Humphreys is also on the cards.\n\"I think every football player wants to play football abroad. I am proud that I can now take this step,\" Tjoe-A-On told the Excelsior website.\n\"Swansea City is a beautiful and ambitious club and I look forward to playing in all those atmospheric stadiums.\n\"I am closing a long period at Excelsior. I have had a great time at the club since I was 12 and have experienced and learned a lot, made a lot of friends in the youth (side), signed my first professional contract, made my debut in professional football, promotion and of course playing in the Eredivisie.\n\"I look back on that with a positive feeling and I want to thank everyone who helped and supported me in my development.\"\nAfter the loss to the Baggies, Swans head coach Duff said he expects to make two signings this week, one permanent and one loan.\nTjoe-A-On was in the final year of his contract with Eredivisie outfit Excelsior and his new deal with Swansea includes the option for an additional 12 months through to the summer of 2027.\nThe 21-year-old made 29 league appearances for the Dutch club last season, scoring one goal.\nNorwich City's left-back Sam McCallum has also attracted interest from Swansea this summer.\nThe Swans are also exploring the option of adding a midfielder to their ranks.", "url": "https://www.bbc.com/sport/football/66421708"}