{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:20", "date_modify": "2025-05-21 04:53:20", "date_publish": "2025-01-14 22:01:35", "description": "Glenavon and Loughgall defeated Championship sides Dundela and Institute to progress to the sixth round n the Irish Cup.", "filename": "sport_football_articles_ce859rdlg9yo_1747803200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/491f/live/fad18d20-d2b7-11ef-b2ff-23c7e0d06ab9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce859rdlg9yo_1747803200.html", "title": "Irish Cup: Glenavon and Loughgall through to sixth round", "title_page": "Irish Cup: Glenavon and Loughgall through to sixth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glenavon have set up a Irish Cup sixth round tie with Cliftonville after a 2-0 win over Dundela.\nMichael O'Connor and David McDaid netted at Mourneview Park in a comfortable evening for the Irish Premiership side.\nLoughgall survived a scare against Championship side Institute as Fra McCaffrey netted a late winner in a 3-2 thriller at the Brandywell.\nMikhail Kennedy netted twice to cancel out goals from Alberto Balde and James Carroll, but McCaffrey scored in the 87th minute to send Dean Smith's side through.\nThey will face Premier Intermediate side Dollingstown, who defeated Championship outfit Ballyclare Comrades at Planetrs Park.\nAfter a goalless first half, Aaron Duke header home the winner in the 83rd minute.\nThe final Irish Cup game of the evening, Moyola Park defeated Belfast Celtic 7-6 on penalties after a goalless draw at Mill Meadow.\nKenny Shiels' side will take on Ards, who shocked Ballymena United, in the sixth round.\nThe four games were being played on Tuesday after their games were postponed due to frozen pitches at the start of January.\nIn a dominant first half display from Glenavon, Peter Campbell's strike from inside the box forced Dundela keeper Aaron Hogg to make a low save early on.\nMatthew Snoddy then headed just off target as the Premiership side continued to ask questions of Dundela's defence.\nThe home side broke the deadlock in the 37th minute when David Toure's clever backheel dispatched Davy McDaid towards the box with the forward's delivery headed home by Michael O'Connor.\nToure then tried to get on the scoresheet himself, but his strike from range was well off target.\nJust after the restart Hogg made an impressive save to deny O'Connor and Glenavon their second of the evening as he lept to his rihgt to palm the danger away.\nHogg was then called into action once again and made another good stop to divert Snoddy's goal-bound header from a free-kick.\nDundela enjoyed a spell of possession, but it was Paddy McLaughlin's side who doubled their lead when Campbell played the ball back for McDaid, whose first shot was deflected. However, McDaid was able to fire home the rebound.\nGlenavon continued to push for another before the full-time whistle with Campbell coming close with his effort just wide of the right-hand post.\nA goal three minutes from full-time from McCaffrey earned Loughgall a dramatic 3-2 win over Championship club Institute at the Brandywell.\nThere was barely 60 seconds on the clock when the visitors went in front thanks to a first goal of the season for Balde.\nThe Institute defence was caught cold from the opening whistle, allowing the recalled frontman to control the ball before dispatching a low left foot shot past Gareth Muldoon in the home goal.\nThe visitors dominated much of the remaining half and doubled their lead on the stroke of half-time.\nA corner from the right caused consternation in the home defence allowing defender Carroll, recently signed from Glenavon, to react quickest and bundle the ball over the line from close range.\nWhatever Institute boss Kevin Deery said to his players at half-time certainly worked as they clawed a goal back 13 minutes after the restart.\nStephen Doherty whipped a corner in from the far side and as the Loughgall defence dithered 'Stute skipper Kennedy nipped in to poke the ball over the line from six yards out.\nJust over 10 minutes later the sides were level. Padraig Lynch was upended by Carroll inside the Loughgall penalty area and Kennedy did the rest, burying his spot kick low into the bottom corner past Berraat Turker.\nBut Institute's joy was short-lived as McCaffrey, signed in the transfer window from Newry City, repaid his manager Dean Smith's faith by heading home Conor McCloskey's cross for a late winner to set up a visit to Dollingstown in the sixth round.", "url": "https://www.bbc.com/sport/football/articles/ce859rdlg9yo"}