{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 03:42:06", "date_modify": "2025-05-21 03:42:06", "date_publish": "2025-04-06 18:07:37", "description": "Enzo Maresca stands by his decision to rotate his Chelsea team against Brentford - but will he come to rue the changes?", "filename": "sport_football_articles_cj3xev2ree2o_1747798926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b5b/live/f4ed6d10-12fa-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj3xev2ree2o_1747798926.html", "title": "Chelsea: Will Enzo Maresca regret Brentford selection gamble?", "title_page": "Chelsea: Will Enzo Maresca regret Brentford selection gamble? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Enzo Maresca's starting line-up was announced before Chelsea's trip to Brentford on Sunday, there was a sense of surprise among many Blues fans across social media.\nAnd, after a drab goalless draw at Brentford stretched their winless away run to eight matches to leave their Champions League hopes in the balance, the questions about his team selection grew even louder.\nMaresca rested Nicolas Jackson, Cole Palmer, Marc Cucurella and an in-form Pedro Neto against their west London rivals. In came Malo Gusto, Kiernan Dewsbury-Hall, Christopher Nkunku and Noni Madueke, who all struggled to make an impact.\nAll four of Chelsea's rested stars came on in the second half and the Blues went from having just six shots and one on target before the interval to 17 shots and four on target.\nThe Chelsea boss also faced criticism from sections of the away end, who have shown increasing frustration at his style of play, amid chants of \"attack, attack, attack\" and \"we've had a shot\" during a poor first half.\nThe bigger concern is, although Chelsea remain fourth, the fight for the Champions League places is looking increasingly competitive, with Manchester City, Aston Villa and Newcastle all within three points of the Blues.\nWith a Conference League quarter-final against Legia Warsaw to come on Thursday, and the likes of Palmer and Jackson just returning from injuries, Maresca was quick to defend his squad rotation.\nThe Italian also blamed the quick turnaround for his selection gamble, claiming it was unfair the Blues had 24 hours less than Brentford to prepare for the match, having played Tottenham at home on Thursday.\n\"Not all of them were 100%,\" he said. \"The idea was to start one way and finish another way. The plan nearly worked because we created more in the second half but the volume probably wasn't enough to win the game.\"\nWhen pressed by BBC Sport on whether he could have rotated in other games, he added: \"This is a different opinion. I am here to try to do the best for the club and players.\n\"I work every day with the players so I can see how they are. I am not sure if Spurs at home is harder than Brentford away. For me, they are all complicated.\"\nChelsea are winless in eight away matches, avoiding defeat away from Stamford Bridge for the first time in five matches on Sunday but having last tasted victory on their travels in early December at Tottenham.\nThey have been better at home and won five in a row.\nThe away form will be a concern though, with difficult trips away at Fulham, Newcastle and Nottingham Forest to come before the end of the season.\nIt feels an age away now when Chelsea were being talked about as being Liverpool's most realistic title challengers - a 2-1 win at home to Brentford securing a seventh straight win in December.\nThere are also concerns about misfiring forwards with Palmer on a long goal drought, Jackson 10 games without a goal while Sancho has not scored in 20 matches in all competitions.\nMaresca is facing increasing criticism about Chelsea's conservative style of play and failure to qualify for the Champions League - with a top-five finish likely to be enough to seal a place - would only amplify this.", "url": "https://www.bbc.com/sport/football/articles/cj3xev2ree2o"}