{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:15", "date_modify": "2025-05-21 05:29:15", "date_publish": "2025-04-03 09:45:25", "description": "Norwich defender Jack Stacey is named EFL Community Player of the Season, while the Canaries take the club award for their charitable foundation.", "filename": "sport_football_articles_crm3z1rzmemo_1747805355.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e70e/live/16f7fbd0-1064-11f0-93d7-a3dd8019c0be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm3z1rzmemo_1747805355.html", "title": "Jack Stacey: Norwich defender named EFL Community Player of Season", "title_page": "Jack Stacey: Norwich defender named EFL Community Player of Season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I was in two minds about whether to go because you never want to make these things about you.\"\nNot many people would think twice about attending a glitzy ceremony to pick up an award of recognition for their hard work.\nBut Norwich City full-back Jack Stacey's modest statement reflects his approach towards working for the club's Community Sports Foundation.\nThe 28-year-old attended a CSF Takeover day at Norwich's Carrow Road home last season and met some of the children with physical and mental disabilities who attend the 'Realising Potential' group.\nAnd it led to him being named the Championship's Community Player of the Season at an event at the Houses of Parliament on Wednesday evening, at which Norwich took the Community Club of the Season award.\n\"The impact we can have as players because of our platform can really make a difference,\" Stacey told BBC Radio Norfolk.\n\"The majority of them are at Carrow Road every other Saturday cheering us on so, for them, it's amazing to be able to meet the players that are on the pitch and it's led to having some really good relationships with these children.\n\"They feel they can open up to me on things they maybe wouldn't have to other adults in the past.\"\nThe Norwich CSF was founded in 1992 and their goals include driving inclusion for people with disabilities - in Norfolk, the number affected is 20% of the population, which is above the national average - as well as boosting mental health and wellbeing and inspiring disadvantaged people.\nThe award citation said the club engaged with a record-breaking 45,828 participants during 2023-24.\nAs part of that, Stacey spends two hours a week with a pan-disability football group, providing coaching and taking part in other activities with the children.\nHe has also provided advice towards the setting up of new Padel [tennis] courts.\n\"All the clubs I've been at, and a lot of the clubs across the EFL, do really great work but, for me, Norwich has been on a different level, in terms of the size of the operation, covering basically the whole of Norfolk,\" he said.\n\"I feel everyone within Norfolk sticks together and really looks after each other and because Norwich is such a big club within the area, we can use that to make a difference.\"", "url": "https://www.bbc.com/sport/football/articles/crm3z1rzmemo"}