{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:15", "date_modify": "2025-04-26 06:31:15", "date_publish": "2025-02-27 09:46:09", "description": "Everton news: Jake O'Brien's thoughts after Brentford victory", "filename": "sport_football_articles_clyzz5gdnz1o_1745649075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c26/live/bd81c680-f4ed-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyzz5gdnz1o_1745649075.html", "title": "Everton news: Jake O'Brien's thoughts after Brentford victory", "title_page": "Everton news: Jake O'Brien's thoughts after Brentford victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Everton defender Jake O'Brien says the Toffees are \"very confident\" going into all their games, as they continued their recent unbeaten run in the league.\nThe Ireland international scored his first goal for the club in Wednesday's draw with Brentford, to help make it seven league games without defeat for David Moyes' side.\n\"It's a really good feeling - it was a tough game but we're happy we came away with something,\" he said.\n\"In the first half, we had chances but we deserved to come away with something and it's seven unbeaten now.\n\"[Against Manchester United] we deserved three points. This week has been difficult as well but we've come away with another point - as long as we're tallying up our points.\n\"We're seven unbeaten and there's a good positive vibe around the place. We're looking very confident going into all our games.\"\nEverton now have a nine-day break before their next game, against Wolves and O'Brien thinks it has come at a good time for the squad: \"It's been a tough couple of games over the past few weeks but it's the perfect time to settle down for a little bit and go again in the next game.\"", "url": "https://www.bbc.co.uk/sport/football/articles/clyzz5gdnz1o"}