{"authors": ["Chris Bevan", "www.facebook.com"], "date_download": "2025-05-20 15:00:16", "date_modify": "2025-05-20 15:00:16", "date_publish": "2023-07-24 18:22:53", "description": "BBC Sport's football expert Rachel Brown-Finnis gives her predictions for the second round of group games at the Women's World Cup.", "filename": "sport_football_66289167_1747753216.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1A05/production/_130416660_rachelbrown-finnis'spredictions.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66289167_1747753216.html", "title": "Women's World Cup 2023 score predictions: Rachel Brown-Finnis predicts the second round of group games", "title_page": "Women's World Cup 2023 score predictions: Rachel Brown-Finnis predicts the second round of group games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Some teams at the Fifa Women's World Cup have already put one foot in the knockout stages after their first game but, for others, an early exit is looming.\nBBC Sport football expert Rachel Brown-Finnis is predicting the outcome of all 64 games in Australia and New Zealand and, before the tournament, she also picked her two teams to go through from each group and reach the knockout stage.\nIt wasn't always the most free-flowing football but I was still very impressed with how New Zealand played in their historic victory over Norway.\nThe Ferns had gone 15 games over 32 years without managing a win at a World Cup, but their second success should come along a lot quicker.\nNew Zealand know they are through to the last 16 if they see off the Philippines, which is a huge incentive, and I think we will see them go on the attack straight away.\nThe home crowd will be right behind them again too, and it is going to be tough for the Philippines to stop them.\nBrown-Finnis's prediction: 2-0\nNorway were so poor in their first game. They just didn't offer anything cohesive as a team.\nNew Zealand's game plan was to stop Norway finding any sort of rhythm, and it worked. They never got anywhere near full-tilt and Switzerland will probably try to do the same.\nI've heard rumblings from inside the Norway camp that there are differences in opinions about how they should be playing, and no joined-up thinking in the squad about their style of play.\nThey clearly have some issues to sort out, which is why I can see the Swiss getting the win that would send them through, and put Norway out.\nBrown-Finnis' prediction: 1-0\nI can understand why Ireland were cagey against Australia - it was their opening game of their first World Cup, and it was against the co-hosts - but they don't look like a side that is suddenly going to start getting lots of goals now.\nCanada have got more quality, and they also really need a win here. I think they will get it too, although I can see Ireland scoring one and keeping it close.\nBrown-Finnis' prediction: 2-1\nAustralia are missing Sam Kerr and we don't know yet when she will be fit again after her calf injury on the eve of the tournament.\nI'm desperate for Kerr to be back in action and I am sure she is hoping to be ready for the knockout stages, but if it is something more significant then that could jeopardise her whole World Cup which would be such a huge shame.\nFingers crossed she is back soon, but, without her, this is going to be a tough game for Australia.\nNigeria showed against Canada that they are hard to beat, and I wouldn't be surprised if they got another point here too - which would leave the Matildas with more work to do to get out of their group.\nBrown-Finnis' prediction: 1-1\nI watched Costa Rica's defeat against Spain and they are probably the worst team I have seen so far at this World Cup.\nI expected Spain to start by making a statement, but Costa Rica made it far too easy for them and they were taken apart.\nJapan made quite a splash too, with their big win over Zambia. If Costa Rica are as open again, then the same will happen to them here.\nBrown-Finnis' prediction: 4-0\nZambia will hopefully have learnt from what happened to them in their first game but the scoreline here depends a lot on Spain, who have a tendency of taking their foot off the gas a little bit.\nI still think Spain will win and go through, but it could be a closer contest than their win over Costa Rica.\nZambia need to be a bit smarter and a lot tighter at the back but they also need to improve in attack.\nThey didn't get the ball up to Barbra Banda at all against Japan but I think she will score this time, although it might just be a consolation goal.\nBrown-Finnis' prediction: 3-1\nI am expecting England to get better and better as this World Cup goes on, so this performance should be much improved on their win against Haiti.\nEven so, I am not anticipating the same kind of instant step-up we saw at last year's European Championship, when the Lionesses went from a narrow victory over Austria in their first group game to an 8-0 thrashing of Norway next time out.\nEngland have come into this tournament in a totally different place in terms of momentum and confidence than they were before the Euros, and are also without some key personnel, so it is is going to take a bit longer for the team to gel.\nBut we do have plenty of experienced players at major finals, and lots of quality too - plus a real mastermind of a manager - so I still think we will get the job done.\nWe need a win to get out of the group, and that's exactly what we will get.\nBrown-Finnis' prediction: 1-0\nChina looked well organised against Denmark, but they don't seem to have much in attack.\nIn contrast, we all saw how dangerous Haiti were against England.\nThey have offered far more going forward than any of the other World Cup debutants, and I would be very surprised if they don't get some goals to show for it this time.\nBrown-Finnis' prediction: 1-2\nThis is a repeat of the 2019 final, and I am going for another USA win... but it is going to be close.\nIt is hard to tell what kind of shape the world champions are in from their first game, because Vietnam did not really try to get out of their own half, but we will find out a lot more about them here.\nThe Netherlands have not found their best form for a while but I do think they are improving.\nThey played pretty well in their opening win over Portugal, and they seem to have found a way of playing that works without the injured Vivianne Miedema.\nBrown-Finnis' prediction: 2-1\nIt's a blow for Jamaica that their captain and top scorer Khadija 'Bunny' Shaw is suspended after her red card against France, but they should still win this game without her.\nI can actually see Jamaica keeping another clean sheet too, unless Panama improve a lot on their poor performance against Brazil.\nBrown-Finnis' prediction: 0-1\nI was impressed by South Africa against Sweden, despite the end result.\nSouth Africa not only took the lead, they defended on the front foot and I liked how they anticipated danger. They dealt with Sweden really well until the very last part of the game.\nArgentina did OK in their defeat by Italy but I don't think South Africa will have seen anything to scare them, and I can see them getting a win this time.\nBrown-Finnis' prediction: 1-2\nSweden did not make things easy for themselves against South Africa, but just about got away with it in the end.\nI don't think they will have as much trouble putting Italy away, and they should book their place in the last 16 here.\nBrown-Finnis' prediction: 2-0\nMorocco had a few decent moments against Germany but they were never going to get anything out of them - they were outclassed in every department.\nIt might not be one-way traffic this time, but it's going to be just as hard for them against South Korea too.\nBrown-Finnis' prediction: 2-0", "url": "https://www.bbc.com/sport/football/66289167"}