{"authors": ["John Haughey", "www.facebook.com"], "date_download": "2025-05-21 04:00:52", "date_modify": "2025-05-21 04:00:52", "date_publish": "2025-04-07 06:19:05", "description": "As the Ulster Championship begins under the sunshine in Ballybofey, BBC Sport NI's John Haughey reflects on Donegal's win", "filename": "sport_articles_cjewxgvdg70o_1747800052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf44/live/c322b260-1339-11f0-a94e-0dcc0e963e4f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cjewxgvdg70o_1747800052.html", "title": "Ballybofey sun a throwback to Ulster SFC times past", "title_page": "Donegal 1-25 Derry 1-15: Ballybofey sun a throwback to Ulster SFC times past - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the sun sparkled in Ballybofey, it felt like a throwback to Ulster Championship times past despite the new rules.\nNo need for the heavy coat or even the woolly hat that has regularly been required on early April days over the last couple of years as the provincial championship had to grudgingly get used to its earlier beginning before being played off with almost indecent haste.\nInstead, it was a day for showing off your taste in shades.\nThe BBC's crack assembled punditry team of Philly McMahon, Chrissy McKaigue and Conor McManus were either jacketed or a long-sleeved smart casual for their TV duties but bare arms and county jerseys thronged the terraces as MacCumhaill Park positively heaved.\nThe long terrace on the Stranorlar side of the ground was nearly packed to capacity 90 minutes before the 14:00 BST throw-in as the patrons lapped up the rays.\nAt that stage, there were only a few dozen folk braving the contrasting chill of the totally shaded covered stand on the far side.\nWhen the game did get under way, despite the late inclusions of Michael Murphy and Patrick McBrearty in the Donegal line-up, it was Derry who showed the early enterprise as Padraig McGrogan charged upfield to kick them into a third-minute lead.\nThe Oak Leafers went on to make at least four incisions deep into the Donegal defence in the opening quarter but Lachlan Murray's fisted point in the 14th minute was their only return for those promising moments with Derry guilty of over-playing the ball on a couple of occasions as they chased goals.\nOf course, their gilt-edged goal chance was squandered in the seventh minute as Shane McGuigan, after being fouled by Hugh McFadden, produced a scuffed penalty effort easily stopped by Shaun Patton.\nThe Slaughtneil man made a hash of the rebound as he attempted to gather the ball instead of first-timing it to the net, which allowed the Donegal keeper to make another block.\nPerhaps trying to give his club-mate some cover, Brendan Rogers later played down the significance of the penalty miss in his post-match interview on the BBC but Derry boss Paddy Tally had no doubt about its importance in the context of the match.\n\"We started the game well. We looked very much in control. [But] We missed a penalty. It put us on the back foot,\" the Oak Leaf County manager added.\n\"We should have been three or four ahead and you needed to get ahead of Donegal today because they are so good when they get ahead.\"\nDonegal's goalscorer Dara O Baoill attributed the home side's somewhat slow start to a sense of sun-induced euphoria which had gripped their fans.\n\"We got caught in the atmosphere a wee bit on the home pitch with the crowd noise,\" said the Gaoth Dobhair man.\n\"I think it took us nearly 18 minutes before we kind of settled and then the chances opened up.\"\nAnd just as was the case in last year's Ulster Championship clash at Celtic Park when he scored two goals, it was O Baoill who inflicted much of the damage on the Oak Leafers.\nFrom a position of 0-5 to 0-5 after 26 minutes which was scant reward for Derry's industry up to that point, O Baoill's brace of two-pointers within five minutes helped Donegal lead 0-11 to 0-5.\nDan Higgins' goal - as Caolan McGonagle was off the pitch receiving treatment - appeared to have the Oak Leafers back in touch as the interval neared only for O Baoill to respond in kind as Derry's defenders back pedalled, allowing him to charge forward some 40 yards before lashing an unstoppable stop past Neil McNicholl.\nRogers, despite having been a pre-match fitness doubt because of an ankle issue, valiantly fought to get the Oak Leafers back into the game as his point and two-pointer, in addition to another successful Conor Doherty shot from outside the 40-metre arc cut Donegal's lead to two.\nBut that was as good as it got for Derry as Donegal responded with seven straight single points which left them nine clear after 47 minutes. Even with the new rules' two-point score, a further Oak Leaf comeback never looked on.\nMurphy, after being well-held by Eoin McEvoy for the most part, finally scored from play five minutes from time as he escaped the shackles of the youngster.\n\"Eoin was very good today. He kept Michael very quiet. Michael got a couple of scores before the end but the game was well opened up by that stage,\" reflected Tally, who spoke of the importance of the lengthy break the Oak Leafers now have before they begin the All-Ireland Group campaign next month.\n\"The season isn't over by a long way. We have the group stages of the championship to look forward to. We have a few weeks off and at this moment in time, we need it. We have a lot of injuries.\n\"We need to strengthen our squad. We need to get boys back. We really only had a week there to get the likes of Brendan in again and Lachlan [Murray] and Ciaran McFaul. I'd like to think with a good run at it that we'll be in better shape.\"\nFor their part, Donegal will be back out again in Ulster in less than a fortnight at Clones when they face Monaghan, who remain the only county to have defeated McGuinness the manager in the province by dint of the 2013 provincial final win over the then All-Ireland champions.\nHopefully, the sun will keep shining for that one.", "url": "https://www.bbc.com/sport/articles/cjewxgvdg70o"}