{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:32", "date_modify": "2025-05-21 07:10:32", "date_publish": "2025-01-31 00:00:00", "description": "All the latest Premier League team news, best manager quotes, transfer latest and Champions League draw reaction.", "filename": "sport_football_live_c9d59ywqxzzt_1747811432.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c9d59ywqxzzt_1747811432.html", "title": "Recap Friday's Premier League team news & Champions League draw reaction", "title_page": "Recap Friday's Premier League team news & Champions League draw reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Recap of Friday's best bits\nThis live page has now closed.\nDon't click off just yet though, as we've collated all the big talking points for you over in the summary points in the top left of the page.\nBelow you'll also find some of the big topics of discussion from today.\nAll the team news that has been revealed by managers in today's news conferences including who is in, who is out and who is a doubt for this weekend's fixtures.\nThe main lines from Mikel Arteta and Pep Guardiola's news conferences before Sunday's big game.\nWhat Aston Villa manager Unai Emery said about Arsenal's approach for striker Ollie Watkins\nAnd of course, all the news and reaction from today's first ever Champions League play-off draw.\nWe're off to lie in a dark room!\nHave a great weekend and we'll catch you soon.\nRecap: What have Guardiola & Arteta said about Sunday's match?\nArsenal v Man City (Sun, 16:30 GMT)\nAfter the drama of the early season meeting between these two, all eyes will be across this game on Sunday.\nArsenal manager Mikel Arteta spoke about about the importance of getting a positive result in this fixture in terms of the title race but added that there was no added \"rivalry\" between his team and City.\nManchester City boss Pep Guardiola said the \"respect is always there\" between him and Arteta and insisted that there is no grudge between the two sides.\nRecap: What did Emery say about Watkins?\nAston Villa forward Ollie Watkins has been the talk of the town over the last few days after it was learned this week that Villa turned down an approach from Arsenal for their main man.\nAnd, of course, Villa manager Unai Emery was asked about the future of Watkins in his pre-match news conference today.\nHe said: \"The commitment of Ollie Watkins with us is a huge commitment. He appreciates a lot how Villa was always supporting him and helping him, when we joined here two years ago how we were working with him and getting the best of him.\n\"Now we need him, like he needed Aston Villa in the last years. I am speaking with him a lot, he is always adapting with every circumstances we have and of course when some teams calling us being interested in the players it’s very good for us and the players.\n\"Some players prefer to leave and some accept to stay here and commit with our challenges. One of them is Ollie Watkins.\"\nRecap: Champions League play-off draw\nWe kicked today off with the first ever Champions League play-off draw of the new format.\nManchester City stole the headlines as they were drawn to face Real Madrid for a place in the last 16.\nOur other British side in the draw, Celtic, will face German champions Bayern Munich.\nLiverpool, Arsenal and Aston Villa are already safely through to the last 16 and will find out their opponents for the first time on Friday 21 February when the next draw is made.\nYou can take up a look at the full draw here.\n'It won't be set one way or the other'\nIpswich Town v Southampton (Sat, 15:00 GMT)\nIpswich Town\nIpswich Town boss Kieran McKenna on match being called a 'must win game': \"You understand it because terminology around 'must win' is different, but that implies it is something that it isn’t.\n\"Of course we are playing another team down towards the bottom of the division and we want to and need to pick up points along the way.\n\"We are coming off the back of a couple of difficult games and this is a home game and and opportunity for us to go and try and win.\n\"Opposition will see it as one of their better opportunities too and whichever way it goes, there is still going to be a lot of games and will be really tight at the bottom.\n\"It won't be set one way or the other.\"\nTeam news - Burns ruled out for rest of season\nIpswich Town v Southampton (Sat, 15:00 GMT)\nIpswich Town\nIpswich Town boss Kieran McKenna has ruled out Wes Burns for the remainder of the season: \"He's got a torn ACL, so will go for surgery next week. Of course we know that's a significant period of time out.\n\"He's seeing the very best people. It's not a very complicated tear, I believe. You can never call an ACL straight forward, but it's an orthodox procedure and everyone is really positive about the prognosis.\n\"Of course he'll miss the rest of the season, and we'll miss him, but he'll be well looked after.\"\nTeam news - Doucoure and Riad out for the rest of the season\nMan Utd v Crystal Palace (Sun, 14:00 GMT)\nCrystal Palace\nCrystal Palace boss Oliver Glasner on injuries: \"Unfortunately, we had several pieces of bad news at the beginning of the week.\n\"Cheick [Doucoure] needs surgery on his knee, and Chadi [Riad] has ruptured his ACL so we have lost both for the rest of the season and Chadi even longer. We hope Cheick will return for pre-season next season.\n\"We will also miss Eberechi [Eze] on Sunday, he got a knock in the League Cup [against Arsenal] and since then he's always had pain, training and not training. We want to get him pain-free so he can perform at his best level.\"\n'I'm convinced Ange will get through it' - Frank\nBrentford v Tottenham (Sun, 14:00 GMT)\nBrentford\nBrentford boss Thomas Frank on Spurs' recent struggles:\n\"We were also hit very hard by injuries last year so, from that perspective, I understand the situation Ange [Postecoglou] is in now at Tottenham.\n\"When results are also not going your way, that's tough. They're things we need to deal with as managers and I'm convinced that Ange is doing that well and he will get through it.\n\"He doesn't need advice, but he just needs to trust his own processes and trust what he believes in, which he does - that's the main thing.\"\nGet more on Brentford here\nWharton and Franca back in the squad\nMan Utd v Crystal Palace (Sun, 14:00 GMT)\nCrystal Palace\nCrystal Palace boss Oliver Glasner on player’s returning: “Adam Wharton and [Matheus] Franca trained with us the whole week without any issues, and we’re thinking both will in the squad. It will also lift their confidence and mood after being out for several weeks.”\nOn Wharton: “We’ve given him a little bit longer time. It’s great work from our rehab staff, and from him personally, and he looks stronger than before.\n\"We are all looking forward to him staying now and training with us, we still have up to 20 games until the end of the season, and we know he’s a great player in midfield. That’s why we hope he stays fit now.”\nGet more on Crystal Palace here\n'Punish the people who are perpetrators of it'\nBrentford v Tottenham (Sun, 14:00 GMT)\nTottenham Hotspur\nTottenham manager Ange Postecoglou was also asked about the abuse suffered by referee Michael Oliver on social media: \"What can we do about it? There are some pretty easy things to do about it, punish the people who are perpetrators of it and make examples of them.\n\"The anonymity of the technical world these days means people can hide and allow themselves some sort of bravado they would never have should they put their name to something, so they are cowards to start with. But if found out, name and shame them, put them out there and we will see if anyone follows suit after that.\"\nFollow our Tottenham page for fan views, opinion, expert analysis, stats and more\n'Spence should be available'\nBrentford v Tottenham (Sun, 14:00 GMT)\nTottenham Hotspur\nTottenham manager Ange Postecoglou on if Mickey van de Ven can play the full 90 on Sunday: \"We will see. Probably not 90 because of the short turnaround but he felt really good last night. It was great to have him out there. You know he is a good player but you don't realise how much of a good player he is until [he's not there]. I guess that is the case with all of our players who have been missing for quite a while.\n\"It's not just the impact they have individually but the impact they have on the group. The whole group got a lift from seeing him out there last night. Knock on wood he got through it really well.\"\nOn the youngsters who scored last night and if they have potential to start against Brentford: \"I don't know about a start but I mean we have had youngsters start for quite a while now so that doesn't change. Certainly the guys who were involved last night in terms of team news the only one who becomes available from last night is Djed [Spence] should be okay. Serg [Sergio Reguilón] is a chance as well. But the rest won't be able to come back.\"\n'I was hoping the transfer window was all over today'\nBrentford v Tottenham (Sun, 14:00 GMT)\nTottenham Hotspur\nTottenham manager Ange Postecoglou has spoken to the media before his side take on Brentford in the Premier League. He was first asked about injuries: \"[Radu Dragusin] yeah, we have to let it settle down and obviously get some more information over the weekend. Not available for this weekend at the moment.\n\"It's a knee so we will let it settle down. There is always concern when it's a knee.\"\nOn the transfer window: \"I was looking at the date, I was hoping it was all over today but it's extended until Monday. We will see what happens over the next couple of days.\"\nAnd on Mathys Tel: \"[I've not heard] a great deal. Usually find out at the tail end of this stuff what is going on. Obviously we're exploring some opportunities the last couple of days of the window to see what we can do.\"\nGet more on Tottenham here\nEverton may 'need' to play Keane as a striker\nEverton v Leicester (Sat, 15:00 GMT)\nEverton\nEverton manager David Moyes on whether he would consider playing defender Michael Keane as a centre-forward due to striker injuries: \"Let's be fair, he's not a centre-forward but everyone seems to tell me he's always done quite well.\n\"I remember him from years ago and he played very well for Burnley before he came here and when I was at Manchester United I had him for a while.\n\"I do think we are probably going to try anything. We are going to need everybody to be adaptable and flexible and see what possibilities we've got.\n\"It's not my first thought but I might need it.\"\n'Ultimately we are still hampered by PSR'\nEverton v Leicester (Sat, 15:00 GMT)\nEverton\nEverton manager David Moyes on how confident he is that he will add to the squad before the close of the transfer window: \"Confident at the moment has become difficult because it's certainly not for the want of trying. I know behind the scenes and for all the Evertonians, we are really out there trying to find players we can bring in. Ultimately we are still hampered by PSR.\n\"I'm really jealous of watching a lot of teams who can maybe go for a lot of players at expensive prices. At the moment we're not quite there but we don't want to get ourselves in a position we've been in before with points deductions. I hope the supporters all understand that and go with us. We hope to bring in some players but maybe it's not the ones that, if we had the money, we would be trying to do.\"\nSee Everton fan views, analysis and more on our club page\n'We are more trying to sign a striker on loan'\nBournemouth v Liverpool (Sat, 15:00 GMT)\nBournemouth\nA bit of transfer news from Bournemouth boss Andoni Iraola, who confirmed the Cherries are still on the hunt for a striker: \"We are trying, but we continue in the same place. We are really thin. We want to sign a player that will improve and help us.\n\"We are also very happy with our current situation, with Evanilson and Enes Unal. We want to keep them, so we are more trying to sign a striker on loan.\n\"We trust the players we already have long-term, but it's true that we need help in the meantime. If the situation appears, we are all for it. If it doesn't appear, we'll continue fighting and being competitive.\"", "url": "https://www.bbc.com/sport/football/live/c9d59ywqxzzt"}