{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 05:03:01", "date_modify": "2025-05-21 05:03:01", "date_publish": "2025-04-04 09:03:19", "description": "Arsenal news: Gabriel injury just another blow for Mikel Arteta", "filename": "sport_football_articles_cy0xlrepz23o_1747803781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff6d/live/da7c5990-1125-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0xlrepz23o_1747803781.html", "title": "Arsenal news: Gabriel injury just another blow for Mikel Arteta", "title_page": "Arsenal news: Gabriel injury just another blow for Mikel Arteta - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The news that Gabriel is going to be out for the whole season is a big blow for Arsenal and Mikel Arteta.\nThe centre-back has arguably been Arsenal's best player this season, but his injury is just the latest chapter in frustrating campaign .\nJust as it looked like they were getting in a position to challenge Real Madrid in the Champions League quarter-final, with Bukayo Saka back from his long-term hamstring injury, they lose Gabriel for the rest of the campaign.\nAfter the win over Fulham, Arteta said the Gunners' injury situation has been \"like this the whole season\".\nHe has put a brave face on, amid the continued disappointment of losing key players, but this injury to Gabriel will make him start to question what is going on.\nAlongside Gabriel, Arsenal have lost Gabriel Martinelli, Bukayo Saka and Kai Havertz for lengthy periods of time with hamstring injuries.\nThe Gunners also have fitness worries over Ben White who has suffered a \"niggle\" in his knee while he returns from a long-term injury of his own and Jurrien Timber could not finish the game against Fulham either.\nArsenal are still second in the league table and have the huge tie against Real Madrid to look forward to, but it is starting to get to the point where it feels like the amount of injuries they have will make it too much even for the most positive Arsenal fan to think they can beat Carlo Ancelotti's side.", "url": "https://www.bbc.com/sport/football/articles/cy0xlrepz23o"}