{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-19 15:37:43", "date_modify": "2025-05-19 15:37:43", "date_publish": "2017-08-13 14:05:43", "description": "Scottish middle-distance runner Laura Muir will be a gold medallist within four years, says BBC commentator Brendan Foster.", "filename": "sport_athletics_40916975_1747669063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E1FB/production/_97315875_muir.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40916975_1747669063.html", "title": "World Championships 2017: Laura Muir 'gold medallist within four years' - Foster", "title_page": "World Championships 2017: Laura Muir 'gold medallist within four years' - Foster - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Laura Muir will be a championship gold medallist within the next four years, says BBC commentator Brendan Foster.\nMuir, fourth in the 1500m final, made it through to Sunday's 5,000m final at the World Championships in London as a fastest qualifier.\n\"Laura Muir's fourth in the 1500m was fantastic,\" said Foster. \"Her run in the heats of the 5,000m was tough because it came just after the 1,500m.\"\nMuir will be competing alongside fellow Scot Eilish McColgan.\nFoster added: \"She's now had a few more days to recover. And Laura one day, I promise you this, on BBC Scotland and on the BBC nationally, you'll be saying: 'Let's now talk to the gold medallist, Laura Muir.' And I promise you that.\n\"I promise you, you'll introduce her as a championship gold medallist within the next four years.\"\nThe commentator believes there is grounds for optimism for Scottish athletics, with the Commonwealth Games coming up on Australia's Gold Coast next April.\n\"A lot of them are quite young and there's an event called the Commonwealth Games coming up in a few months' time,\" said Foster.\n\"They're going to be wearing the blue vest of Scotland and I think it's going to be a glorious time for these Scottish athletes.\n\"I think what they've been doing the last few years in Scotland is remarkable.\n\"We've got Eilish McColgan, Laura Muir, Lynsey Sharp and Chris O'Hare all running today. Our top British hopes are all Scots and I applaud that.", "url": "https://www.bbc.com/sport/athletics/40916975"}