{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:11:15", "date_modify": "2025-05-21 05:11:15", "date_publish": "2025-01-31 16:31:15", "description": "Belfast boxer Colm Murphy makes weight ahead of his Commonwealth silver featherweight title defence against Kasimu Hamad Haji at the Ulster Hall on Saturday.", "filename": "sport_boxing_articles_ckg0menvj47o_1747804275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1235/live/6c2ce3f0-dfe9-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_ckg0menvj47o_1747804275.html", "title": "Murphy makes weight for Commonwealth title defence", "title_page": "BBC Nations Fight Night: Colm Murphy makes weight for Commonwealth title defence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Belfast boxer Colm Murphy made weight ahead of his Commonwealth silver featherweight title defence against Kasimu Hamad Haji at the Ulster Hall on Saturday.\n'Posh Boy' Murphy's bout tops the bill of the Nations Fight night which will be live on the BBC iPlayer and BBC Sport website from 18:00 GMT.\nThe 25-year-old came in at 8st 9lb during Friday's weigh-in at the Europa Hotel in Belfast.\nHis opponent Hamad Haji weighed in slightly heavier than Murphy, who has won Celtic and Irish titles, and is unbeaten in his 13 bouts as a professional.\nSharing the top of the bill is John 'The Kid' Cooney who will defend his Celtic super-featherweight belt against Wales' Nathan Howells. Both fighters weighed in at 9st 2lb.\nOn the undercard, Cookstown's Teo Alin (9st 2lb) came in two pounds lighter than Brayan Mairena (9st 4lb) in their super-featherweight contest.\nJack O'Neill and Luke Flash both came in at 8st 9lb for their super-bantamweight contest, whilst Sean Jackson (8st 4lb) was slightly heavier than Conor Quinn (8st 3lbs) for their super-flyweight encounter.\nCharles McDonagh and Karl Sampson both made weight for their lightweight fight.\nArmagh's James Freeman also made weight but his opponent Jacob Marrar was not present and will be weighed later on Friday afternoon for their welterweight bout.", "url": "https://www.bbc.com/sport/boxing/articles/ckg0menvj47o"}