{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:47", "date_modify": "2025-05-21 05:24:47", "date_publish": "2025-01-14 16:47:22", "description": "Northampton Saints centre Rory Hutchinson signs a new contract to remain with the Premiership club.", "filename": "sport_rugby-union_articles_c75zlyp4164o_1747805087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac8f/live/eca0ab00-d294-11ef-b526-d36fb212fcf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c75zlyp4164o_1747805087.html", "title": "Rory Hutchinson: Northampton Saints centre extends contract with club", "title_page": "Rory Hutchinson: Northampton Saints centre extends contract with club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northampton Saints centre Rory Hutchinson has signed a contract extension to remain with the Premiership club.\nThe 28-year-old Scotland international is already the Saints' current longest-serving player, having made 166 appearances across 11 seasons since graduating from the club's academy in 2015.\nHutchinson has scored 236 points in that time, including 34 tries, with 14 appearances, two tries and a Player of the Month award in this campaign.\nHutchinson told Saints' website: \"I'm really enjoying my rugby this season; I feel like I'm back to where I was a few years ago with my form.\n\"While we're not happy with where we are in the table currently, we're fully confident that we will keep getting better and push up the standings before the end of the season.\n\"There's a core of players in this team that make the group special. We've got some real talent and when we click, we're dangerous and can push any team. Getting to play with players who are that talented and are also your best mates is a privilege, and I can't wait to make more memories here in Northampton.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c75zlyp4164o"}