{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:32", "date_modify": "2025-05-21 06:32:32", "date_publish": "2025-01-31 11:33:05", "description": "Callum Robinson, Jak Alnwick and Callum O'Dowda all sign new contracts with Cardiff City.", "filename": "sport_football_articles_c0qw540v2pwo_1747809152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a42/live/3554ee70-dfc3-11ef-aa66-cde6e2edab48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0qw540v2pwo_1747809152.html", "title": "Callum Robinson, Jak Alnwick, Callum O'Dowda sign new Cardiff deals", "title_page": "Callum Robinson, Jak Alnwick, Callum O'Dowda sign new Cardiff deals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Callum Robinson, Jak Alnwick and Callum O'Dowda have all signed new contracts with Cardiff City.\nRobinson, the Bluebirds' top scorer with 11 goals this season, has signed a two-year extension which will keep him in south Wales until the summer of 2027.\nGoalkeeper Alnwick triggered a one-year extension after making his 25th appearance of the season in this month's 3-0 win over Swansea City, meaning his deal will now run until 2026.\nO'Dowda, who has impressed since switching from left wing to left-back, has agreed a three-year extension to the summer of 2028.\nRenewing the contracts of three important first-team players is a significant bit of business for Cardiff, as several members of their squad will see their current deals expire at the end of this season.\nAfter enduring their worst start to a league season in their history, the Bluebirds are now on an eight-game unbeaten run in all competitions and have climbed up to 18th in the Championship table.\nRepublic of Ireland forward Robinson has been integral to that improvement, scoring six goals in his past six appearances.\n\"The aim was to get back in the team originally, then get back scoring goals. I wanted to earn myself a new deal and I'm so grateful that it's happened,\" he said.\n\"We've got some really good young players and that's why I wanted to continue here. I feel like we can push on. We had a tough start to the season but since then we've been stable, and in the last few weeks we've been really strong – hopefully that can continue.\"\nAlnwick, who has captained Cardiff 18 times this season, said: \"Getting that extra year, I'm delighted I'm going to be staying here longer now.\n\"I got a feeling when I first came down here, the way the club have supported me, the fans, everything about the place, it gives you a feeling of home. It's a special place and for me to be able to stay longer, I can't wait.\"\nRepublic of Ireland international O'Dowda, who recently made his 75th appearance for the club, said: \"I'm delighted. I think everyone can tell how much I've loved this city and representing the club over the past two and a half years. I'm really happy to get it over the line and kick on now.\n\"Coming to Cardiff City, it was a time in my career that revived everything for me. I'd say the love for the game and coming to a city like this, it brought it all back for me.\"", "url": "https://www.bbc.com/sport/football/articles/c0qw540v2pwo"}