{"authors": ["Ray Hunt", "www.facebook.com"], "date_download": "2025-05-21 03:55:57", "date_modify": "2025-05-21 03:55:57", "date_publish": "2025-04-07 13:25:57", "description": "Southampton news: Opinion - Fan writer on Ivan Juric's departure", "filename": "sport_football_articles_cd6j505z81xo_1747799757.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57d7/live/2bcb00b0-b62a-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6j505z81xo_1747799757.html", "title": "Opinion - Fan writer on Ivan Juric's departure - BBC Sport", "title_page": "Southampton news: Opinion - Fan writer on Ivan Juric's departure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With relegation to the Championship now confirmed, Southampton made the swift decision to part ways with Ivan Juric immediately and Simon Rusk is in temporary charge once again.\nIt means work can now begin on recruiting his successor for next season's Championship push.\nIn truth, it was a near impossible task even when when he succeeded Russell Martin on 21 December. Juric inherited a side bottom of the table with one win in 16, but he took the job knowing his record would be tarnished with a near-certain relegation.\nHe lasted 107 days and lost 12 of his 14 top-flight games. With just one win, and the lowest points-per-game average, he will go down as one of the worst managers in league history. According to the stats.\nIt does feel as though he was set up to fail. It is a shifting of the blame from Sport Republic themselves - who are the cause. How could he possibly succeed from the position he was in?\nAnd yet it was clear he was the wrong appointment and he didn't help himself with his team selections, establishing zero identity and seeming completely out of his depth. Once again, Sport Republic's recruitment under scrutiny.\nMany fans have been questioning the timing. What's the point when our fate is sealed? I'm very pleased with the timing. It allows us to maximise the window to find the right replacement. Let work commence immediately.\nAs glad as I am to see Saints making a move early, I just hope it is not a rash decision, like it was to appoint Juric in the first place.\nWe have time on our hands. Let's make the right decision for what appears to be a very important 2025-26 season.\nCan Sport Republic get it right this time?", "url": "https://www.bbc.com/sport/football/articles/cd6j505z81xo"}