{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:15", "date_modify": "2025-05-21 04:09:15", "date_publish": "2024-12-29 00:00:00", "description": "Anis Mehmeti grabs a double as Bristol City score three goals in 20 minutes to send Portsmouth into the Championship relegation zone.", "filename": "sport_football_live_cr7vjpxele2t_1747800555.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr7vjpxele2t_1747800555.html", "title": "Bristol City 3-0 Portsmouth: Anis Mehmeti inspires Robins to win", "title_page": "Bristol City 3-0 Portsmouth: Anis Mehmeti inspires Robins to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anis Mehmeti scored twice in the first half as Bristol City netted three goals in 20 minutes to coast to a win which sent Portsmouth back into the Championship relegation zone.\nThe rampant Robins, with Mehmeti and Nahki Wells at their influential best, offered by far the bigger threat and could easily have been more than 3-0 ahead by the break.\nForward Mehmeti set the hosts on their way, coolly finishing off a fine pass from Max Bird.\nCity as good as sealed the points - and a third victory in four home games - with two goals in three minutes soon after the half-hour mark to move up to 10th in the table.\nMehmeti swept home his, and Bristol City's, second by finishing off a lovely Wells cross from the left after a fine move and defender Rob Dickie's simple close-range effort ended any realistic chances of a Pompey comeback.\nPortsmouth, who drop to 23rd after a third loss in four, have not won on their travels since October.\nThey had more than 56% possession but did very little with it, managing just two touches in the opposition box and three attempts with 75 minutes gone - and ending with only four touches in the City box in total.\nCity's tactics in allowing their visitors to edge possession and pick them off on the counter-attack should have led to a greater margin of victory.\nAfter Mehmeti's opener, Wells had a powerful strike saved by keeper Nicolas Schmid and also went close with another opportunity, while a Mehmeti shot was deflected wide.\nBut the Albanian was in scintillating form and his eighth goal in 24 Championship appearances was not long in coming following a smart one-two with Wells.\nDickie's quick reactions, after Luke McNally's header was saved by Schmid, allowed him to poke in City's third.\nScott Twine and substitutes Sam Bell and Yu Hirakawa all went close to adding to the City goal tally after the break while, at the other end, Colby Bishop and Marlon Pack were unable to convert rare half-chances for Portsmouth.\nBut the scoreless second period meant there was a repeat to the winning scoreline for the home side in this fixture, Pompey having won the previous meeting between the two 3-0 earlier this month.\nPortsmouth boss John Mousinho told BBC Radio Solent:\n\"It was a really poor result and performance. It's disappointing to follow up what have been really positive performances in the past couple of games.\n\"It was probably our best performance of the season against Coventry and we were unlucky against Watford on Thursday.\n\"One of the most frustrating things is we started the game OK and were the better side for the first 10-15 minutes. We really shot ourselves in the foot with the first goal. I can live with going a goal down but we went under after that. We didn't look like we competed.\n\"We tried to freshen things up after the busy period and with a game on Wednesday. Making those changes was our way of trying to have more energy and I don't think the changes were the issue. If you are not 'at it' then you get punished.\"", "url": "https://www.bbc.com/sport/football/live/cr7vjpxele2t"}