{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:31", "date_modify": "2025-05-21 06:51:31", "date_publish": "2025-03-29 21:23:32", "description": "Lilah Fear and Lewis Gibson win GB's first figure skating World Championship medal since Torvill and Dean in 1984 with ice dance bronze in Boston.", "filename": "sport_articles_c1egp8qgppwo_1747810291.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/50c9/live/eea5f540-0d4a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1egp8qgppwo_1747810291.html", "title": "World Figure Skating Championships 2025: Lilah Fear & Lewis Gibson win Great Britain's first medal since 1984", "title_page": "World Figure Skating Championships 2025: Lilah Fear & Lewis Gibson win Great Britain's first medal since 1984 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lilah Fear and Lewis Gibson won Great Britain's first figure skating World Championship medal in more than 40 years with ice dance bronze in Boston.\nNot since 1984, when Jayne Torvill and Christopher Dean won their fourth and final global title, have British skaters stood on a world podium in any discipline.\nBut Fear, 25, and Gibson, 30, finally ended that wait on Saturday with a total score of 207.11 points, having finished fourth at the previous two World Championships.\nAmerican favourites Madison Chock and Evan Bates defended their title while Canada's Piper Gilles and Paul Poirier took silver.\n\"I can't even describe my feelings, I'm still shaking,\" said Fear. \"I'm in disbelief.\"\nGibson added: \"It's a dream come true.\"\nOlympians Fear and Gibson are three-time European medallists and earlier this season claimed Britain's first ever medal at the Grand Prix final.\nIn Boston, they had placed third after Friday's rhythm dance but while their free dance routine - soundtracked by a trio of Beyonce hits - was judged the sixth best on Saturday, their combined score was enough to land them the greatest success of their careers to date.\nFellow Britons Phebe Bekker and James Hernandez placed 17th.\nEarlier this month, Torvill said Fear and Gibson had \"taken ice dancing in Great Britain to another level\".\nThe World Championships is a qualifying event for next year's Winter Olympic Games in Milan-Cortina.\nElsewhere, US skater Ilia Malinin won a second straight men's figure skating world title with a routine which included a record-equalling six quadruple jumps.\nThe 20-year-old also carried off a once-banned backflip as part of his routine.\nHe and fourth-place finisher Adam Siao Him Fa of France became the first skaters in nearly 50 years to legally land the move at a world championships.\nGibson played football as a youngster - until, that was, he watched the first series of Dancing On Ice.\nAn 11-year-old Gibson was enthralled by Torvill and Dean's ITV reality show.\nThe Scot, who was brought up in Prestwick, South Ayrshire, loved the thrills and spills and wanted a piece of the action for himself.\n\"They just looked to be having so much fun,\" he told BBC Sport previously. \"I knew it was something I wanted to do.\"\nIn London, more than 400 miles away from Gibson's home, six-year-old Fear was already a natural on the ice.\nThe daughter of a figure skater and the niece of a Canadian ice hockey player, the ice rink was familiar territory. She had first learned to skate at the tender age of two.\nFear was born in Greenwich, Connecticut, to Canadian parents but was raised in London and has Canadian-British citizenship.\nThey joined forces in the 2016-17 season and represented Team GB at the Winter Olympics in 2022, where they finished tenth.\nTorvill and Dean, who won Olympic gold in 1984 and bronze in 1994, never thought they would be doing a farewell tour in 2025 still waiting for Great Britain to win another Olympic figure skating medal.\nThey are hoping the wait may be nearly over with the emergence of Fear and Gibson, who Torvill says have \"taken ice dancing in Great Britain to another level\".\nTorvill and Dean have been following their progress with interest for several years since first meeting them on the ice at Alexandra Palace, when the youngsters asked them to look at the programme they were working on.\n\"We sort of added a few little moves here and there, but I think what struck us right at the beginning was how well matched they were as a team, in stature and personality and ability,\" Dean said earlier this month.\nSo, could Fear and Gibson's Beyonce moves be about to finally take over from Torvill and Dean's Bolero and provide some new skating role models in Britain?\n\"We're retiring this year, so it would be nice to just hand that on to them,\" Dean said.", "url": "https://www.bbc.com/sport/articles/c1egp8qgppwo"}