{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:15:28", "date_modify": "2025-05-21 05:15:28", "date_publish": "2025-04-03 19:30:59", "description": "English riders lose their scheduled rides for this year's North West 200 and Isle of Man TT with the demise of the WTF (We're The Future) road racing team.", "filename": "sport_motorsport_articles_c5ygp1j911no_1747804528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b89/live/ad1e1dd0-10c1-11f0-8d69-dff4a207f5f1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_c5ygp1j911no_1747804528.html", "title": "Isle of Man TT & North West 200: Hillier and Herbertson lose scheduled rides for 2025", "title_page": "Isle of Man TT & North West 200: Hillier and Herbertson lose scheduled rides for 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leading motorcycle road racing exponents James Hillier and Dominic Herbertson have lost their scheduled rides for this year's North West 200 and Isle of Man TT events with the news that their WTF (We're The Future) Racing team has withdrawn from the meetings.\nAn official statement from the team issued on 1 April confirmed the news.\n\"WTF Racing has today announced the immediate cessation of all road racing activities due to significant commercial circumstances beyond the team's control,\" the statement read.\nThe team's sister outfit, OMG Racing, has also withdrawn from the 2025 British Superbike Championship for similar reasons.\nThe squad won the BSB title last year with Kyle Ryde and has captured two championships for Yamaha during their association.\nHampshire rider Hillier rode Honda machinery for the We're The Future team in 2024, securing a fourth place finish in the blue riband Senior TT and fifth positions in the Superbike and Superstock races.\nThe 40-year-old was fourth in both Superstock outings at the North West last year and took the same placing in one of the three Superbike races.\nSpeaking on his Facebook page, Hillier described the news of his team's demise as \"a big shock\".\n\"I really didn't see that coming and it's not great timing. Where I stand at the moment I don't quite know.\n\"I'm trying to make progress to sort some machinery and get something in place. We don't have a whole lot of time but we'll try to work something out to get something in place.\n\"Funding the operation is the biggest thing in today's economic climate.\"\nHerbertson had been scheduled to race for the team for the first time this season.\nThe 34-year-old from Hexham clinched his first TT podium last year with a third place in the Supertwins class.", "url": "https://www.bbc.com/sport/motorsport/articles/c5ygp1j911no"}