{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:35", "date_modify": "2025-05-20 14:44:35", "date_publish": "2023-07-27 21:50:09", "description": "Coventry City sign 22-year-old Dutch defender Milan van Ewijk from SC Heerenveen for an undisclosed fee - their seventh summer deal.", "filename": "sport_football_66331334_1747752275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0811/production/_130556020_gettyimages-1259130537.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66331334_1747752275.html", "title": "Milan van Ewijk: Coventry City sign Dutch defender from SC Heerenveen on four-year deal", "title_page": "Milan van Ewijk: Coventry City sign Dutch defender from SC Heerenveen on four-year deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City have made their seventh summer signing by bringing in Dutch defender Milan van Ewijk from Eredivisie side SC Heerenveen on a four-year deal for an undisclosed fee.\nThe 22-year-old wing-back played 36 league games for Heerenveen in the 2022-23 season, scoring six goals.\n\"He is an exciting player who really fits in with the way we play,\" said Coventry manager Mark Robins.\n\"He has great pace and quality going forward, as well defensive ability.\"\nHe follows the Sky Blues' signings of Bristol City defender Jay Dasilva, Everton striker Ellis Simms, Japan midfielder Tatsuhiro Sakamoto from Belgian club KV Oostende, Barnsley goalkeeper Brad Collins, Swansea City defender Joel Latibeaudiere and Burnley defender Bobby Thomas.\nNetherlands Under-21 international Van Ewijk started his career in the Feyenoord academy and continued his development with a move to Excelsior Maassluis.\nHe moved to the Dutch top flight in 2020 after signing for ADO Den Haag before joining Heerenveen in 2021.\nBeaten Championship play-off finalists Coventry, who sold star striker Viktor Gyokeres to Sporting Lisbon for an eight-figure club record fee, start the new season with a trip to local rivals Leicester City on Sunday, 6 August.", "url": "https://www.bbc.com/sport/football/66331334"}