{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:54", "date_modify": "2025-04-26 06:41:54", "date_publish": "2025-03-02 12:06:43", "description": "'He has damaged his knee' - McInnes on Magennis", "filename": "sport_articles_c871jx3x7vjo_1745649714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c86/live/b678c7d0-f75e-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c871jx3x7vjo_1745649714.html", "title": "'He has damaged his knee' - McInnes on Magennis", "title_page": "'He has damaged his knee' - McInnes on Magennis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derek McInnes refused to speculate on the severity of Kyle Magennis' latest injury after the Kilmarnock midfielder lasted just 12 minutes against Ross County.\nThe midfielder was brought on as a second-half substitute in the 1-0 defeat but had to be replaced after falling to the ground while trying to tackle Noah Chilvers.\n\"I would hate to speculate too much until we get that looked at properly, but he has damaged his knee,\" manager McInnes said.\n\"I thought he was outstanding against Rangers midweek, but with his history we thought his best impact would be from the bench.\"\nSince the 2020-21 campaign, when Magennis was at Hibs, he has not managed more than 13 league games in a season due to injury.\n\"Unfortunately, he just looks as if he has twisted his knee and those are always the ones you worry about. Hopefully he's lucky because he hasn't had much luck in injuries,\" McInnes added.\nKilmarnock changed three for the trip to Dingwall after a gruelling week, with Danny Armstrong, Bobby Wales and Magennis all dropped to the bench.\n\"A few boys were really leggy on Friday so we took that into consideration for the starting team, but we finished really strongly,\" McInnes added.\n\"We should have won the game. It has been a tough week. We were close against Aberdeen, against Rangers and again today.\n\"We just have to pull ourselves together and hopefully on having a game next week will let us get a couple of players back.\"", "url": "https://www.bbc.co.uk/sport/articles/c871jx3x7vjo"}