{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:58", "date_modify": "2025-05-21 07:59:58", "date_publish": "2025-01-25 00:00:00", "description": "Iliman Ndiaye's first-half penalty proves decisive as Everton ease their relegation fears with a hard-fought victory at Brighton.", "filename": "sport_football_live_cly9249xlmzt_1747814398.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cly9249xlmzt_1747814398.html", "title": "Brighton & Hove Albion 0-1 Everton: Iliman Ndiaye penalty eases Toffees' relegation fears", "title_page": "Brighton & Hove Albion 0-1 Everton: Iliman Ndiaye penalty eases Toffees' relegation fears - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iliman Ndiaye's first-half penalty proved decisive as Everton eased their relegation fears with victory at Brighton in Toffees' boss David Moyes 700th Premier League match as a manager.\nWith seven minutes of a largely uneventful first half remaining, Brighton defender Joel Veltman appeared to deliberately shepherd the ball out of play with his hand while under pressure from Beto inside the penalty area.\nAfter being invited by the video assistant referee (VAR) to consult his pitchside monitor, on-field official Tim Robinson pointed to the spot and Ndiaye sent a low effort into the bottom corner to give Everton the lead.\nBrighton created little in the first half but emerged for the second period with greater purpose, Kaoru Mitoma curling a shot wide of the far post before Orel Mangala and Jordan Pickford combined to clear Joao Pedro's close-range effort behind for a corner.\nHalf-time substitute Georginio Rutter flashed a shot narrowly wide after shrugging off Jarrad Branthwaite on the edge of the box, but there was no way through for the Seagulls as their unbeaten start to 2025 came to an end.\nThe visitors, however, face an anxious wait on the fitness of striker Dominic Calvert-Lewin and midfielder Orel Malanga, who were both forced off with injuries.\n\"They don't look great, either of them,\" Moyes said. \"They'll get assessed first thing [on Sunday] and then we'll make a decision.\n\"We've had a difficult day and, if we'd actually come away and not got a result, it would have felt much sorer because of the injuries we've picked up.\"\nEverton's second away win of the season lifts them seven points clear of the relegation zone with a game in hand, while Brighton remain ninth.\nReaction to Saturday's Premier League action\nHaving masterminded a richly deserved victory over Tottenham last weekend, Moyes will hope his team's latest triumph is the first step towards improving their dismal recent away record.\nSaturday's win was just their second in 22 league matches away from Goodison Park, while Ndiaye's first-half spot-kick was only their second goal in seven top-flight games on their travels.\nEverton's cause was not helped by Calvert-Lewin's 12th-minute withdrawal after the striker appeared to pull his right hamstring as he leapt for the ball inside the Brighton half.\nNdiaye – who scored a wonderful goal in the win over Spurs – also cut a frustrated figure for large parts of the first half, but he kept his composure from the spot to net his fifth Premier League goal of the campaign.\nHe was, however, shown a yellow card after appearing to mimic a seagull while celebrating his 42nd-minute opener in front of the home supporters.\nThe Toffees had their backs to the wall for most of the second half and they had to play the closing stages with 10 men, Mangala picking up an apparent knee injury after Moyes had used all his allotted substitution slots.\nBut on a day when the 61-year-old became just the third manager after Arsene Wenger and Sir Alex Ferguson to reach 700 Premier League games, the visitors held on to register back-to-back victories for the first time this season and claim a vital three points in their battle to avoid the drop.\nFabian Hurzeler's side had started the new year with a spring in their step, drawing against Arsenal and thrashing Norwich in the FA Cup before registering back-to-back victories over Ipswich and Manchester United.\nHowever, since a 2-1 victory over Manchester City on 9 November, they have now failed to win in their last five league matches at Amex Stadium.\nThey started on the front foot against the Toffees and Tariq Lamptey, making his first start of 2025, was heavily involved, getting in behind the Everton defence on several occasions without being able to pick out a team-mate in the penalty area.\nBrighton players were vociferous in their protests at Robinson's decision to penalise Veltman for handball late in the half, but it was a clumsy intervention from the Dutchman that ultimately cost his side dearly.\nA second-half improvement was not enough to spark a Seagulls revival, with Pedro's blocked effort their only attempt on target in the 90 minutes.\nBoth sets of players were involved in an altercation at the final whistle but Hurzeler's team can have no complaints at the outcome.\nIt emerged afterwards that Yankuba Minteh, who scored one and assisted another in the 3-1 win at Old Trafford, was left out of the starting XI by Hurzeler after reporting late for pre-match preparations.", "url": "https://www.bbc.com/sport/football/live/cly9249xlmzt"}