{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:34:13", "date_modify": "2025-05-20 13:34:13", "date_publish": "2023-07-25 08:32:28", "description": "QPR have signed defender Morgan Fox on a two-year deal following his departure from Stoke City.", "filename": "sport_football_66299148_1747748053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4EDE/production/_130509102_gettyimages-1413887462.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66299148_1747748053.html", "title": "Morgan Fox: QPR sign defender following Stoke City departure", "title_page": "Morgan Fox: QPR sign defender following Stoke City departure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Queens Park Rangers have signed defender Morgan Fox on a two-year deal following his departure from fellow Championship side Stoke City.\nThe 29-year-old made 43 appearances for the Potters last season missing only three league matches.\n\"I will be looking to use my experience to push this squad forward,\" he told the club website, external.\n\"The manager explained his plans for the team and for me personally, and it is an exciting opportunity.\"\nFox, who came through Ipswich Town's Academy, began his professional career with Charlton Athletic in 2013 where he made more than 100 appearances for the club. In 2017 he joined Sheffield Wednesday where he spent three-and-a-half seasons.\nAs his career has progressed Fox has moved from left-back and into a more central defensive role.\nManager Gareth Ainsworth added: \"I've said from the moment I came in that experience is lacking a little bit in this squad, we have got some fantastic young talent here but it needs some leadership and Morgan definitely brings that.\n\"He is a warrior and brings much-needed experience.\n\"Morgan is only 29 and there is no reason why he can't have a really good stint here, and he brings healthy competition to that backline.\"", "url": "https://www.bbc.com/sport/football/66299148"}