{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:51", "date_modify": "2025-05-21 05:29:51", "date_publish": "2025-01-14 13:55:45", "description": "Lancashire director of cricket Mark Chilton describes Jimmy Anderson as 'inspirational' and 'an icon of English cricket'.", "filename": "sport_cricket_articles_cj65k09nkx2o_1747805391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b4d/live/673a0cd0-d27c-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cj65k09nkx2o_1747805391.html", "title": "Jimmy Anderson: Lancashire thrilled to have 'inspirational' player for 2025", "title_page": "Jimmy Anderson: Lancashire thrilled to have 'inspirational' player for 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lancashire director of cricket Mark Chilton says it is great news for the club to have Jimmy Anderson available for them for the 2025 season.\nAnderson will play in the County Championship and the T20 Blast for Lancashire after deciding to delay his retirement.\nEngland's all-time leading wicket-taker in Tests, the 42-year-old has not played a match since his final Test, against the West Indies at Lord's last July.\n\"I find it fascinating and quite inspirational that Jimmy still has the desire to want to play and want to be part of what we're trying to achieve over the next year or two,\" Chilton told BBC Radio Lancashire.\n\"So we're all really looking forward to it.\"\nSince playing his 188th Test six months ago, Anderson has kept his options open.\nHe has worked as a bowling coach within the England set-up, while he put his name forward for the IPL auction, although no club signed him up.\nAnderson played once for Lancashire last season and took 7-35 against Nottinghamshire at Southport in July, showing the impact that he can still have.\nSo Chilton recognises what a boost it is for the Red Rose and county cricket in general to have the veteran of 704 Test wickets still performing at a time when Championship stalwarts like Hampshire captain James Vince are considering their options.\n\"It's fantastic for everyone involved, the members, the supporters, the county game as well,\" he said.\n\"To have Jimmy back in that competition is great for everyone. He's an absolute icon of English cricket.\"\nChilton also says that Anderson's performance against Notts last summer shows that even at 42, his skills are not on the wane.\nHe adds: \"He's fit enough, he still looks after himself and his age is just a number.\n\"He can play for as long as he feels capable of doing his job.\"", "url": "https://www.bbc.com/sport/cricket/articles/cj65k09nkx2o"}