{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:23", "date_modify": "2025-05-21 07:56:23", "date_publish": "2025-01-13 15:26:42", "description": "PSL 2025 draft: David Warner & Kane Williamson sign for Karachi Kings but Jason Roy & Dawid Malan miss out", "filename": "sport_cricket_articles_c391n0ep3l8o_1747814183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b824/live/2ef360d0-d1c1-11ef-9f8b-6138f0924d77.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c391n0ep3l8o_1747814183.html", "title": "PSL 2025 draft: David Warner & Kane Williamson sign for Karachi Kings but Jason Roy & Dawid Malan miss out", "title_page": "PSL 2025 draft: David Warner & Kane Williamson sign for Karachi Kings but Jason Roy & Dawid Malan miss out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Warner and Kane Williamson will both play in the Pakistan Super League in 2025 after being drafted on Monday.\nFormer Australia opener Warner, 38, was signed by Karachi Kings and will be joined by New Zealand's Williamson, 34, who initially went undrafted before being selected in the supplementary round.\nEnglish trio Tom Kohler-Cadmore (Peshawar Zalmi), Tom Curran and Sam Billings (both supplementary - Lahore Qalandars) were also signed, but Jason Roy, Dawid Malan, Tymal Mills and Alex Hales were among the players not selected.\nIreland's Josh Little will play for Multan Sultans, while New Zealand's Daryl Mitchell (Lahore Qalandars), West Indies' Jason Holder and South Africa's Rassie van der Dussen (both Islamabad United) also got picked up.\nAustralia's Usman Khawaja, South Africa's Tabraiz Shamsi and Afghanistan's Mujeeb ur Rahman failed to earn deals.\nEngland's James Vince (Karachi Kings), Chris Jordan and David Willey (both Multan Sultans) had already been retained by their sides alongside Pakistan stars like Babar Azam, Shaheen Shah Afridi and Muhammad Rizwan.\nThe 10th edition is set to take place between 8 April and 19 May and is expected to clash in part with the Indian Premier League.\nPlayers signed in PSL draft\nIslamabad United: Matthew Short, Jason Holder, Ben Dwarshuis, Salman Irshad, Mohammad Nawaz, Andries Goes, Saad Masood, Hunain Shah. Supplementary: Riley Meredith, Rassie van der Dussen\nKarachi Kings: David Warner, Adam Milne, Abbas Afridi, Khushdil Shah, Aamir Jamal, Mir Hamza, Litton Das, Riazullah, Fawad Ali. Supplementary: Kane Williamson, Mohammad Nabi, Omair Bin Yousuf\nLahore Qalandars: Daryl Mitchell, Kusal Perera, Asif Afridi, Asif Ali, Rishad Hossain, Mohammad Akhlaq, Momin Qamar, Mohammad Azab. Supplementary: Tom Curran, Sam Billings, Salman Ali Mirza\nMultan Sultans: Michael Bracewell, Mohammad Hasnain, Kamran Ghulam, Akif Javed, Tayyab Tahir, Gudakesh Motie, Josh Little, Shahid Aziz, Ubaid Shah. Supplementary: Johnson Charles, Shai Hope, Yasir Khan\nPeshawar Zalmi: Tom Kohler-Cadmore, Corbin Bosch, Mohammad Ali, Abdul Samad, Nahid Rana, Hussain Talat, Max Bryant, Najibullah Zadran, Maaz Sadaqat. Supplementary: Alzarri Joseph, Ahmed Daniyal", "url": "https://www.bbc.com/sport/cricket/articles/c391n0ep3l8o"}