{"authors": ["Emlyn Begley", "www.facebook.com"], "date_download": "2025-05-21 06:22:59", "date_modify": "2025-05-21 06:22:59", "date_publish": "2025-03-31 13:49:29", "description": "After Nico O'Reilly's FA Cup quarter-final exploits for Manchester City, BBC Sport looks at what positions he can play and how highly Pep Guardiola rates him.", "filename": "sport_football_articles_cp31dvrnpqgo_1747808579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a96f/live/5c0cd7d0-0e30-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp31dvrnpqgo_1747808579.html", "title": "Man City's Nico O'Reilly: Who is he? What position does he play?", "title_page": "Man City's Nico O'Reilly: Who is he? What position does he play?  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"He's going to play in the semi-final, for sure,\" said Pep Guardiola after Nico O'Reilly saved Manchester City's FA Cup skins for the second round in a row.\nThe City manager may have been half-joking - with the words accompanied by a huge smile and laugh - but 20-year-old O'Reilly has certainly added to his growing reputation.\nO'Reilly, who has yet to start a Premier League game, came off the bench at half-time to assist two goals in Sunday's 2-1 comeback win at Bournemouth.\nIn the previous round he scored twice as they came from behind to beat Plymouth 3-1.\nO'Reilly also netted in the 8-0 win over Salford in round three.\nBBC Sport looks at the youngster's career.\nO'Reilly joined City as an eight-year-old, having also been scouted by Manchester United, Liverpool and Everton.\nHe signed his first professional contract in July 2022, alongside 10 other players, including Rico Lewis.\nIn 2022-23 O'Reilly made headlines with two remarkable goals in the Under-18 Premier League - a stoppage-time scorpion kick winner against Middlesbrough and 40-yard strike against Manchester United - and ended the season as an unused sub for the first team against Brighton.\nLast season his development was hindered by injury but he still scored from near the halfway line for City's under-23 team against Nottingham Forest.\nIn the summer he impressed Guardiola on City's pre-season tour of the United States - and started the Community Shield win over Manchester United.\nO'Reilly has played in the Premier League and Champions League from the bench this season and started in the Carabao Cup - but his headline acts have been in the FA Cup.\nWith three goals and two assists in four games, only Exeter's Josh Magennis has been involved in more FA Cup proper goals this season.\nAnyone coming through the academy at a Guardiola club would be best placed to be flexible - and 6ft 2in O'Reilly matches that description.\nHe is a midfielder - and an attacking midfielder at that - by trade. City's website says he is \"able to operate in a number of attacking positions\".\nYet in pre-season, with Rodri absent, O'Reilly featured as a defensive midfielder alongside Mateo Kovacic in a friendly against Barcelona - in which he scored - and against United in the Community Shield.\nO'Reilly played as a centre-back against Salford and as a left-back when he replaced Abdukodir Khusanov at half-time against Bournemouth.\nO'Reilly enjoyed a huge amount of joy down the left, with a cross to assist Erling Haaland and pass to play in Omar Marmoush.\nBBC chief football news reporter Simon Stone said: \"He had his contract updated in 2023 but there are likely to be talks about an improved deal in light of recent performances.\n\"There was interest from Chelsea in the winter window but never close.\"\nHad O'Reilly, who is under contract until 2028, joined Chelsea, he would have followed fellow City academy product Cole Palmer.\nPalmer has scored 39 goals in 78 games and become an England regular since his 2023 move.\nO'Reilly spoke to BBC Sport after his man-of-the-match performance on Sunday.\n\"My instructions were to get involved as much as I can - in the attacking phase and securing the defending phase,\" he said.\n\"It was good to get the contributions with the two assists. I was buzzing.\n\"Towards the start it was a bit challenging because I've not really played there, but I know what I need to do there and I'm just buzzing I can play.\n\"I'm just grateful for the opportunities I get from the manager and to play with the players who are out there.\"\nCity play Nottingham Forest in the semi-finals at Wembley in late April.\nIt may not have been a serious promise from Guardiola, but it seems likely that O'Reilly will feature at some stage.\nNo player remaining in the FA Cup has more goals than his three this season.", "url": "https://www.bbc.com/sport/football/articles/cp31dvrnpqgo"}