{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:48", "date_modify": "2025-04-26 03:37:48", "date_publish": "2025-03-08 00:00:00", "description": "Bristol Rovers boost their League One survival hopes when they end a four-game winless run by beating play-off chasing Huddersfield 1-0.", "filename": "sport_football_live_c4g92gg0er7t_1745638668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9aa/live/b328f1d0-fc46-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c4g92gg0er7t_1745638668.html", "title": "Bristol Rovers 1-0 Huddersfield Town", "title_page": "Bristol Rovers 1-0 Huddersfield Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bristol Rovers boosted their League One survival hopes when they ended a four-game winless run by narrowly seeing off play-off chasing Huddersfield 1-0.\nRuel Sotiriou made the most of the Terriers' disjointed back line after 10 minutes for the only goal of the game, when defender Clinton Mola headed the ball forward for the Rovers attacker to control and volley over goalkeeper Lee Nicholls.\nSil Swinkels then helped keep the lead intact three minutes later as the on-loan Aston Villa defender rushed back to clear the ball off the line, after Dion Charles' shot looped off Pirates goalkeeper Jed Ward and towards the goal.\nWard also denied Lasse Sorenson from close range minutes later, when the Terriers wing back met Josh Ruffels' deep cross.\nNicholls stopped Scott Sinclair netting just before the break as the Rovers forward attempted to round the goalkeeper following Connor Taylor's knockdown header.\nAfter half-time, Ward denied Sorensen again – with a low save – following a run across the pitch by Ruben Roosken.\nAnd Matt Butcher rifled just wide from outside the area with eight minutes remaining.", "url": "https://www.bbc.co.uk/sport/football/live/c4g92gg0er7t"}