{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-19 14:39:47", "date_modify": "2025-05-19 14:39:47", "date_publish": "2017-08-08 22:28:31", "description": "Can Chelsea retain their title? Who is destined for the drop? Phil McNulty predicts where your team will finish in the 2017-18 Premier League.", "filename": "sport_football_40816204_1747665587.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C797/production/_97259015_premier_league_predictions_getty2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40816204_1747665587.html", "title": "Premier League 2017-18: Phil McNulty predicts who will finish where", "title_page": "Premier League 2017-18: Phil McNulty predicts who will finish where - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n8 August 2017\ncomments\nIt is that time of the year again and the most contentious pre-season task of all - picking who will finish where in the Premier League in the 2017-18 campaign.\nThe big money is spent and will continue to be spent even after the season gets under way this weekend.\nSo here goes with the crystal ball - and with the usual safety net excuse that these placings could yet be moved around by some more heavy lifting in the transfer markets before the end of August.\nQuiz: Meet the Premier League new boys\nPlay our Premier League Predictor game\nPremier League at 25: Best of England's top flight since 1992\nWho will be Premier League champions? BBC pundits' views\nNew signings, new bosses, new rules\nPhil McNulty's predicted 2017-18 Premier League positions at a glance\nPosition\nClub\nPosition (cont)\nClub (cont)\n1\nManchester City\n11\nNewcastle\n2\nChelsea\n12\nWest Brom\n3\nManchester United\n13\nCrystal Palace\n4\nLiverpool\n14\nSouthampton\n5\nArsenal\n15\nStoke\n6\nTottenham\n16\nSwansea\n7\nEverton\n17\nBurnley\n8\nWest Ham\n18\nWatford\n9\nLeicester\n19\nHuddersfield\n10\nBournemouth\n20\nBrighton\nManchester City\nThis season: Champions\nLast season: 3rd\nPep Guardiola's arrival at Etihad Stadium last summer was greeted with an excitement and expectation which was ultimately unfulfilled as they finished the season without a trophy and in third place in the Premier League.\nThere were flashes of the scintillating attacking style the Catalan wants but too often City were fragile in defence.\nGuardiola has embarked on some spectacular - not to mention costly - renovation work on his defence.\nEderson has replaced the flawed Claudio Bravo in goal and the failure to put a succession plan in place for ageing full-backs has been remedied by the arrival of England's right-back Kyle Walker from Tottenham and Monaco's Benjamin Mendy on the left for in excess of £100m. Real Madrid's Danilo also adds further defensive versatility and ability.\nCity's attacking riches are already in place and look for Gabriel Jesus to emerge as a Premier League superstar this season.\nThis makes City the champions.\nPlayers in: Benjamin Mendy (Monaco), Danilo (Real Madrid), Kyle Walker (Tottenham), Ederson Moraes (Benfica), Douglas Luiz (Vasco Da Gama), Bernardo Silva (Monaco)\nPlayers out: Pablo Zabaleta (West Ham), Gael Clichy (Istanbul Basaksehir), Jesus Navas (Sevilla), Willy Caballero (Chelsea), Bacary Sagna (released), Enes Unal (Villarreal), Angus Gunn (Norwich, loan), Aaron Mooy (Huddersfield), Bersant Celina (Ipswich), Pablo Mari, Thierry Ambrose, Manu Garcia, Paolo Fernandes, Thomas Agyepong, Angelino (NAC Breda, loan), James Horsfield (NAC Breda), Ruben Sobrino (Alaves), Joe Coveney (Nottingham Forest), Bruno Zuculini (Hellas Verona), Olivier Ntcham (Celtic), Nolito (Sevilla), Joe Hart (West Ham), Aleksandar Kolarov (Roma), Aleix Garcia, Douglas Luiz, Marlos Moreno (Girona, loan), Kelechi Iheanacho (Leicester City), Fernando (Galatasaray), Anthony Caceres (Al Wasl, loan)\nChelsea\nThis season: 2nd\nLast season: Champions\nAntonio Conte's miraculous rebuilding from a 10th-place finish to champions last season was a superb feat of management.\nThere has been turmoil around Stamford Bridge this summer, with Diego Costa's discontent providing the backdrop along with questions about Conte's own future before he signed an improved two-year deal.\nChelsea, however, will still be hugely formidable although it remains to be seen whether the decision to sell Nemanja Matic to rivals Manchester United is a wise one.\nConte, having appeared to pursue Romelu Lukaku, will be delighted to have landed one of his personal favourites in Alvaro Morata from Real Madrid while Tiemoue Bakayoko's arrival from Monaco will be expected to offer a more youthful and athletic alternative to Matic.\nNo title - but a very good shout for a cup.\nPlayers in: Alvaro Morata (Real Madrid), Tiemoue Bakayoko (Monaco), Antonio Rudiger (Roma), Willy Caballero (Manchester City)\nPlayers out: Juan Cuadrado (Juventus), Christian Atsu (Newcastle), Asmir Begovic (Bournemouth), Dominic Solanke (Liverpool), Alex Kiwomya (Doncaster Rovers), Bertrand Traore (Olympique Lyonnais), Nathan Ake (Bournemouth), Tammy Abraham (Swansea, loan), Kasey Palmer (Huddersfield, loan), Todd Kane (Groningen, loan), Ola Aina, Michael Hector (Hull, loan), Ruben Loftus-Cheek (Crystal Palace, loan), Nathaniel Chalobah (Watford), Marco van Ginkel (PSV Eindhoven, loan), Ike Ugbo (Barnsley, loan), Kurt Zouma (Stoke, loan), Izzy Brown (Brighton, loan), Tomas Kalas (Fulham, loan), Jamal Blackman (Sheffield United, loan), Bekanty Victorien Angban (Waasland-Beveren, loan), Nemanja Matic (Manchester United), Mario Pasalic (Spartak Moscow, loan), Mason Mount, Fankaty Dabo, Matt Miazga, Charlie Colkett, Mukhtar Ali (Vitesse Arnhem, loan)\nManchester United\nThis season: 3rd\nLast season: 6th\nIt is testimony to Jose Mourinho's built-in winning mechanism that a campaign that appeared a disappointment for so long still ended with Manchester United winning the EFL Cup and the Europa League, confirming Champions League football this season.\nUnited and Mourinho will be under pressure to offer a serious title challenge this season and I expect them to do so.\nVictor Lindelof from Benfica will be asked to provide added central defensive reliability with the shield offered by midfield enforcer Nemanja Matic.\nThe big arrival, however, is £75m Romelu Lukaku from Everton, apparently stolen from under Chelsea's nose.\nLukaku will be under huge scrutiny to deliver but his track record suggests he will. The Belgian has been accused of being \"a flat track bully\" - United should not worry too much about that because that is exactly what they required during too many draws against sides beneath them last season.\nMourinho will be back in the title shake-up.\nPlayers in: Nemanja Matic (Chelsea), Romelu Lukaku (Everton), Victor Lindelof (Benfica)\nPlayers out: Zlatan Ibrahimovic (released), Josh Harrop (Preston), Regan Poole (Northampton, loan), Wayne Rooney (Everton), Dean Henderson (Shrewsbury, loan), Adnan Januzaj (Real Sociedad), Sam Johnstone (Aston Villa, loan), Devonte Redmond (Scunthorpe United, loan), Cameron Borthwick-Jackson (Leeds, loan)\nLiverpool\nThis season: 4th\nLast season: 4th\nStrange summer for Liverpool and manager Jurgen Klopp - and at this stage it is a slight leap of faith to back him to deliver another top-four finish but he is moving his club in the right direction.\nMohamed Salah's arrival from Roma offers even more pace and movement to an attack rich in those qualities with the likes of Sadio Mane, Roberto Firmino and Philippe Coutinho.\nLiverpool will watch developments on the south coast with interest to see if there is any way of reviving the fractious deal for Southampton's Virgil van Dijk to bolster a vulnerable defence and RB Leipzig midfielder Naby Keita remains on the radar.\nThe big question mark is the future of Coutinho. Klopp and Liverpool are understandably bullish about their refusal to sell - but Barcelona do not normally just walk away. The outcome will be crucial to Liverpool's season.\nPlayers in: Mohamed Salah (Roma), Andrew Robertson (Hull), Dominic Solanke (Chelsea)\nPlayers out: Andre Wisdom (Derby County), Ryan Fulton (Hamilton Academical), Lucas Leiva (Lazio), Kevin Stewart (Hull), Pedro Chirivella (Willem II, loan), Connor Randall (Hearts, loan), Taiwo Awoniyi (Royal Excel Mouscron, loan), Shamal George (Carlisle United, loan)\nArsenal\nThis season: 5th\nLast season: 5th\nArsenal finally slipped out of the Champions League places last season after a campaign which contained much acrimony and discontent at Emirates Stadium, but which was salvaged to an extent by an outstanding FA Cup final win against Chelsea.\nArsene Wenger, the central figure in so much of that debate, has signed a new two-year deal and the French manager want to make a fast start to ensure there is a feel-good mood around Arsenal.\nSead Kolasinac will add muscle at left-back while the highly regarded Alexandre Lacazette has arrived from Lyon with many suggesting he is a guarantee of goals.\nWenger insists Alexis Sanchez will not be sold but there will still be much relief if he is still a Gunner at the turn of the month. If he stays, and Wenger says he will, then Arsenal can flourish.\nStill some questions though - and Wenger does not need any early slip-ups.\nPlayers in: Alexandre Lacazette (Lyon), Sead Kolasinac (Schalke)\nPlayers out: Takuma Asano (Stuttgart, loan), Chris Willock (Benfica), Kaylen Hinds (Wolfsburg), Marc Bola (Bristol Rovers, loan), Dan Crowley (Willem ll), Wojciech Szczesny (Juventus), Emiliano Martinez (Getafe, loan), Stephy Mavididi (Preston North End, loan), Yaya Sanogo (released)\nTottenham\nThis season: 6th\nLast season: 2nd\nRather like my slightly wayward prediction of Leicester City's relegation before the season they won the title, this is a prediction that bears all the hallmarks of coming back to haunt.\nSpurs have proved an outstanding team over the last two seasons but have yet to win a trophy - this placing is also heavily influenced by the fact they have yet to strengthen this summer.\nManager Mauricio Pochettino has a top-class first team but still needs high quality cover for Harry Kane and chairman Daniel Levy should also be scouring the markets to improve what he has.\nAnd how will Spurs cope with playing their matches at Wembley, where their recent record is so poor?\nI will not be surprised in the slightest if Spurs defy this current placing, but just one or two questions to be answered at this stage of the summer.\nFancy them very strongly for a cup this season.\nPlayers in: N/A\nPlayers out: Connor Ogilvie (Gillingham, loan), Luke McGee (Portsmouth), Kyle Walker (Manchester City), Federico Fazio (Roma), Clinton Njie (Marseille), Tom Glover (Central Coast Mariners, loan), Anton Walkes (Atlanta United, loan), Joshua Onomah (Aston Villa, loan)\nEverton\nThis season: 7th\nLast season: 7th\nEverton are a club on the move under manager Ronald Koeman and major shareholder Farhad Moshiri.\nTheir summer transfer business has been highly impressive, with signings for the future in goalkeeper Jordan Pickford, England defender Michael Keane and exciting Spain Under-21 striker Sandro Ramirez, with former Ajax captain Davy Klaassen expected to provide goals from midfield.\nThere is justified optimism around Goodison Park, with Gylfi Sigurdsson expected to arrive from Swansea City in a club record £50m deal, and that will only increase if Wayne Rooney can roll back the years after his return to Goodison Park.\nThe minus has come with the departure of Romelu Lukaku to Manchester United. Koeman has yet to land the front line striker to replace his goals and presence - Everton also appear to lack pace.\nRoss Barkley also looks to be on the way out but Everton are on the up. Do not expect them to finish any lower than last season but they may need a couple more transfer windows to seriously infiltrate the top six.\nPlayers in: Wayne Rooney (Manchester United), Michael Keane (Burnley), Davy Klaassen (Ajax), Jordan Pickford (Sunderland), Sandro Ramirez (Malaga), Cuco Martina (Southampton), Henry Onyekuru (Eupen), Nathangelo Markelo (FC Volendam), Boris Mathis (Metz), Anton Donkor (Wolfsburg, loan), Josh Bowler (QPR), Lewis Gibson (Newcastle United)\nPlayers out: Tom Cleverley (Watford), Russell Griffiths (Motherwell), Henry Onyekuru (Anderlecht, loan) Conor McAleny (Fleetwood Town), Henry Onyekuru (Anderlecht), Gerard Deulofeu (Barcelona), Brendan Galloway, Tyias Browning (Sunderland, loan), Romelu Lukaku (Manchester United), Aiden McGeady (Sunderland), Courtney Duffus (Oldham Athletic), Matthew Pennington (Leeds, loan), Joe Williams (Barnsley, loan), Kieran Dowell (Nottingham Forest, loan), Antonee Robinson (Bolton Wanderers, loan)\nWest Ham\nThis season: 8th\nLast season: 11th\nIt was an unsettling first season at London Stadium for the Hammers, away from the home comforts and familiar surroundings of Upton Park.\nThere may also be a slight false start this season with home fixtures delayed after the World Athletics Championships but expect better from Slaven Bilic's side after some very interesting work in the transfer market.\nEngland goalkeeper Joe Hart will hope to prove he is not in permanent decline in a World Cup year after his loan move while former Manchester City team-mate Pablo Zabaleta will provide steel and consummate professionalism.\nJavier Hernandez, goal poacher par excellence, may yet prove to be a masterstroke while Marko Arnautovic is a talented wildcard.\nCause for cautious optimism.\nPlayers in: Javier Hernandez (Bayer Leverkusen), Marko Arnautovic (Stoke), Joe Hart (Manchester City, loan), Pablo Zabaleta (Manchester City), Sead Haksabanovic (Halmstads)\nPlayers out: Jonathan Calleri (Deportivo Maldonado), Gokhan Tore (Besiktas), Alvaro Arbeloa (retired), Sam Howes (Watford), Sam Ford (released), Kyle Knoyle (Swindon Town), Sam Westley (released), Havard Nordtveit (Hoffenheim), Reece Oxford (Borussia Monchengladbach, loan), Raphael Spiegel (Boavista), Stephen Hendrie (Southend United), Enner Valencia (Tigres UANL), George Dobson (Sparta Rotterdam), Darren Randolph (Middlesbrough), Ashley Fletcher (Middlesbrough), Reece Burke, Josh Cullen (Bolton Wanderers, loan)\nLeicester\nThis season: 9th\nLast season: 12th\nLeicester City looked much more like the side that won the Premier League after Craig Shakespeare took over from the sacked Claudio Ranieri last season - but will full command be different to temporary charge for a talented coach?\nRiyad Mahrez's future remains in doubt but the Foxes have shown their ambition with the arrival of Kelechi Iheanacho from Manchester City, while plenty regard the signing of Vicente Iborra from Sevilla as a coup.\nShakespeare will hope there is no more upheaval before the end of August, with Chelsea being linked with midfielder Danny Drinkwater.\nAnd with one or two more additions (Harry Maguire may prove a shrewd acquisition in defence) then this could be a very decent season at the King Power.\nPlayers in: Harry Maguire (Hull), Eldin Jakupovic (Hull), Vincent Iborra (Sevilla), Sam Hughes (Chester), Kelechi Iheanacho (Manchester City), George Thomas (Coventry City)\nPlayers out: Ron-Robert Zieler (Stuttgart), Bartosz Kapustka (Freiburg, loan), Callum Elder (Wigan, loan)\nBournemouth\nThis season: 10th\nLast season: 9th\nBournemouth will be starting to feel almost established in the Premier League now as they enter their third season, still with manager Eddie Howe and the likes of top scorer Josh King.\nAnd this status is reflected in the additions they have made to the squad in the summer.\nAsmir Begovic is a goalkeeper of experience and reliability, Nathan Ake is a defender of rich promise while Jermain Defoe will hope to continue the Indian summer of his career towards next year's World Cup with England in Russia.\nBournemouth and Howe are growing together and I expect that to be reflected in another season of good consolidation.\nPlayers in: Asmir Begovic (Chelsea), Connor Mahoney (Blackburn), Nathan Ake (Chelsea), Jermain Defoe (Sunderland)\nPlayers out: Mark Travers (Weymouth, loan), Ryan Allsop (Blackpool, loan), Jordan Lee (Torquay, loan), Lewis Grabban (Sunderland, loan), Sam Surridge (Yeovil Town, loan), Ben Whitfield (Port Vale, loan)\nNewcastle United\nThis season: 11th\nLast season: Promoted (Championship winners)\nAny prediction about Newcastle United always comes with a variety of strings attached - and this is no different.\nManager Rafael Benitez's relationship with the hierarchy has appeared strained at various stages of the summer, a situation not unfamiliar for either party throughout their history.\nBenitez's Premier League experience and his bond with the Toon Army means it is vital he feels comfortable in his role. The effects of anything otherwise could be catastrophic for Newcastle.\nThe so-called marquee signing may not have arrived on Tyneside yet but Benitez is the most important figure in Newcastle's dynamic. If he goes, all bets are off.\nIf Benitez feels confident and settled then expect a comfortable mid-table finish and he has always enjoyed a cup run.\nThe Toon Army, however, will have its fingers crossed.\nPlayers in: Mikel Merino (Borussia Dortmund, loan), Javier Manquillo (Atletico Madrid), Jacob Murphy (Norwich), Stefan O'Connor (Arsenal), Josef Yarney (Everton), Florian Lejeune (Eibar), Christian Atsu (Chelsea)\nPlayers out: Florian Thauvin (Marseille), Kevin Mbabu (BSC Young Boys), Matz Sels (Anderlecht, loan), Haris Vuckic (FC Twente), Lubomir Satka (DAC 1904), Vurnon Anita (Leeds), Alex Gilliead (Bradford, loan), Tom Heardman (Bury, loan), Adam Armstrong (Bolton, loan), Yoan Gouffran (Goztepe Spor Kulubu), Sean Longstaff (Blackpool, loan), Daryl Murphy (Nottingham Forest), Lewis Gibson (Everton), Ivan Toney (Wigan, loan)\nWest Brom\nThis season: 12th\nLast season: 10th\nIt has been a relatively quiet summer at The Hawthorns, although it remains to be seen how important the loss of the influential Darren Fletcher to Stoke City proves to be.\nStriker Jay Rodriguez is a real talent who has suffered cruelly with injuries but manager Tony Pulis will hope he regains the form and influence that won him England recognition.\nAnd while he is an acquired managerial taste to some, Pulis keeps teams in the Premier League with the minimum of fuss. Expect the same again.\nPlayers in: Ahmed Hegazi (Al Ahly, loan), Jay Rodriguez (Southampton), Ben Pierce (Everton), Yuning Zhang (Vitesse Arnhem)\nPlayers out: Darren Fletcher (Stoke City), Sebastien Pocognoli (Standard Liege), Yuning Zhang (Werder Bremen, loan)\nCrystal Palace\nThis season: 13th\nLast season: 14th\nPalace are another club who will now be feeling a sense of permanence in the Premier League - but once again suffered managerial musical chairs with the surprise resignation of Sam Allardyce after he guided them away from relegation last season.\nNew manager Frank de Boer is a personality of real pedigree who is looking to re-establish himself after a brief and bruising experience at Inter Milan following success at Ajax.\nDe Boer must get used to life in the Premier League but Palace have firepower in the shape of Christian Benteke and Wilfried Zaha, while Ruben Loftus-Cheek is a smart addition on loan from Chelsea.\nPalace should have enough to survive with a little to spare.\nManager in: Frank de Boer\nPlayers in: Jairo Riedewald (Ajax), Ruben Loftus-Cheek (Chelsea, loan)\nPlayers out: Steve Mandanda (Marseille), Mathieu Flamini, Joe Ledley, Fraizer Campbell (released)\nSouthampton\nThis season: 14th\nLast season: 8th\nNew season. New manager. New season. More speculation about their best player.\nThis seems to be life almost every summer at Southampton as Mauricio Pellegrino replaces the sacked Claude Puel, who seemed harshly dealt with after an eighth-place finish and a Wembley final, while Virgil van Dijk sits on the sidelines declining to figure in pre-season as he craves a £60m move to Liverpool.\nSouthampton seem to thrive in this environment but surely there will come a time when they cannot pull off this trick of succeeding surrounded by such turbulence.\nThe Saints will not struggle for a moment but I do not expect them to be as high as in recent seasons. It will be interesting to see how Italian Manolo Gabbiadini fares after an outstanding introduction last term. He will be a crucial figure.\nManager in: Mauricio Pellegrino\nPlayers in: Jan Bednarek (Lech Poznan), Mario Lemina (Juventus)\nPlayers out: Cuco Martina (Everton), Lloyd Isgrove (Barnsley), Harley Willard (Maidstone), Martin Caceres (Hellas Verona), Jason McCarthy (Barnsley), Jay Rodriguez (West Brom), Harrison Reed (Norwich, loan), Harry Lewis (Dundee United, loan), Ryan Seager (MK Dons, loan)\nStoke\nThis season: 15th\nLast season: 13th\nThere was a real sense that Stoke City were running out of momentum under Mark Hughes last season. Some of the old menace had gone and they were too tame on too many occasions.\nStill formidable on their own ground but Hughes will need a good start to deflect some of the criticism that was aimed his way last season.\nDarren Fletcher will be a steady presence in midfield while Kurt Zouma is a very good defensive addition - but how much will the 'X Factor' provided by the unpredictable Marko Arnautovic be missed?\nBig season for Hughes. Good start essential.\nPlayers in: Kurt Zouma (Chelsea, loan), Josh Tymon (Hull), Darren Fletcher (West Brom), Tre Pemberton (Blackburn), Eric Maxim Choupo-Moting (Schalke)\nPlayers out: Daniel Bachmann (Watford), Shay Given (released), Liam Edwards (Hull City), Harry Isted (Luton Town), Joel Taylor (released), George Waring (Tranmere Rovers), Jon Walters (Burnley), Glenn Whelan (Aston Villa), Marko Arnautovic (West Ham), Phil Bardsley (Burnley), Dominic Telford, Ryan Sweeney (Bristol Rovers, loan)\nSwansea\nThis season: 16th\nLast season: 15th\nPaul Clement did a fine job in pulling Swansea City out of a desperate situation last season and survival could well be regarded as success for the Swans this season.\nTammy Abraham will arrive on loan from Chelsea with high expectations and a growing reputation while Roque Mesa from Las Palmas has the air of a deal conducted under the radar that might just have other clubs looking on in envy in the months to come.\nThe big question surrounds the talisman Gylfi Sigurdsson, the source of so much inspiration and seemingly on his way to Everton.\nCan Swansea find the players to replace what the Icelander gives them? How Clement tackles this may shape their season.\nPlayers in: Roque Mesa (Las Palmas), Tammy Abraham (Chelsea, loan), Erwin Mulder (Heerenveen), Marc Walsh (Finn Harps), Cian Harries (Coventry City)\nPlayers out: Gerhard Tremmel (retired), Marvin Emnes (released), Liam Shephard (Peterborough United), Josh Vickers (Lincoln City), Owain Jones (released), Tom Dyson (released), Tom Holland (The New Saints), Alex Samuel (Stevenage), Franck Tabanou (Guingamp), Bafetimbi Gomis (Galatasaray), Daniel James (Shrewsbury Town, loan), Borja Baston (Malaga, loan), Jordi Amat (Real Betis, loan), Jack Cork (Burnley), Connor Roberts (Middlesbrough, loan), Modou Barrow (Reading)\nBurnley\nThis season: 17th\nLast season: 16th\nBurnley's survival last season was built on the foundations of Turf Moor, the glorious old stadium where they proved so tough to beat.\nThe Clarets have lost their outstanding defender Michael Keane to Everton, but still have the fine goalkeeper Tom Heaton and, most significantly of all, manager Sean Dyche.\nHe has added some real battle-hardened Premier League edge in Jon Walters and Phil Bardsley, while Jack Cork and Charlie Taylor will also make a contribution.\nCould be some suffering along the way but I think Burnley will stay up.\nPlayers in: Phil Bardsley (Stoke), Jack Cork (Swansea), Jon Walters (Stoke), Charlie Taylor (Leeds), Adam Legzdins (Birmingham)\nPlayers out: Michael Kightly (Southend United), Joey Barton (released), George Green (released), RJ Pingling (Merstham), Christian Hill (released), Taofiq Olomowewe (released), Jon Flanagan (Liverpool), Josh Ginnelly (Lincoln, loan), Michael Keane (Everton), Ntumba Massanka (Wrexham, loan), Bradley Jackson (Southport, loan), Rouwen Hennings (Fortuna Dusseldorf), Paul Robinson (retired), Connor King (Barnoldswick Town), Tendayi Darikwa (Nottingham Forest), Chris Long (Northampton Town, loan), Alex Whitmore (Bury, loan), Aiden O'Neill (Fleetwood Town, loan)\nWatford\nThis season: 18th\nLast season: 17th\nWhat to make of Watford? Another new manager and this time it is the highly regarded Marco Silva, the man who produced a revival of sorts at Hull City last season but ultimately could not prevent relegation.\nSome questioned Silva's glowing reviews on the basis of his inability to get results away from home - this season at Vicarage Road will provide a clearer picture.\nInteresting signings such as Will Hughes from Derby County and Nathaniel Chalobah from Chelsea… but I fear a season of struggle for the Hornets.\nManager in: Marco Silva\nPlayers in: Nathaniel Chalobah (Chelsea), Harvey Bradbury (Portsmouth), Sam Howes (West Ham), Daniel Bachmann (Stoke), Kiko Femenia (Alaves), Will Hughes (Derby), Richarlison (Fluminense)\nPlayers out: Dennon Lewis (Crawley Town, loan), Mario Suarez (Guizhou Hengfeng Zhicheng), Obbi Oulare (Royal Antwerp, loan), Steven Berghuis (Feyenoord), Juan Carlos Paredes (Emelec), Uche Agbo (Standard Liege), Sven Kums (Anderlecht)\nHuddersfield\nThis season: 19th\nLast season: Promoted (Championship play-offs)\nNow this is an interesting one. The Pride of Yorkshire and the great Championship story of last season - and this is a prediction made with no huge confidence.\nHuddersfield defied the odds so brilliantly last season that to write them off before the season is fraught with danger.\nManager David Wagner is an inspirational figure, they will be backed by fervent fans and their work in the transfer market, done early and with clear focus, shows a club with a plan. This is a unified force.\nAustralian midfielder Aaron Mooy, signed from Man City after spending last season on loan at John Smith's Stadium, will be crucial once more and Benin international striker Steve Mounie has shown good things already.\nWinger Tom Ince, signed from Derby, finally gets the chance to prove he is Premier League quality.\nThe fear is their rivals will just have too much over the course of a long season - but I will be delighted to be proved wrong.\nPlayers in: Mathias Jorgensen (FC Copenhagen), Steve Mounie (Montpellier), Kasey Palmer (Chelsea, loan), Tom Ince (Derby), Jonas Lossl (Mainz, loan), Aaron Mooy (Manchester City), Laurent Depoitre (Porto), Danny Williams (Reading), Scott Malone (Fulham)\nPlayers out: Tareiq Holmes-Dennis (Portsmouth, loan), Jordy Hiwula (Fleetwood, loan), Fraser Horsfall (Gateshead, loan), Rekeil Pyke (Port Vale, loan), Jack Payne (Oxford United, loan), Mark Hudson (retired)\nBrighton\nThis season: 20th\nLast season: Promoted (Championship runners-up)\nThink the relegation places will be a serious dogfight this season and a blanket could be thrown over the bottom five here.\nChris Hughton has done a superb job to take Brighton up after the disappointment of just missing out before. This is a club with real potential who could thrive if they survive this first season back.\nTransfer dealings have been steady and new goalkeeper Mathew Ryan, signed from Valencia for £5.2m as a replacement for David Stockdale, will carry much weight of responsibility, while midfielder Davy Propper has arrived from PSV Eindhoven for a club record fee.\nIzzy Brown from Chelsea adds pace but Brighton will hope the flourishes of brilliance from Anthony Knockaert can provide the match-winning moments to keep them up.\nBrighton will be a great place to watch Premier League football this season and all neutrals will wish them well.\nPlayers in: Izzy Brown (Chelsea, loan), Markus Suttner (Ingolstadt), Mathew Ryan (Valencia), Pascal Gross (Ingolstadt), Josh Kerr (Celtic), Mathias Normann (FK Bodo/Glimt), Steven Alzate (Leyton Orient), Ales Mateju (Viktoria Plzen), Davy Propper (PSV Eindhoven)\nPlayers out: Elvis Manu (Genclerbirligi SK), Jordan Maguire-Drew (Lincoln City), Christian Walton (Wigan, loan), Rob Hunt (Oldham Athletic), Oliver Norwood (Fulham, loan), Ben White (Newport County, loan), Tom Dallison, Tyler Forbes (Accrington Stanley, loan)\nAll transfers sourced from the Premier League website., external All transfers correct as of 23:00 BST on 8 August.\nTake part in the Premier League Predictor game, which allows you to create leagues with friends.\nFollow Match of the Day on Instagram, external for the best photos from the world of football.\nSubscribe to the BBC Sport newsletter, external to get our pick of news, features and video sent to your inbox.\nRelated internet links\nMatch of the Day Facebook\nMatch of the Day Twitter\nPremier League official site\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/football/40816204"}