{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 04:19:52", "date_modify": "2025-05-21 04:19:52", "date_publish": "2025-02-06 17:54:35", "description": "England's Champions Trophy match against Afghanistan will go ahead, despite calls for a boycott.", "filename": "sport_cricket_articles_cde9p7kn916o_1747801192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc4f/live/d7cf35d0-e481-11ef-9332-6d8408b4920e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cde9p7kn916o_1747801192.html", "title": "England to play Afghanistan despite boycott calls", "title_page": "England to play Afghanistan despite boycott calls - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Champions Trophy match against Afghanistan will go ahead, despite calls for a boycott.\nA cross-party letter, signed by nearly 200 UK politicians, was sent to the England and Wales Cricket Board (ECB) asking for England to refuse to play in response to the Taliban's human rights record.\nFemale participation in sport in Afghanistan has effectively been outlawed since the Taliban returned to power in 2021.\nThe matter was discussed at an ECB board meeting on Thursday, after which the governing body confirmed the match in Lahore on 26 February will take place as scheduled.\nIn a statement, the ECB said the situation in Afghanistan \"is nothing short of gender apartheid\", adding a co-ordinated international response by the cricketing community is the appropriate way forward.\n\"At a cricketing level, when women's and girls' cricket is growing rapidly around the world, it is heartbreaking that those growing up in Afghanistan are denied this opportunity, but the appalling oppression of women and girls by the Taliban goes so much further,\" it read.\nIt added the ECB donated £100,000 to the Global Refugee Cricket Fund to help female cricketers in exile, and it will continue to press the ICC to take action, including supporting the women and girls of Afghanistan who want to play cricket.\nEngland will also play Australia and South Africa in the Champions Trophy, which takes place in Pakistan and Dubai from 19 February.\nEngland have played Afghanistan twice – at the 2022 T20 World Cup and the 2023 50-over World Cup – since the Taliban returned to power in 2021.\nCalls for a boycott of this fixture were led by Labour MP Tonia Antoniazzi, who said England's players should use their \"power\" to \"make a difference\".\nHer fellow Labour MP and Culture Secretary Lisa Nandy said the game should go ahead, adding that boycotts were counter-productive.\nWhen asked last month about the possibility of the players leading a boycott, similar to England's refusal to play in Zimbabwe during the 2003 World Cup, captain Jos Buttler said: \"I don't think a boycott is the way to go about it.\"", "url": "https://www.bbc.com/sport/cricket/articles/cde9p7kn916o"}