{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 04:58:00", "date_modify": "2025-05-21 04:58:00", "date_publish": "2024-12-20 20:12:41", "description": "A fully clothed Tyson Fury weighs in four stone heavier than champion Oleksandr Usyk for Saturday's heavyweight world title fight in Saudi Arabia.", "filename": "sport_boxing_articles_cewx41zg2k4o_1747803480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee6d/live/96029880-bf0c-11ef-8911-252920fd10c8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cewx41zg2k4o_1747803480.html", "title": "Fully clothed Fury four stone heavier than Usyk", "title_page": "Fury vs Usyk 2: Fully clothed Fury four stone heavier than Usyk  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A fully clothed Tyson Fury weighed in at a career-heavy 20st 1lb for Saturday's heavyweight world title fight against champion Oleksandr Usyk in Saudi Arabia.\nUkraine's Usyk will defend his WBA (Super), WBC and WBO titles against two-time champion Fury at Riyadh's Kingdom Arena.\nDressed in a leather jacket, white trousers and a baseball cap - which he kept on when he stepped on the scales - Fury weighed in four stone heavier than his opponent.\nHe cut a more relaxed figure than he has throughout the week, even shaking hands with Usyk's team.\nBut the 36-year-old Briton seemed eager to get Friday's weigh-in over and looked away after just seven seconds during their final face-off. They had shared an 11-minute face-off a day earlier.\nThe Morecambe fighter walked off without giving an on-camera interview.\nUsyk, asked how he was feeling, simply replied: \"Nothing.\"\nThe 37-year-old earned a split decision win for the undisputed title in May, inflicting a first career loss on Fury.\nHe too was fully dressed in a tracksuit as he tipped the scales, making it difficult to determine the boxers' conditioning and shape, as he weighed in at 16st 2lb, just two pounds heavier than his weight for the first fight.\n\"You can analyse it anyway you like but tomorrow night you're going to find out who is the best,\" Fury's promoter, Frank Warren, said.\n\"You know both of them will come to fight. We are going to see something extra, extra special.\"\nAway from the weigh-in, the fighters' teams are in a dispute over a replacement official and the length of Fury's beard.\nFury has grown a bristly beard, which he says provides added strength. Boxing rules usually require facial hair to be of a certain length. Stubble, for example, can further damage a cut.\nAt a rules meeting on Friday, Fury's beard was cleared. Usyk's team, however, are planning to \"push this further\".\nSpeaking to the Independent,, external Usyk's promoter Alex Krassyuk cited WBC rules setting out that the length of facial hair cannot act as a cushion for the impact of a punch.\nUsyk v Fury 2 - all you need to know\nMeanwhile, Fernando Barbosa was set to be one of the three judges on Saturday but he has not travelled to Riyadh because of illness.\nSteve Weisfeld and Ignacio Robles were flown in to replace Barbosa, but the two fighters' teams were split on which judge should be used.\nRobles will be the third judge after a coin toss was used to decide.", "url": "https://www.bbc.com/sport/boxing/articles/cewx41zg2k4o"}