{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:19", "date_modify": "2025-05-20 12:23:19", "date_publish": "2023-08-04 14:20:06", "description": "McAvoy eyes fast Hearts start on two fronts", "filename": "sport_articles_cekym9re97eo_1747743799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ead0/live/c67e8c80-32d1-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cekym9re97eo_1747743799.html", "title": "McAvoy eyes fast Hearts start on two fronts", "title_page": "McAvoy eyes fast Hearts start on two fronts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Frankie McAvoy says it could be a month into the new season before Hearts are performing at full pelt, but has challenged them to hit the ground running.\nThe Tynecastle side kick off their Premiership campaign at St Johnstone on Saturday and have been set twin targets of reclaiming third place in Scotland and advancing to the Europa Conference League group stage.\n“Sometimes it maybe takes four or five weeks into a season before you see a team really bedding down,” said the Jambos head coach.\n“You try and get a good start, particularly in the Premiership. If you can pick up points early in the season it hopefully helps you nearer the end.\n“Last season Hearts had to juggle Europe and the league but made a good start and got a few points away from Aberdeen, although ultimately they overtook us.\n“We need to be mindful we have two goals we’ve set – finish third and trying to get through in Europe.”\nJapanese forward Kyosuke Tagawa signed on Friday to become Hearts’ fifth new arrival this summer and Costa Rican striker Kenneth Vargas is also set to arrive, but McAvoy says the club are still eyeing further reinforcements.\n“We’d still like to add a few more players,” he added. “Steven [Naismith] is working closely with Joe [Savage] to identify other targets.\n“Vargas will be in and hopefully we be won’t be far away with another one or two.”", "url": "https://www.bbc.com/sport/articles/cekym9re97eo"}