{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 14:35:04", "date_modify": "2025-05-20 14:35:04", "date_publish": "2023-07-25 05:24:41", "description": "New Zealand miss a golden opportunity to edge closer to the knockout stages of the Women's World Cup as the Philippines upset them in Wellington.", "filename": "sport_football_66290027_1747751704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0564/production/_130508310_gettyimages-1568840354.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290027_1747751704.html", "title": "New Zealand 0-1 Philippines: World Cup debutants score 'special' victory to leave players in tears", "title_page": "New Zealand 0-1 Philippines: World Cup debutants score 'special' victory to leave players in tears - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Philippines' first Women's World Cup victory \"has to be one of the biggest wins in the history of sport in the country\", says manager Alen Stajcic.\nSarina Bolden's early header shocked co-hosts New Zealand, who missed a golden opportunity to edge closer to the knockout stages in Wellington, but it was a brilliant result for debutants the Philippines.\n\"How can you top beating a host nation at a World Cup? It's number one,\" said Stajcic.\n\"It was very emotional out on the pitch, seeing just about everyone crying. It's unbelievable. When you hear stories of other teams needing so long to win World Cup matches… We have done it in our second match in our first World Cup.\n\"You can't really appreciate how far back in the pack we have come compared to these teams. The unity, work rate and heart from the team was special.\n\"I don't know if there's been a bigger win for Philippines' sport. It has to be one of the biggest wins in the history of the country.\"\nGlobal success has come the way of the Philippines thanks to superstar boxer Manny Pacquiao, but at this World Cup new sporting heroes are emerging.\nThe Philippines players celebrated passionately at full-time as substitutes and staff sprinted onto the pitch with many holding their heads in their hands in disbelief.\nMeanwhile New Zealand, who shocked Norway on the opening day and knew another victory could have sealed their place in the last 16, were left frustrated as they could not find a breakthrough.\nGoalkeeper Olivia McDaniel produced heroics in stoppage time, denying New Zealand substitute Grace Jale with an excellent fingertip save as her half-volley was heading towards the bottom corner.\nNew Zealand, spurred on by a vocal home crowd, were pushing for an equaliser for the entirety of the second half but Jacqui Hand had a goal ruled out for offside by the video assistant referee [VAR] after she hit the post earlier, while striker Hannah Wilkinson headed a cross over the bar from one of the game's biggest chances.\n\"It means everything to us. We really put our head down and we knew what was coming at us,\" said McDaniel. \"We had a goal in mind and we achieved it. We couldn't have asked for any better.\n\"This is what the team and the coaching staff have done. We put in our work and came out on top because of it. But we still have so much work to do.\"\nNew Zealand had support from the home crowd, but they grew increasingly frustrated in the second half and tension built in the Wellington Regional Stadium.\nCeltic's Olivia Chance made a difference when she was introduced, producing several good balls from the left, but goalkeeper McDaniel stood firm in the Philippines goal.\nHand's disallowed goal, her strike which hit the post, Wilkinson's missed header and Jale's late attempt were the best of the New Zealand chances, but the Philippines also had a goal ruled out for offside when teenager Isabella Flanigan slotted into the corner in the second half.\nIt is a result that leaves Group A wide open and New Zealand must now target a result in their final match against Switzerland to progress to the knockout stages for the first time.\n\"Five days ago we were celebrating and were so excited. Today we didn't get what we wanted,\" said New Zealand manager Jitka Klimkova.\n\"We could see how much our players wanted it and were fighting for it. Our goal was to inspire our nation and it wasn't the result we wanted, but the fight and the passion was definitely there.\n\"Sport can be exciting and it can be heartbreaking. I could see tears in the eyes of our players. I know how much it means for them to be here. It is heartbreaking but this is not over yet.\n\"I believe there will be even more desire [against Switzerland]. We know we still have a chance. This group is focused, they want it for themselves, the team and for the country. They will find a way.\"", "url": "https://www.bbc.com/sport/football/66290027"}