{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:21:31", "date_modify": "2025-05-21 06:21:31", "date_publish": "2025-03-31 15:07:59", "description": "Newport County: Nelson Jardim looks for revenge over Bromley", "filename": "sport_football_articles_crm32w9jgglo_1747808491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fb5/live/efecedf0-0e2b-11f0-b851-29ea4ea8a4cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm32w9jgglo_1747808491.html", "title": "Newport County: Nelson Jardim looks for revenge over Bromley", "title_page": "Newport County: Nelson Jardim looks for revenge over Bromley  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nelson Jardim has backed his players to improve as Newport County prepare to face a side who tormented them from set pieces on Boxing Day.\nJardim's side will look for revenge over Bromley on Tuesday night (19.45 BST) after the south London side scored four goals from set pieces in their 5-2 home win over County on 26 December.\nNewport will also hope to put smiles back on fans' faces at Rodney Parade after losing for just a second time in eight home league games with Saturday's 2-0 defeat to Notts County.\n\"We can only back the players to look forward and improve....I have nothing [negative] to say in terms of effort or commitment as the boys did their best against Notts County,\" said Jardim.\n\"We knew it was always going to be tough playing against a good team. At moments we made it hard for them, and showed we can play good football.\n\"In the last 25 minutes of the first half we were probably the better team. You can pick the stats that suit you, but I'm quite sure we were 50/50 in terms of possession in the second half, so you have to be positive.\"\nJardim expects a \"completely different game\" against a Bromley side 13th in League Two - five places and six points above 18th-placed Newport.\n\"They play a different style,\" he said.\n\"The facts, the evidence is there - in that game [on Boxing Day] we conceded from three corners, one from a throw-in, and the last one was a free-kick just outside the box.\n\"We had 70% of the ball in that game, and scored two goals towards the end.\n\"It'll be a tough game, but completely different to this one [Notts County]. But we have to look at ourselves and improve the way we want to play the game.\"\nJardim said injured striker Kyle Hudlin will not be back for Bromley's visit, but could be available for Saturday's trip to Carlisle.\nDefender Kyle Jameson is not ready to return yet either.", "url": "https://www.bbc.com/sport/football/articles/crm32w9jgglo"}