{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:58", "date_modify": "2025-05-20 14:43:58", "date_publish": "2023-07-28 11:01:24", "description": "England make a winning start to the Netball World Cup, dominating a Barbados team featuring two of their former team-mates.", "filename": "sport_netball_66336440_1747752238.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25E1/production/_130579690_chelseapitmanworldcup.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66336440_1747752238.html", "title": "Netball World Cup 2023: England beat Barbados 90-29 in Pool B opener", "title_page": "Netball World Cup 2023: England beat Barbados 90-29 in Pool B opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England made a winning start at the Netball World Cup with a dominant victory over a Barbados team featuring two of their former team-mates.\nCoach Jess Thirlby's side lived up to their billing as Pool B favourites with a 90-29 win on day one of the tournament in Cape Town, South Africa.\nFellow Pool B team Scotland came close to an upset against Malawi, leading for three quarters before losing 55-49.\nEngland play their next game against Malawi on Saturday (17:00 BST).\nThe meeting with Barbados was made particularly interesting as former Roses players Sasha and Kadeen Corbin were playing their first matches for the Caribbean team.\nThe sisters worked well together in attack but still seemed to be finding their way in terms of gelling with the rest of their new team as they failed to pose a true challenge for England.\nCo-captain Layla Guscoth said it is \"always strange\" to play against former team-mates but was pleased England \"came good towards the end\".\n\"They're fast and athletic so it's good to play a team like that in our first hit out,\" she added.\nCheered on by fans singing \"netball's coming home\", England took charge in the first quarter, surging 20-8 ahead and then seemed to get better with every quarter, scoring more than 20 goals in each period.\nBut with goal attack Eleanor Cardwell scoring 30 of 34 goal attempts and England's overall shooting accuracy at 88%, there is still room for improvement.\nWhen Kadeen Corbin was moved to goal keeper from goal shooter in the fourth quarter, the Barbados attack was further blunted as England won that final quarter 25-7.\nThirlby, saying she was keen for players to \"shake off\" any pre-tournament nerves, used all 12 of her players in a move that will save energy for some stiffer tests to come than 14th-ranked Barbados.\n\"It's tournament netball and I trust in the whole squad,\" said Thirlby.\n\"We're not getting carried away with the scoreboard, we want a performance. It was more about the processes today.\"\nThere are 16 teams in four pools in the first group stage, with the top three in each pool advancing to the second pool stage, which will determine who advances to the semi-finals. The final is on 6 August.", "url": "https://www.bbc.com/sport/netball/66336440"}