{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:00", "date_modify": "2025-05-21 07:37:00", "date_publish": "2025-01-13 16:24:19", "description": "'Fans' feelings shouldn't affect Rangers players' - Bell", "filename": "sport_articles_cx2p4vv8ljvo_1747813020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/acf5/live/1b650e50-d1b8-11ef-bb8b-e9ec18d255be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2p4vv8ljvo_1747813020.html", "title": "'Fans' feelings shouldn't affect Rangers players' - Bell", "title_page": "'Fans' feelings shouldn't affect Rangers players' - Bell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Rangers goalkeeper Cammy Bell says fan discontent shouldn't affect the players on the pitch.\nPhilippe Clement's side were 3-1 up at home to St Johnstone on Sunday when a section of the support left the stadium in an effort to show their discontent with recent results.\nRangers are 15 points behind Celtic and have just two wins from their last six games.\n\"I was at Rangers when at a time of real turmoil,\" Bell told the BBC's Scottish Football Podcast.\n\"They were in the lower leagues, there was a lot going on up the stairs with discontent with the board at that point as well and I don't think it does affect you as a player.\n\"Yes, there's a real split in where the club is at the moment. Yes, you've got this group that are really unhappy with the board at the moment and the way things are going. You've got the other fans that are just wanting to back the team and try and get the best of what's on the pitch at the moment\n\"Does it affect you as a player? It certainly shouldn't.\n\"You've got to just concentrate on what you can affect and that is the game of football.\n\"Rangers dropped off in the second half, their performance was completely different from the first and it's frustrating for the fans, frustrating for the manager because when you go 3-0 up after 25 minutes, you've surely got real confidence to go on and try and really batter a team and really put them under the cosh for the full 90 minutes.\n\"Rangers just stepped off their game and allowed St Johnston back into it. Performance-wise, second half, was disappointing.\"", "url": "https://www.bbc.com/sport/articles/cx2p4vv8ljvo"}