{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:28:32", "date_modify": "2025-05-20 14:28:32", "date_publish": "2023-07-28 16:26:37", "description": "Max Verstappen sets the fastest time in Belgian Grand Prix qualifying but a grid penalty means Ferrari's Charles Leclerc will start from pole position.", "filename": "sport_formula1_66342379_1747751312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/250F/production/_130578490_gettyimages-1560094172.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66342379_1747751312.html", "title": "Belgian Grand Prix: Charles Leclerc on pole position after Max Verstappen grid penalty", "title_page": "Belgian Grand Prix: Charles Leclerc on pole position after Max Verstappen grid penalty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen set the fastest time in Belgian Grand Prix qualifying but a grid penalty means Ferrari's Charles Leclerc will start from pole position.\nThe Red Bull driver beat Leclerc by 0.820 seconds on a drying track but has a five-place grid drop for using too many gearbox components this season.\nLeclerc edged the second Red Bull of Sergio Perez by 0.057secs with Lewis Hamilton's Mercedes fourth fastest.\nCarlos Sainz was fifth from McLaren's Oscar Piastri and Lando Norris.\nIt was a day defined by the weather, but the rain that some felt might threaten qualifying because of reduced visibility from spray in wet conditions stopped in the hour before qualifying and the track progressively dried through the session.\nVerstappen is expected to win the race from sixth on the grid, regardless of the weather, so superior has his and Red Bull's performance been so far this season.\nBut a second pole of 2023 for Leclerc is a major boost for the Monaco-born driver, who was Verstappen's closest title rival last year but has cut a dispirited figure for much of this season because of Ferrari's failure to live up to their own expectations.\nIt will be all the sweeter for Leclerc, who struggled in exactly similar damp conditions in the races in Spain, Canada and Austria before realising he had a problem and needed to address it.\n\"Not a bad qualifying for us especially in those conditions,\" Leclerc said. \"It's always difficult to put everything together. I put a lot of work into those conditions as I wasn't comfortable a few races ago.\"\nLeclerc was the first driver to set a lap on the final runs, meaning he missed the best of the circuit, but he acknowledged that Verstappen was out of reach.\n\"We went a bit early [for the final run],\" he said. \"Having said that, pole was definitely not on for us but we could have been closer. Let's see how it goes.\"\nVerstappen came close to being eliminated in the second knockout session, and argued with his engineer Gianpiero Lambiase over the radio afterwards about the run plan they had chosen.\nLeclerc was faster than the double champion on the first runs in the final session by about 0.1secs but Verstappen said he found the confidence to push harder on his final set of tyres.\n\"To be on pole again, I know I have to drop back with the penalty but it was the best I could do today.\"\nOutside the top battle for pole, Piastri impressed in the McLaren, the Australian out-pacing team-mate Norris throughout after the Briton ran wide at the second Stavelot corner in the first part of qualifying.\nThat damaged Norris' floor and he said he was \"pretty happy\" to qualify as high up as he did in the circumstances.\nBehind the McLarens, Hamilton's team-mate George Russell will be disappointed with eighth on the grid in the Mercedes, both of which have an aerodynamic upgrade for this weekend.\nRussell said: \"I've just been off the pace. I don't know why. I usually love those transitional sessions but every lap we were nowhere.\"\nHamilton faced a stewards' investigation for rejoining the track unsafely ahead of Russell after he ran wide at Eau Rouge in the first part of qualifying, but no further action was taken against the seven-time champion.\nThe Aston Martins continued their recent run of a slump in form with ninth and 10th places, Fernando Alonso just 0.038secs behind Russell and a second ahead of team-mate Lance Stroll.\nDaniel Ricciardo looked to have made it into the second part of qualifying in his first wet competitive session since returning to F1 with Alpha Tauri at the last race in Hungary, but his lap was deleted for exceeding track limits and he will start 19th.\nBritish-born Thai Alex Albon was 16th in the Williams, who had expected the circuit would suit their car but likely suffered for the damp conditions favouring downforce, over the efficiency needed at Spa in the dry.", "url": "https://www.bbc.com/sport/formula1/66342379"}