{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 08:01:32", "date_modify": "2025-04-26 08:01:32", "date_publish": "2025-02-26 17:27:58", "description": "England are dumped out of the Champions Trophy by a nerve-shredding eight-run defeat by Afghanistan in Lahore.", "filename": "sport_cricket_articles_c70wqd51yk5o_1745654492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79dc/live/e42dd930-f46c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c70wqd51yk5o_1745654492.html", "title": "Champions Trophy 2025: England out after Afghanistan win thriller", "title_page": "Champions Trophy 2025: England out after Afghanistan win thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England were dumped out of the Champions Trophy by a nerve-shredding eight-run defeat by Afghanistan in Lahore.\nJoe Root threatened to rescue his side from the brink, hitting a superb 120 as others fell around him in pursuit of 326.\nBut, battling cramp by the end, Root was caught with 39 runs needed from 26 balls as Afghanistan, who would have also been out with defeat, came roaring back.\nEngland should still have won – they needed 17 from 14 balls with three wickets left – but they fell away after Jamie Overton hit to long-on for 32.\nJofra Archer followed for 14 in the penultimate over, leaving final pair Adil Rashid and Mark Wood 13 to get from the last.\nThey managed only singles from the first four balls and Rashid was caught at long-off off the penultimate delivery as England were dismissed for 317.\nThat they got so close masked a wretched bowling performance in which they lost all control as Ibrahim Zadran took Afghanistan to 325-7 with a sensational 177 from 146 balls.\nBattling to overcome an injury to Wood, England had their opponents 37-3 in the ninth over but conceded 108 in the final nine which ultimately decided the contest.\nDefeat means England are eliminated at the earliest opportunity - their fate decided before the final group match against South Africa in Karachi on Saturday.\nAfter the final catch was taken, the thousands of Afghanistan fans inside the stadium in Lahore were dancing in the aisles.\nAustralia showed four nights ago England's target was chaseable by knocking off 352 against them on this ground.\nBut this many runs for this team under this pressure always felt too much and so it proved. That they got so close will only add to the pain.\nWith help from the rest of the top order scarce, Root took the match onto his shoulders and had swung it back in his team's favour until he gloved an upper cut off seamer Azmatullah Omarzai.\nEngland used to be the standard of the white-ball world and would have still closed out the match in recent times. Any aura built under Eoin Morgan has drained away over a miserable 18-month period, however.\nCaptain Jos Buttler admitted on Tuesday his future as captain could be decided by the result and defeat leaves him under immense pressure – this his third poor white-ball tournament in a row after failed defences of the 2023 50-over World Cup and the T20 version in 2024.\nBrendon McCullum has been unable to change England's fortunes since taking over as coach in January but will be given time to attempt to turn the ship around.\nButtler's future is far less certain.\nThe threat was supposed to come from Afghanistan's spinners – as it did when they spun their side to victory over England in Delhi at the World Cup 16 months ago.\nInstead, it was seamer Azmatullah who finished with figures of 5-58.\nHe started England's disappointing slide by bowling Phil Salt with a bail-trimmer for 12 before Jamie Smith tried to slog the first ball of spin in the innings, bowled by Mohammad Nabi, and was caught for nine.\nThat brought in Root, who was superb. He limited risks and repeatedly knocked the ball into the leg side to counter spin as Harry Brook was caught and bowled by Nabi for 25, Buttler top-edged to deep square leg and Liam Livingstone sliced a cut on 10.\nA further 93 runs were needed from 68 balls when Overton arrived and he proved a useful companion to Root.\nRoot showed little emotion when reaching his century in 98 deliveries but was visibly frustrated when he was caught.\nCalmer heads could have seen England home but that is not England's way. Both Overton and Archer were caught attempting to clear the ropes to seal England's defeat.\nThe result was made more remarkable given the start England made.\nOnly 11 runs came in the opening four overs bowled by Wood and Archer, before the latter bowled Rahmanullah Gurbaz and had Sediqullah Atal lbw in the fifth over. Archer soon bounced out Rahmat Shah for four and England had taken three powerplay wickets for the first time in 14 ODIs.\nBut, with Wood having limped off with a knee issue after tumbling in his fourth over, Ibrahim led an initially patient rebuild. He and skipper Hashmatullah Shahidi milked England's change bowlers in a partnership of 103 from 124 balls until Rashid bowled the sweeping Shahidi.\nAt 140-4 in the 30th over, England still had control but they lost all semblance of it late on.\nIbrahim cut loose in a partnership of 111 in 9.1 overs with veteran Mohammad Nabi, who made 40 from 24, as Wood returned to hobble through 4.2 further overs which cost 37 and Archer was hit for 20 – the most expensive over of his ODI career.\nWhen Livingstone pulled up in the field, Root was left to bowl the 47th over and his first delivery was flogged over mid-wicket for six by Nabi, the next parried over the rope by Salt for another before a shoddy misfield from Duckett let through four more as England wilted.\nIbrahim targeted the straight boundaries and a six off Archer took him beyond Duckett's 165 from four nights earlier – previously the highest Champions Trophy score.\nHaving batted from the first over to the last, he was finally out caught at deep square leg to the first ball of the 50th over off Livingstone but the damage had been done.\nUnlike England, Afghanistan's tournament is still alive. They play Australia on Friday.\nEx-England spinner Vic Marks: \"This is probably an unpopular opinion but if you do not play any 50-over cricket other than internationally, you probably won't be very good at it.\n\"Look at Joe Root, who played the perfect 50-over innings. But the bowlers, they are not used to bowling 10 overs if you are basing your team on T20 form and experience.\n\"It comes down to concentration, too. Someone like Phil Salt has got some good starts this winter and if you do that in T20, you have done your job. But if that keeps happening in ODIs, losing early wickets puts the rest of the batting order under so much pressure.\n\"It is a very, very different game to T20 cricket and you have to go about it differently - I don't think many of England's players recognise that.\"\nEngland captain Jos Buttler: \"To be eliminated from the tournament, it's really disappointing. We had our chances in the game, it was another fantastic game. We're gutted to come out the other side.\"\nAfghanistan captain Hashmatullah Shahidi: \"As a team we are happy. I know the whole nation will be happy. We'll look towards the the next game.\n\"First time we beat England was in the 2023 World Cup. I keep saying that we are improving day by day as a team, we've shown it. I'm happy with the result.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c70wqd51yk5o"}