{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:57:13", "date_modify": "2025-04-26 06:57:13", "date_publish": "2025-02-28 14:30:16", "description": "Englishman Dale Whitnell celebrates a remarkable two holes-in-one in his round on day two of the South Africa Open.", "filename": "sport_golf_articles_cn0440k0747o_1745650633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a697/live/02264480-f5db-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cn0440k0747o_1745650633.html", "title": "South Africa Open: English golfer Dale Whitnell hits two holes-in-one", "title_page": "South Africa Open: English golfer Dale Whitnell hits two holes-in-one - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Englishman Dale Whitnell carded a remarkable two holes-in-one during his round on the second day of the South Africa Open.\nWhitnell aced the 179-yard second and repeated the trick on the 149-yard 12th at Durban Country Club.\nThe 36-year-old immediately followed his first hole-in-one with an eagle and he was chasing a remarkable 13-under-par 59 until making a double bogey - including an air shot - on the 16th.\nHis eventual score of 63 beat his level-par Thursday round by nine shots.\n\"Coming back this morning I knew I was struggling to make the cut, so I knew I needed to go out and play well and I got off to a hot start,\" Whitnell told DP World Tour.\n\"I birdied the first and hit a flush seven iron on the second, I didn't realise it had gone in until they cheered down at the bottom.\n\"Then I got another hole-in-one on the 12th. Bizarre.\n\"It's a weird feeling, everything in one. I was excited and adrenalin was pumping, but I had to focus on my job and managed to do that OK.\"\nWhitnell, who hails from Essex and sits 545th in the world rankings, had never previously achieved a hole-in-one in competition.\nThe US-based National Hole-in-One Registry says the odds of carding two in the same round are 67 million to one.\nWhitnell is just the second Englishman to have made two holes-in-one in the same round in professional competition, after John Hudson, who achieved the feat in the European Tour's Martini International at Royal Norwich in 1971.\nHudson's double was made even more impressive by the fact that he managed to do it across successive holes, with the second coming at a 314-yard par four.", "url": "https://www.bbc.co.uk/sport/golf/articles/cn0440k0747o"}