{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:03", "date_modify": "2025-05-21 07:46:03", "date_publish": "2024-12-23 16:46:54", "description": "Luton Town midfielder Liam Walsh apologises to fans after a second red card of the season rules him out of their festive fixtures.", "filename": "sport_football_articles_cm2l0mr927no_1747813563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c982/live/4aa13990-c14c-11ef-9c2a-c910c1a61425.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2l0mr927no_1747813563.html", "title": "Liam Walsh: Luton midfielder says sorry to fans over two red cards", "title_page": "Liam Walsh: Luton midfielder says sorry to fans over two red cards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town midfielder Liam Walsh has apologised to supporters following two red cards already this season.\nFollowing his 14 December dismissal against Blackburn, he will continue serving a four-match suspension throughout the festive and New Year period and has been fined by the club.\n\"As a football fan myself I understand how much I've let you down and I own up to that, there is no excuse. I have made not one but two mistakes now that I know myself are not good enough and not up to the standards expected as a professional,\" he told the club website, external.\n\"I've had a week or so to think how I can make it up to the fans of this great football club, because Luton Town is a club I want to be at and succeed at. I will be working hard now to stay as fit as possible so I am ready to come back to the pitch to help the boys, and also showcase to you fans how much you mean to me.\n\"I know a lot of people won't take my apology well and rightly so, but I look forward to playing in front of you Hatters again, backing up my words and helping this club go on to success.\"", "url": "https://www.bbc.com/sport/football/articles/cm2l0mr927no"}