{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:19", "date_modify": "2025-04-26 08:04:19", "date_publish": "2025-02-26 15:55:34", "description": "Portsmouth boss John Mousinho says clubs need to be careful with the workload placed on players as he deliberately held back information on his injured players.", "filename": "sport_football_articles_cqlydwzd2vqo_1745654659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2499/live/0da242f0-f455-11ef-a11e-f9aa15b912e1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cqlydwzd2vqo_1745654659.html", "title": "Portsmouth FC: John Mousinho warns of demands placed on players", "title_page": "Portsmouth FC: John Mousinho warns of demands placed on players - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Portsmouth boss John Mousinho says there has to be a wariness around the demands placed on players.\nIt comes as the Pompey head coach chose not to disclose details of his injury list at his weekly news conference ahead of their Championship match at Luton on Saturday.\nThe expectation was that Mousinho would outline the timelines for when defenders Rob Atkinson and Hayden Matthews would return but instead the Pompey boss will reserve that information until after Saturday's game.\n\"The best thing is I'll give you the full rundown after the game,\" Mousinho told BBC Radio Solent.\n\"You'll have a good idea of where we're at with the starting line-up on Saturday and I'll speak to you about it afterwards.\"\nPortsmouth have suffered a number of injuries throughout the season with long-term absentees including defender Conor Shaughnessy while they were also without Jordan Williams, Freddie Potts and Callum Lang for last weekend's win over QPR.\n\"I've been at the club for two years now and we've never had a clean bill of health,\" he added. \"We were watching Championship games on Tuesday night and players were getting injured for various reasons.\n\"It's one of those seasons where it's only going to get worse with the state of the pitches and the weather and the demands on players so it's something we need to be wary of in the future.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cqlydwzd2vqo"}