{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-05-20 13:36:26", "date_modify": "2025-05-20 13:36:26", "date_publish": "2023-08-01 16:22:27", "description": "Kilmarnock manager Derek McInnes suggests the Viaplay Cup last 16 should become an open draw and the \"strange\" seeding system scrapped.", "filename": "sport_football_66377213_1747748186.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D584/production/_130606645_20796381.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66377213_1747748186.html", "title": "Kilmarnock: Derek McInnes suggest scrapping 'strange' Viaplay Cup seedings", "title_page": "Kilmarnock: Derek McInnes suggest scrapping 'strange' Viaplay Cup seedings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock manager Derek McInnes has suggested the Viaplay Cup last 16 should become an open draw and the \"strange\" seeding system scrapped.\nOf the eight group winners, only the three with the best records are seeded, along with Scotland's five European representatives.\nKilmarnock won Group F, finishing with 10 points, but were unseeded for the second round and landed holders Celtic.\n\"I find the whole seeding thing strange,\" said McInnes.\n\"You win your group and are up against a seed. If you win your group I think you should be a seed.\n\"If you can't satisfy everybody who wins their group, don't have any seeds. Just put everybody in a hat.\n\"We played two Championship clubs and yet there's other Premiership teams who had one. And there was no Championship clubs in Ross County or Livingston's groups. So I don't even know how they come to the conclusion of doing that [group stage] draw, whether it's fair.\n\"Celtic is not the draw we wanted, but we'll try to make the most of it.\"\nHaving secured survival on the final day of last season, Kilmarnock open their new Scottish Premiership campaign at home to Rangers on Saturday.\nThe Rugby Park side failed to take a point from either of the Old Firm in six league meetings last term and McInnes says it's \"an itch we need to scratch\".\n\"It's a great opening fixture for us,\" he added. \"We beat every team in the Premiership last season except Rangers and Celtic.\n\"We know what we are capable of but we also have to demonstrate our capabilities of getting results against the best two teams.\n\"We have to have the confidence, assurance and personality on Saturday to try to do exactly that. We expect a tough game - it is important Rangers get that as well.\"", "url": "https://www.bbc.com/sport/football/66377213"}