{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:53:15", "date_modify": "2025-05-20 12:53:15", "date_publish": "2023-08-03 10:51:02", "description": "Two officials now dedicated VARs as SFA creates independent review panel", "filename": "sport_articles_c0k4x18r2xlo_1747745595.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c31e/live/6e926420-31ea-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c0k4x18r2xlo_1747745595.html", "title": "Two officials now dedicated VARs as SFA creates independent review panel", "title_page": "Two officials now dedicated VARs as SFA creates independent review panel - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andrew Dallas and Greg Aitken have been appointed as the first dedicated Video Assistant Referees in Scotland, while the Scottish FA has also created a VAR independent review panel.\nWith more than 30 years of combined experience as match officials, Dallas and Aitken will step back from on-field duties to focus on officiating from Clydesdale House.\nGary Hilland, Andrew McWilliam and Graeme Leslie will also call time on their on-field duties to take up positions as the first dedicated VAR assistants in Scotland.\n\"Andrew and Greg have significant experience officiating at the highest level but have both shown a particular aptitude operating as VARs since its launch last year,\" said Allan.\n\"With the new season upon us it is important for us to continue to improve the VAR operation in all areas, so while their time on the pitch has come to an end, we are delighted that our match officials will continue to benefit from their vast experience.\"\nThe independent review panel will comprise former players, managers and coaches. Guided by experts on the IFAB Laws of the Game, it will meet on a regular basis to discuss and give an independent view of VAR interventions and non-interventions.\nThe appointment of the dedicated VAR match officials and the independent review panel are facets of \"a commitment to improved transparency and efficiency, and knowledge and understanding of VAR\" after several controversies following its rollout in Scotland last autumn.", "url": "https://www.bbc.com/sport/articles/c0k4x18r2xlo"}