{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:42", "date_modify": "2025-05-21 07:31:42", "date_publish": "2025-01-13 14:37:32", "description": "Andoni Iraola press conference: Chelsea vs Bournemouth preview", "filename": "sport_football_articles_c5yegwezez5o_1747812702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5908/live/85292f40-6de2-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yegwezez5o_1747812702.html", "title": "Andoni Iraola press conference: Chelsea vs Bournemouth preview", "title_page": "Andoni Iraola press conference: Chelsea vs Bournemouth preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iraola confirmed the club's intention to sign a new striker following the injuries to Enes Unal and Evanilson: \"Everyone in the club is trying to sign a striker. This week we lost Enes and Evanilson. It's not going to be one or two days and then a striker signs - they're very valuable.\"\nHe continued: \"I understand clubs don't want to lose strikers half way through the season - we need a striker with the level to start and play Premier League games, it's not going to be easy but everyone in the club is working on this.\"\nHe confirmed Max Aarons is set to join Valencia: \"We've thought the best for him, if he wasn't playing the minutes he wanted here. The opportunity that has arrived for him is amazing, Valencia is a big club and I hope he does well there.\"\nHe also praised Aarons' attitude: \"His behaviour is very good, the other day knowing that it was almost a done agreement we asked him to play 45 minutes and he played very well and gave us everything - I hope he does very well because he deserves it.\"\nMarcus Tavernier, Marcos Senesi, Julian Araujo, Alex Scott, Adam Smith and Luis Sinisterra all remain out with injuries and Kepa Arrizabalaga is ineligible to play against his parent club on Tuesday.\nRyan Christie is available again after missing the victory against West Brom with illness.\nIraola does believe the club can cope without a striker for now, and the club try many different options in training, He said: \"During games we can swap positions more confidently, all the wingers we have can play as a 10 and as a nine - we have the tools to make the right calls.\"\nOn Daniel Jebbison, who has returned from loan, Iraola said: \"Hopefully he gets to speed quickly because we will definitely need him - we are asking him to change things that he was probably doing at Watford. He has come with the spirit of solving everything quickly - I hope he is able to do it.\"\nOn Chelsea: \"They are having a fantastic season, they are using the depth of their squad, they are changing their starting 11s and everyone is playing a lot and they're a lot more familiar with their roles. They are doing very well.\"", "url": "https://www.bbc.com/sport/football/articles/c5yegwezez5o"}