{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:15", "date_modify": "2025-05-21 05:57:15", "date_publish": "2025-01-14 11:02:06", "description": "Swansea City: Goalkeeping reshuffle continues as Nathan Broome joins Port Vale on loan", "filename": "sport_football_articles_cx24ngy04ejo_1747807035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1844/live/7ba965c0-d25f-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx24ngy04ejo_1747807035.html", "title": "Swansea City: Goalkeeping reshuffle continues as Nathan Broome joins Port Vale on loan", "title_page": "Swansea City: Goalkeeping reshuffle continues as Nathan Broome joins Port Vale on loan  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams has tweaked his goalkeeping options once more after allowing Nathan Broome to join Port Vale on loan for the rest of the season.\nThe 23-year-old joins up with a Vale side chasing promotion from League Two, with Swansea hoping he will get some game-time in the Potteries.\nBroome, who is under contract until at least 2026, is the second goalkeeper in Swansea's senior squad to leave the club this month following Andy Fisher's loan move to st Johnstone.\nJon McLaughlin, who made his debut in the FA Cup defeat at Southampton last weekend, sees his short-term deal expire this month but Swansea are likely to extend his contract until the end of the season.\nThe veteran Scot will continue to serve as understudy to Lawrence Vigouroux, with 19-year-old Kit Margetson - the son of Swansea goalkeeping coach Martyn Margetson - likely to be the next in line.\nTwo Swansea Under-21 goalkeepers have also departed on loan this month.\nEvan Watts, 20, has joined Galway United for the 2025 League of Ireland Premier Division season, while 21-year-old Ben Hughes will spend the rest of this campaign at Caernarfon Town.", "url": "https://www.bbc.com/sport/football/articles/cx24ngy04ejo"}