{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:49", "date_modify": "2025-05-21 05:28:49", "date_publish": "2025-01-14 15:12:51", "description": "Ireland players Dan Sheehan and James Lowe are nearing a return to action, with the start of the Six Nations looming.", "filename": "sport_articles_cgrn0kjv87po_1747805329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b26f/live/ebc58e40-d289-11ef-85b4-cfd5b07d0a4a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgrn0kjv87po_1747805329.html", "title": "Six Nations 2025: Ireland's Dan Sheehan & James Lowe near return", "title_page": "Six Nations 2025: Ireland's Dan Sheehan & James Lowe near return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland have received a boost on the eve of their Six Nations squad announcement with Leinster confirming that Dan Sheehan and James Lowe are nearing a return to action.\nHooker Sheehan, 26, has not played since sustaining an anterior cruciate ligament injury during Ireland's defeat by South Africa in July.\nNew Zealand-born wing Lowe, 32, has been out since Ireland's Autumn Nations Series win over Australia on 30 November with a calf problem.\nIn an injury bulletin issued on Tuesday, Leinster said both players may feature in Saturday's Champions Cup match against Bath at Aviva Stadium.\nIreland back row Will Connors is also in contention, having been sidelined since the end of November.\nFit-again international trio Tadhg Furlong, Jack Conan and Ciaran Frawley all came through Sunday's win at La Rochelle without injury.\nHaving already qualified for the last 16, Leo Cullen's side - who have won all 12 of their games this season - are looking to seal top spot in Champions Cup pool 2 when they welcome Premiership leaders Bath to Dublin on Saturday (17:30 GMT).\nIreland interim head coach Simon Easterby names his Six Nations squad on Wednesday.", "url": "https://www.bbc.com/sport/articles/cgrn0kjv87po"}