{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:13:22", "date_modify": "2025-05-21 04:13:22", "date_publish": "2025-04-06 00:00:00", "description": "Live text coverage of the European Champions Cup last-16 match between Toulouse and Sale.", "filename": "sport_rugby-union_live_cp8vlljdzjzt_1747800802.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/671c/live/cf717990-1305-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_cp8vlljdzjzt_1747800802.html", "title": "European Champions Cup LIVE: Toulouse beat Sale 38-15 after parachutist rescued from stadium roof", "title_page": "European Champions Cup LIVE: Toulouse beat Sale 38-15 after parachutist rescued from stadium roof - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you next week\nIt's a quick turnaround with the quarter-finals starting next Friday.\nAnyone who beats Toulouse will have to be a very good side. See you next week for the last eight!\n'I couldn't be prouder'\nFT: Toulouse 38-15 Sale\nSale director of rugby Alex Sanderson on Premier Sports: \"They are all heart this group.\n\"I've had two lads come up and apologise and I said I'm not having it lads. There is nothing to apoligse about, they gave it all tactically and mentally. I'm gutted, but you hurt and you heal and we'll be tighter for it.\n\"We know we have to have more to win trophies but they put their bodies on the line for each other, I couldn't be prouder of the group, they showed real grit. We just need to be better in execution.\"\n'So many positives'\nFT: Toulouse 38-15 Sale\nSale captain Ben Curry on Premier Sports: \"There were so many positives but that doesn't make it easier. They are an 80-minute team, we went toe to toe and beat them for 50 minutes but they have such a great 23.\n\"They got us in that last 30 minutes.\"\nPost\nToulouse 31-15 Sale\nToulouse have shown in the second half just why they are the team to beat. But Sale's first 40 minutes will live long in the memory. They have given it their all and then some, and if Tom Roebuck's try just before the break was given then...you never know.\nInjured Capuozzo carried off pitch\nToulouse 31-15 Sale\nAnge Capuozzo leaves the field on a stretcher, clutching his face in both hands and clearly in pain. They haven't showed a replay of the incident which is a worrying sign, as he does now clap the crowd back.\nHopefully that won't be as bad as it looks.\nPost\nToulouse 31-15 Sale\nThe crowd sing Ange Capuozzo's name as he is treated, he's been hurt in the tackle that came in right on the line. Let's hope this isn't too bad.\nSale's Tom O'Flaherty has limped off too, hurt in the same incident.\nConverted Try - Toulouse 31-15 Sale\nAnge Capuozzo (con Ramos)\nThat's ridiculous from the little winger! He gathers in a kick forwards, puts his head down and finds the smallest of gaps, breaks the line and then accelerates away to score a simply brilliant solo score.\nHe's down hurt though and there's a stretcher coming on.", "url": "https://www.bbc.com/sport/rugby-union/live/cp8vlljdzjzt"}