{"authors": ["Richard Woodward", "www.facebook.com"], "date_download": "2025-04-26 07:56:03", "date_modify": "2025-04-26 07:56:03", "date_publish": "2025-02-25 12:24:42", "description": "Ipswich news: Opinion - 'Forget all you know' after promotion to Premier League", "filename": "sport_football_articles_cq5zl21x6vgo_1745654163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed4c/live/b5390d40-54ba-11ef-b2d2-cdb23d5d7c5b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq5zl21x6vgo_1745654163.html", "title": "Opinion - 'Forget all you know' after promotion to Premier League - BBC Sport", "title_page": "Ipswich news: Opinion - 'Forget all you know' after promotion to Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "How badly must an established Premier League club be run to get relegated these days?\nI had to look back nearly 10 years to find the last instance - sorry, Newcastle fans. Coincidentally, that 2015-16 season was also when Leicester shocked the world by winning the title. Isn't it depressing that both those situations are just as unlikely to reoccur today?\nBack in April 2021, the mooted European Super League plans triggered the collective anger of football fans. The disregard for open competition by removing the consequence of failure understandably offended most of us.\nThankfully, the Super League never came to be. But we do have a Premier League with its relegation places yet again comprising the three promoted clubs. It hardly screams 'fair competition', does it?\nAnd while it is easy to just blame money, most football clubs in the top two tiers are now well backed. Yes, it is still an unlevel playing field and yes, PSR enforcement could have done more, but big clubs with big resources have dominated the pyramid forever.\nWhat I theorise as a more underestimated cause of the competitive imbalance is the approach to refereeing.\nWhile much has been done to rightly protect star players from vicious fouls, the consequence is matches stripped of any blood and thunder. Fixtures are officiated to prevent the promoted upstarts from bringing their illustrious opposite numbers down a peg or two. That wasn't my experience watching my club's last spell in the top league.\nSo welcome to the era of the 'Premier League foul', the era of feigning head injuries to halt opposition counter-attacks, the era of simulation being completely ignored. But only for those lucky tenured elite.\nIf you have recently thrived in the Championship, where the physical battle is the minimum weekly requirement to get points, forget everything you know.\nAt least until the following May.", "url": "https://www.bbc.co.uk/sport/football/articles/cq5zl21x6vgo"}