{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:03", "date_modify": "2025-05-21 04:17:03", "date_publish": "2025-04-05 17:38:10", "description": "Stoke City manager Mark Robins hails his side for being \"brave\" but laments their build-up play in the final third.", "filename": "sport_football_articles_cx26p5gdn48o_1747801023.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fdea/live/b3ea0d00-1241-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx26p5gdn48o_1747801023.html", "title": "Mark Robins: 'Brave' Stoke missed 'detail' in Preston draw", "title_page": "Mark Robins: 'Brave' Stoke missed 'detail' in Preston draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City manager Mark Robins called his side \"brave\" but said they lacked \"detail\" to beat Preston North End.\nKaine Kesler-Hayden struck first for the Lilywhites to open the scoring in the first half before Potters midfielder Lewis Baker converted a 75th minute penalty to salvage a point for Stoke at Deepdale.\n\"I think we were brave,\" Robins told BBC Radio Stoke. \"I thought we were the better team throughout the game. I thought we had the first real opportunity when Milly [Manhoef] went through and took one touch too many.\n\"If he can get that out from under his feet and finish then I think he scores but I'm not going to criticise the decision making too much although it's the thing that cost us a little bit.\n\"That's where we fall down a little bit but I think we had the better opportunities.\"\nThe Potters dropped down two places in the Championship to 20th and Robins said his side lacked a \"quality finish\".\n\"We went behind to a rubbish goal which ended up taking a deflection and trickling into the back of the net,\" added Robins.\n\"It's really disappointing to concede like that but knew we were in the game. It looked like we needed that little bit of impetus which we didn't get.\n\"I wanted a bit more from the wide areas today and that's both full-backs and wide players to work in tandem. That wasn't quite working but we managed to inject a little bit of urgency to get the penalty at the end.\n\"We kept the pressure on them and kept the ball in their box but we just didn't get that quality finish to go and see the game out.\"", "url": "https://www.bbc.com/sport/football/articles/cx26p5gdn48o"}