{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 14:21:49", "date_modify": "2025-05-20 14:21:49", "date_publish": "2023-07-29 08:46:39", "description": "As the Republic of Ireland prepare for their final World Cup match, defender Louise Quinn says the team will be playing with \"total pride\".", "filename": "sport_football_66347124_1747750909.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0648/production/_130580610_inpho_02298436.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347124_1747750909.html", "title": "Women's World Cup: Republic of Ireland will play Nigeria with 'total pride'", "title_page": "Women's World Cup: Republic of Ireland will play Nigeria with 'total pride' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Louise Quinn laughs as the subject of her black eye is brought up by the media in Brisbane.\n\"I actually quite like it. I didn't mind it at all, I think it looked quite good, actually.\"\nThe defender picked up the shiner in the Republic of Ireland's opener with Australia, and although there was also a much more serious scare with a foot problem, she was fit to face Canada in the second game.\nShe's a fighter, like so many in this team.\nDespite two battling performances against co-hosts Australia and the Olympic champions, the Republic of Ireland are left with zero points from their two games and cannot make the last-16.\nNigeria, on the other hand, stunned Australia to add three points to their opening draw with the Canadians. The African champions are in a strong position to progress against a wounded, but not defeated, Irish side in Brisbane on Monday.\nA win or draw would secure Nigeria's place in the next round, and defeat to the Irish might even be enough if results go their way.\n\"They have put themselves in a brilliant position. We have seen their quality,\" said Quinn, adding that Ireland will be playing with \"pure pride\".\nKatie McCabe's wonder goal, the first 'Olympico' scored at the Women's' World Cup, ensures there will be fond memories and a legacy after the tournament.\nHowever, this team want more and will be chasing that first victory so they end their first World Cup on a high.\n\"We have put in some very good performances over the past two games but there are no points on the board,\" Quinn added.\n\"We want to be able to look back and know we have given it our all. There has been no doubts about that.\n\"Everyone has done everything to make sure we can get something out of those games. It's total pride and we're going to give it everything.\"", "url": "https://www.bbc.com/sport/football/66347124"}