{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:38", "date_modify": "2025-05-21 04:38:38", "date_publish": "2025-01-18 00:00:00", "description": "Daizen Maeda's second-half goal ensures holders Celtic start the defence of their Scottish Cup with a victory over Premiership rivals Kilmarnock.", "filename": "sport_football_live_c5yegl4wle6t_1747802318.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5yegl4wle6t_1747802318.html", "title": "Celtic vs Kilmarnock: Scottish Cup live coverage, stats & head-to-head", "title_page": "Celtic vs Kilmarnock: Scottish Cup live coverage, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chances flowed. Kyogo got in but was off target. Reo Hatate blazed over from six yards. Kyogo then squared for Kuhn to tap home but Robbie Deas got there.\nAs half-time approached, things changed dramatically.\nDerek McInnes' side showed real bravery to press, commit numbers forward and go man-for-man at the back.\nIt paid off when Murray crossed, the ball hit Deas' hand and fell to Bobby Wales, who scored. After a VAR check, it was given.\nKilmarnock's belief became palpable as they continued that approach.\nIt did leave a lot of space to be exploited, though, and eventually it was. Maeda broke free but as he scampered away Lewis Mayo showed pace to deny the winger.\nMcInnes celebrated that like a goal but moments later Maeda delivered, again wide open from Kuhn's run across the box, and he finished coolly.\nCeltic upped it from there. Kuhn smashed off the bar, Hatate was superbly denied by O'Hara and Kuhn then missed from eight yards, but the holders had done enough to progress to the next round.\nCeltic manager Brendan Rodgers: \"I don't think the scoreline reflected the game and the dominance in the game but if you don't finish your chances and opportunities Kilmarnock are a team that can hurt you,\n\"They play a pressure game and you've got to be strong. Overall I'm really pleased with the appetite with the team because we had so many chances the game should've been dead and buried at half time.\"\nKilmarnock manager Derek McInnes: \"We wanted to come here, with the odds stacked against us, and be competitive. We had a dressing room full of belief.\n\"We came here depleted and it didn't help much when we have two injuries in the first half.\n\"Celtic were enjoying the first half too much for my liking. We finished the first half strong and we went, as we planned, man for man in the second half. Risk and reward. We spooked Celtic in the second half.\"", "url": "https://www.bbc.com/sport/football/live/c5yegl4wle6t"}