{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:09:34", "date_modify": "2025-05-20 14:09:34", "date_publish": "2023-07-30 00:00:00", "description": "Relive a rain-ruined fourth day in which Stuart Broad is given a guard of honour before Australia start well in run-chase.", "filename": "sport_live_cricket_64959415_1747750174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17B40/production/_130588079_stokes.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_64959415_1747750174.html", "title": "The Ashes LIVE: England vs Australia, fifth Test day four, Kia Oval", "title_page": "The Ashes LIVE: England vs Australia, fifth Test day four, Kia Oval - score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWell, that was a frustrating day. The forecast is looking a little better for tomorrow, so we are staying hopeful.\nWe will be back with you from 8:00 BST tomorrow for all the reaction.\nFor now, here's Stephan Shemilt's match report from The Oval, and we look forward to you joining us in the morning!\nClose of play - Aus 135-0\nAnd there it is.\nPlay has been abandoned at The Oval on day four because of the rain, and the amount of time that it would take to get the ground ready again even if it does dry up.\nAustralia will resume tomorrow on 135-0, trailing England by 249 runs.\nPost\nOver on Test Match Special, where they (like me) are filling time while the rain falls, they are also discussing the Team of the Ashes with BBC Sport website fan favourite Matt Henry.\nA reminder of it:\n1. Usman Khawaja (picked in 97 % of teams)\n2. Zak Crawley (96%)\n3. Marnus Labuschagne (54%)\n4. Joe Root (95%)\n5. Harry Brook (53%)\n6. Ben Stokes (92%)\n7. Jonny Bairstow (56%)\n8. Chris Woakes (62%)\n9. Pat Cummins (61%)\n10. Mark Wood (87%)\n11. Stuart Broad (84%)\nPost\nBBC Test Match Special\nOn Test Match Special now, Jonathan Agnew is chatting to Glenn McGrath and Michael Atherton about the duo's Ashes battles, which saw McGrath dismiss the England batter a record 19 times.\nYou can listen on BBC Sounds or using the audio icon at the top of this page.\nPost\nWe've also been talking about the Team of the Series, as selected by the BBC Sport readers.\nUsman Khawaja, the series' leading run-scorer, was the most-selected player with 97% people choosing him.\nJonny Bairstow over Alex Carey is also causing a bit of a stir on our socials, but you can still have a go at selecting your team here if you want to make any changes.", "url": "https://www.bbc.com/sport/live/cricket/64959415"}