{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:29:55", "date_modify": "2025-05-21 07:29:55", "date_publish": "2025-05-20 17:01:32", "description": "An emotional Ange Postecoglou angrily refuted suggestion he is a \"clown\" in a combative news conference on the eve of Tottenham's Europa League final against Manchester United.", "filename": "sport_football_articles_cyvmmm76l0lo_1747812595.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/036f/live/5c445dc0-359c-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cyvmmm76l0lo_1747812595.html", "title": "Europa League final: Tottenham manager Ange Postecoglou refutes suggestion he is 'a clown'", "title_page": "Europa League final: Tottenham manager Ange Postecoglou refutes suggestion he is 'a clown' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An emotional Ange Postecoglou angrily dismissed the suggestion he is a \"clown\" in a combative news conference on the eve of Tottenham's Europa League final against Manchester United.\nReferencing a report in the Standard, external which said he was \"teetering between hero and clown\" depending on the result in Bilbao, Spurs boss Postecoglou defended his managerial record despite his side's poor domestic season.\nIn Wednesday's final, Tottenham will either end a 17-year wait for a trophy or finish the campaign empty-handed again, on the back of their worst campaign since the club returned to the top flight in 1978.\nSpeaking at San Mames Stadium, Postecoglou veered from simmering discontent to his voice cracking with emotion as he recounted his personal journey and that of his family.\nHe brought the conversation back to the article when the reporter who wrote it pointed out this season could become one of the best or worst in the club's \"modern history\" and the Australian was veering a fine line \"between two very different types of infamy\".\n\"Irrespective of tomorrow, I'm not a clown and never will be,\" said Postecoglou.\n\"You really disappointed me that you used such terminology to describe a person that for 26 years, without any favours from anyone, has worked his way to a position where he is leading out a club in a European final.\n\"For you to suggest that somehow us not being successful means that I'm a clown, I'm not sure how to answer that question.\"\nPostecoglou was born in Athens but emigrated to Australia with his family when he was five.\nAfter winning four international caps as a player, he embarked on a stellar coaching career that included spells with Brisbane Roar and Melbourne Victory, before taking over the Australia national side.\nHe moved on to Japan with Yokohama F Marinos, then joined Celtic in 2021 and Tottenham in 2023.\nPostecoglou evidently feels, regardless of whether Tottenham win or not tomorrow, he is a success story given where he has come from.\n\"My parents left everything they knew because of their children, because of me, I hold that dear to my heart,\" he added.\n\"I was born in Greece. My father made sure I knew what it means to be Greek. Then I grew up in Australia, where football is not a prominent sport.\n\"I feel that very strongly. In Australia, when it comes to sport, you will take on anyone, it doesn't matter how big and strong they are.\"\nImmediately before his manager spoke to the media, Tottenham captain Son Heung-min had done so alongside full-back Pedro Porro.\nAlong with Ben Davies, Son is the remaining link to the team beaten by Liverpool in the 2019 Champions League final.\nThat loss still stings, judging by Son's \"I still don't think it was a penalty\" response to a question about the game, referring to the contentious first-minute spot-kick for handball against Moussa Sissoko that offered Liverpool a chance to establish a lead they never seriously looked like losing.\nSon's participation in Wednesday's final had been in doubt due to a foot injury that kept him out for a month prior to the home defeat by Crystal Palace on 11 May.\nBut, during Tuesday evening's open training session, Postecoglou appeared to indicate the 32-year-old would start as he operated a three-man attack that also included Brennan Johnson and Wilson Odobert in the number 10 role behind striker Dominic Solanke.\nJames Maddison, Dejan Kulusevski and Lucas Bergvall have all been ruled out of the game through injury and, if Postecoglou sticks with that formation tomorrow night, it would mean Brazilian forward Richarlison starts on the bench.", "url": "https://www.bbc.com/sport/football/articles/cyvmmm76l0lo"}