{"authors": ["Sara Orchard", "www.facebook.com"], "date_download": "2025-05-21 03:55:10", "date_modify": "2025-05-21 03:55:10", "date_publish": "2025-04-07 14:00:25", "description": "England will be without Mackenzie Carson and Charlotte Fray for the rest of their Women's Six Nations campaign.", "filename": "sport_rugby-union_articles_ce8gmxmjy3eo_1747799710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1212/live/170b48c0-13b1-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ce8gmxmjy3eo_1747799710.html", "title": "Women's Six Nations: England's Mackenzie Carson ruled out with ankle injury", "title_page": "Women's Six Nations: England's Mackenzie Carson ruled out with ankle injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England prop Mackenzie Carson has been ruled out of the rest of their Women's Six Nations campaign with an ankle injury.\nThe 26-year-old Gloucester-Hartpury player suffered the injury during the first half of the 67-12 thrashing of Wales on 29 March.\nNo timeframe has been given for Carson's return, but it is understood that she will not require surgery and should still be fit for the World Cup which starts in August.\nUncapped Bristol Bears prop Simi Pam retains her place in the squad as the Red Roses prepare to play Ireland in Cork on Saturday.\nEngland are top of the Six Nations table after convincing wins over Italy and Wales, while second-placed France are also unbeaten.\nThe defending champions will also be without Leicester lock Charlotte Fray, who has also been released from the squad because of a shoulder injury, while Gloucester-Hartpury lock Sarah Beckett has returned to her club for further treatment for a back injury.\nHowever, Gloucester-Hartpury's Alex Matthews has completed her ban for a dangerous tackle in the Premiership Women's Rugby final, and is available for selection in the Six Nations for the first time.\nShe will be competing for her place in the squad with Exeter Chiefs' Maddie Feaunati who has impressed in the number eight shirt in Matthews' absence.", "url": "https://www.bbc.com/sport/rugby-union/articles/ce8gmxmjy3eo"}