{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 05:17:10", "date_modify": "2025-05-21 05:17:10", "date_publish": "2025-04-03 16:49:24", "description": "Michael Wimmer coy on potential new Motherwell deal for 'very important' Andy Halliday", "filename": "sport_articles_cql6rwgpd4xo_1747804630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deb8/live/4e523b80-109c-11f0-b4be-f729a68ebc4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cql6rwgpd4xo_1747804630.html", "title": "Michael Wimmer coy on potential new Motherwell deal for 'very important' Andy Halliday", "title_page": "Michael Wimmer coy on potential new Motherwell deal for 'very important' Andy Halliday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Michael Wimmer praised the influence of \"very, very important\" midfielder Andy Halliday, but the Motherwell boss would not be drawn on contract talks with the 32-year-old, whose deal expires this summer.\nThe former Rangers and Hearts player has featured in every game this season, starting all of Wimmer's first five matches in charge.\nBut, as it stands, the experienced midfielder is one of many Well players set to be out of contract at the end of this season, meaning he is free to negotiate with other clubs.\n\"I'm very happy with Andy,\" Wimmer told the media prior to his team's trip to face Kilmarnock on Saturday.\n\"You can see in [the 4-1 defeat to] Aberdeen, for 90 minutes he gave everything for the club and the team.\n\"And I like how he deals with the young guys. It's very good how he speaks with them, how he helps them on the pitch to support them. But I don't speak about players who we want to extend, perhaps you will read it.\"\nWimmer is keen to lay the foundations for next season, with midfielder Callum Slattery, defender Stephen O'Donnell and wing-back Tom Sparrow all penning contract extensions recently.\nThe Well boss is also open to exploring an extended stay for on-loan Carlisle striker Luke Armstrong at Fir Park.\nBut, including loan recruits, there are still about 20 players from a bloated squad who are currently set to depart the club in the summer.\nThis will be the largest turnover of players former Austria Vienna manager Wimmer has experienced, but he says it is a \"good situation\" for him.\n\"The picture has become clearer every day,\" the German added. \"I see who fits to us, who wants to work with us, who wants to play in this stadium in front of these great fans.\n\"Players in the squad now I can see every day, they have an advantage. We're now working to extend players.\"\nBut what does that mean for injured players who are unlikely to get the chance to play under Wimmer this season, including captain Paul McGinn?\n\"I have to make this picture, watch videos,\" the 44-year-old said. \"These players have played for the club and made good performances, gave everything.\n\"They deserve also that I give them a clear picture and a chance. Of course they are at a disadvantage because they can't play, but it's up to me to give them the feeling they have no disadvantage.\"", "url": "https://www.bbc.com/sport/articles/cql6rwgpd4xo"}