{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 04:40:59", "date_modify": "2025-05-21 04:40:59", "date_publish": "2025-02-01 06:49:56", "description": "Six Nations fans are usually made to wait to watch Ireland and England face each other, but not this year as the sides meet in Dublin on the opening weekend.", "filename": "sport_rugby-union_articles_c391p4eydvlo_1747802459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c114/live/faa16370-dfff-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c391p4eydvlo_1747802459.html", "title": "Six Nations 2025: Ireland host England in opening-weekend blockbuster", "title_page": "Six Nations 2025: Ireland host England in opening-weekend blockbuster - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As a fixture, Ireland against England is usually the good thing that comes to those who wait. But not this year.\nOnly twice have Ireland and England locked horns on the opening weekend in the Six Nations era, with England winning both times, in 2000 and 2019.\nIt is often kept for the tournament's pressure-packed latter stages, so when organisers released the 2025 schedule in the hours leading up to last year's match at Twickenham, eyes were immediately drawn to 1 February: Ireland v England.\nNow, with 10 months having flown by, the rugby world braces itself for the latest chapter in a rivalry that began 150 years ago.\nWhen they met last March, the stakes were sky-high. With seconds left, Marcus Smith's drop-goal sent Twickenham crazy. Ireland's hopes of back-to-back Grand Slams were crushed and suddenly all was fine in England's world.\nThis weekend, it's all about setting tones, settling scores, laying down markers and capturing that early jolt of momentum that can shape a championship.\nTo England first. The pressure on head coach Steve Borthwick is intense. That Twickenham win promised a new dawn. What followed, however, was a defeat in France and summer and autumn campaigns filled with agony.\nNew Zealand on three occasions, Australia, South Africa. Southern hemisphere scalps kept slipping through England's grasp.\nThose results were, of course, bookended by a couple of thumping wins over Japan, but there is no escaping the sense that English rugby needs a lift, the ongoing tumult in its corridors of power having served only to darken the mood lately.\nSpeaking of lifts, the aerial battle has been a point of discussion since the teams were announced. Borthwick has created history by starting Curry twins Ben and Tom either side of Ben Earl, who was outstanding against Ireland last year.\nAnd while that trio offers speed, mobility and breakdown menace, the selection may give Ireland - for whom the 6ft 6in Ryan Baird is a surprise inclusion - the edge at the line-out.\nMaro Itoje, England's new captain, was quick to assuage such fears this week.\n\"We have enough line-out jumpers. The line-out is a massive part of the game and we have a well-oiled machine,\" said the lock, who has replaced Saracens team-mate Jamie George as England's skipper.\n\"If you were to look at our statistics over the last autumn, it's an area that we're pretty strong at in terms of ball winning.\"\nLast year, England attacked Ireland from the outset and stopped the green machine clicking into gear. Key to that was Alex Mitchell, who is reinstalled at scrum-half after missing the autumn matches through injury.\nMitchell will start alongside Marcus Smith instead of Northampton team-mate Fin Smith.\nIn addition to delivering the killer blow against Ireland last year, Marcus Smith stood out during a difficult autumn campaign. The rekindling of that half-back partnership could breathe new life into an England attack that features wing Cadan Murley, who makes his debut.\nNext week, England host France. Suffice to say, these first two weekends could decide not only England's fate this year, but Borthwick's future too.\nIreland may be chasing an unprecedented third title in a row, but they do not approach this year's tournament without trepidation.\nWith head coach Andy Farrell deep in British and Irish Lions prep, his assistant Simon Easterby has stepped up to lead a team who huffed and puffed their way through November.\nThey were well beaten by the All Blacks - their first home reverse since the 2021 Six Nations - and laboured to wins over Argentina, Fiji and Australia.\nThat series exposed some alarming frailties, with 13 penalties shipped against both New Zealand and Argentina, 23 turnovers conceded against Australia, and 49 handling errors combined in the All Blacks and Wallabies games. And the line-out, like at the World Cup, faltered at key times.\nIreland have not shied away from their underwhelming displays in November, and given how the England game ended last year, Easterby's side need not look far for motivation.\nLike England, Ireland are missing some key operators. Tadhg Furlong is a world-class tight-head prop while Joe McCarthy started every Test in 2024 having enjoyed a breakthrough Six Nations. Both are absent.\nIt is, however, still a formidable pack, with Josh van der Flier and captain Caelan Doris among those to have found form with Leinster prior to entering Ireland camp.\nNo doubt Farrell will be keeping a close eye on Doris and his England counterpart Itoje as the battle to be named Lions captain intensifies.\nEasterby has been able to field a settled backline, although handing a Six Nations debut to fly-half Sam Prendergast is a big call, leading former England winger Chris Ashton to suggest England will target the 21-year-old's inexperience.\nAs ever, the respective benches could have a big say and Ireland can call upon 509 caps worth of experience. Easterby will emphasise the importance of a fast start against an England side who won three Six Nations games last year despite trailing in all five at half-time.\nIreland's back-to-back title wins were built on strong starts. They swatted Wales aside in Cardiff in 2023 and crushed 14-man France in Marseille last year.\nIf they produce another stirring performance on Saturday and claim a 26th win in 30 Six Nations home matches stretching back to 2013, few will doubt their title credentials.", "url": "https://www.bbc.com/sport/rugby-union/articles/c391p4eydvlo"}