{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-21 06:53:09", "date_modify": "2025-05-21 06:53:09", "date_publish": "2025-01-31 05:41:03", "description": "As Wales prepare to kick off the 2025 Six Nations away to France, Warren Gatland will hope for an unlikley repeat of 2019 Welsh heroics in Paris.", "filename": "sport_rugby-union_articles_clyn3jvw8l2o_1747810389.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/094a/live/acef6830-dee6-11ef-95b8-53b8dd8c4ede.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clyn3jvw8l2o_1747810389.html", "title": "Six Nations 2025: Warren Gatland's Wales aim for lift in France", "title_page": "Six Nations 2025: Warren Gatland's Wales aim for lift in France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paris on a Friday night. Probably not how struggling Wales would have chosen to kick off their Six Nations campaign, or how Warren Gatland might have wanted to celebrate his 150th game in charge of his adopted nation.\nThe lack of expectation heading into the tournament from the Welsh public has probably never been matched. That includes the dark days of the 1990s.\nMost are fearful of a second successive Wooden Spoon with only two wins in the previous 16 games in the tournament.\nWales have been given odds of 22-1 at the bookmakers to win the opening game in Paris. They are 80-1 outsiders for the Six Nations title and one particular predictor gives Gatland's side just a 0.2% chance of achieving that feat.\nNew Wales scrum consultant Adam Jones summed it up neatly when asked about hope of a victory in France.\n\"The whole country and rugby world thinks we are going to go there and get pumped,\" said Jones.\nCaptain Jac Morgan, however, says Gatland's side are determined to prove people wrong as they aim to banish the negativity that has engulfed Welsh rugby.\nGatland will raise his metaphorical bat when he reaches 150 games in charge of Wales. The nation will be hoping there is no cricket score in France's premier rugby venue.\nHis overall record stands at 149 matches with 76 wins, 71 defeats and two draws over two stints in charge of Wales.\nThe two spells are starkly contrasting. During his first 12-year tenure, Gatland recorded 70 wins in 125 games with 53 defeats and two draws, a success rate of 56%.\nHe guided Wales to three Grand Slams and two World Cup semi-finals, while taking sabbaticals to lead the British and Irish Lions to a series victory against Australia in 2013 and a draw against New Zealand four years later.\nWales briefly topped the world rankings in August 2019 but in just over five years Gatland's side have gone from being the world's best to Wales' worst.\nSecond time around Gatland has presided over statistically the most dismal run in their 144-year international rugby history with 12 successive Test losses.\nSince returning to replace fellow New Zealander Wayne Pivac in December 2022, he has managed only six wins and 18 losses in 24 matches, a success rate of just 25%.\nSix years ago almost to the day, Wales opened their Six Nations campaign against France in Paris and completed a remarkable second-half comeback to seal victory on the way to a Grand Slam.\nIt was a 10th successive win during a record 14-match streak with Gatland boasting afterwards his side had forgotten how to lose. Currently they cannot remember how to win.\nAs Gatland enters his 13th Six Nations campaign with Wales, he will hope he can avoid a 13th successive Test loss.\nOctober 2023 was Wales' most recent international victory when Gatland's side defeated Georgia in the final World Cup pool match in Nantes. Some 482 days or almost 16 months ago - whichever you prefer.\nA dismal dozen Test defeats - 11 of those in a calendar year - have followed, with losses against Argentina, England, Ireland, France, Italy, Scotland and Fiji, a couple against South Africa and a hat-trick of failures against Australia.\nThe wretched run of results has seen Wales slip to all-time low of 11th in the world rankings.\nGatland looked a broken man at times during the latter stages of 2024 but has been publicly defiant before this latest campaign.\nPre-tournament comments have included how he believes Wales can win the tournament, how he is building \"a siege mentality\" and how people should write his side off \"at their peril\".\nHe has also tried to heap pressure on France by stating he hopes Wales \"can catch them cold\" and highlighted the pressure his opposite number Fabien Galthie faces to defeat Wales comfortably.\nIn 2019, Gatland said if Wales beat France they would go on to win the Six Nations - exactly what happened.\nSix years ago, you believed those swaggering sentiments. He also had the tools at his disposal to back up his actions with words.\nNow it feels the Gatland soundbites are the right things to say but you wonder whether he believes them himself.\nSpeculation is rife this will be his final tournament, whatever might happen over the next two months. Gatland has accepted change is likely if signs of improvement are not shown during the Six Nations.\nThe 61-year-old has spoken himself about whether he needs the pressure and whether he could just retire to his beach house in New Zealand and reflect on his memorable achievements in the game.\nWelsh Rugby Union (WRU) chief executive Abi Tierney said Gatland's position had been \"on the line\" as a review into the miserable autumn campaign commenced earlier this season.\nHe was given the green light to continue with another detailed assessment planned after Wales finish the tournament at home to England in mid-March.\nThere have been changes to Gatland's staff. As well as scrum consultant Jones coming in, attack coach Alex King has left with Rob Howley taking over those responsibilities. How much that can influence events remains to be seen.\nWales might have enjoyed previous Paris success but France have won the past six games in this rivalry.\nLes Bleus were unbeaten in the autumn which included a victory against New Zealand and still have former Wales defence coach Shaun Edwards in the ranks.\nThey have injuries to centre Gael Fickou, lock Thibaud Flament, flanker Charles Ollivon and wing Damian Penuad that might give Wales some faint hope.\nThere is still, though, the little matter of scrum-half Antoine Dupont. Among many headline acts on show at Stade de France, none is more in demand than the France captain.\nWidely regarded as the world's best player, he returns to the Six Nations arena after missing last season's tournament while he concentrated on the Paris Olympics and being part of France's sevens squad.\nA year on, he can admire a gold medal, in addition to helping his club Toulouse land a Champions Cup and French league double, while also orchestrating Les Bleus' triumph against the All Blacks.\nDupont is also reunited at Test level with half-back partner Romain Ntamack for the first time in 17 months.\nThe dynamic duo's presence will lift the decibel level at Stade de France, and Wales face a Herculean task trying to silence it.\nFew people really expect Wales to win in France. But whatever happens in the Parisian late evening, Welsh rugby needs something, anything, from this tournament.\nJust a glimmer of hope to emerge from the doom and gloom. A blueprint of what this Wales side represents, what they can become.\nYes, Wales have lost a golden generation of players and do have some talented youngsters but people are becoming tired of talk of building towards the 2027 World Cup. They want progress. Now.\nThe state of the game in Wales cannot be laid solely at the door of Gatland or his Wales national side. Nor should it.\nThe relative success of the Wales men's squad over previous years has papered over the cracks of the mismanagement of the game.\nThe cash-strapped four Welsh professional sides are struggling, despite a few optimistic glimpses this season. Interest is generally waning, with crowds down, apart from at Cardiff.\nWelsh rugby is used to peaks and troughs, ecstatic highs and wretched lows with not much in between. This current malaise is comparable to any of the previous \"rock bottom\" scenarios.\nWelsh rugby has lifted itself out of such holes before. Long-suffering supporters will hope this Friday night in Paris can be the start of another such voyage.", "url": "https://www.bbc.com/sport/rugby-union/articles/clyn3jvw8l2o"}