{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:14", "date_modify": "2025-05-21 06:46:14", "date_publish": "2025-03-30 16:12:00", "description": "Teenager Angus Hall scores an eye-catching try on his first Premiership start as Saracens reignite their top-four hopes with victory at Leicester.", "filename": "sport_rugby-union_articles_cn9vrdn3q10o_1747809974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6c1f/live/81760b10-0d7f-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn9vrdn3q10o_1747809974.html", "title": "Premiership: Leicester Tigers 22-29 Saracens: Sarries boost top-four bid", "title_page": "Premiership: Leicester Tigers 22-29 Saracens: Sarries boost top-four bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Teenager Angus Hall scored an eye-catching try on his first Premiership start as Saracens reignited their top-four hopes with a hard-fought win at Leicester Tigers.\nThe 19-year-old collected Elliot Daly's pass and sped clear to finish in the corner after Saracens had fallen behind for the first time in the match.\nJamie George and Juan Martin Gonzalez gave the visitors a 14-point lead before the Tigers fought back to lead through Freddie Steward and a Hanro Liebenberg double either side of half-time.\nBut Hall's effort pulled Saracens level and replacement Theo Dan scored the decisive try from a Leicester line-out, with Cameron Henderson's effort for the Tigers controversially ruled out for offside.\nSaracens' bonus-point win lifts them to sixth in the table, two points behind Leicester in third.\nSarries, who started with a quartet of England players in an effort to boost their play-off chances, suffered an early setback as prop forward Fraser Balmain was carried off injured in the opening minute.\nBut it did not disrupt the visitors' rhythm as they quickly opened a 14-point lead, moving the ball back and forth across the pitch inside Leicester's 22 before George eventually burst over the line.\nGeorge and Theo McFarland then made inroads on the right and Saracens brought the ball back infield for Gonzalez to scoot through a sizeable gap in the Tigers' defence, with Alex Lozowski adding the extras on both occasions.\nA try-saving tackle by Tom Willis denied Solomone Kata soon afterwards, but a wave of Tigers pressure finally paid off as Ollie Hassell-Collins set up Steward, who broke clear to score under the posts.\nAfter Handre Pollard and Lozowski had traded drop-goals, it was Leicester who finished the first half in the ascendancy after Liebenberg squeezed over to reduce the gap to two points at the turnaround.\nThat momentum spilled into the second half as the Tigers turned the ball over deep in opposition territory and Liebenberg took advantage, going over for his second try to put the home side ahead for the first time.\nThe lead was short-lived, however, with quick hands from Saracens enabling Daly to release Hall and the youngster displayed good technique to hold off Adam Radwan's challenge and dot down just inside the corner flag.\nSaracens were hit by another injury blow when Lozowski was forced off on the hour - but again they responded by scoring, with Maro Itoje doing enough to disrupt the line-out so that Julian Montoya's throw sailed through for Dan to collect and finish.\nThe home crowd thought their side had levelled again immediately as Henderson charged down Ivan van Zyl's kick from the scrum and scampered over - but referee Luke Pearce adjudged the Leicester lock offside and chalked off the try after a video replay.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn9vrdn3q10o"}