{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:36:31", "date_modify": "2025-05-20 11:36:31", "date_publish": "2023-08-07 05:55:45", "description": "British number two Dan Evans beats Dutchman Tallon Griekspoor in straight sets to claim the Citi Open title in Washington.", "filename": "sport_tennis_66424666_1747740991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5C5F/production/_130674632_dan_evans_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66424666_1747740991.html", "title": "Citi Open: Dan Evans beats Tallon Griekspoor to win first ATP 500 title", "title_page": "Citi Open: Dan Evans beats Tallon Griekspoor to win first ATP 500 title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Dan Evans won the first ATP 500 title of his career by beating Tallon Griekspoor in the Citi Open final in Washington DC.\nEvans, now the world number 21, triumphed 7-5 6-3 against the Dutchman after a 90-minute rain stoppage.\n\"To do the work I've done and to stick with it and come through is [amazing],\" said Evans.\nAmerican 19-year-old Coco Gauff beat Greece's Maria Sakkari 6-2 6-3 to take the women's title.\n\"It was really tough a couple weeks ago,\" said world number seven Gauff, who was knocked out in the first round at Wimbledon last month but did not drop a set in the Citi Open. \"We were all feeling it and I'm glad that I was able to bounce back.\"\nBritish number two Evans, 33, required four break points to take the opening set, before play was suspended at 2-2 in the second because of rain and lightning.\nAfter the restart Evans cruised through his remaining service games until he saved four break points in the penultimate game of the match.\n\"The last game sort of summed up my week. I got out of trouble and it was an amazing week,\" said Evans, who began the tournament on a seven-match losing streak.\n\"I wasn't playing very well and I wasn't happy with my game.\"\nHe is the first Briton to win the tournament since Tim Henman in 2003.", "url": "https://www.bbc.com/sport/tennis/66424666"}