{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:48:53", "date_modify": "2025-04-26 03:48:53", "date_publish": "2025-03-05 14:10:13", "description": "Three-time Super Bowl winner Travis Kelce says he will continue playing for the Kansas City Chiefs in the 2025 season.", "filename": "sport_american-football_articles_cjevvnxl55yo_1745639333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a961/live/9b15cc50-f55f-11ef-9dd3-3538510401a1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_american-football_articles_cjevvnxl55yo_1745639333.html", "title": "Travis Kelce: Kansas City Chiefs tight end will continue playing in 2025 season", "title_page": "Travis Kelce: Kansas City Chiefs tight end will continue playing in 2025 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three-time Super Bowl winner Travis Kelce says he will continue playing for the Kansas City Chiefs next season.\nThe 35-year-old tight end has one year left on his contract but said he was considering retirement after the Chiefs lost to the Philadelphia Eagles in the Super Bowl last month.\nKelce, who is dating pop superstar Taylor Swift, was restricted to four catches for 39 yards on his fifth Super Bowl appearance.\n\"I still feel like I can play at a high level and possibly at a higher level than I did last year,\" Kelce told the New Heights, external podcast he co-hosts with brother and former Eagles centre Jason.\n\"I don't think it was my best outing. I let my guys down in a lot more moments than I helped them.\n\"I have a bad taste in my mouth in how I ended the year and how well I was playing and how accountable I was for the people around me. I don't want to leave that life yet.\n\"I feel like there is a responsibility in me to play out the contract I initially signed to give Kansas City and the Chiefs organisation everything I've got, and that's what I'm going to do.\"\nKelce has helped the Chiefs reach five of the past six Super Bowls, establishing himself as one of the NFL's best tight ends in history.\nSpeaking at the NFL's Scouting Combine, Chiefs general manager Brett Veach said Kelce \"was battling with a pretty big illness\" before the Super Bowl.\nThe Chiefs drafted Kelce with the 63rd overall pick in 2013.\nFrom 2016 to 2022 he recorded more than 1,000 receiving yards and was an All-Pro selection in each of those seasons.\nKelce formed a productive partnership with Patrick Mahomes, who became the Chiefs' starting quarterback in 2018, as they won the Super Bowl in 2020, 2023 and 2024.\nThe Eagles denied them an unprecedented 'three-peat' after a regular season in which Kelce made 97 receptions for 823 yards, his lowest yardage total since 2014.\nThe 2025 season is scheduled to start on 4 September.", "url": "https://www.bbc.co.uk/sport/american-football/articles/cjevvnxl55yo"}