{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-20 12:52:40", "date_modify": "2025-05-20 12:52:40", "date_publish": "2023-08-03 09:47:01", "description": "It's been 38 years since a non-Old Firm team won Scotland's title. From a financial gulf to psychological barriers, here's why it's unlikely to change any time soon.", "filename": "sport_football_66359978_1747745560.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1658/production/_130602750_bbc-sport-index-imagery-3-split-images-gradient-b03af1b9-2f9d-484b-9879-4eb7ac8409c7.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359978_1747745560.html", "title": "Why a non-Old Firm title win is now a near impossible task", "title_page": "Why a non-Old Firm title win is now a near impossible task - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New season. Fresh faces. Pristine pitches. There's even a brand new ball manufacturer for the upcoming SPFL campaign.\nBut will we see a different destination for the Premiership title come May? The start of the 2023-24 season marks just over 38 years since the league trophy was last held aloft by a team outside Glasgow's big two.\nSince Sir Alex Ferguson's Aberdeen clinched back-to-back crowns in 1985, which followed up Dundee United's 1983 triumph under Jim McLean, the silverware has alternated between Celtic and Rangers over the course of almost four decades.\nIt's comfortably the longest spell of two-team domination in Scotland and there's no suggestion of it ending any time soon.\n\"At this moment, I just don't see it,\" former Hearts, Celtic and Rangers defender Steven Pressley tells BBC Scotland.\nSo why is that?\nA gaping - and widening - financial chasm is the obvious driver. But Pressley - a man who experienced an unlikely challenge with Hearts and the expectancy of playing for the Old Firm - feels \"certain other aspects\" have to be in place.\nBBC Scotland looks at the reasons why a challenge from the other 10 top-flight teams has become a near impossible mission.\nHaving the biggest budget will more often than not equal winning the biggest prizes in football. Granted, it isn't always the case.\nBut, with the level of disparity between the Old Firm and the others, the margin for an upset is far slimmer in Scotland than it is across other leagues in Europe.\nIn recent times, Leicester City's extraordinary Premier League title win in 2015-16 has been a go-to comparison but they had a smaller financial gap to wrestle with when it came to challenging England's top clubs.\nData provided to BBC Scotland by football finance expert Kieran Maguire tells us that Celtic and Rangers make up 70% of the Premiership's total revenue. Their wages account for 69% of the league's total, while they amount to 96% for combined squad costs.\nIn 2021-22, they made up 95% of transfer fees in the division.\nEye-watering numbers for sure - but what's even more staggering is the changing fortunes over the past 38 years.\nIn 1984-85, the last season a non-Old Firm team finished on top, Aberdeen generated £110 for every £100 Celtic managed. Now, the Pittodrie club bring in just £16 for every £100 made by Celtic.\n\"There's been a significant transformation over time,\" Maguire tells BBC Scotland. \"That's partly due to the expansion of stadiums and the sell-out crowds Celtic and Rangers attract.\n\"But the real mover is qualification for European competition. In the SPFL, there's a ceiling for broadcast revenue. That's not the case in Europe.\"\nWith both Celtic and Rangers benefitting from Champions League group-stage cash last term and the prospect of more this season, the gulf is only increasing.\nAssuming no-one with very deep pockets fancies taking over a non-Old Firm club, the only realistic avenues to reducing that gap is with improvement in European competition and a successful player-trading model.\nFor the second season running, a team outside Glasgow will feature in the group stages of either the Europa League or Conference League, but the prize money on offer is dwarfed by Europe's premier club tournament.\nScotland's current coefficient ranking opens the door to Champions League qualification for the runners-up in the Premiership. Managing that is hard enough with both Old Firm teams in the league but it's not impossible, as Aberdeen showed in 2016-17 and 2017-18.\nPerhaps repeating that feat would the first step towards achieving the unthinkable.\nBank balance certainly plays a significant part but Pressley believes there's more to it.\nThe former Scotland centre-back cites \"stability, consistency of high-level coaching, really good recruitment, promotion of top academy players and overcoming the phycological barrier\" as \"vital\" additional factors. Not too much to ask, is it?\nHaving won titles during spells with both sides of the Old Firm, Pressley knows what it takes to get over the line. But he also knows what's required to mount an unlikely challenge outside Glasgow.\nHearts - backed by Vladimir Romanov - started the 2005-06 campaign with 10 wins and two draws from their opening 12 games under George Burley, before a shock exit for the former Scotland boss.\nThe Tynecastle club would end the season in second. A mightily impressive achievement, but the 17 points they finished behind eventual champions Celtic only highlights further the scale of the task.\nThat season will forever be a 'what if?' for Hearts fans, but Pressley is \"far from convinced\" that the Edinburgh side would have gone on to win the title had Burley remained in his post.\nHowever, if they had been able to retain the management team and the core of the playing staff, the ex-Hearts captain believes his former side \"would have sustained a greater challenge for a longer period of time\".\n\"I had a feeling about the group,\" Pressley adds. \"We felt we could compete, but it didn't come overnight. The spine of the team had been together for a number of years, then there was the emergence of Christophe Berra, Craig Gordon and Robbie Neilson.\n\"Because we had players from overseas, they were going into the unknown so they didn't have an element of fear when it came to the Old Firm. George had sold them the dream that we could compete, he made our group feel really good.\n\"He spoke down about a lot of other teams and players in Scotland. He was almost dismissive. When you look back to the Ferguson and McLean eras, they put huge emphasis on the psychology and building a venomous mentality.\"\nIt should also be remembered that Romanov's initial level of spending could not be sustained, leading to insolvency and relegation. A cautionary tale.\nHaving the resources, consistency and continuity is difficult enough to challenge - but believing it is another beast. Any public suggestion of title-winning aspirations would only end with the player or manager in question getting laughed out the press room.\nThe relentless domination of the Old Firm since 1985 has made the idea of a Premiership triumph outside Glasgow a pipe dream at best.\nGoal difference denied Hearts the title in 1986 and Aberdeen took Rangers to a final-day decider five years later. But there has since been little in the way of a realistic season-long fight.\nEven with Rangers out of the top flight for four years between 2012 and 2016, the closest anyone came to Celtic was Aberdeen, who finished 15 points behind in the 2015-16 campaign.\nBy the end of 2020-21, the gap between first and third was 39 points. Despite reducing this to 32 in the next campaign, last term it reached a 21-year high of 42 - over double 2018-19's figure of 20.\nWith the end-of-season totals both of the Old Firm sides have been racking up recently, it would take teams such as Aberdeen (76), Hearts (74) and Hibernian (67) to smash their record points tallies to stand any chance of finishing second.\nThere's a simple fix: just get yourself a modern-day Ferguson or McLean, find them a bottomless pit of cash and provide them with top recruitment and generational academy talent.\nThen, all you need to do is close your eyes, cross your fingers and hope they stick around long enough to see the plan come to fruition.\nEasy peasy, right?", "url": "https://www.bbc.com/sport/football/66359978"}