{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 04:46:39", "date_modify": "2025-05-21 04:46:39", "date_publish": "2024-12-25 10:54:30", "description": "The retirement of long-time talisman Andy Murray this year gave an opportunity for other British players to step into the limelight - and here's who impressed.", "filename": "sport_tennis_articles_c4gw78x8pw1o_1747802799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c059/live/0e6b38c0-b87f-11ef-9b54-edc811e341cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c4gw78x8pw1o_1747802799.html", "title": "How Jack Draper, Katie Boulter, Henry Patten & Alfie Hewett led British success in 2024", "title_page": "How Jack Draper, Katie Boulter, Henry Patten & Alfie Hewett led British success in 2024 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For almost two decades, Andy Murray has been the benchmark of British tennis success.\nThe former world number one hanging up his racquet has allowed others to grab a greater share of the limelight.\nAs the nation's leading players prepare for the new season, BBC Sport reflects on the British success stories in 2024 - and you can choose the player who has impressed you the most.\nThis year has been a coming of age for Jack Draper.\nHis US Open semi-final run drew the attention of a wider audience, but that breakthrough had been months in the making.\nIn June, the 23-year-old left-hander won his first ATP Tour title in Stuttgart and became the new British men's number one.\nThat led to a career-best major performance in New York, breaking into the world's top 20 and winning his biggest career title in Vienna.\nBecoming better equipped physically to deal with the rigours of the ATP Tour has been a key to his success, although he is still working on solving the issues that have led to on-court sickness.\n\"I feel like I've changed so much as a person in the last six months,\" Draper said.\n\"I'm hoping as time goes on I'll be able to manage these things better and become the player I want to be.\"\nThe legendary Billie Jean King recently said people should \"pay more attention\" to British women's number one Katie Boulter.\nBoulter expressed her gratitude at being recognised by one of the sport's icons, adding she was happy to \"fly under the radar\".\nRemarkably the 28-year-old is still able to do that, despite breaking into the world's top 25 and winning two WTA titles - including the biggest of her career so far.\nWhat has stopped her gaining more attention is the lack of a deep run at a major. Another factor, perhaps, has been the interest in Emma Raducanu's comeback.\n\"I know I can get to where I want to,\" said Boulter, who did not reach the third round of a Grand Slam tournament in 2024.\n\"I'm not going to give you any numbers to tell you what my targets next year are, but I'm aiming high.\"\nEight years ago Henry Patten was working at Wimbledon as an IBM data collector on the outside courts.\nNow, the 28-year-old is the SW19 men's doubles champion.\nIt has been a stunning rise for a player who began the year well outside the top 100 and had little ATP Tour pedigree.\nThen he linked up with Finland's Harri Heliovaara. They claimed the title in Marrakech in their first tournament together, before triumphing in Lyon and Stockholm either side of Wimbledon.\n\"It has been a year of firsts and there are so many things which I'm proud we've been able to achieve,\" says Patten, who made his Davis Cup debut in September.\nFew outside of British tennis circles would have heard of Jacob Fearnley or Sonay Kartal before this year.\nLittle over a year ago, 23-year-old Fearnley was unranked in the professional game. He finished the season as a top 100 player.\nWinning four ATP Challenger titles led to the fifth biggest climb in the men's rankings since 2000.\nKartal's rise has also been sharp.\nThe 23-year-old began the year outside the top 250 and feared she would miss the rest of the season because of illness.\nAfter several hospital visits, Kartal was given the go-ahead to return in April. Now the world number 85 is celebrating the best year of her career after winning a maiden WTA title.\nLike Fearnley, the reward is direct entry into a Grand Slam main draw for the first time at the upcoming Australian Open.\nThe task for British tennis is developing the next generation of talent and avoiding another 35-year wait for a Grand Slam singles champion.\nThe performances of the British juniors this year - across singles, doubles and team events, external - have provided optimism.\nMika Stojsavljevic, who turned 16 last week, won the US Open girls' singles title, while 17-year-old Mimi Xu and 18-year-old Charlie Robertson reached the last four in New York.\nHenry Searle, 18, who won the Wimbledon boys' singles in 2023, and 15-year-old Hannah Klugman, winner of the prestigious Orange Bowl junior championships last year, have continued making strides.\n\"Success in junior tennis is definitely a strong indicator of long-term potential but, of course, it is no guarantee,\" said Iain Bates, the LTA's head of women's tennis.\n\"Seeing younger players reaching the back end of junior Slams is a sign of the health of the pathway.\"", "url": "https://www.bbc.com/sport/tennis/articles/c4gw78x8pw1o"}