{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:32", "date_modify": "2025-05-21 05:35:32", "date_publish": "2025-04-02 14:37:04", "description": "'Remarkable professional' Tom Sparrow pens new Motherwell deal", "filename": "sport_articles_c4g327k5k2xo_1747805732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26c1/live/bbc67dc0-0fcf-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4g327k5k2xo_1747805732.html", "title": "'Remarkable professional' Tom Sparrow pens new Motherwell deal", "title_page": "'Remarkable professional' Tom Sparrow pens new Motherwell deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Michael Wimmer says Tom Sparrow is an \"integral part\" of his Motherwell future after the versatile 22-year-old signed a new two-year deal at the club.\nSparrow, whose fresh contract will run until the summer of 2027, joined the Lanarkshire side last summer after leaving Stoke City.\nHis initial appearances came in central midfield, but the former Chester player has impressed at right-wing back in recent weeks, scoring in last month's 2-1 win at Rangers.\n\"During my brief time here, I've come to truly value Tom and his contributions,\" said Fir Park boss Wimmer.\n\"He is a remarkable professional who has performed exceptionally well since my arrival. He brings energy, determination, and skill - qualities we highly seek in our team.\n\"As we prepare for next season, we're focused on laying the groundwork. Tom is an integral part of that plan and this is positive news for everyone at the club.\"\nFormer Wales Under-21 international Sparrow, who has scored four times for the club, added: \"It makes complete sense for me to continue here.\n\"I have enjoyed every moment and believe I've made a significant impact. I feel I've grown and learnt a great deal from participating in so many matches.\"", "url": "https://www.bbc.com/sport/articles/c4g327k5k2xo"}