{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:41:11", "date_modify": "2025-05-21 05:41:11", "date_publish": "2025-04-06 00:00:00", "description": "Manchester City were held to a dull goalless draw at Manchester United as they missed the chance to move into Premier League top four.", "filename": "sport_football_live_c2dep9ejpykt_1747806071.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c2dep9ejpykt_1747806071.html", "title": "Manchester United 0-0 Manchester City", "title_page": "Manchester United 0-0 Manchester City - visitors miss chance to move into top four with dull derby draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nFT: Man Utd 0-0 Man City\nRight, I think my race is run.\nNot the greatest game we've watched together, was it?\nThe Premier League returns with Leicester vs Newcastle on Monday night. And be sure to join the Daily Football live text team tomorrow for reaction to all of this weekend's Premier League matches.\nThey'll be online from 07:00 BST on the BBC Sport website and App.\nSee ya!\n'I want to do it for him'\nFT: Man Utd 0-0 Man City\nManchester City\nManchester City defender Ruben Dias on Kevin De Bruyne leaving the club: \"It's not the best news to receive. More than the player he is he's a friend and a very special person to all of us, the club and the fans. Right now it's a time to savour every single second we can have him.\n\"What he's done is special, there are so many adjectives the classify it. Enjoy every moment, we are still in three competitions [including Fifa Club World Cup]. Try and make it as best as we can, he deserves it, as a member of this team I want it for him more than anything else.\"\n'It is what we are made of'\nFT: Man Utd 0-0 Man City\nManchester City\nManchester City defender Ruben Dias speaking to Sky Sports: \"It was a very difficult game, it always is, they were dangerous. I feel like to leave today with a point is to add to our run to stay in the top four, there was a lot of fight from all of us.\nOn playing against United's low block: \"It's not easy when they are so low and so many numbers, it's difficult. I felt in the first half we had moments we arrived to the moment of last pass and if the last pass gets in we could have been more dangeorus. Second half was different.\nOn City's fighting spirit: \"Even though it was not our best performance, the way we fought and everyone was connected. The way Bernardo [Silva] and Mateo [Kovacic] fought for every ball. The last effort fom Omar [Marmoush], completely drained but he still went for it, that is what we are made of.\nHow far are City of getting back to their level?: \"Time will tell how far we are, but definitely I feel we are more solid, our attitude, how we fight for duels, we are able to suffer in difficult circumstances. The way we react when lost the ball, the principles of being what we are.\n\"Offensively we are not normal, not today, but they are little signs that people don't appreciate that much.\"\n'It will take time'\nMan Utd 0-0 Man City\nManchester City\nManchester City manager Pep Guardiola speaking to Sky Sports: \"We have the control but not in the right spots to hurt them in the first half, a little better in the first minutes of the second half. United have been an incredible transitional team, defend against us deep, with Garnacho and the pace they have. They link inside, they know perfectly what they have to do. But we take the point, I'd prefer to win but we are there.\nWhat do the players need to do better?\n\"The players know it. There is a process when the ball is on one side the players need to be in the right position. Today that was not good enough.\n\"Against a 5-4-1 it's so narrow and congested. We should have been in some positions that we tried to get in but weren't good enough to punish them.\n\"The last games we much much better, back four better, just our process was not [good] but we know that, when we lose the ball in certain positions they are a strong team and punish you, but we knew that.\nAbout getting back to City's usual level:\n\"It will take time, the players gave everything today,\n\"We will prepare for the upcoming games, there are a few things I'm happy with what I saw, but now we need to achieve the target of qualifying for Champions League then next season is next season.\"\n'Bruno has really big quality'\nFT: Man Utd 0-0 Man City\nManchester United\nManchester United manager Ruben Amorim speaking to BBC Match of the Day: \"I think we did well. We played a different game compared to Nottingham Forest last week. I know the excitement is not the same when you are not fighting for big things, changes the excitement of the derby.\nOn the lack of goals: \"We look at the positive things. Now in the last games we have the opportunities so we have to improve the last pass and the last shot.\"\nOn the lack of intensity: \"Sometimes you look at the teams and because of the moment there are doubts. Sometimes it is the moment of the clubs and the teams and you have to understand that.\"\nOn Bruno Fernandes' importance to the team: \"That is clear but you look at other teams and they have players who are essential. If you look at Liverpool with [Mohamed] Salah, the difference that he makes. Bruno is our player in that department. He's doing quite well. Everybody has to improve and Bruno has to step up a little bit more next year because he has really big quality.\"\n'Not a beautiful game to watch'\nFT: Man Utd 0-0 Man City\nManchester City\nMan City midfielder Mateo Kovacic speaking to BBC Radio 5 Live: \"Not a beautiful game to watch. It was tough. They were aggressive in the mid block so it was tough to find the right spaces to play. It was tough to create chances and we had to be careful with the counter attack because they are good going forward. It was a typical derby. We wanted the win but we take the point and move on.\n\"We always go for the win but we also had to be careful not to lose it because we are in a battle for the Champions League and we need points. We could have done more going forward and creating more but it was tough with the small spaces. We move on to the next games.\n\"We have to have the same mindset for Champions League [as going for the title] because it is important that Man City are in the competition next season.\n\"It will be tough until the end because there are many teams that fight for the top four and no game in the Premier League is easy. But we are confident that we can achieve it.\"\n'This Man Utd team shouldn't be competing with Brentford and Crystal Palace'\nFT: Man Utd 0-0 Man City\nRoy Keane\nFormer Manchester United midfielder on Sky Sports\nThat's the desire I'm talking about. They [Man United] need to find a way to get a result.\nIt's got to come from the manager, the staff, they've got to get it into the leaders they have in the dressing room.\nThey've got experienced players out there, [Harry] Maguire, Casemiro, [Bruno] Fernandes, do they get a grip of these players? We watch them at weekends but I'm always intrigued about what happens day-to-day at the training ground.\nThey get interviewed after as if a draw isn't too bad. A draw doesn't get you anywhere fast.\nThis is not enough, this isn't good enough.\nForget the top teams, I'm on about competing with Brentford and Crystal Palace and Wolves and all these teams. Are you telling me Man United should be behind them, even this group of players?\n'He's going to stay in the history of the Premier League'\nFT: Man Utd 0-0 Man City\nManchester United\nMore from Manchester United captain Bruno Fernandes speaking to Sky Sports about fellow midfielder Kevin De Bruyne who is leaving Manchester City at the end of the season: \"De Bruyne made the Premier League better. If City is where he is and Manchester United haven't won many trophies in this period, that is because of Kevin. He deserves all the credit, he has done fantastic.\n\"Ten years in the Premier League is a lot. Kevin keeps being world class and it was a pleasure to watch him so close, it was a pleasure to play against him and he's going to stay in the history of the Premier League, not only of Man City.\"\n'The killer instinct was missing'\nFT: Man Utd 0-0 Man City\nManchester United\nManchester United midfielder Bruno Fernandes speaking to Sky Sports: \"Happy with the performance but we need points. We played against a very good side but the game was there, we needed a killer instinct to get the goals. When you play against Manchester City, you know they will have a lot of the ball. The killer instinct was missing but we created a lot of chances.\n\"We have to be carry on. Not just for the rest of the season but everything that comes after.\nOn his responsibility to be the difference: \"We know that I will get more attention than others because I am the captain and I need to be at a level every time I go on the pitch. Effort will never be missing and that has to be my main thing to show to the other players.\nOn how far off Manchester United are: \"It is not these games that will define that. Whenever we play big teams, we know the pressure and attention is there. If we want to be a big club, like Manchester City and Liverpool, we have to do that consistently. If after today we relax and think that this is enough, we go back again. We have to do this consistently.\nOn what the derby was like to play in: \"It can't be like it was in the past, a lot of things have changed, with VAR, everything. With VAR, you can't do that.We can't be as rough as we want in the duels. Everything have changed.\"\n'They had chances, we had chances as well'\nFT: Man Utd 0-0 Man City\nManchester City\nManchester City manager Pep Guardiola speaking to BBC Match of the Day: \"Tight game. They had chances, we had chances as well. The only problem is we moved too much with the ball. We had to be in the right position and we didn't do that.\nOn his team selection: \"I think they played really good. Rico [Lewis] was really good. Satisfied with all of them.\nOn how the front line will operate without Erling Haaland: \"It depends. We put players with the sense of goal, with Omar [Marmoush] and Phil [Foden]. Gundo [Ilkay Gundogan] and Kev [De Bruyne] with good crosses and passes in to them. We have lived this many years. We were really good in our intensity. In that terms we are satisfied for the way we have done it.\"\nOn Nico O'Reilly's performance: \"Really good, especially in the first half. Really pleased.\"\n'Man Utd need to show more courage to win football matches'\nFT: Man Utd 0-0 Man City\nRoy Keane\nFormer Manchester United midfielder on Sky Sports\nWe saw the lack of quality [from Man United], the lack of goals holding the club back the last couple of years.\nI'm not sure what the mindset is in this group in terms of winning football matches.\nI think they need to show more courage. You go back to teams I played under, and I know you'll say this team isn't as good as that, obviously not, but there's a responsibility, when you're playing for Manchester United, to win football matches.\nWhat we've seen today, as much as we're all disappointed with it, what were we expecting? They don't score enough goals and they've not done for the last year or two and that's not going to change.\n'I'm not naive or crazy'\nMan Utd 0-0 Man City\nManchester United\nMore from United boss Ruben Amorim on what United need to do to return to the top level:\n\"I'm not naive or crazy, I can see the moment we are in, I can look at the opponents and understand there is a big gap, but as a leader I cannot say we are going to take all of the time to close the gap.\n\"Even if we bring in more players we have to hurry and show urgency to do better because we don't have much time at a club like this. We are in a rush.\nDid the struggles of both teams affect the intensity of the game?\n\"If you look at the moment of both teams, not fighting for titles, that changes the game completely.\n\"The feeling of winning, not being able to lose one point, that feeling is not here. As the coach it's hard to say that. We need to fight for big things, if we do then the feeling will be completely different.\"\n'We were closer to a goal'\nMan Utd 0-0 Man City\nManchester United\nManchester United manager Ruben Amorim speaking to Sky Sports: \"I think we had some chances to win the game. We tried to use the space in transitions, defending in a low block, but we had our chances.\n\"We had some moments with the ball, we pushed City into their half, we were closer to a goal but we can accept a draw. We were closer to the goal, they had more posession but that is normal.\nOn what United need to improve: \"We have so many aspects to improve. Everywhere we need to improve in every aspect, build up, transition, decisions in the final third. Every player can improve, they are here because they showed something at other cubs. They have the quality, we are still a team that plays on transition, we need to spend more time in final third to have more opportunities.\"", "url": "https://www.bbc.com/sport/football/live/c2dep9ejpykt"}