{"authors": ["Bobbie Jackson", "Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 03:51:37", "date_modify": "2025-05-21 03:51:37", "date_publish": "2025-04-07 10:26:27", "description": "Southampton reach agreement with manager Ivan Juric to leave following relegation from the Premier League on Sunday.", "filename": "sport_football_articles_c1k4j7g92kxo_1747799497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2316/live/d49197f0-139d-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1k4j7g92kxo_1747799497.html", "title": "Ivan Juric: Southampton manager leaves after relegation", "title_page": "Ivan Juric: Southampton manager leaves after relegation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton have reached an agreement with manager Ivan Juric to leave following relegation from the Premier League on Sunday.\nJuric was appointed as Russell Martin's successor on an 18-month deal in December but has won just two of his 16 matches.\nSunday's 3-1 defeat at Tottenham consigned the rock-bottom Saints to the earliest relegation in Premier League history with eight games still to play.\nThe loss against Spurs was Southampton's 25th of the season in the league.\n\"Ivan came to Southampton at a tough time and was tasked with trying to improve a squad in a difficult situation,\" Southampton said.\n\"Unfortunately, we haven't seen performances progress the way we had hoped, but we would like to thank Ivan and his staff for their honesty and hard work as they fought against the odds to try and keep us up.\n\"With relegation to the Championship now confirmed, we believe it is important to give fans, players and staff some clarity on the future as we head into a very important summer.\"\nSimon Rusk is expected to step in as interim manager with Adam Lallana acting as his assistant.\nSouthampton and Leeds were the last two clubs to have parted company with two permanent managers during the same campaign - both doing so in 2022-23.\nJuric lasted just 107 days at St Mary's and oversaw only one victory in the Premier League - a 2-1 triumph at Ipswich.\nHis spell in charge is the ninth-shortest reign as a manager in Premier League history.\nRooted to the bottom of the standings on 10 points, Southampton require two further points to avoid beating Derby County's record-low tally of 11, achieved in 2007-08.\nJuric arrived at Southampton having been sacked by Roma in November after only 12 games in charge of the Serie A club.\nThe 49-year-old has previously held roles in Italy with Torino, Hellas Verona, Genoa, Crotone and Mantova.\nSouthampton won promotion to the Premier League last summer after beating Leeds in the play-offs, however, their campaign in the top flight has been troubled from the outset.\nSaints lost eight of their opening nine games, and their 1-0 win against Everton on 2 November was their only victory in their opening 23 league fixtures.\nJuric, who had no previous experience in English football, was unable to inspire the squad after replacing Martin in the dugout, losing each of his first six games.\nSouthampton sat nine points adrift of safety when Juric walked through the doors, but Sunday's loss against Spurs left them 22 points shy of 17th-placed Wolves.\nThey are only the third team to lose as many as 25 of their first 31 games of a top-flight campaign, after Sunderland in 2005-06 and Sheffield United in 2020-21 (both also 25).\nSouthampton have conceded the most goals in the league (74) by far, and are the lowest scorers in the top four divisions of English football (23 goals in 31 games).\nNo team has ever had fewer points in the Premier League after 31 games (10), although Sunderland in 2005-06 & Derby in 2007-08 had the same tally too.", "url": "https://www.bbc.com/sport/football/articles/c1k4j7g92kxo"}