{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:09:46", "date_modify": "2025-05-20 12:09:46", "date_publish": "2023-08-05 11:17:32", "description": "Rodgers turned down Saudi and EPL for Celtic return", "filename": "sport_articles_cx8y1p04rp0o_1747742986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b2b/live/84787a70-3381-11ee-bde6-7ffba94c56ae.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cx8y1p04rp0o_1747742986.html", "title": "Rodgers turned down Saudi and EPL for Celtic return", "title_page": "Rodgers turned down Saudi and EPL for Celtic return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brendan Rodgers has revealed he turned down offers in Saudi Arabia and England before returning to Celtic.\nIn an interview with Sky Sports, external, the Northern Irishman said \"he always wanted to come back to Celtic\" and a chat with captain Callum McGregor was crucial in his decision to return to Glasgow.\n\"I spoke to a few clubs once I'd left Leicester, I spoke to a team in Saudi, but it just didn't feel right,\" the Celtic manager said. \"If I wanted to stay in the Premier League, I could've stayed in the Premier League, but Celtic is Celtic.\n\"Then, Ange [Postecoglou] left, Dermot [Desmond] phoned me and was very kind with his words, spoke about the possibility of coming back.\n\"Michael Nicholson and Chris McKay then flew out to Majorca and we had a long chat, which made me need to think about it more. I then met up with Callum [McGregor], and once I had spoken to him, that whetted my appetite a little bit more.\n\"I then thought to myself, I always wanted to come back to Celtic, that was the reality for me. I never regretted leaving but I knew that I had hurt a lot of people when I left.\n\"I've been a Celtic man since I was a boy, and if that was to be my last ever go at it, I didn't want it to be that.\"", "url": "https://www.bbc.com/sport/articles/cx8y1p04rp0o"}