{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:15", "date_modify": "2025-05-20 14:43:15", "date_publish": "2023-07-28 11:43:37", "description": "Turkey requests to merge their bid to host Euro 2032 with Italy, potentially boosting the UK and Ireland's chances of hosting the tournament in 2028.", "filename": "sport_football_66338138_1747752195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/152D1/production/_130573768_gettyimages-1328187697.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66338138_1747752195.html", "title": "Euro 2028 and 2032: Turkey and Italy merge bids for 2032", "title_page": "Euro 2028 and 2032: Turkey and Italy merge bids for 2032 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Turkey has requested to merge its bid to host Euro 2032 with Italy, potentially boosting the UK and Republic of Ireland's chances of hosting the tournament in 2028.\nWhile Italy had only bid for the 2032 tournament, Turkey had bid to host both Euro 2028 and 2032.\nTurkey's solo bid for 2028 remains as a rival to the UK and Republic of Ireland's five-nation bid.\nUefa will choose the hosts for both tournaments on 10 October.\nIt is likely that Turkey will not officially withdraw from the bidding process for Euro 2028 until their joint bid is approved by Uefa, but if and when that does happen, the UK and Ireland bid would be left unopposed.\nThe Italian Football Federation (FIGC) said the decision to merge with Turkey followed a \"complex and fruitful consultation process\" and pointed to other successful joint bids at previous Euros, the upcoming World Cup in 2026 in the US, Canada and Mexico and the UK and Republic's bid for 2028.\n\"[They] show that sharing events of this magnitude represents, on the one hand, a route for the direct involvement of a higher number of fans and, on the other, the search for an even more efficient and sustainable design,\" the FIGC said.\nFIGC president Gabriele Gravina added: \"We are facing a historic turning point that aims to enhance continental football. Football wants to be an ideal bridge for sharing passions and emotions related to sport.\"\nEuropean football's governing body says it will work with both the Turkish and Italian federations to \"ensure that the documentation to be submitted for their joint bid is compliant with the bidding requirements.\n\"If the joint bid does comply with such requirements, it will be submitted to the UEFA Executive Committee at the meeting scheduled on 10 October, where the appointments for 2028 and 2032 will be made. Decisions on venues and match schedules will be made at a later stage,\" Uefa said.\nTurkey's hosted June's Champions League final between Manchester City and Inter Milan at Istanbul's Atatürk Olympic Stadium, but a major international tournament has never been in the country.\nReigning European champions Italy hosted the Euros in 1968 and 1980 and Rome's Stadio Olimpico was also used as a venue at Euro 2020.", "url": "https://www.bbc.com/sport/football/66338138"}