{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:53", "date_modify": "2025-05-21 07:41:53", "date_publish": "2025-05-20 13:52:20", "description": "Man Utd news: Fans share pictures as they arrive at Bilbao", "filename": "sport_football_articles_c0j77g7xp2wo_1747813313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b5c/live/69aa5c20-357a-11f0-8a3d-319afdf0f64c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0j77g7xp2wo_1747813313.html", "title": "Man Utd news: Fans share pictures as they arrive at Bilbao", "title_page": "Man Utd news: Fans share pictures as they arrive at Bilbao - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your stories and images about how you are getting to Bilbao and if you've got a ticket for the match sorted.\nHere are some of your replies:\nPaul: Left Littlehampton at 09:50 yesterday - travelled to Luton Airport by train. Flight from Luton to Mallorca yesterday afternoon. Overnight stay in Mallorca. Today 06:15 flight from Mallorca to Madrid - currently on a five-hour coach journey from Madrid to Bilbao, where we are staying for two nights. Return bus from Bilbao to Zaragoza, then train to Barcelona and flight back to Gatwick on Thursday evening.\nFiazal: Started this journey back on 11 May. Flew out from Dubai for work - first stop was Norway, then Latvia. Managed to squeeze in a quick visit to see my parents in London before catching a flight to Madrid last night. Landed late, picked up a seven-seater I've hired for the next leg. No hotel for the night of the game - we'll grab a few hours' kip in the car and then make the drive back to Madrid. Saved a bit of money doing it this way – work, flights, sleeping rough – but most of what I've saved has gone straight on the ticket. Worth it, though – I'm in the United end, and just buzzing to be there.", "url": "https://www.bbc.com/sport/football/articles/c0j77g7xp2wo"}