{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:53", "date_modify": "2025-05-20 14:43:53", "date_publish": "2023-07-28 11:23:41", "description": "The English Football League announce plans to make added-on time more \"accurate\" this season in an attempt to combat time wasting.", "filename": "sport_football_66335147_1747752233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F6BE/production/_130566136_gettyimages-1247715246.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66335147_1747752233.html", "title": "English Football League: Added-on time to be more 'accurate' under plans for new season", "title_page": "English Football League: Added-on time to be more 'accurate' under plans for new season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The English Football League is to introduce a more \"accurate\" way to calculate added-on time during matches this season.\nMatch officials are being told to add the exact time taken for certain events - like goals and substitutions - rather than the previous \"nominal\" amount.\nA multi-ball system will also be used to help keep stoppages to a minimum when the ball goes out of play.\nThe EFL's plans also include changes over how injured players are treated.\nFootball's law makers - the International Football Association Board (Ifab) - announced its wish to \"create fairer conditions for both teams in terms of the amount of time available in a match\" at the start of the year and those guidelines form the basis for the EFL's initiative.\n\"In line with the most recent Ifab guidance, the EFL and PGMOL (Professional Game Match Official Limited) are committed to ensure a more accurate calculation of additional time alongside an improvement in the amount of time the ball is in-play from the start of the new season,\" the EFL said in a statement.\nAlong with goals and substitutions, the exact time taken to deal with injuries, penalties and sendings-off - both from the moment of the offence to either the whistle of the spot-kick or the player leaving the field - will also be added on.\nIn a further effort to limit the amount of time lost, the EFL said match officials will take a more \"robust approach\" to dealing with players time wasting.\nA yellow card will be shown to anyone delaying the restart of play or not retreating the necessary distance at a free-kick.\nInjured players will also have to leave the field of play to be assessed. Exceptions to that new ruling include injured goalkeepers, players from the same team who have collided and severe injury. Once play has restarted, the treated players will have to wait at least 30 seconds before being allowed back on.\nThere is also confirmation that as long as a player makes an attempt to play the ball, or makes a challenge for it, only a yellow card will be shown for conceding a penalty by denying an opponent a clear goal-scoring opportunity.\nA red card will be given in any other circumstance, such as holding, pushing or handball.\nThe EFL added that match officials will also try to keep the game flowing by maintaining a \"high threshold for penalising contact\" and not awarding a foul for \"all contact yet penalising when contact has a detrimental impact on an opponent\".\nThe new initiatives will be adopted for the start of the league season on Friday, 4 August, when Sheffield Wednesday host Southampton in the Championship.", "url": "https://www.bbc.com/sport/football/66335147"}