{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:35", "date_modify": "2025-05-21 07:50:35", "date_publish": "2025-01-13 10:44:25", "description": "Man Utd beat Arsenal on penalties: Fan views", "filename": "sport_football_articles_cx26wx90pkno_1747813835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx26wx90pkno_1747813835.html", "title": "Man Utd beat Arsenal on penalties: Fan views", "title_page": "Man Utd beat Arsenal on penalties: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's FA Cup game between Arsenal and Manchester United.\nHere are some of your comments:\nArsenal fans\nGuy: Extremely disappointed by the loss. We have a lack of a killer instinct yet again. Another game where we had possession and shots but couldn't convert. It isn't unlucky at this stage - it's poor coaching, a poor team and poor player purchases in recent windows. Our front line is toothless without Bukayo Saka.\nDan: If that isn't Mikel Arteta's cue to either get into the transfer market for an attacker or leave, I don't know what is. Yet again, useless in the final third!\nJude: Laboured and uninspired performance. Now that Gabriel Jesus is injured, we cannot continue pretending to have a forward. Let's sell Kai Havertz and use the money on a striker who doesn't spend half the time crawling around.\nVince: I've been a staunch follower of Arteta's policy that eschews the need to splurge on a natural forward. This loss, and the one to Newcastle in the league cup, tell me I've been severely myopic, if not downright blind. We're still in the January transfer window and with Jesus sidelined for who knows how long, please go get that striker before the month ends and our hopes with it.\nMan Utd fans\nAndy: Grit. Determination. Desire. All we want to see as United fans, great performance now we need to replicate that as a baseline rather than just against the 'big' teams. A confidence builder for sure\nChris: The last two games have shown a glimpse of what this team are capable of, but it will be the next two games that will really show the true mentality change. If they are positive, hopefully the second half of the season will move towards another trophy and a far more respectable league position than currently.\nAgim: Something good is in the air. Something good is building. Two hard games away and United have believed in themselves and got rewarded for it. Respect for Ruben Amorim for not letting his guard down and making the players understanding the importance of playing for Manchester United.", "url": "https://www.bbc.com/sport/football/articles/cx26wx90pkno"}