{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:43", "date_modify": "2025-05-19 14:31:43", "date_publish": "2017-08-19 19:34:54", "description": "Holders DR Congo fail to qualify for the 2018 African Nations Championship (CHAN) finals after a 1-1 draw with neighbours Congo Brazzaville.", "filename": "sport_football_40988464_1747665103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16781/production/_97433029_509000454.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40988464_1747665103.html", "title": "Holders DR Congo knocked out of CHAN by Congo Brazzaville", "title_page": "Holders DR Congo knocked out of CHAN by Congo Brazzaville - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The African Nations Championship (CHAN) holders, the Democratic Republic of Congo, failed to qualify for the 2018 finals in Kenya following a shock elimination by Congo Brazzaville.\nDR Congo could only draw 1-1 with their rivals in Kinshasa, having drawn the first leg of their qualifier 0-0.\nIt put Congo Brazzaville through on the away-goals ruling.\nIn other shocks South Africa, Mali and Algeria were also eliminated.\nDR Congo boasted an outstanding record in the previous four tournaments for home-based footballers with two titles and two quarter-finals finishes.\nThey were expected to beat Congo Brazzaville in front of their home fans in Kinshasa and qualify for the 2018 Championship in Kenya next January and February.\nJean-Marc Makusu Mundele put the title-holders ahead on 36 minutes only for Jaures Ngombe to equalise just two minutes later.\nDR Congo needed at least one more goal to survive, but Congo defended bravely to clinch only a second appearance at the 16-team tournament.\nSeverely depleted South Africa contained Zambia for 79 minutes in Ndola before conceding two goals in three minutes to lose the match 2-0 and the tie 4-2 on aggregate.\nJustin Shonga bagged a brace for Zambia against a South Africa side deprived of many first choice players because clubs refused to release them.\nMali, who lost the 2016 final against DR Congo in Kigali, were another shock casualty as they had a man sent off when losing 1-0 at home to Mauritania.\nKaramoko Traore scored on 38 minutes in Bamako and the hosts were reduced to 10 men before half-time when Boubacar Samassekou was shown the red card with Mauritania advancing 3-2 on aggregate.\nNigeria secured a ticket to Kenya by overcoming Benin 2-0 in Kano. Trailing 1-0 from the first leg, the Nigerians secured their place through goals from Rabiu Ali and Kingsley Eduwo.\nIvory Coast, third behind DR Congo and Mali at the 2016 Nations Championship, scored seven minutes into stoppage time to pip Niger for a place at next year's finals.\nSanfo Sylla scored the crucial goal to give the Ivorians a 1-0 victory and an away goals victory after the tie ended 2-2.\nAngola missed a penalty in Luanda before Dany scored the only goal of the tie just past the hour to inflict a first loss in 11 matches on Madagascar.\nRwanda staged a brave comeback to defeat Uganda 2-0 in Kigali but failed 3-2 on aggregate, with Cameroon and Sudan also booking places in Kenya.\nOn Friday, Morocco and Libya knocked out Egypt and Algeria respectively as they booked their places at Kenya 2018.\nMorocco beat Egypt 3-1 in Rabat on Friday to win the tie 4-2 overall.\nLibya held Algeria to a 1-1 draw in Sfax to go through to the finals with a 3-2 aggregate victory.\nDespite CHAN matches only featuring locally-based footballers the games have full international status and count toward the monthly Fifa rankings.", "url": "https://www.bbc.com/sport/football/40988464"}