{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 07:08:18", "date_modify": "2025-05-21 07:08:18", "date_publish": "2025-03-30 13:34:31", "description": "Mitchell Starc takes his first five-wicket haul in T20 cricket as Delhi Capitals cruise to a seven-wicket win over Sunrisers Hyderabad in the Indian Premier League.", "filename": "sport_cricket_articles_cjwv37241d7o_1747811298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c2c/live/8d7e46d0-0d60-11f0-8cb6-ef080be5aa48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cjwv37241d7o_1747811298.html", "title": "IPL 2025 results: DC beat SRH as Australia's Mitchell Starc takes first five-wicket haul in T20s", "title_page": "IPL 2025 results: DC beat SRH as Australia's Mitchell Starc takes first five-wicket haul in T20s - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mitchell Starc took his first five-wicket haul in T20 cricket as Delhi Capitals cruised to a seven-wicket win over Sunrisers Hyderabad in the Indian Premier League.\nThe 35-year-old Australia left-arm quick claimed 5-35 as Sunrisers were bowled out for 163 after their skipper Pat Cummins had won the toss and batted first.\nAniket Verma hit 74 off 41 balls and was one of only three Sunrisers batters to make it into three figures as Starc and Kuldeep Yadav, who finished with 3-22, did the damage.\nFaf du Plessis hammered 50 off 27 balls as he and Jake Fraser-McGurk put on 81 for the first wicket to give the Capitals a solid foundation in the chase.\nSunrisers spinner Zeeshan Ansari dismissed both players on his IPL debut to put the brakes on with 3-42.\nHowever, Abishek Porel and Tristan Stubbs finished unbeaten on 34 and 21 respectively as they got Delhi over the line with 30 balls to spare.\nThe Capitals have started this year's IPL with victories in both of their opening two matches.\nStarc's figures eclipsed his previous best in the format nearly a decade ago - 4-15 for Royal Challengers Bangalore against Kings XI Punjab in the IPL in May 2015.\nHe bagged the wickets of Abhishek Sharma and Ishan Kishan early in the SRH innings after both picked out fielders attempting big shots.\nHowever, it was the dismissal of Australia team-mate Travis Head for 22 which gave him the greatest satisfaction and brought a wry smile.\nSunrisers opener Head gloved a delivery from Starc to Delhi wicketkeeper KL Rahul, which ensured Starc has got the wicket of the left-hander six times in all formats.\nHead has faced Starc eight times since 2015, and managed just 18 runs off 34 balls.\nStarc then returned in the penultimate over of the Sunrisers innings for his final over as he eyed the chance of a maiden T20 five-for in his 209th match in the format.\nHe was indebted to two superb diving catches from Capitals skipper Axar Patel and Du Plessis - to dismiss Harshal Patel and Wiaan Mulder - to complete the feat.\n\"There's not many egos in bowlers in T20 cricket - you're hanging on for dear life sometimes - so it was nice to contribute today,\" Starc said after he was given the player of the match award.\n\"As a bowler you have to think outside the box a lot more now with how the scores are trending. You have to do things you normally wouldn't and try to find a little bit of leeway against the batters.\"\nIn Sunday's other match, England fast bowler Jofra Archer was back to something like his best after a poor start to this year's IPL as he helped Rajasthan Royals beat Chennai Super Kings by six runs.\nAfter a wicketless, and expensive, start to the tournament Archer conceded just one run in his first two overs against CSK and became the first player to bowl a maiden in this year's IPL as he took 1-13.", "url": "https://www.bbc.com/sport/cricket/articles/cjwv37241d7o"}