{"authors": ["Chris Harby", "www.facebook.com"], "date_download": "2025-05-21 06:52:17", "date_modify": "2025-05-21 06:52:17", "date_publish": "2025-03-29 19:43:52", "description": "Jonny Lomax kicks a late drop-goal as St Helens edge past Catalans Dragons 14-13 in a Super League thriller in Perpignan.", "filename": "sport_rugby-league_articles_cr72gep4294o_1747810337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a726/live/ab513a40-0cd5-11f0-9025-f3e7e963b60e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cr72gep4294o_1747810337.html", "title": "Super League: Catalans Dragons 13-14 St Helens", "title_page": "Super League: Catalans Dragons 13-14 St Helens - Saints pip Les Dracs in thrilling finale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonny Lomax kicked a late drop-goal as St Helens edged past Catalans Dragons 14-13 in a Super League thriller in Perpignan.\nTristan Sailor's quickfire double put Saints up early before Les Dracs roared back as Sam Tomkins replied with two tries of his own to cut the deficit to two points.\nThe 36-year-old kicked a penalty to level the scores at 12-12 to set up a nervy finale before Lomax and Luke Keary traded late drop-goals.\nBut, with the tension mounting and errors creeping in for both sides, Lomax kept his cool to slot over the winning drop-goal with two minutes left to seal Saints' first win in France since 2018.\nA first victory in three Super League outings lifts St Helens into third place, while Catalans stay ninth after their fourth defeat of the season.\nSaints lost 19-year-old centre Harry Robertson inside three minutes after failing an HIA, but full-back Jack Welsby, on his 150th appearance, propelled them into an early 12-0 lead.\nHis first break and short inside pass gave Sailor a clear sprint to the line, and his second tore deep into Catalans territory before a quick play took him under the posts for his second try in three minutes. Mark Percival converted both.\nMuch of the pre-match talk centred on Tommy Makinson taking on his former side for the first time, and the full-back had a say on the pitch when his chip ahead held up in the gusting wind and bounced kindly for Tomkins to touch down.\nBayley Sironen was held up over the line before a Nick Cotric foot in touch denied Keary a score as Catalans pressed in a breathless opening half-hour.\nThe hosts scored again when Tomkins cut back inside and burst through Welsby's tackle to touch down, but then, kicking into a gusting wind, missed a simple conversion.\nCatalans enjoyed a let-off moments into the second half when Sailor was judged marginally offside before collecting a high, hanging Lomax kick to send Dayon Sambou over the line.\nPaul Wellens' side hung tough in defence, as Cotric was hauled down 10 metres short, and Keary went even closer with an angled run and stretch.\nBut the pressure told when Saints were caught offside in front of their own posts and Tomkins tied up the scores.\nSoon after, Catalans thought they had hit the front for the first time, but Sironen's touchdown was ruled out when Tevita Pangai Junior was deemed to have been tackled in the build-up.\nThe French side looked destined to wear down their opponents, but the Saints held their nerve and finished strongly.\nTomkins denied Saints a third score with eight minutes left when he got back to prevent Mark Percival collecting his chip through, but seconds later Lomax nudged the visitors back in front.\nKeary responded within a minute to tie it up again at 13-all, but the Saints skipper had the final say to clinch a third Super League away win of the season.\nCatalans head coach Steve McNamara:\n\"I thought it was a great contest and both teams played extremely well in the conditions, it's very difficult for people to understand how tough that was to play.\n\"Both teams had a game plan, then looked at the weather and scrapped it but having said that I thought we played really well in attack for the majority of the game and defended well.\n\"For those two St Helens tries, I thought Jack Welsby was outstanding on both sets and it's cost us dearly. Coming back from that point took a lot of energy but it was one of those games of fine margins and Saints just pipped us to the posts.\n\"I don't think we've had a game this season in decent weather and it's tested us again tonight but credit to Saints, Jack Welsby was outstanding for those couple of try plays and Lomax's kicking the drop goals was the difference.\"\nSt Helens boss Paul Wellens:\n\"It's almost impossible to prepare for those windy conditions, you can't replicate 60mph winds in training... you just have to be alert to things.\n\"You saw how many last plays bounced and it became a competition for the ball, some went our way and some went theirs.\n\"For Jonny to land two drop goals in those conditions is outstanding.\n\"It's great that we won a tight game against top opposition and we're going to need to do that again moving forward.\n\"There's a lot we can take from this in terms of improvements so we will look to find them for next week.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/cr72gep4294o"}