{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:05", "date_modify": "2025-05-21 06:46:05", "date_publish": "2024-12-24 07:19:56", "description": "The Green Bay Packers earn a dominant 34-0 win over the New Orleans Saints to secure their spot in the NFL play-offs.", "filename": "sport_american-football_articles_cvg9pnwlpjwo_1747809965.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2856/live/ede4ac00-c1e6-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_cvg9pnwlpjwo_1747809965.html", "title": "NFL: Green Bay Packers rout New Orelans Saints to secure play-off spot", "title_page": "NFL: Green Bay Packers rout New Orelans Saints to secure play-off spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jordan Love starred as the Green Bay Packers routed the New Orleans Saints 34-0 to secure their spot in the NFL play-offs.\nThe 26-year-old quarterback threw for 182 yards and a touchdown as the Packers earned their place in the play-offs for the fifth time in six seasons.\nThe result was the first shutout of the campaign as the in-form Packers won their ninth match in 11 games.\n\"The goal is the Super Bowl. That's the first step right there making the play-offs,\" said Love.\n\"This was a big-time game to clinch that spot. I'm proud of the way we came out here and handled business.\"\nIn a dominant performance, the Packers possessed the ball for 37 minutes and 13 seconds of the 60-minute game, and had 404 total yards in comparison to the Saints 196.\nThe Packers improved to 11 wins and four defeats with the Saints dropping to 5-10 having already been ruled out of play-off contention.\nGreen Bay, who are looking to reach their first Super Bowl since 2011, join fellow NFC Conference sides the Detroit Lions, Minnesota Vikings and Philadelphia Eagles in the play-offs.", "url": "https://www.bbc.com/sport/american-football/articles/cvg9pnwlpjwo"}