{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 03:43:01", "date_modify": "2025-05-21 03:43:01", "date_publish": "2025-04-06 17:13:54", "description": "Fulham's seventh-place finish under Roy Hodgson remains their best in the Premier League. Under Marco Silva, they are set to match it - and maybe achieve even more.", "filename": "sport_football_articles_c5yp64l9n3zo_1747798981.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e63/live/afb83500-1303-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yp64l9n3zo_1747798981.html", "title": "Fulham: Can Marco Silva's European contenders get over the line?", "title_page": "Fulham: Can Marco Silva's European contenders get over the line? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 2008-09 Premier League season remains the high water mark for Fulham. Under Roy Hodgson, they finished seventh with a best-ever total of 53 points; it secured qualification for the inaugural Europa League, in which the Londoners went all the way to the final.\nFor a decade and a half, that idyllic era seemed very far away for Fulham fans. But after a sun-soaked April day where they deservedly handed champions-elect Liverpool a first away league defeat of the season, they may start to believe those glory days may return.\nMarco Silva's class of 2025 have moved on to 48 points with the win over Liverpool, just five shy of the club's record tally with seven league games still to play.\nThey sit eighth in the Premier League, firmly in the congested battle for Europe. Certainly Fulham are candidates for the Europa League - and potentially even more.\nIf this 3-2 win over Liverpool was the only Fulham game you saw this season, you would believe they could be a Champions League side. Silva's men were good value for the win, and could have been further in front following a first half where – an Alexis Mac Allister wonder goal aside – they were rampant.\nFulham pressed Liverpool relentlessly, like few sides have this campaign. Ibrahima Konate and Virgil van Dijk, so often like granite, cracked under the relentless work-rate of Rodrigo Muniz, whose status as feared Premier League front man will astonish those who witnessed a failed loan stint at Middlesbrough.\nKonate was caught out after six minutes trying to turn on the ball in his own area, and Liverpool were fortunate not to concede a penalty when Caoimhin Kelleher looked to have fouled Muniz. He was subbed in the second half after a torrid afternoon.\nFor the third goal, Muniz beautifully pulled a ball from the sky and finished low through Kelleher as Van Dijk was left standing by the Brazilian.\nAlex Iwobi continued his remarkable career resurrection with an afternoon of pace, power and creativity. Makeshift full-back Curtis Jones will beg Arne Slot not to be played there again.\nAnd while Liverpool scored in the second half and came close to an equaliser when Harvey Elliott struck the bar, Fulham always had a measure of control. If Calvin Bassey checked his short pockets at full time, he would have found Mohamed Salah.\nThe problem for Silva is that this is not how Fulham have played all season. It is not even how Fulham have played all week.\nThis win was a tonic after a really poor eight days for the Cottagers. Last weekend, the atmosphere on the banks of the Thames was very different as Fulham were dumped out of the FA Cup in the quarter-finals by Crystal Palace. They were also beaten at Arsenal in midweek.\nBut the Gunners are now the only top-four side Fulham have not beaten in the league this season. Against this, they have dropped points at home to three of the current bottom four - losing 4-1 at Craven Cottage to Wolves, as well as drawing with Ipswich and Southampton.\nFulham's past six league games have brought alternating wins and defeats - and it is that inconsistency which raises the biggest question as to how far Silva can take them.\n\"The reaction was great,\" Silva told his post-match media conference, referencing recent bad results. \"The energy was there, the high tempo. We picked the right moments to press, to play balls in behind; we showed great commitment and attitude from the first minute.\n\"This has been a week of big games for us, and in the first two, we did not get what we wanted. So to bounce back and give something back for the fans was important, because the atmosphere has been top level.\"\nWhile there's a question as to whether Fulham can keep up their level for the season's final seven matches, there is no doubt that Silva has taken them to another level.\nHe has turned Fulham from a yo-yo club into a fearsome Premier League unit.\nBetween 2018 and 2022, Fulham were either promoted or relegated in every single campaign. But since returning to the top flight under Silva, they have finished 10th and 13th with no concern about the drop - and now they are only looking up.\n\"Changing the mindset of this club has been clear for me - in the last 15 to 20 years, it was not easy to be competitive,\" he said.\nSilva referenced last season's Carabao Cup, where Liverpool beat Fulham 3-2 on aggregate in the semi-finals. His side led at Anfield in the first leg but conceded twice in three second-half minutes, before drawing at Craven Cottage.\n\"The mindset now is completely different,\" said the Portuguese coach. \"This pleases me more.\n\"We will do our very best, fight for our shirt and for our goals. We can never switch off.\n\"In the last two months of the season, the players may be more tired, but they have to push hard. For Bournemouth [away in their next league game] we have to be as prepared.\"\nFulham fans may worry about how far Silva - heavily linked with the Tottenham job - can take them.\nBut when Craven Cottage roared at full-time on Sunday, it felt for a moment like the golden days of the late 2000s had returned.", "url": "https://www.bbc.com/sport/football/articles/c5yp64l9n3zo"}