{"authors": ["Glen Schreuder", "www.facebook.com"], "date_download": "2025-05-21 05:51:35", "date_modify": "2025-05-21 05:51:35", "date_publish": "2025-01-14 11:27:56", "description": "Aberdeen fan column: 'Jimmy Thelin puts his stamp on squad, now we need results'", "filename": "sport_articles_ckg7lnr1w79o_1747806695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/36e4/live/48b6c950-d250-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg7lnr1w79o_1747806695.html", "title": "Aberdeen fan column: 'Jimmy Thelin puts his stamp on squad, now we need results'", "title_page": "Aberdeen fan column: 'Jimmy Thelin puts his stamp on squad, now we need results' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the winless streak extended to 11 games after the goalless draw against Hearts, it's left fans wondering when the run will ever end.\nAnd a trip to Ibrox on Wednesday doesn't fill one with much confidence that it will cease before the weekend's Scottish Cup tie against Elgin.\nJimmy Thelin is six months into the 'three-year project', and with the January transfer window being open, it's provided him with an opportunity to put his own stamp on the squad.\nJanuary dealing can be difficult, however the additions of Kristers Tobers from Grasshoppers and Jeppe Okkels on loan from Preston look shrewd pieces of business, while yesterday's captures of Alfie Dorrington and Alexander Jensen show Thelin has been putting in the hours.\nOur defence has been in desperate need of a leader, and the signing of Latvia captain Tobers should strengthen a defence who've been leaking goals for fun in recent weeks.\nIn addition to the new faces, Ante Palaversa signing a two-year contract extension brought a smile. Tieing down a quality midfielder, with an eye on next season, we are seeing signs of a squad being built with 'Thelin's stamp' on it.\nTwo weeks into the window, we can't argue the board aren't backing the manager, while the fans will continue to back him too. Performances are there, we just need results to follow.", "url": "https://www.bbc.com/sport/articles/ckg7lnr1w79o"}