{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 06:48:38", "date_modify": "2025-05-21 06:48:38", "date_publish": "2025-03-28 21:42:15", "description": "Holders Cliftonville move a step closer to retaining the Irish Cup as they ease past Championship side Ards 3-0 in the semi-final at Windsor Park.", "filename": "sport_articles_ce8m81245x2o_1747810118.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0e5e/live/cbdc1c30-0c12-11f0-a9ec-f38dd40b0146.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce8m81245x2o_1747810118.html", "title": "Irish Cup: Holders Cliftonville ease pat Ards to reach final", "title_page": "Irish Cup: Holders Cliftonville ease pat Ards to reach final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holders Cliftonville moved a step closer to retaining the Irish Cup as they eased past Championship side Ards 3-0 in the semi-finals at Windsor Park.\nJoe Gormley fired the Reds ahead on 29 minutes with a composed finish before substitute Alex Parsons added a second with a close-range header and Ryan Corrigan scored a late third.\nAfter winning the competition for the first time in 45 years last season, the Reds now have another final to look forward to on Saturday, 3 May.\nJim Magilton's side will discover their opponents on Saturday as Bangor face Dungannon Swifts in the other last-four tie.\nThe first real chance of the game arrived on 12 minutes as Rory Hale clipped the ball into Ryan Curran, who attempted to dink the ball over Alex Moore, but the goalkeeper spread himself to save.\nA similar ball over the top presented Cliftonville with another opportunity as Harry Wilson picked out Shea Gordon, but Moore was quick off his line to clear before Gordon could get a shot off.\nArds went close on 21 minutes as Conor Maxwell fed Aidan Steele in the box and he side stepped Jonny Addis before his rising strike was blocked by Luke Conlan.\nCliftonville continued to control the tempo of the game and Gormley broke the deadlock just before the half-hour mark.\nHe ruthlessly smashed the ball past Moore on the half-volley after Hale had slipped the ball into his path to give the Reds a deserved half-time lead.", "url": "https://www.bbc.com/sport/articles/ce8m81245x2o"}