{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-20 12:05:05", "date_modify": "2025-05-20 12:05:05", "date_publish": "2023-08-05 11:49:49", "description": "Michael Duff claims a point in his first game in charge of Swansea City as Jerry Yates denies Birmingham City an opening-day away win.", "filename": "sport_football_66345312_1747742705.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F024/production/_130667416_cdf_050823_swansea_v_birmingham_041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345312_1747742705.html", "title": "Swansea City 1-1 Birmingham City: Swans' Jerry Yates cancels out Siriki Dembele opener", "title_page": "Swansea City 1-1 Birmingham City: Swans' Jerry Yates cancels out Siriki Dembele opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Duff claimed a point in his first game as Swansea City boss as Jerry Yates denied Birmingham City an opening-day away win.\nDuff's Swansea were heading for defeat after Birmingham debutant Siriki Dembele took advantage of a defensive mistake to stroke the visitors in front just before half-time.\nJohn Eustace's men looked well placed to claim victory as they smothered a Swansea side who lacked inspiration going forward at times.\nBut a moment of attacking quality allowed Yates to mark his debut following a summer move from Blackpool with a simple finish.\nIvan Sunjic was denied a late winner by a superb Carl Rushworth save, and Birmingham may feel more frustrated by the draw given that they created better chances.\nYet both Duff and Birmingham's Eustace could take some satisfaction having each got off the mark in 2023-24.\nThis was the beginning of a new era for both clubs, with Swansea starting life under a new head coach following Russell Martin's move to Southampton and Birmingham opening the season with fresh optimism after a summer takeover.\nBirmingham's mood was lifted further on the eve of the season when American football legend Tom Brady became a minority shareholder of the club.\nThere was more good news for the Blues as they edged in front late in a first half which was full of endeavour but a little short on final-third quality.\nSwansea huffed and puffed, playing with the high tempo demanded by Duff but without the control of possession which was their hallmark under Martin.\nHome chances were limited, with Jamie Paterson seeing a cross-shot smothered by John Ruddy, then beating the Birmingham keeper only to see celebrations halted by the offside flag.\nBirmingham carried more threat, with Dembele forcing an early save from Rushworth before another debutant, Ethan Laird, teed up Krystian Bielik for a shot which was well smothered by Swansea's on-loan Brighton goalkeeper.\nThe breakthrough as a result of home error, with Rushworth trying to feed Ben Cabango on the edge of his own box when a clearance would have been the better option.\nKeshi Anderson dispossessed the Swansea centre-back and squared for Dembele, who took a touch before guiding the ball beyond the helpless Rushworth.\nIt was the sort of defensive lapse which cost Swansea too often last season - and came despite the fact Duff wants his team to take fewer risks than they did under Martin.\nBirmingham might have doubled their advantage on the counter early in the second half but Sunjic could only shoot tamely at Rushworth.\nSwansea missed a chance to respond when Ruddy could only parry a Paterson corner to Harry Darling, whose looping header left the Birmingham goalkeeper stranded but bounced to safety off the crossbar.\nThe leveller came thanks to a high-class Matt Grimes pass which sent substitute Liam Cullen scampering down the left and his measured cross allowed Yates to guide the ball home from close range.\nJoel Piroe and Cabango then saw shots blocked as Swansea went in search of a winner, before Rushworth made amends for his part in the Birmingham goal with a fine reaction save to deny Sunjic at the other end.\nSwansea City head coach Michael Duff:\n\"I've got mixed emotions really. Birmingham started probably a bit better than us but I thought we finished the first half really well, so I'm really disappointed to give away a poor goal.\n\"I think we were pretty dominant in the second half and they were trying to shut up shop.\n\"The players stuck to their task, I thought we looked really fit - we were still going in the 97th minute.\n\"We were ultimately a little bit unfortunate. We hit the crossbar, there was a goalmouth scramble that was somehow cleared off the line and we scored a really good goal.\n\"That's the frustration. They've not had to do a lot to score and we've had to do a lot to score our goal. They are things we need to learn.\"\nBirmingham head coach John Eustace:\n\"I thought we were very dominant and I thought we gifted them the goal. Apart from that I don't think they had many clear-cut chances.\n\"We came to a difficult place against a very good team and gave a good account of ourselves.\n\"I think it's a continuation of last season. Nine players have come in, 14 players have gone out. The squad is very thin. It's a good point but I think we've lost two.\n\"We've got to build that consistency by training with each other every day. It's difficult to get them to gel. Today was a really good marker for where we are.\"", "url": "https://www.bbc.com/sport/football/66345312"}