{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:51", "date_modify": "2025-05-21 07:49:51", "date_publish": "2025-05-18 17:20:27", "description": "Man City news: Fan views on the rebuild required", "filename": "sport_football_articles_c629zl4yv9lo_1747813791.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c629zl4yv9lo_1747813791.html", "title": "Man City news: Fan views on the rebuild required", "title_page": "Man City news: Fan views on the rebuild required - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for you to tell us what needs doing at Manchester City to get the club back to winning ways next season.\nHere are some of your suggestions:\nHarvey: With the new system that Pep is playing, the team needs to rebuild with players who can play in it. A new full-back is desperately needed with them currently being given more licence to roam forward. Andrea Cambiaso, who can play on either side, would be a great addition. We also need to replace Kevin de Bruyne - and Florian Wirtz would be a great option.\nMu: It's quite obvious to say that we need fresh faces in the squad. There are many players that are either past it or just generally need a new challenge. Hunger isn't there as before. What actually needs addressing just as much is how we play and set up. To put it simply, it isn't effective anymore. We've been found out. Time will tell what Pep will do to make this team tick again.\nAndrew: A lot of unnecessary noise about spending a lot of money - we have great academy output, supplemented by buying young players to develop with Vitor Reis, Abdukodir Khusanov and Claudio Echevarri a case in point. A couple more under-21 players would be well worth it, plus buy back some ex academy with Trafford top of the list. Sell Jack Grealish and Kyle Walker for sure. Ilkay Gundogan, John Stones and Manuel Akanji can stay if they are robustly fit.", "url": "https://www.bbc.com/sport/football/articles/c629zl4yv9lo"}