{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:01:10", "date_modify": "2025-05-20 14:01:10", "date_publish": "2023-07-30 15:07:01", "description": "Man City 1-2 Atletico Madrid: Pep Guardiola's side lose Seoul friendly", "filename": "sport_articles_crgkkx7dqwno_1747749670.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f297/live/91ed5860-2eea-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crgkkx7dqwno_1747749670.html", "title": "Man City 1-2 Atletico Madrid: Pep Guardiola's side lose Seoul friendly", "title_page": "Man City 1-2 Atletico Madrid: Pep Guardiola's side lose Seoul friendly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City slipped to a first defeat of pre-season in the final match of the Asia tour as Diego Simeone's Atletico Madrid secured a 2-1 win in Seoul.\nA heavy downpour delayed kick-off and Pep Guardiola's side - featuring the likes of Jack Grealish, Erling Haaland, Ruben Dias and John Stones, went in goalless at half-time.\nGuardiola changed several players on 54 minutes - meaning only Julian Alvarez and Dias played the full fixture - and the La Liga side pounced on the disruption to score twice through Memphis Depay and Yannick Carrasco.\nDias headed a late consolation for City, who face Arsenal in the Community Shield next Sunday.\n\"Atletico brought on some very good players,\" former City keeper David James told the club's media channel.\n\"City made a raft of changes. It unsettles the pattern of play. That's when the goals came. They were better in that moment of indecision of both sides and punished City with both goals.\"\nCity defender Steph Houghton added: \"I think they will be disappointed. Knowing that group of players they want to win every game they play. You have to think long-term. They are winners, they want to win. It's not always the best thing to go through pre-season with loads of wins.\"", "url": "https://www.bbc.com/sport/articles/crgkkx7dqwno"}