{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:10:11", "date_modify": "2025-05-20 13:10:11", "date_publish": "2023-07-24 12:44:54", "description": "Oli Hairs clobbers a rapid 127 not out as Scotland demolish Italy at the T20 World Cup Europe Qualifier in Edinburgh.", "filename": "sport_cricket_66288700_1747746611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33FE/production/_130501331_ft20qual_sco-v-ita_24072023_017.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66288700_1747746611.html", "title": "T20 World Cup Europe Qualifier: Scotland crush Italy on record-breaking day for Oli Hairs", "title_page": "T20 World Cup Europe Qualifier: Scotland crush Italy on record-breaking day for Oli Hairs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oli Hairs equalled Scotland's highest T20 score with 127 not out as Italy were demolished by 155 runs.\nThe opening batter, dropped twice early on, also set a new national mark for the fastest century, getting to 102 in just 40 balls at the Grange, Edinburgh.\nBrandon McMullen fell on 96 as Scotland reached 245-2 to make it three T20 World Cup Qualifier wins from three.\nItaly could only muster 90 in 12.4 overs, with Gavin Main taking five wickets.\nHairs' maiden international century included fourteen fours and eight sixes as the 32-year-old punished Italy for those missed catching opportunities inside the first four overs.\nWith George Munsey gone for 12 after slashing at a wide delivery, McMullen looked certain to join Hairs on three figures but holed out going for the boundary from the 50th ball he faced.\nHairs modestly described his 183-run stand with McMullen as a \"good little partnership\".\n\"It was good to get off the mark quickly and keep it going,\" said the player-of-the-match. \"It was good fun. It's always nice to smack a few.\"\nItaly had pushed Ireland hard in their opening match and beat Jersey but they had no answer to Scotland's huge total.\nGrant Stewart was the only player to reach double figures with a valiant 41 and his resistance was ended when Main claimed his fifth wicket.\nScotland next meet Austria on Tuesday with all of the action live on the BBC Sport website and iPlayer.", "url": "https://www.bbc.com/sport/cricket/66288700"}