{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-20 13:39:21", "date_modify": "2025-05-20 13:39:21", "date_publish": "2023-07-25 08:31:58", "description": "Rasmus Hojlund signs for Manchester United - but what type of player is he, and what are his stats?", "filename": "sport_football_66243517_1747748361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8E28/production/_130429363_-b9eedeb7-781a-4e5d-9341-9dbb205c751c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66243517_1747748361.html", "title": "Rasmus Hojlund: Manchester United sign the Danish striker - here's all you need to know", "title_page": "Rasmus Hojlund: Manchester United sign the Danish striker - here's all you need to know - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The comparisons between Erling Haaland and Rasmus Hojlund are obvious.\nBoth are over 6ft with a mop of blond hair. Both are ruthless in the final third. And when the new Premier League season starts, both will be playing for Manchester clubs.\nOn Saturday, the 20-year-old Hojlund sealed a £72m move to United from Italian side Atalanta.\nWhat will he bring to the Premier League and United's attack, and can he really rival Haaland?\nAfter youth spells at Boldklubben af 1893 and Brondby, Hojlund began his senior career at Copenhagen, making his debut aged 17 in 2020.\nStill developing, he struggled in the Danish Superliga as a youngster, leaving in January 2022 having failed to score in his 19 league appearances - though only two of those were starts.\nHe joined Austrian side Sturm Graz - a move that turbocharged his career.\nAcross the second half of the 2021-22 season, Hojlund scored a goal every other game, netting nine times in 17 starts.\nHojlund caught the eye with his lethal left foot and impressive footballing brain. The striker became exceptional at moving into space, timing runs to perfection to set up a wide variety of finishes.\nHis form led to a move south to Italian club Atalanta for a reported £15m, 10 times what Sturm Graz had paid for him in January.\nThat figure now looks like a bargain.\nLast season he scored 20 goals in 47 appearances for the Serie A side and Denmark, for whom he made his debut last September.\nIn March, he struck five goals in two European Championship qualifiers for the Danes, including a hat-trick against Finland.\nSo the potential is there, but when you compare numbers, Hojlund is a long way off Haaland.\nThe Norwegian hit 36 goals in 35 appearances for Manchester City in the league last season - a goal every 77 minutes. In Serie A, Hojlund found the net every 204 minutes.\nThat said, Haaland had a record-breaking season, is two years older, plays for the European champions and is further along in his career.\nHojlund has only had two full seasons as a professional. In Haaland's second season, he managed a more modest 12 goals in 25 appearances for Molde.\nSo while Hojlund is not the finished article, he can be moulded and refined and may become the perfect fit for United's starting XI.\nUnited are in need of a centre-forward. With Anthony Martial injured for much of last season, Rashford has become the team's key attacking threat.\nThe England striker was exceptional last term, scoring 30 goals in 56 games - one every 143 minutes. But his best position is wide on the left, cutting in on his stronger right foot.\nUnited chose not to sign Burnley loanee Wout Weghorst on a permanent deal at the start of this transfer window.\nThey privately ruled out making approaches for Paris St-Germain's Kylian Mbappe and Tottenham's Harry Kane, who are both world-class frontmen.\nWhat they will get with Hojlund is raw potential.\nBut there are signs of quality, glimpses that suggest he is on the path to stardom.", "url": "https://www.bbc.com/sport/football/66243517"}