{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 03:43:56", "date_modify": "2025-05-21 03:43:56", "date_publish": "2025-04-06 16:09:25", "description": "Slovenia's Tadej Pogacar wins his second Tour of Flanders title, with defending champion Mathieu van der Poel finishing third.", "filename": "sport_cycling_articles_creq82ezprgo_1747799036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6276/live/3c284a10-12fb-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_creq82ezprgo_1747799036.html", "title": "Tour of Flanders 2025: Tadej Pogacar wins second title in Belgium", "title_page": "Tour of Flanders 2025: Tadej Pogacar wins second title in Belgium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tadej Pogacar held off defending champion Mathieu van der Poel to claim his second Tour of Flanders title.\nThe three-time Tour de France champion, racing for UAE Team Emirates-XRG, completed the 270km course in Belgium in five hours, 58 minutes and 41 seconds.\nPogacar finished just over a minute clear of Denmark's Mads Pedersen in second, while Dutchman Van der Poel came third, having recovered from a crash with 127km to go.\nThe Tour of Flanders, which began in 1913 and known as De Ronde, is a historic one-day road race held in Belgium every spring and highlighted by climbs and cobbled sectors.\n\"The goal was to win, but at the end it's hard to realise. I cannot be more proud of the team,\" said 26-year-old Pogacar.\nVan der Poel re-joined the peloton within just 10km of his crash and tussled with Pogacar through the hills.\nBut the Slovenian pulled away with a race-winning attack on the final ascent of the Oude Kwaremont with around 15km to go and cruised along the flat roads to a solo victory.\nThe chasing pack sprinted for the remaining medal positions with Belgian Wout van Aert missing out on a podium finish.\nIn the women's race, Belgian Lotte Kopecky made history as the first cyclist to win three editions of the event.\nRiding for Team SD Worx, the 29-year-old claimed victory in thrilling style by winning a four-way sprint finish ahead of France's Pauline Ferrand-Prevot, Liane Lippert of Germany and Poland's Katarzyna Niewiadoma-Phinney.\n\"It was a crazy race with a lot of crashes in the beginning,\" said Kopecky. \"When it went with the four of us I was pretty confident.\"\nItalian rider Elisa Longo Borghini was among the favourites with Kopecky and also chasing a third Tour of Flanders title, but had to withdraw after crashing around 95km from the finish.\nAround 750,000 spectators gathered on the streets from Bruges to Oudenaarde for the event, which is one of five one-day races in the cycling calendar known as the Monuments.\nThe others are Milan-San Remo, Paris-Roubaix, the Liege-Bastogne-Liege and Tour of Lombardy.\nOn 13 April, Pogacar will be taking part on more cobbled tracks for the Paris-Roubaix race - known as 'hell of the north' - for the first time, where Van der Poel is again the defending champion.\n\"Roubaix is a completely different race, but I will accept the challenge and try to do my best,\" added Pogacar.", "url": "https://www.bbc.com/sport/cycling/articles/creq82ezprgo"}