{"authors": ["Niall Keenan", "www.facebook.com"], "date_download": "2025-04-26 06:25:43", "date_modify": "2025-04-26 06:25:43", "date_publish": "2025-02-28 21:50:12", "description": "Derry City fall to a 2-1 Irish Premier Division defeat by Waterford in their League of Ireland Premier Division game at the Brandywell.", "filename": "sport_articles_cm2j5n8n1r0o_1745648743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb3d/live/cb5fdff0-f61c-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cm2j5n8n1r0o_1745648743.html", "title": "League of Ireland Premier Division: Derry City fall to defeat by Waterford", "title_page": "League of Ireland Premier Division: Derry City fall to defeat by Waterford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derry City suffered a second loss in three Premier Division games as they fell to a 2-1 defeat to Waterford at the Ryan McBride Brandywell Stadium.\nGoals from Kyle White and Kacper Radkowski gave the visitors a 2-0 half-time lead as Derry manager Tiernan Lynch served a one-game touchline ban.\nPat Hoban converted a penalty after the hour to pull one back for the Candystripes but the home side could not find an equaliser.\nDerry lie eighth in the table and travel to face title favourites St Patrick's Athletic on Monday night.\nDerry's deadline day signing from Dundee United, Kevin Holt, was thrown straight into the fold but it was White, on his first start for Waterford, who opened the scoring inside 10 minutes.\nHe raced into the area from the left-hand side to get on the end of a cross-field pass, faked to shoot before coolly placing the ball past Brian Maher with the outside of his foot into the far bottom corner.\nDerry had a goal ruled out for offside shortly after despite the ball seemingly coming off a Waterford player.\nThe Foylesiders won all four meetings between these sides last term and have only lost once to the Munster club at the Brandywell since 2018 but they struggled to break down their guests in the opening period.\nOn 39 minutes poor defending led to a Waterford free-kick on the left that came to Radkowski on the far side of the area and he hammered the ball home to double the Blues' lead.\nCity's best chance of the half came near the interval when Liam Boyce met a teasing Dom Thomas cross in the six-yard box but he steered his effort over when he perhaps should have done better.\nIn the second half, Derry defender Mark Connolly held his head in his hands as he spurned the chance to reduce the deficit.\nAt the other end, Conan Noonan saw his attempt cleared off the line by the debuting Holt before Hoban's spot kick on 62 minutes gave Derry a lifeline.\nWaterford's Padraig Amond who topped the scoring charts alongside Hoban with 14 goals in the League of Ireland last season should have perhaps wrapped things up but the door was left open for City.\nLynch's men failed to capitalise. On 82 minutes Adam O'Reilly laid the ball across but somehow Robbie Benson skewed wide when it seemed harder to miss with an open goal to aim at.\nDerry have three points from their opening three games and head to Dublin on Monday night to face Stephen Kenny's St. Pat's before a home game against Galway United next Friday.", "url": "https://www.bbc.co.uk/sport/articles/cm2j5n8n1r0o"}