{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:16:48", "date_modify": "2025-04-26 06:16:48", "date_publish": "2025-03-01 19:15:47", "description": "A familiar white-ball defeat for England in Karachi must mark the start of their rebuild, writes Matthew Henry.", "filename": "sport_cricket_articles_c1d4r9p40k6o_1745648208.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ff0/live/2f6c6c80-f6d0-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c1d4r9p40k6o_1745648208.html", "title": "Champions Trophy 2025: England's defeat in Karachi should mark start of rebuild", "title_page": "Champions Trophy 2025: England's defeat in Karachi should mark start of rebuild - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "If the defeats in India were alarming, and losses to Australia and Afghanistan in Lahore dispiriting, the thrashing by South Africa in Karachi was the moment England's winter plunged to the depths.\nNasser Hussain's side famously won a Test here in 2000 in the dark. The winning runs were hit after the sun had set and the locals had broken their Ramadan fast.\nAt one point on Saturday, there were fears the floodlights would not be needed.\n\"As a whole group, not just batters, we're not getting the results and that does take away your confidence,\" captain Jos Buttler said.\n\"It's time for everyone to get away, get a change of scenery and work hard wherever cricket takes you next.\"\nButtler knows this feeling because the seven-wicket defeat by South Africa was English white-ball cricket going full circle.\nBack in 2015, he was part of the side also dismissed cheaply before their opponents cantered home - New Zealand the victors on that occasion in Wellington.\nThat day England's players sat in silence in a shell-shocked dressing room as the baying crowd shook the foundations of the stadium above them.\nThis was a Champions Trophy dead rubber rather than a live World Cup match and there were no such problems with the crowd.\nStill, it must be the spark of a rebuild, like the Cake Tin defeat was to Eoin Morgan.\nThis has to be England's latest visit to rock bottom.\nThe quirk is that England's destroyer 10 years ago will be the one to plot the path ahead to ultimately regain the world titles lost.\n\"These guys are too hard on themselves,\" said their opponent turned coach Brendon McCullum.\n\"They've got immense talent, they are desperate to want to perform. That's actually stymying the ability of us to get the performance we want. They care too much.\"\nExpect hard work but no change in England's rhetoric.\nAnd while there is some merit in McCullum words - relaxing his players and removing the fear of failure is what has helped him turn around the fortunes of the Test side alongside Ben Stokes - it was not the reason Phil Salt and Jamie Smith gave away their wickets or Liam Livingstone looked a novice when faced with spinner Keshav Maharaj.\nAttacking shots are causing England's downfall, not tentative prods. There is more at play here - muddled minds aplenty.\nMcCullum finds himself in a tricky spot.\nMorgan's rebuild was remarkable, it progressed all the way to Lord's in 2019, but it began at a distinct path, with England playing dull, dated cricket.\nThe requirements were clear - pick younger, more ambitious players available in county cricket but not selected. The present-day route is far less obvious.\nInitially, McCullum must decide if these are good players underperforming.\nDebate can be had over Liam Dawson, who should have been in Pakistan as an all-rounder and second spin option, but there are few other glaring omissions.\nWould the 35-year-old left-arm spinner have made this side semi-finalists? You are always a better player when away from the spotlight.\nLivingstone looks to be fighting for his ODI future and Salt is under pressure after a tournament in which he has averaged 10, but the rest of the top seven - Ben Duckett, Joe Root, Harry Brook, Jos Buttler and, to a lesser extent given his poor showing here, Smith - still looks a fearsome line-up on paper.\nIn contrast, the bowling needs work and McCullum hinted at regrets over the limited, pace-heavy approach employed in Pakistan.\n\"Obviously, our gameplan was to try and bring fast bowling over here, try to stock our batting and give ourselves that sort of conviction and that method,\" McCullum said.\n\"We may not have got it totally right this time but you've got to have conviction in something.\"\nHis side's new-ball economy rate is currently the most expensive in the world, their powerplay threat only better than Zimbabwe, Ireland and the United Arab Emirates and their middle-over record in Pakistan their worst at a major tournament.\nIt leaves plenty of room for improvement.\nBut with Jofra Archer on a three-year contract and Mark Wood lauded wholesale change does not look likely.\nHampshire quick Sonny Baker - the 21-year-old who impressed for the Lions this winter - is one on the radar, while there is still hope Josh Hull could be the left-armer England so desperately require, but otherwise England will rebuild with the players seen here, meaning other gains will have to be made.\nIt is three months and 23 days since England lined up with a top seven of Salt, Will Jacks, Jordan Cox, Bethell, Livingstone, Sam Curran and Dan Mousely. Greater consistency in selection would be a good place to start.\nThat will be aided by the fact McCullum is now in charge of both red and white-ball teams, meaning there is no longer a tussle between two coaches with two different priorities.\nDifficulties will still appear with the New Zealander keen to promote multi-format regulars rather than white-ball specialists, which will leave a winter featuring an Ashes series flanked by white-ball trips to New Zealand and Sri Lanka to be balanced with great care.\nMcCullum is now England's man for all seasons, who has sparked a rebuild twice before - first in Wellington and then with the Test side.\nHis third act may be his most difficult.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c1d4r9p40k6o"}