{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:37:45", "date_modify": "2025-04-26 07:37:45", "date_publish": "2025-02-27 14:01:59", "description": "Chris Wilder will be feeling \"heaviest burden\" as he tries to guide his boyhood club to promotion, according to the BBC 72+: EFL Podcast.", "filename": "sport_football_articles_c04zzd644qdo_1745653065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/261e/live/aabf0f50-f50e-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c04zzd644qdo_1745653065.html", "title": "Sheffield United: Chris Wilder will feel burden of guiding Blades", "title_page": "Sheffield United: Chris Wilder will feel burden of guiding Blades - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chris Wilder will be dealing with \"the heaviest burden\" as he tries to guide his beloved Sheffield United back to the Premier League, according to a manager who understands the task of leading a club close to their heart.\nA dramatic home defeat by Yorkshire rivals Leeds United on Monday left Wilder's side five points adrift in the title race, and two points ahead of Burnley in the push for automatic promotion with 12 games remaining.\nWilder is in his second spell managing his boyhood team, having begun his playing career at Bramall Lane and helping the Blades to two promotions as a player, and another two in his first spell in the dugout, during which he led the Blades to a ninth-place finish in the Premier League in 2020 - their highest since 1992.\nMark Bonner was born in Cambridge, began working for the club's academy as a teenager, and ran the club's reserve side. He became first-team coach and later the manager after several spells in interim charge.\nHe guided the U's into League One for the first time in nearly 20 years in 2021 but was sacked in 2023, only to return to the Abbey Stadium this month as director of football.\nBonner told the BBC's 72+: EFL Podcast: \"When it's your city and you live there and your family live there and everywhere you go everyone wants to talk to you about it, it's what you're known for and almost what your family and extended family are known for, it is definitely a heavier burden to carry.\n\"It does hit heavier, there's no question about that, it's a real difficult weight to carry.\n\"It's brilliant when it's going well, and obviously supporters feel the weight of bad runs and defeats and get frustrated, but it's impossible to find someone who is a manager of 'their team' who feels it heavier.\"\nBonner said it was important to try to keep emotional attachment under control.\n\"It's hard not to get wrapped up in it, but in the end you just have to treat it as a job – there's a professional element of it, it's really stressful, there's more bad days than good in the job.\n\"You have got to enjoy the big moments, the local rivals wins, because if you get them there is no better feeling.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c04zzd644qdo"}