{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:32:47", "date_modify": "2025-05-21 07:32:47", "date_publish": "2025-01-13 17:51:11", "description": "As Arsenal continue to struggle in front of goal, BBC Sport look at what striker the Gunners could sign this month.", "filename": "sport_football_articles_cx2jlln2r5ro_1747812767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/683e/live/81c31c50-d1b8-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2jlln2r5ro_1747812767.html", "title": "'Arsenal need a striker' - but who could they sign?", "title_page": "'Arsenal need a striker' - but who could they sign? Isak, Sesko, Delap, Osimhen, Vlahovic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's exit from the FA Cup on Sunday, losing on penalties to 10-man Manchester United, again highlighted a major weakness in their squad - the lack of a world class centre-forward.\nThe Gunners are second in the Premier League and are joint third top scorers on 39 from 20 games.\nHowever, they are only sixth in terms of big chance conversion rate all season and eighth since 1 December. And they are the only side in the top six to not have a goalscorer in double figures.\nKai Havertz, who is playing the centre-forward role despite not being a natural number nine, is their top scorer in the league on seven.\nAnd their shortcomings in front of goal have been ruthlessly exposed in their past two games in particular.\nArsenal had 23 shots but only three on target in their 2-0 League Cup semi-final first-leg defeat by Newcastle. They had seven on target from 26 shots against Manchester United, with their goal being a deflected effort from defender Gabriel.\nThey suffered another injury blow to an attacking player in that game, with Gabriel Jesus, by no means prolific but at least more of a natural fit through the central areas, taken off on a stretcher in the first half.\nFormer Arsenal and England forward Theo Walcott told BBC Sport: \"It's like everyone else has said before. Arsenal need a striker at this time because it would have been a completely different story.\n\"Arsenal have gone from being a free-flowing forward line, exciting the crowd, to going a bit stale at Emirates Stadium. You need players to do something differently and they haven't got that at the moment.\"\nMikel Arteta has only one won trophy as Arsenal boss, the 2020 FA Cup, and Alan Shearer, the Premier League's all-time record scorer, believes the Gunners will miss out on silverware this season if they do not strengthen.\n\"I said it at the beginning of the season, I felt that's what they needed and I think that would possibly cost them the league not investing in that position,\" said Shearer.\nFormer Manchester City defender Micah Richards agreed, adding: \"The difference between Arsenal winning the league or winning these ties is just a centre-forward.\n\"It's hard, you can't just go out and get a number nine, there's not that many in world football.\"\nSo who will Arsenal be looking at this transfer window? Here are nine number nines they could be after.", "url": "https://www.bbc.com/sport/football/articles/cx2jlln2r5ro"}