{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:02", "date_modify": "2025-05-21 04:58:02", "date_publish": "2025-01-23 09:18:15", "description": "Britain's Alfie Hewett maintains his chances of an Australian Open clean sweep by reaching the wheelchair singles final and doubles final.", "filename": "sport_tennis_articles_cp82y0x5pv5o_1747803482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfeb/live/00b0b640-d965-11ef-91ba-f9b50d923955.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cp82y0x5pv5o_1747803482.html", "title": "Australian Open 2025 results: Alfie Hewett reaches wheelchair singles and doubles finals", "title_page": "Australian Open 2025 results: Alfie Hewett reaches wheelchair singles and doubles finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Alfie Hewett maintained his chances of an Australian Open clean sweep by reaching the wheelchair singles final before progressing to the doubles final with partner Gordan Reid.\nThe second seed will face world number one Tokito Oda, who he lost to in last year's final, on Saturday after beating Argentine Gustavo Fernandez 6-3 6-3 in the last four.\nLater, Hewett and fellow Briton Reid beat Spaniard Martin de la Puente and Ruben Spaargaren of the Netherlands 6-4 6-4 in the doubles semi-finals.\nTop seeds Hewett and Reid, who have won the past five Melbourne doubles titles together, face Spain's Daniel Caverzaschi and Stephane Houdet of France on Friday.\nElsewhere, Britain's Andy Lapthorne advanced to the final of the quad wheelchair doubles final alongside Dutch partner Sam Schroder.\nThe pair defeated Australian-Canadian duo Heath Davidson and Robert Shaw 6-1 6-2 and take on Guy Sasson of Israel and the Netherlands' Niels Vink on Friday.\nIn the women's wheelchair doubles, Briton Lucy Shuker and Japanese partner Yui Kamiji were beaten 7-5 6-1 in their semi-final by Chinese duo Li Xiaohui and Wang Ziying.", "url": "https://www.bbc.com/sport/tennis/articles/cp82y0x5pv5o"}