{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:36:22", "date_modify": "2025-04-26 07:36:22", "date_publish": "2025-02-27 14:34:21", "description": "Man Utd news: Fan views criticising Alejandro Garnacho", "filename": "sport_football_articles_cy7xxy67xmlo_1745652982.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy7xxy67xmlo_1745652982.html", "title": "Man Utd news: Fan views criticising Alejandro Garnacho", "title_page": "Man Utd news: Fan views criticising Alejandro Garnacho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Here are some from those of you who think Garnacho did not act correctly:\nTerry: I understand his frustration, but someone had to come off. Make your feelings known, but react in a professional manner and sit with your team mates in the dugout.\nChris: Garnacho has put his ego before the team, just like so many of his now former team-mates. The case with Cristiano Ronaldo caused a stir mainly due to the magnitude of the name he carries; however Garnacho does not carry that impetus. He needs to grow up and understand that his leverage with the club is small. Football is a team game and the reason why Liverpool are successful this season is on the basis of very competent players working as a well-oiled machine together.\nJohn: A fine line between passion and arrogance. If I were his team-mate then I would justifiably be annoyed with Garnacho who seems to put himself on a higher pedestal than is warranted. Play for the team, stand down your ego, work harder to prove yourself and you will play every game!\nMatthew: Good player but always seems to want to make it about himself. The gaffer had to make a tough call and his team have just won 3-2 with 10 men. That should be his priority.", "url": "https://www.bbc.co.uk/sport/football/articles/cy7xxy67xmlo"}