{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 04:59:03", "date_modify": "2025-05-21 04:59:03", "date_publish": "2025-04-04 12:18:23", "description": "Munster advance to the quarter-finals of the Investec Champions Cup with a brilliantly dogged 25-24 win away to La Rochelle.", "filename": "sport_rugby-union_articles_c5ygxl53xgno_1747803543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d3d9/live/6c869530-1248-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5ygxl53xgno_1747803543.html", "title": "Champions Cup: La Rochelle 24-25 Munster", "title_page": "Champions Cup: La Rochelle 24-25 Munster - Vistors beat Ronan O'Gara's two-time champions in last 16 classic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Munster advanced to the quarter-finals of the Investec Champions Cup with a brilliantly dogged 25-24 win at La Rochelle.\nIn an enthralling contest that featured six tries and four yellow cards split evenly between the two teams, Jack Crowley's drop-goal ultimately proved the difference with Munster surviving a late La Rochelle fightback to end their former fly-half Ronan O'Gara's hopes of bringing a third title to the Stade Marcel-Deflandre this season.\nMunster took control of the game with two tries inside five second-half minutes but were still left hanging on at the death.\nGavin Coombes charge down score in the 47th minute had given the visitors their first lead of the game before Andrew Smith stretched over in the corner with Dillyn Leyds in the sin-bin.\nThat put Munster in a commanding position but, after a penalty try followed by a 78th-minute score for Hoani Bosmorin, Ian Costello's side were left to hold on in a hugely dramatic finish.\nLa Rochelle, winners of this competition in 2022 and 2023, are still without a win since beating Toulouse in the Top 14 on 4 January.\nWithout a win in eight games, La Rochelle certainly did not start like a team low on confidence.\nJust a minute into the game, a brilliant move highlighted by an excellent pass from Uini Atonio concluded with Tawera Kerr-Barlow crossing the line.\nIt was only after Ihaia West's conversion attempt that the television match official (TMO) intervened to chalk off the score for Teddy Thomas stepping in touch before the final pass.\nAfter 11 minutes, the hosts were over again and this time the score did count. After Andrew Smith had been sent to the sin bin for a cynical breakdown infringement, La Rochelle went to the corner.\nAlthough Munster stopped the maul, La Rochelle moved the ball centrally and UJ Seuteni provided the final pass for flanker Levani Botia to crash over.\nMunster held firm until Smith's return and then had a man advantage of their own after Ihaia West was shown a yellow card for a high tackle on Sean O'Brien.\nLike La Rochelle, they made the extra player count almost immediately as Thaakir Abrahams led a brilliant break and put Craig Casey away between the posts.\nMunster could not force another score during West's absence and the New Zealander ensured his side carried a lead into the break with a penalty from the last play of the half.\nCalvin Nash, who had made a try-saving tackle on the dangerous Thomas before the break, won Munster a breakdown penalty less than a minute into the second half which Jack Crowley kicked to bring the sides level once again.\nMunster lived dangerously in the period that followed with former England international Jack Nowell going close in one corner before Thomas spurned a gilt-edged chance in the other.\nBut they took control of the game with a pair of scores just five minutes apart.\nFirst Gavin Coombes charged down down West and showed real composure to nudge the ball over the line with his boot before he touched down.\nThen, after Dillyn Leyds was shown the game's third yellow card for a deliberate knock-on, Casey spun the ball wide for Smith to score in the corner.\nWith just 28 minutes remaining, the visitors held a 12-point lead.\nLa Rochelle would cut the deficit to five with a penalty try with a quarter of an hour to go after Alex Kendellen was adjudged to have illegally halted a maul that was driving towards the line.\nWith the replacement flanker also shown a yellow card, Munster were again down to 14 but pushed their lead back out to two scores through Crowley's nerveless drop-goal.\nLa Rochelle desperately tried to find a way back into the game, and got back within a point through Bosmorin's 78th-minute try, but their attempt to deny Munster their famous French victory were ended by Tadhg Beirne's last-play turnover.\nThe celebrations were delayed as the officials looked at a tackle by Fineen Wycherley before Andrea Piardi's decision to take no action sparked jubilation among the travelling supporters.", "url": "https://www.bbc.com/sport/rugby-union/articles/c5ygxl53xgno"}