{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:59:26", "date_modify": "2025-05-21 06:59:26", "date_publish": "2025-03-29 08:54:35", "description": "Former Rangers stars have their say on potential transfer dealings, while English League One leaders want permanent deal for Ibrox midfielder...", "filename": "sport_football_articles_cpv4v319vwno_1747810766.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dcf5/live/9967de70-0c7a-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpv4v319vwno_1747810766.html", "title": "Rangers may get 'realistic' £10m for Raskin - gossip", "title_page": "Rangers may get 'realistic' £10m for Raskin - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers \"might have to settle\" for a fee close to £10m if in-form midfielder Nico Raskin is sold this summer, reckons former Ibrox favourite Scott Arfield, who tells fans to \"get realistic\" about a potential price. (Daily Record), external\nFormer Rangers striker Kris Boyd is \"unconvinced\" a deal will be done to keep on-loan winger Vaclav Cerny at Ibrox, citing Abdallah Sima and Malik Tillman as examples of players who saw their values soar at the club, making them unaffordable. (Scottish Sun - subscription), external\nKris Boyd also says it is \"incredible\" that Rangers are obliged to pay Lens £3.5m for winger Oscar Cortes, urging his old club to back out of the deal if possible. (Scottish Sun - subscription), external\nManager Chris Davies has confirmed that Birmingham City will be looking to turn the loan deal for Rangers midfielder Kieran Dowell into a permanent transfer at the end of the season. (Birmingham Live), external\nFormer Aberdeen star Joe Harper urges the Pittodrie club to agree a contract extension with Shayden Morris, saying the winger is on an \"upward trajectory\" and can \"turn games\". (Press & Journal - subcription), external", "url": "https://www.bbc.com/sport/football/articles/cpv4v319vwno"}