{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-20 12:10:49", "date_modify": "2025-05-20 12:10:49", "date_publish": "2023-08-05 09:07:25", "description": "A new rugby season will begin earlier than usual when Wales host England on Saturday with World Cup places at stake.", "filename": "sport_rugby-union_66400687_1747743049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E743/production/_130630295_cdf_270723_cf_wales_rugby_training_095.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66400687_1747743049.html", "title": "Wales v England: Warren Gatland aims to revitalise Welsh rugby ahead of World Cup", "title_page": "Wales v England: Warren Gatland aims to revitalise Welsh rugby ahead of World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Something does not sound quite right about Wales hosting England in a rugby international on the opening Saturday in August.\nBut this is World Cup year with the season starting earlier than normal. It might not be a rip-roaring occasion that emulates the traditional Six Nations showdowns but this occasion will have its own significance\nThese two fierce rivals will face each other twice in the space of seven days, with places on the trip to France up for grabs for both sides.\nThis will be the last chance to impress for England's players before Steve Borthwick names his 33-man squad next Monday, while Wales have a little longer.\nThe return fixture follows in Twickenham the following Saturday before Wales' preparation is completed on 19 August against South Africa in Cardiff, after which Warren Gatland will announce his final selection with the Wales coach this week claiming he currently only knows one of his squad.\nWelsh rugby needs a major boost, some positivity after a torturous 12 months in which Wales lost nine out of 12 games and also saw Gatland's return in December 2022 to replace Wayne Pivac.\nWales managed one win in the 2023 Six Nations against Italy, finishing fifth in the table, and are languishing at ninth in the world rankings.\nThey can slip to their joint lowest position of 10th this weekend if they lose and World Cup rivals Fiji defeat Japan.\nWelsh rugby has also been embroiled in off-the-field turmoil, with players threatening to strike ahead of the Six Nations home match against England in February over contractual issues before that crisis was averted.\nWales have since lost the experience of Alun Wyn Jones, Justin Tipuric and Rhys Webb - who retired from international rugby despite being named in the original training party - while Six Nations captain Ken Owens is out with a back injury.\nSo all doom and gloom then? Not for Gatland.\nWhen he announced his World Cup extended squad, he admitted he needed to change the negative narrative of Welsh rugby and instil belief in his players.\nAfter two months with his squad, Gatland doubled down this week by promising Wales will do \"something special\" and \"surprise people\" at the World Cup.\n\"I'm impressed with this group of players in the last eight weeks,\" said Gatland.\n\"They're in great shape physically. I couldn't have asked for more. They've been to the well and had to dig deep with everything we've put them through.\"\nCentre George North says Wales are worlds apart from the Six Nations low.\n\"Anything's better than after the Six Nations, isn't it?\" said North.\n\"We all took it very personally because it's our fingerprints on it. After all the stuff going on, we're in a much better place now. There has been a lot of hard graft and the vibe is different.\n\"The boys believe in what we've done from the first day of training, that it will pay dividends and you've got to trust the system.\"\nThe players have been tested with punishing training camps in Switzerland and Turkey, with Gatland admitting there have been \"tough sessions but we come out the other side\".\n\"The camps have been brutal and it's one of probably the worst ones I've been on,\" said North.\n\"Some of the sessions we did in Switzerland were so hard, but Turkey was another level again.\n\"We had a heatwave, which is even hotter than it was normally. Some of those sessions, you think there's no way we can do it, but you grind it out and it stands you in good stead.\n\"We're not doing this graft for nothing and Gats never has apologised for working us hard.\"\nGatland's first stint in charge of Wales yielded four Six Nations titles, three Grand Slams and two World Cup semi-finals.\nAfter ignoring the 'never go back' adage, Gatland was a more restrained figure during the Six Nations as he weighed up what he had signed up for.\nHe admitted he had to let things play out but there are now signs his imprint is back on this squad and his swagger has returned.\n\"He has found his voice, for sure,\" said North.\n\"He has had the ability to put his stamp on it, more than he did in the Six Nations. It was set out from day one what was expected of us by him.\n\"Gats has been back playing his normal mind games, been around the boys geeing them up and poking the bear as well. He knows exactly what he wants and he has installed it in us through his coaches.\"\nWales' players and coaches have been saying the right things this week. Now we will see whether that translates on the field at this early stage in the season as Wales' hopefuls aim to impress this weekend.\nThere will be some sentiment in Cardiff with Leigh Halfpenny becoming the ninth player to win 100 Wales caps, but he will be trying to prove his World Cup credentials alongside everybody else.\nGatland will parade three news caps in Max Llewellyn, Corey Domachowski and Keiron Assiratti, while Taine Plumtree and former England prop Henry Thomas could make Wales debuts as replacements.\nIt might effectively be a \"friendly\", yet a Wales win is important in terms of restoring confidence and optimism for those suffering supporters, with more than 60,000 expected at the Principality Stadium.\n\"Any chance to put the Welsh jersey on is special but England at home is massive,\" said North.\n\"There aren't many games now before the World Cup. It's a first opportunity to put your hand up, we only have three games and you have to take chances when they come.\"", "url": "https://www.bbc.com/sport/rugby-union/66400687"}