{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:04:52", "date_modify": "2025-05-20 15:04:52", "date_publish": "2023-07-27 09:55:20", "description": "‘There's more stability & we look more creative’", "filename": "sport_articles_cp60ykz3jylo_1747753492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a228/live/68aaea00-2c63-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp60ykz3jylo_1747753492.html", "title": "‘There's more stability & we look more creative’", "title_page": "‘There's more stability & we look more creative’ - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Can Kilmarnock kick on up in the table in their second successive season of top-flight football?\nLast season was a struggle at times for Derek McInnes' men, who were strong at home and pretty dreadful on the road.\nKillie eventually finished 10th, ensuring survival by beating Ross County on the final day, but hope springs eternal of further progress in the new campaign.\nSandy Armour, editor of the Killie Hippo fanzine, says there’s now \"more stability” after McInnes overhauled the squad this summer.\n“The only mitigating factor last season was there were a few players we’d signed on two-year contracts that were tied up that we basically couldn’t get rid of,” Armour told the BBC’s Scottish football podcast.\n“McInnes was looking at his budget and it was used up on guys like that who were in reality Championship players.\n“Now that we’ve had a huge clearout in the summer, we got rid of 15 players including a lot of loans, and the players coming in are his players and they’re on two or three-year deals.\n“There’s more stability, a bit more long-term planning and the team look a lot more creative.\n“We’ve got more potential to be creative and that was the reason for losing away games last year, we didn’t have goals in us. We depended on centre-halves for a period to score a goal.\n“We can hopefully finish a bit higher this year but between fourth and 12th place, there’s really fine lines pretty much every season. But just a small bit of improvement can get you up a few places in the league.”", "url": "https://www.bbc.com/sport/articles/cp60ykz3jylo"}