{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:48", "date_modify": "2025-04-26 06:13:48", "date_publish": "2025-03-05 00:00:00", "description": "Lautaro Martinez is on target as Inter Milan take a commanding lead against Feyenoord in the first leg of their Champions League last-16 tie.", "filename": "sport_football_live_c2ljzj2pnwxt_1745648028.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f28/live/45cd9000-f9f8-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c2ljzj2pnwxt_1745648028.html", "title": "Feyenoord 0-2 Inter Milan: Marcus Thuram and Lautaro Martinez score for Italian side", "title_page": "Feyenoord 0-2 Inter Milan: Marcus Thuram and Lautaro Martinez score for Italian side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lautaro Martinez scored a landmark goal as Inter Milan took a commanding lead against Feyenoord in the first leg of their Champions League last-16 tie.\nMarcus Thuram struck their opener seven minutes before the break when he stabbed home Nicolo Barella's looping ball into the box from close range.\nKristjan Asllani's free-kick from 25 yards was tipped over the bar by Feyenoord goalkeeper Timon Wellenreuther in the final action of the first half.\nBut Inter doubled their lead five minutes after the interval as captain Martinez fired high into the roof of the net from Piotr Zielinski's lay-off.\nIt was the Argentine's 18th goal in the competition and took him one clear of the legendary Sandro Mazzola as the club's record scorer in the European Cup/Champions League.\nPolish midfielder Zielinski had a chance to get on the scoresheet when Thuram was fouled in the box by Jeyland Mitchell - but Wellenreuther got down low to his right to save the penalty.\nThe second leg takes place at the San Siro on Tuesday, 11 March (20:00 GMT).\nFeyenoord tried to find a way back into the tie and Brighton loanee Jakub Moder came close when his strike smashed off the crossbar.\nBut they will be without winger Ibrahim Osman for the return in Milan after he was shown a yellow card for fouling Denzel Dumfries and will be suspended.\nBefore he scored, Martinez had a curling strike from the edge of the area which was pushed behind by Wellenreuther.\nHe has netted six goals in the competition this season, a new career high in a single edition of the tournament.\nWhile potent up front, Simone Inzaghi's side have also been tight at the back, keeping eight clean sheets in nine matches – the Nerazzurri's joint-most in a single season in the competition (also eight in 2022/23).\nThuram's opener was his 15th of the season across all competitions, matching his tally from last season in 11 fewer appearances.\nSerie A leaders Inter last reached the Champions League final in 2023, when they lost to Manchester City, and if they are to do so again, talisman Martinez is likely to play a key role.\nWatch highlights of every Champions League game from 22:00 on Wednesday on BBC iPlayer and the BBC Sport website and app.\nThere will also be a Champions League Match of the Day on BBC One on Wednesday, from 22:40 to 00:00.", "url": "https://www.bbc.co.uk/sport/football/live/c2ljzj2pnwxt"}