{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:31:43", "date_modify": "2025-05-20 12:31:43", "date_publish": "2023-08-04 11:00:29", "description": "Defender Olufunwa joins Saints after Liverpool exit", "filename": "sport_articles_cw81xq9pv99o_1747744303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53b0/live/dc303400-32b5-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw81xq9pv99o_1747744303.html", "title": "Defender Olufunwa joins Saints after Liverpool exit", "title_page": "Defender Olufunwa joins Saints after Liverpool exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone have signed Oludare Olufunwa on a two-year deal following the defender's release from Liverpool.\nThe 22-year-old, who can play right-back or centre-half, came through the Southampton youth academy before joining Liverpool last summer and went on to make 30 appearances in Premier League 2.\n“I know Scottish football, it is a very good standard with some big teams in the league,\" said Olufunwa.\n“I spoke to the gaffer before I came in and he explained how this would be a good step for me and my career. The move made sense.\n“It was a great experience at Liverpool and I have to thank everyone there for what they did for me. It is probably one of the biggest clubs in the world. They improved me as a player and as a person.\n“I have been playing against Dan Phillips from quite a young age up. It has been good to see him again and he has helped me to integrate with the rest of the lads.\"\nOlufunwa is Saints' fourth summer signing, following defender Sam McClelland, striker Luke Jephcott and goalkeeper Dimitar Mitov.\n\"I am delighted to get Dare over the line,\" said manager Steven MacLean.\n\"He’s a big lad, quick and strong and hungry. He’s had a few injuries in his career so that’s probably why he’s not kicked on as much already.\n\"I feel like this is the perfect place for him to develop and compete for minutes.\"", "url": "https://www.bbc.com/sport/articles/cw81xq9pv99o"}