{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:25:28", "date_modify": "2025-05-19 15:25:28", "date_publish": "2015-02-23 16:40:01", "description": "Ishmael Miller scores his first Huddersfield goal as Chris Powell's men comfortably beat Reading.", "filename": "sport_football_31498956_1747668328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81222000/jpg/_81222001_powell_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31498956_1747668328.html", "title": "Huddersfield Town 3-0 Reading", "title_page": "Huddersfield Town 3-0 Reading - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ishmael Miller scored his first Huddersfield goal as the Terriers returned to form by beating Reading.\nThe striker, signed from Blackpool in January, rounded off the hosts' win with a brilliant lofted finish.\nHarry Bunn had put Town ahead against the run of play with a powerful header as Alex Smithies denied Hope Akpan and Oliver Norwood at the other end.\nNahki Wells pounced on Adam Federici's error to double the lead after the break before Miller grabbed the third.\nIt was Huddersfield's first win in the Championship since 7 February and takes Chris Powell's side up to 12th.\nReading had celebrated impressive victories at Wolves, Derby and Ipswich in February but, after a period of sustained pressure at the end of the second half failed to yield an equaliser, Federici's mistake left them with too much to do.\nThe Australian goalkeeper spilled Jacob Butterfield's tame shot straight back to Wells to slot in from close range.\nMiller had gone close, forcing a good save out of Federici, before rounding off a superb counter-attack to score his first goal after four goalless games for his new side.\nHuddersfield boss Chris Powell: \"It's a very sweet victory for us before two road trips.\n\"I'm happy for everyone - the players and our supporters - because it was a performance full of quality.\n\"The tempo was better and we got the goal we wanted early on. It was a good night's work.\"\nReading boss Steve Clarke: \"It's disappointing. It was a strange game which just slipped away from us for no real reason.\n\"Obviously you don't expect Adam Federici to make a mistake like he did, and from there we didn't really have an opportunity to get back into the game.\n\"If we'd got to 2-1 we'd have had half a chance but Huddersfield pulled away from us.\"", "url": "https://www.bbc.com/sport/football/31498956"}