{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-04-26 06:39:16", "date_modify": "2025-04-26 06:39:16", "date_publish": "2025-03-02 16:21:14", "description": "Tottenham produce a determined display against Manchester City but are unable to avoid defeat.", "filename": "sport_football_articles_c981pl9603jo_1745649556.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b722/live/4be47540-f781-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c981pl9603jo_1745649556.html", "title": "City grab victory despite determined Spurs display", "title_page": "Tottenham 1-2 Manchester City: City grab victory despite determined Spurs display - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This was nothing like the 4-0 defeat Tottenham suffered against Manchester City when the two met earlier this season.\nSpurs were persistent, attacking-minded and creative on Sunday, but did not manage to muster a result reflective of their performance.\nManchester City, on the other hand, found a way to win despite a slightly shaky display in which they often struggled at the back and were largely unproductive in Spurs' final third.\nTottenham will rue the string of missed chances they had at the latter end of the first half and the beginning of the second, with Matilda Vinberg slicing wide when one-on-one being the clearest opportunity for them to have avoided defeat.\nThe hosts' attacking line caused constant problems for City, who gave the ball away far too often. Yui Hasegawa was one of the few players who did a consistently good job of holding position.\nThe fact Khadija Shaw so rarely found herself with service in the final third speaks volumes of City's attacking misfortunes, but, nevertheless, the visitors did what was required.\nIt was the introduction of three substitutes – Jill Roord, Mary Fowler and Jess Park – who sparked their late attacking intent and helped them to victory.\nWith so many games coming up, though, and City's squad already depleted, they may not be able to rely on fresh legs from the bench too often throughout this month.", "url": "https://www.bbc.co.uk/sport/football/articles/c981pl9603jo"}