{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:46", "date_modify": "2025-05-21 04:35:46", "date_publish": "2025-04-04 17:27:09", "description": "Dundee United 'don't want to be relying on anyone'", "filename": "sport_articles_c87p8el10yzo_1747802146.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bc3/live/18dcbc50-115f-11f0-ba60-99b08c2860b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c87p8el10yzo_1747802146.html", "title": "Dundee United 'don't want to be relying on anyone'", "title_page": "Dundee United 'don't want to be relying on anyone' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United \"don't want to be relying on anyone\", says manager Jim Goodwin, as he urged his side to complete their top-six quest at Tynecastle on Sunday.\nUnited have effectively secured a top-half finish but a point from their remaining two pre-split fixtures would remove any modicum of doubt.\nGoodwin believes his former club St Mirren will beat both Dundee and Ross County in the coming weeks and aims to make sure there is no drama when United host St Johnstone on April 12.\n\"We have put ourselves in a great position and we haven't been out of the top six pretty much all season, which is credit to the group off the back of recently being promoted,\" said the Irishman.\n\"We are in a really strong position and it's very much in our hands. We don't want to be relying on anyone.\n\"St Mirren have had a really good season. They are hitting a bit of form at the right time and I would expect St Mirren to win their next two fixtures and that ultimately means we need to get a result in our next two games.\"\nHearts are only a point ahead of both St Mirren and Motherwell with a trip to Fir Park on the horizon after Sunday.\nGoodwin said: \"It's fair to say it's probably more of a must-win fixture for Hearts than ourselves but we're not going with a negative mindset of trying not to lose the game.\n\"We want to go there and try and win the game. We have to have a good defensive shape with the quality of players they have in the forward areas.\n\"But I believe St Mirren will win their next two fixtures and I think that's going to mount a lot of pressure on Hearts.\n\"They have to, I suppose, be a bit more open and expansive than we need to, and if we can exploit those areas on the counter-attack then that's something we will look to do.\"", "url": "https://www.bbc.com/sport/articles/c87p8el10yzo"}