{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:08:17", "date_modify": "2025-05-21 05:08:17", "date_publish": "2025-01-14 19:22:44", "description": "Holders Wigan Warriors are likely to travel to Sheffield Eagles in the third round as they begin their Challenge Cup title defence.", "filename": "sport_rugby-league_articles_cj48vxx28rlo_1747804097.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2a8/live/1a173590-d18c-11ef-8075-4d88325174ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cj48vxx28rlo_1747804097.html", "title": "Challenge Cup draw: Holders Wigan Warriors could face Sheffield Eagles in third round", "title_page": "Challenge Cup draw: Holders Wigan Warriors could face Sheffield Eagles in third round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holders Wigan Warriors are likely to travel to Sheffield Eagles in the third round as they begin their men's Challenge Cup title defence.\nWigan beat Warrington Wolves in last season's final at Wembley Stadium, the second trophy in their history-making quadruple season.\nThe 2025 season is the first under a revamped structure where all 12 Super League clubs join from the third-round stage.\nThe top-flight clubs, who did not previously enter the competition until the sixth round, will be obliged to play away at seeded lower division teams who have won their second-round matches.\nThe Championship Eagles, Challenge Cup winners in 1999, will have to beat the winner of West Bowling v Cutsyke Raiders in the second round to earn their tie against the Super League giants.\nElsewhere, newly promoted Wakefield will face a trip to the side they replaced in the top tier if London Broncos can get past Goole Vikings in their second-round tie.\nHull KR, last season's beaten Grand Finalists, will face either League 1 Keighley Cougars or Championship York Knights.\nThe third round is scheduled to take place during the weekend of 8 and 9 February - one week before the 2025 Super League season gets under way.\nThe fourth round, featuring 16 clubs, will then take place in March, before quarter-finals in April and semi-finals on the weekend of 10-11 May, with Wembley Stadium set to host the final on June 7.", "url": "https://www.bbc.com/sport/rugby-league/articles/cj48vxx28rlo"}