{"authors": ["Karan Vinod", "www.facebook.com"], "date_download": "2025-05-21 05:02:53", "date_modify": "2025-05-21 05:02:53", "date_publish": "2025-04-04 09:27:57", "description": "Fabian Hurzeler press conference: Brighton vs Crystal Palace", "filename": "sport_football_articles_c0elwlyrvg8o_1747803773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0elwlyrvg8o_1747803773.html", "title": "Fabian Hurzeler press conference: Brighton vs Crystal Palace", "title_page": "Fabian Hurzeler press conference: Brighton vs Crystal Palace - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hurzeler has confirmed that the same squad available from the Aston Villa loss will also be available for Palace, with Joel Veltman still out.\nOn the reaction he has seen from his squad after tough losses this week against Nottingham Forest and Aston Villa: \"Quite well. We have to deal with setbacks and it's always about how you come back. We have to focus on the things that make us strong. It's about small margins - it's about details. We always stay positive.\"\nHurzeler was \"happy\" with Brajan Gruda and Joao Pedro's performances against Villa and said debutant Eiran Cashin's performance \"made a good impression\".\nHurzeler reiterated that the club needs two things - \"togetherness and positive energy\" - as they approach the climax to the season.\nOn bagging derby bragging rights against Palace having lost at home to their rivals in December: \"I can feel it and it's also our responsibility to give them something back. In the first derby, we weren't at the highest level. Tomorrow it's an opportunity for us to make it better than last time.\"\nHurzeler hailed Palace as \"one of the best teams in transition and one of the best teams in set-pieces.\"\nOn breaking down Palace's stern defence: \"Everyone defends - everyone has the mindset to defend. It is not easy to play through the block so we have to find other solutions. It is important to be patient, because if you force it, you will give them opportunities to win the ball and they can attack with their transition players.\"", "url": "https://www.bbc.com/sport/football/articles/c0elwlyrvg8o"}