{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:18", "date_modify": "2025-05-21 04:18:18", "date_publish": "2025-02-09 12:49:51", "description": "Andrew Coscoran breaks Eamonn Coghlan's legendary 42-year-old Irish indoor mile record at the Millrose Games and betters Ray Flynn's outdoor mark.", "filename": "sport_athletics_articles_c6271ml0jlro_1747801098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d72/live/c2da3620-e6e3-11ef-9c03-b5355c68e892.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c6271ml0jlro_1747801098.html", "title": "Andrew Coscoran: Balbriggan man breaks legendary Coghlan and Flynn Irish mile marks", "title_page": "Andrew Coscoran: Balbriggan man breaks legendary Coghlan and Flynn Irish mile marks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Balbriggan athlete Andrew Coscoran broke Eamonn Coghlan's legendary 42-year-old Irish indoor mile record at the Millrose Games in New York and in the process also bettered Ray Flynn's even older national outdoor mark for the classic distance.\nCoscoran clocked three minutes, 49.26 seconds which was only good enough for seventh place as US athlete Yared Nuguse broke the world record with a 3:46.63 time.\nThe north county Dublin man's time cut 0.52 seconds off Coghlan's Irish indoor mark, which was a world record when set in East Rutherford in 1983 when the 'chairman of the boards' became the first man indoors to duck under three minutes and 50 seconds for the mile.\nCoscoran's performance in the Wanamaker Mile also made him the fastest Irish miler of all time as he bettered Flynn's 1982 outdoor mark of 3:49.77.\nHis latest record-breaking feat came less than a week after he set an Irish indoor 3000m record of 7:30.75 in Boston.\nUp ahead, Nuguse won in 3:46.63 which bettered the previous indoor mark of 3:47.01 set by Ethiopia's Yomif Kejelcha in 2020.\nUS athlete Hobbs Kessler was also inside the old world record as he clocked 3:46.90, with Australian Cameron Myers (3:47.48), France's Azeddine Habz (3:47.56), American Gary Martin (3:48.82) and Great Britain's Neil Gourley (3:49.22) also finishing ahead of Coscoran.\nLetterkenny athlete Mark English and Dubliner Sarah Healy also bettered their previous Irish indoor men's 800m and women's 3000m record at the famous New York meeting.\nEnglish clocked 1:45.15, nearly one second faster than his previous indoor best set in 2021, as he took fourth behind US trio Josh Hoey (1:43.90), Bryce Hoppel (1:44.19) and Jonah Koech (1.44.82).\nHealy cut over four seconds off the Irish record she set in Boston last week as her time of 8:30.79 left her third behind American duo Whittni Morgan (8:28.03) and Josette Andrews (8:29.77).\nThe Irish woman took third spot as she passed Australia's Olympic 1500m silver medallist Jessica Hull (8:30.91) in the closing metres.", "url": "https://www.bbc.com/sport/athletics/articles/c6271ml0jlro"}