{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:47:57", "date_modify": "2025-04-26 03:47:57", "date_publish": "2025-03-05 15:21:10", "description": "Newcastle news: Fan views on Lewis Hall's injury", "filename": "sport_football_articles_cy83kzmrm83o_1745639277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy83kzmrm83o_1745639277.html", "title": "Newcastle news: Fan views on Lewis Hall's injury", "title_page": "Newcastle news: Fan views on Lewis Hall's injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on how big a miss Lewis Hall will be for Newcastle after the defender was ruled out for the season with a foot injury.\nHere are some of your comments:\nTom: Hall has been arguably the best player in the squad and one of the best full-backs in the league this season. Hopefully he comes back stronger and pushes his way into the England squad.\nJD: Lewis has been our most consistent of the back four so this will hurt. No doubt Trippier or Livramento will fill in for the rest of the season. We could also put Burn in there should Botman return to that left-sided centre-back spot soon.\nAlex: This is absolutely devastating, Hall has been outstanding all season. I think we'll see Burn filling in at left-back, with Botman/Schar at centre-back if they are fit. Alternatively, Trippier could fill in at left-back, with Tino on the right. If they aren't, then we have big problems. Our January transfer business doesn't look so smart now... I hope we'll have enough to get into Europe.\nRichard: Hall divided opinion when he first arrived because Newcastle didn't want to play him too often as it would have meant they were obligated to buy him and they wanted to be sure he was the right quality. This led a lot of folks to ask why he was even here if we are not going to play him! Now, of course, he's been outstanding and losing him is a real blow. But injuries happen and we must accept it. It's been nowhere near as bad as last season in terms of days lost so we shouldn't be too downhearted. Still, I bet Mo Salah was pleased to hear Lewis is out.", "url": "https://www.bbc.co.uk/sport/football/articles/cy83kzmrm83o"}