{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:57", "date_modify": "2025-05-21 06:43:57", "date_publish": "2025-03-30 20:48:25", "description": "The FA Cup \"seems to have its sparkle back\" - but will Manchester City stop there being a \"fairytale ending\" for Aston Villa, Crystal Palace or Nottingham Forest?", "filename": "sport_football_articles_c934p10vg1xo_1747809837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/81a0/live/53f5f560-0d9d-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c934p10vg1xo_1747809837.html", "title": "FA Cup's sparkle returns but will Man City prevent 'fairytale ending'?", "title_page": "FA Cup's sparkle returns but will Man City prevent 'fairytale ending'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The FA Cup \"seems to have its sparkle back\" but could Manchester City be party poopers and prevent a \"fairytale ending\"?\nSeven-time winners City will be aiming to reach a third consecutive final when they face Nottingham Forest at Wembley on the weekend of 26-27 April - as part of an intriguing last-four line-up without most of the cup's traditional heavyweights.\nCity are the only team in the semi-finals with any recent record of success in the oldest national football competition in the world.\nForest last got to the final in 1991 and have not won the trophy since 1959, while Aston Villa have been beaten finalists twice since they tasted success for a seventh time back in 1957.\nCrystal Palace, meanwhile, have twice lost in the showpiece and never won the cup - and as a result Pep Guardiola's team are very much the bookmakers' favourites.\nSpeaking on BBC Radio 5 Live, former Chelsea and Everton winger Pat Nevin said: \"Many of the big dogs have gone out already - not because they didn't care, but because they simply weren't good enough.\n\"The FA Cup seems to have its sparkle back and, with a bit of luck, it might even have the first magical fairytale ending we have seen since Wigan in 2013.\"\nFourteen-time record winners Arsenal, Manchester United - who have won the cup 13 times - and Chelsea, Tottenham and Liverpool, each with eight victories, have already been knocked out.\nAnd that means the stranglehold the Premier League's so-called 'big six' - the five teams above plus City - have had on the FA Cup in recent years could be broken.\nSince Wimbledon's shock triumph in 1988, only four teams outside of the 'big six' have lifted the trophy - Everton in 1995, Portsmouth in 2008, Wigan in 2013 and Leicester City four years ago.\nEven Spurs, technically part of the elite group, have lifted the FA Cup just once in that period - in 1991.\nThat means five teams have accounted for 31 of the past 36 FA Cup victories.\nBut this could be the year an unfancied team triumphs - unless City, who have reached the semi-finals a record seven times in a row, prevail again.\n\"No team has done it [got to seven consecutive semis] and it will be difficult for one team to do what these legendary players, the new ones and the old, have done. It is unbelievable,\" said Guardiola.\nPalace, Forest and Villa will all believe they have the firepower to prevent City from winning the cup for the second time in three years.\nCity's last trophyless season came at the end of the first year of Guardiola's tenure in 2016-17.\nAnd in Forest they face a club six points above them in the league and who have won four of their five previous meetings in the FA Cup, dating back to 1902.\n\"Pep has always taken the domestic competitions seriously and it's a great record he's got,\" said former Manchester United captain Roy Keane on ITV.\n\"The two semi-finals are hard to call. They're two really good games.\n\"Nottingham Forest are going along nicely. They've had some good breaks with the penalty shootouts but they're more than capable of sitting in and beating City.\"\nPalace have been eliminated by Villa in all three FA Cup campaigns in which they have met.\nAs well as a trip to Wembley, Unai Emery's Villa are also gearing up to face Paris St-Germain in the Champions League quarter-finals and are still in contention for a top-four finish in the league.\nEmery said: \"We can take two objectives through the FA Cup - to get a trophy and play in Europe. In a case like that, it's fantastic.\n\"To be consistent in Premier League is really the [main] objective we have but being like we are now, in the FA Cup, we have to enjoy with the supporters because this competition means a lot for them.\"\nBut Palace will be no easy task for Villa, with only Liverpool in better form than the Eagles over their past 10 league matches.\nBoss Oliver Glasner said: \"I think it's something special that the two semi-finals are played in the same stadium as the final and this is something very English. I really like it and we will be ready in four weeks to win this game.\"\nSpeaking on BBC Radio 5 Live, former Middlesbrough and Fulham goalkeeper Mark Schwarzer, added: \"This is what the FA Cup is about - being able to dream.\n\"[It is a chance for] clubs who may not necessarily think they have a chance to win the FA Cup but are now in a great position to rewrite history.\"", "url": "https://www.bbc.com/sport/football/articles/c934p10vg1xo"}