{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:35", "date_modify": "2025-05-21 06:48:35", "date_publish": "2025-03-28 21:46:44", "description": "Tom Roebuck's two tries helps Sale Sharks to a bonus-point win over Northampton Saints to keep them on course for the play-offs.", "filename": "sport_rugby-union_articles_c1lp34e07n5o_1747810115.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/411f/live/197fcd00-0c23-11f0-91f1-3bb93ded1c83.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c1lp34e07n5o_1747810115.html", "title": "Premiership: Sale 27-24 Northampton Saints: Sharks go fourth with bonus-point win", "title_page": "Premiership: Sale 27-24 Northampton Saints: Sharks go fourth with bonus-point win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two tries from England winger Tom Roebuck helped Sale Sharks move up to fourth in the Premiership after a bonus-point win over Northampton Saints in Salford.\nRoebuck scored twice in a helter-skelter first half after his opposite winger Tom O'Flaherty had gone over for the night's opening try.\nSaints were briefly reduced to 13 men but responded with tries from prop Emmanuel Iyogun and wing Tommy Freeman.\nStraight after half-time, number eight Henry Pollock brought Northampton level at 17-17 with a brilliant individual try.\nBevan Rodd's bonus-point score and George Ford's penalty then appeared to seal the game for Sale, only for Fraser Dingwall to grab Saints' fourth try with four minutes remaining and spark a nervous finale.\nVictory sent Sale fourth in the table in what is now a five-way battle for the final two play-off places.\nNorthampton's title defence appears to have run its course after an eighth defeat of the season. It leaves them eighth in the table and nine points behind the top four with five games remaining.\nThey endured a nightmare opening after O'Flaherty spun out of a tackle to score Sale's first try superbly in the right corner.\nTom James, a scrum-half employed at 10 with England fly-half Fin Smith rested and other options injured, was the first to be sin-binned for a high tackle on Roebuck.\nAnd only three minutes later, Freeman was also yellow-carded for a deliberate knock-on after Sale broke down the right.\nSoon after, O'Flaherty's kick into the left channel found Tom Curry, who offloaded inside for Roebuck to run in.\nBut with 13 men, a quick tap penalty allowed Pollock to barrel into the 22 for Northampton - and two passes later Iyogun went into the left corner.\nSale's lead was quickly restored as Ford put Tom Carpenter through a hole and the full-back passed outside for Roebuck to score his second try.\nBut Saints replied again as clean line-out ball fed Freeman and he bounced away from Jean-Luc du Preez to go over.\nShortly after, Ford was sin-binned for a high tackle on Burger Odendaal as Saints broke up the left - his first yellow card in 11 years.\nUp 17-12 as they took the second-half restart, Sale cleared to halfway but Pollock ran it back, broke two tackles, chipped over the covering defence and found a kind bounce to draw Saints level.\nSale went back in front as Rodd, on his 100th appearance, scored from the back of a driving maul, and after Ford extended the lead from the tee, the game looked to be petering out.\nBut the hosts gave away a series of penalties and Dingwall's late try, which earned Saints two bonus points, gave the champions late hope.\nSale Sharks director of rugby Alex Sanderson said:\n\"I thought we were good for the win but Northampton showed why they're a champion side.\n\"They don't tire and they don't give up when you give them little sniffs like we did.\n\"We put the pressure back on ourselves and they capitalised on that because they're very good on the front foot with a bit of quick ball.\n\"Realistically, we've got to win five out of our last seven games with bonus points to finish in the top four.\n\"That means you've got to win your home games and I thought our attacking intent tonight was brilliant. To score 27 points against a team of Northampton's calibre is good progress.\"\nNorthampton director of rugby Phil Dowson told BBC Radio Northampton:\n\"We couldn't really get going. It was stop-start in the second half and we couldn't get any flow, really.\n\"I thought Tom James [filling in at 10] was excellent and he was game for the challenge, and we tried to make the occasion special for him but we couldn't quite manage it.\n\"There's no lack of emotional engagement in what we're trying to do but we just haven't been good enough throughout the season.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c1lp34e07n5o"}