{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 05:46:22", "date_modify": "2025-05-21 05:46:22", "date_publish": "2025-04-02 13:10:53", "description": "'Defensive frailties mean Dundee continue to flirt with drop'", "filename": "sport_articles_c5y6gewdkvro_1747806382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8b9/live/ba516e40-d0de-11ee-9a5b-e35447f6c53b.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y6gewdkvro_1747806382.html", "title": "'Defensive frailties mean Dundee continue to flirt with drop'", "title_page": "'Defensive frailties mean Dundee continue to flirt with drop' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee's defeat to Rangers summed up their season as they were left pondering another case of 'what if?'.\nThe Dark Blues succumbed to a stoppage-time Cyriel Dessers goal in a game they led by two in heading into the final 15 minutes.\nIt was a microcosm of what has gone wrong this term. Once again the defensive frailties that have dogged them were exposed - and they have now shipped nine goals in the past three games, which further emphasises the problem.\nAn inability to see a match out was also highlighted again, with Docherty stressing the \"need to manage the game\" in his post-match comments.\nHis side have lost 23 points from winning positions in the Premiership this season, more than any other team.\nIf you were to add those 23 points on to their current tally, they would be comfortably in the top six and pushing for their Europe instead of languishing in second bottom.\nThey have pace, they have strength, they have goals - qualities most teams in the bottom six are crying out for.\nBut the benefits of those positive attributes are being neutralised by their defensive frailties outlined above.\nAll is not lost - the manager has seen enough to know his team, when they are on it, can be more than a match for anyone in the division.\nHe just needs to find a way of getting it all working together on a more regular basis between now and the end of the season.\nIf he can, you get a sense all will be well. If he can't, then the Dundee fans should prepare for a relegation scrap.", "url": "https://www.bbc.com/sport/articles/c5y6gewdkvro"}