{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 06:11:47", "date_modify": "2025-05-21 06:11:47", "date_publish": "2025-04-01 13:00:15", "description": "Former England captain Charlotte Edwards replaces Jon Lewis as head coach after the 16-0 Ashes defeat at the beginning of the year.", "filename": "sport_cricket_articles_cwy0lv33nv1o_1747807907.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0551/live/99a11a40-0f14-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cwy0lv33nv1o_1747807907.html", "title": "Charlotte Edwards appointed as England women's head coach", "title_page": "Charlotte Edwards appointed as England women's head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England have appointed legendary former captain Charlotte Edwards as their new head coach.\nThe 45-year-old, England's all-time leading run-scorer, replaces Jon Lewis, who was sacked in March after the 16-0 Ashes hammering in Australia.\nEdwards played more than 300 times for England in a 19-year career, including in excess of 200 games as captain.\nIn a 10-year spell in charge, Edwards won three Ashes series and both the 50-over and 20-over World Cups in 2009.\nShe was surprisingly sacked in 2016 and replaced by Heather Knight, who then enjoyed her own nine-year reign.\nKnight was also sacked in the aftermath of the Ashes debacle but will remain as a player, now under coach Edwards.\n\"I cannot wait to take this team forward and drive us to success. It means the world to me to have the three lions on my chest once again,\" said Edwards.\n\"Leading England as captain was my life for 10 years and I will forever be passionate about this team and our legacy. We have such a talented group of players, and I am excited about working with them and improving them both as individuals and as a team.\"\nEngland are yet to name a new captain. Vice-captain Nat Sciver-Brunt has previously stated she would be interested in the role, while off-spinner Charlie Dean said she \"wouldn't say no\".\nThe upheaval at the top of the England team comes as a result of a review into the Ashes, led by director of women's cricket Clare Connor.\nRealistically, Edwards was the standout candidate to lead a rebuild, with Connor describing her as a \"proven winner\". Following her stellar playing career, she has enjoyed considerable success as a coach.\nHer Southern Vipers have been the strongest team in English domestic cricket and Edwards' Southern Brave won the women's Hundred in 2023.\nOverseas, Edwards has led Mumbai Indians to two titles in three seasons at the Women's Premier League in India. In 2022, Edwards' Sydney Sixers were beaten in the final of Australia's Big Bash.\n\"When we drew up the criteria for the job it became apparent very quickly that Charlotte was the outstanding candidate,\" Connor added.\n\"She has the experience, passion and expertise to lead this team to success. The results she has achieved as a head coach in multiple environments, since retiring as one of the greatest ever England players, is testament to her relentless drive and the standards she sets for those around her.\n\"She is a proven winner; she has won repeatedly as a player and now as a coach. She possesses a deep knowledge of the game, both in England and across the world, and she understands the importance of creating an environment that is both challenging and supportive.\"\nEdwards will lead England in home white-ball series against West Indies and India this summer, building up to the 50-over World Cup in India in October.\nEdwards' former England team-mate Lydia Greenway, who has also coached with her at Mumbai, is confident the appointment will move England \"in the right direction\" after a difficult two years.\nA thrilling drawn Ashes in the summer of 2023 gave a sense of optimism under Lewis, but the two T20 World Cup disappointments either side of that and this year's thrashing to Australia left the team at a new low.\n\"The one thing with Lottie is the standards she sets, and what she expects of you as a player,\" Greenway told BBC Sport. \"Straight away, I've got no doubt in my mind that she'll go into that group and set out her expectations and her standards from the word go.\n\"I think everyone should be really excited by this appointment. We don't know whether there will be the success that we want, but what we do know is she'll move things in the right direction.\"\nOf the five domestic or franchise teams that Edwards has coached since 2020, they have finished in the top three of the group stages in their respective competitions in 16 of the 19 attempts.\nGreenway cautioned that Edwards would need to be given time to \"embed her style\" but the relationships that she has forged with England's players during her coaching tenure so far will be crucial.\nDean and opening batter Maia Bouchier have played for Southern Vipers under Edwards, spinner Sophie Ecclestone linked up with her at Sydney Sixers while experienced batters Danni Wyatt-Hodge and Knight played under her captaincy.\n\"It was one of the questions prior to the last cycle of recruiting a head coach: was it too soon for her to be working with some of her former teammates,\" Greenway said.\n\"But we're in a position where she's already gone through that experience of working with them and she's established herself now as a coach.\n\"When you go from playing to coaching, it does take you a while to get used to what your role is, so she's managed to navigate that journey already and she's clearly ready for it.\"\nBy Ffion Wynne, BBC Sport journalist\nIn the end, Edwards' appointment felt almost as inevitable as the sackings of Lewis and Knight which came before her.\nThere were murmurings of her potentially taking the vacancy before Lewis took the role in 2022, but Edwards wanted a little more time to establish herself in domestic cricket and around the franchise circuit.\nShe has done that with so much success, and Mumbai Indians' second Women's Premier League win just a couple of weeks ago felt poetic, like the cricket world was serving the ECB with a timely reminder of what and who was waiting for them.\nThere, she has also established a relationship with Sciver-Brunt, which could be crucial if the all-rounder is named as England's next captain.\nEdwards has a monumental rebuilding task on her hands, not only in developing the new captain but essentially, she needs to rebrand the team altogether.\nA humiliating month in Australia saw the team's fitness and athleticism questioned - not for the first time, either. Their attitude was criticised, fans accused them of not caring enough and there was tension between players and the media, too.\nCombined with how performances have stagnated on the pitch, particularly in the field and the inability to perform under pressure, Edwards has got her work cut out.\nBut those who know her best, including both Greenway and Dean, say there is nobody better suited to taking on a challenge.", "url": "https://www.bbc.com/sport/cricket/articles/cwy0lv33nv1o"}