{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:04", "date_modify": "2025-05-20 14:14:04", "date_publish": "2023-07-29 18:17:48", "description": "Worcestershire forge a dramatic late win over Gloucestershire to climb to second in County Championship Division Two.", "filename": "sport_cricket_66343079_1747750444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10264/production/_130584166_gettyimages-1483562009.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66343079_1747750444.html", "title": "County Championship: Worcestershire beat Gloucestershire for back-to-back victories", "title_page": "County Championship: Worcestershire beat Gloucestershire for back-to-back victories - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcestershire's seamers forged a dramatic late victory over Gloucestershire on the final day at the Cheltenham Festival.\nAdam Finch took 4-83, Dillon Pennington 4-63 and Joe Leach 2-57 as the visitors bowled out their neighbours for 311 to win by 110 runs with just 8.5 overs remaining.\nWorcestershire had declared overnight on 316-8, setting Gloucestershire a notional 421 to win in 96 overs.\nThey looked on course when reducing the hosts to 190-7 shortly before tea, only for brothers Jack and Matt Taylor to stage a defiant stand of 95 in 27 overs.\nIt took a late burst from Nottinghamshire-bound Pennington with the second new ball to end Gloucestershire resistance, as he removed Jack Taylor for a season's-best 98 and Zaman Akhter in the space of three balls.\nHe then bowled Paul van Meekeren to seal victory, leaving Matt Taylor stranded on 49.\nAfter back-to-back victories for the first time since 2019, Worcestershire's fourth win of the season lists them into second, 14 points above promotion rivals Glamorgan, 40 behind runaway leaders Durham - but 21 clear of fourth-placed Sussex, who have a game in hand.\nGoing into the five-week break from Championship cricket, Gloucestershire are still seeking their first win of 2023 after 11 matches. Only Yorkshire, docked 48 points by an ECB Cricket Discipline Commission panel, now sit below them in the table.\nRequired to score at 4.39 an over to break their long winless run, Gloucestershire never seriously considered victory after losing three wickets during the morning session.\nMiles Hammond and James Bracey shared a stubborn stand of 53 in 19 overs either side of lunch.\nBracey battled hard in scratching 19 from 64 balls before pushing at a ball from Leach, to fall to a fine diving catch by Gloucestershire old boy Gareth Roderick.\nThe returning Pennington then had Tom Price caught at the wicket without scoring in the next over to make it 130-5.\nHammond, Gloucestershire's most effective batsman in red-ball cricket this season, continued to serve up resistance, going to his eighth 50 of 2023 before playing on to Finch for 64.\nWith him went Gloucestershire's best chance of saving the game. Fired up and in the zone, the aggressive Finch generated additional pace to bowl Zafar Gohar in his next over from the College Lawn End.\nWith 40 overs still to negotiate, Gloucestershire were 190-7 and reliant upon their last recognised batsman, Jack Taylor, who at least reached the sanctuary of the tea interval unbeaten on 40 in partnership with younger brother Matt.\nAttack proved the best form of defence for the elder Taylor, who drove Leach down the ground for his ninth four to raise his first Championship 50 of the season from just 54 balls.\nHe was just two short of his hundred when controversy flared. Taylor blocked a ball from Pennington, who then attempted to shy at the stumps only to hit the batsman. Umpire Martin Saggers intervened as tempers flared, awarding five penalty runs to Gloucestershire and issuing Pennington with a verbal warning.\nPennington had the last laugh however, when Taylor dragged the next delivery onto his stumps to depart for 98.\nAkhter fell two balls later, edging Pennington low to first slip, leaving Gloucestershire on the brink. But it was another six overs before van Meekeren was removed to finish the job, Pennington's seventh wicket of the match.\nGloucestershire captain James Bracey:\n\"The feeling is one of frustration. It's a case of more of the same really. It's been a similar story all year, clinging on at the end and not quite good enough with our skills across four days.\n\"There are obviously encouraging glimpses - Jack Taylor, Miles Hammond and Matt Taylor all played well - but not enough to win us games.\n\"Ollie Price has taken the number three role with both hands, is settling down well and looks as though he can play there for years to come. Joe Phillips has looked pretty comfortable, a really good sign in only his second game. And Paul van Meekeren gave us a real threat with pace.\"\nWorcestershire head coach Alan Richardson:\n\"We've had some great individual performances, but I'm really pleased by the way the boys have gone about winning this game as a team.\n\"Joe Leach's burst of three wickets in 16 balls was crucial. That enabled us to build a first-innings lead. Once we'd done that, we were able to dictate the game as much as we could, set a target and bowl Gloucestershire out.\n\"Matthew Waite was also excellent. He showed his all-round ability. He gave us valuable runs at a time when we were not in a great position in the first innings, and then really kicked on at the end of the third day to put us in an even better position. His impact on that third night gave us the opportunity to win on the last day. It was all about reaching the last hour of the last session and being in with a chance.\"\nReport supplied by ECB Reporters' Network.", "url": "https://www.bbc.com/sport/cricket/66343079"}