{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-21 06:26:19", "date_modify": "2025-05-21 06:26:19", "date_publish": "2025-04-01 10:12:41", "description": "Hibs, Rangers & Glasgow City dominate SWPL team of the week after big wins", "filename": "sport_articles_cgm8g891y8po_1747808779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51be/live/1256d3f0-0e78-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgm8g891y8po_1747808779.html", "title": "Hibs, Rangers & Glasgow City dominate SWPL team of the week after big wins", "title_page": "Hibs, Rangers & Glasgow City dominate SWPL team of the week after big wins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lee Gibson (Glasgow City): The Scotland shot-stopper headed into the international break with a fine performance in a big win for Leanne Ross' side.\nNothing she could do for Saoirse Noonan's exquisite finish, but Gibson did come up with a big block with her boot and coped well with Celtic's second-half pressure.\nLauren Doran-Barr (Hibernian): The full-back is a consistent, solid performer for league leaders Hibs and her showing against her old side Motherwell was no different.\nOffered a calmness at the back alongside a somewhat inexperienced defence.\nLinzi Taylor (Hibernian): Speaking of an inexperienced defence... Taylor would surely rather be further forward, but she put in another performance out ofnposition for Grant Scott's side.\nShe excelled marauding forward, offering support to the midfield and getting stuck into tackles.\nKimberley Smit (Glasgow City): The centre-half fired a potentially priceless shot on goal late on against Celtic, which, after a wee deflection, found the net.\nUp until that late goal she commanded the backline well and dealt with the hard-to-handle Noonan.\nNicola Docherty (Rangers): Unsurprisingly, the Rangers supporter starred on the big Ibrox pitch and relished the space that often opened up in front of her.\nLinked up really well with Brogan Hay throughout the big win over Hearts.\nBrogan Hay (Rangers): So good I've swapped her on to the opposite flank. It really was Hay's day on Sunday and she rightfully earned praise from head coach Jo Potter.\nTwo goals and an assist. Not a bad day at the office.\nHannah Jordan (Spartans): Has to be attracting attention from top-six clubs. The 20-year-old has had a superb season for Jack Beesley's side and played a crucial part in what could prove to be a top-flight status-saving comeback against Montrose.\nAbby Callaghan (Queen's Park): Some way to mark your 100th appearance for the club.\nThe midfielder's finish in the 91st minute appeared to salvage a draw, but the Spiders went one better and found another late winner against Dundee United - just their third SWPL victory.\nAbbie Ferguson (Hibernian): A bundle of energy up and down the right wing for Hibs at K-Park. Skinned many a Motherwell player in an enthusiastic performance.\nBrenna Lovera (Glasgow City): The City forward had no right to open the scoring from where she did on Friday night, but it shows, when fit, she's one of the best finishers in the division.", "url": "https://www.bbc.com/sport/articles/cgm8g891y8po"}