{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:02:55", "date_modify": "2025-05-20 13:02:55", "date_publish": "2023-08-01 10:28:31", "description": "'Levels' above last season to the curious case of Carson", "filename": "sport_articles_cz4ygw7zv0zo_1747746175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f7b/live/d6071ac0-3054-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cz4ygw7zv0zo_1747746175.html", "title": "'Levels' above last season to the curious case of Carson", "title_page": "'Levels' above last season to the curious case of Carson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Jardine, Misery Hunters podcast, external\nHas that really been a whole summer? Having had just enough time to take a fortnight off, put the players through an intense Northern Irish fitness retreat, sign a couple of players and shift a couple of players - Stephen Robinson’s St Mirren are only a few days from resuming league duty and things are near unrecognisable from one year ago.\nFor starters, his side have managed to successfully negotiate their way out of an extremely winnable League Cup group. Last year was a toil against Arbroath and meltdown in Airdrie... This season has brought 94th-minute Toyosi Olusanya non-league glory and a comfortable time against Arbroath. Levels.\nPerhaps more importantly, Robinson enters this season with the weight of top-half expectation on his shoulders as opposed to the near-identical weight of bottom-half “you’re not Jim Goodwin” pressure he was carrying into the 1st gameweek last year.\nSt Mirren last season were a side defined by defensive resolve and commitment to counter attacking, mostly at home. By the time the split occurred, that unlikely three points richly deserved against Celtic in October proved to be the margin required to break through into the top six. Will they have such strength this season? We’ll soon find out.\nThus far, transfer business in Paisley has predominantly focused on changing a top-flight profligacy in front of goal that has been present for longer than the Saints have been playing in Ferguslie.\nRobinson a budget to work with courtesy of Eamonn Brophy and Jay Henderson sales and he opted to spend that cash on Glentoran’s international standout, Conor McMenamin. Nominally a winger, though one with an impressively consistent eye for goal at that level, McMenamin’s arrival would appear to herald an adjustment to how the Buddies will shape up this year.\nThe remaining situation to be resolved is that of Trevor Carson.\nA regular hero between the sticks last year in a season of incredibly tight margins week on week. For whatever reason, despite a contract extension agreed before even completing the first of his initial deal, Carson has decided that he’ll now be plying his trade elsewhere. With both club and manager firm in expecting a fee for their experienced international asset, Carson remains on the payroll, but without a squad number and watching loanee Zach Hemming take the #1 jersey and deputise from afar.\nFor Hemming, fresh from a very tough season in the top flight last year with Kilmarnock, this represents a significant step up in expectation and a leap of faith from his new manager. That pressure is only likely to increase the longer Carson remains in the same postcode.", "url": "https://www.bbc.com/sport/articles/cz4ygw7zv0zo"}