{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:00:58", "date_modify": "2025-05-20 13:00:58", "date_publish": "2023-08-01 11:46:32", "description": "Trent Alexander-Arnold on Liverpool vice-captaincy", "filename": "sport_articles_cq529zr2qvwo_1747746058.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c961/live/4c682b40-3056-11ee-8f3f-fd2cab24afae.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cq529zr2qvwo_1747746058.html", "title": "Trent Alexander-Arnold on Liverpool vice-captaincy", "title_page": "Trent Alexander-Arnold on Liverpool vice-captaincy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trent Alexander-Arnold says his vice-captaincy appointment was a \"special moment to remember\".\nManager Jurgen Klopp broke the news to the defender during one of the club's training sessions, where he learned he would be taking over the responsibility from James Milner.\n\"At first I thought he was going to tell me to stop giving the ball away. It was a lovely surprise and not one I was really expecting in that moment. It was special and a moment I will remember.\n\"I feel ready. I feel like, even before being put in this position, I have been a leader, leading in the things I do on a daily basis in training in and around the lads. I think the lads see me as someone in a leadership role.\n\"It's an amazing position to be in, but there is more responsibility on me now to make sure we succeed and achieve the things we want to this season.\"\nSpeaking before the squad's pre-season friendly against Bayern Munich, Klopp gave his reasons on his decision.\n\"The good thing for this team is that we had plenty of options - for the captaincy and vice-captaincy. I really thought Trent is ready for that,\" said Klopp.\n\"It's clear that at a club like this you need a specific DNA and if not him who could have that?\n\"It was always clear he knows how I value him. We had similar conversations about this in the past, when it was always about timing.\n\"I can imagine for a boy from Liverpool that for him and his family it is a big thing, but it is not because of that, it is because of the personality. I think he likes it and he deserves it, and that's it.\"", "url": "https://www.bbc.com/sport/articles/cq529zr2qvwo"}