{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:48:19", "date_modify": "2025-05-20 14:48:19", "date_publish": "2023-07-28 08:03:42", "description": "Donegal's 2012 All-Ireland winning captain Michael Murphy discusses key Dublin-Kerry match-ups, what All-Ireland final week is like and why Sunday's decider is nearly impossible to call.", "filename": "sport_gaelic-games_66325796_1747752499.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16DDA/production/_129285639_bbc-sport-project-chameleon-columnist-banner--06f228aa-be11-41e9-9ff1-a43e9ab58311.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_gaelic-games_66325796_1747752499.html", "title": "GAA All-Ireland Football final: 'Dublin vs Kerry has the makings of an epic decider' - Michael Murphy column", "title_page": "GAA All-Ireland Football final: 'Dublin vs Kerry has the makings of an epic decider' - Michael Murphy column - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal's 2012 All-Ireland winning captain Michael Murphy previews Sunday's All-Ireland Football final, looking at Dublin v Kerry match-ups, what All-Ireland final week is like for players and why this weekend's decider is so difficult to call.\nMany expected this year to produce one of the most wide-open football championships in recent memory, but here we are, building up to an All-Ireland final between the two aristocrats of Gaelic football.\nNot that I'm complaining. It's a classic heavyweight pairing. Dublin-Kerry finals are always occasions to savour and Sunday should be no different.\nIn one corner, you have a Kerry side one win away from becoming back-to-back All-Ireland champions, while in the other is a Dublin team hoping to avenge last year's semi-final loss to the Kingdom.\nDublin and Kerry doing battle in front of over 80,000 fans, it doesn't come much better in our sport.\nIt will be a joy to watch Kerry superstar David Clifford strut his stuff at Croke Park again, but Dublin have gotten the band back together again with Stephen Cluxton, Paul Mannion and Jack McCaffrey all returning this year. Their hand is stronger than last year, and make no mistake: they're coming for Kerry's title.\nThere is nothing quite like All-Ireland final week, but it can be hectic. I remember in the lead-up to our first final with Donegal in 2012, the county was in hysterics because we hadn't been in a final since 1992.\nWe got some good advice from Kerry's Kieran Donaghy on the dos and don'ts. It's important to stick to your close circle of friends because you'd be bombarded with ticket requests and people stopping you in the street to talk about the game.\nThey always meant well, but managing your energy levels is absolutely critical because your mind and body must be ready to go full-pelt for 70 minutes on the biggest stage of all.\nBut look, Dublin and Kerry have been here before. They got their media duties out of the way early so they have had a clear run into this final as regards their training and preparation. They will be ready.\nIt's remarkable just how similar these two teams are across every statistical category in the championship this season: attack, defence, kick-outs for, kick-outs against. The variances are minimal.\nIt's almost impossible to predict where one team can edge the other, but as ever, match-ups will be key to determining the outcome.\nWe'll start with the biggest talking point. How Dublin are going to handle David Clifford. Well, Mick Fitzsimons is Dublin's go-to man-marker. He shadowed Conor McManus in Dublin's semi-final win over Monaghan and I see him picking up Clifford. It'll be a fascinating battle.\nDublin may want to take a leaf out of Cork's approach to the Clifford conundrum. Cork have marked Clifford but they have played a sweeper, or plus one, primarily concerned with doubling on Clifford and a secondary focus on sweeping up around the D.\nThere is something in that for Dublin and I think they will have the opportunity to do it because Paudie Clifford, Dara Moynihan and Stephen O'Brien in the Kerry half-forward line are all likely to drop and build attacks from deep.\nI'd expect Eoin Murchan to mark Paudie Clifford. Derry's Conor McCluskey did a good job on Paudie in the semi-final and Murchan has a similar stature to him.\nYou'd then probably have Davy Byrne on Paul Geaney and John Small on Seanie O'Shea. They have met each other on a number of occasions in league and championship in recent years.\nO'Shea is coming into form for Kerry but Small is a competitive animal. He has a flexibility and versatility in his approach to marking that makes that particular battle really intriguing.\nIt's been said that Kerry are over-reliant on Clifford and O'Shea, but that's hardly surprising. Clifford is a generational talent and O'Shea is a brilliant forward, too. But the numbers don't lie. Clifford and O'Shea accounted for 64% of Kerry's scores against Mayo, 76% against Cork, 53% against Louth, 54% against Tyrone and 65% against Derry.\nFor Dublin, it could be as simple as 'how do we limit Clifford and O'Shea's figures?' That's easier said than done, admittedly, but it will have attracted a great amount of focus in the Dublin camp over the last fortnight.\nAt the other end, the Kerry defence will have their hands full with the Dublin forwards that will line out - Paul Mannion, Paddy Small, Niall Scully, Cormac Costello, Colm Basquel and Con O'Callaghan.\nWhile I would personally start Ciaran Kilkenny, I expect Dessie Farrell to give Niall Scully another opportunity and bring Kilkenny off the bench.\nThe fascinating thing is Kerry haven't yet faced a team with six forwards as potent as Dublin's. They are all direct, prolific forwards who all need individual attention. Jason Foley - who's had a strong season at full-back - will likely pick up the always-dangerous O'Callaghan, with Tom O'Sullivan on Costello and Graham O'Sullivan detailed to tag Basquel.\nSo, can Gavin White, Tadhg Morley and Paul Murphy in Kerry's half-back line handle Mannion, Small and Scully? White loves to get forward and attack while Morley likes to sweep, so it doesn't really add up for me. That may well be an area Dublin will set out to target.\nFinally, it will be worth keeping an eye on Jack Barry v Brian Fenton in midfield. They have history and there's a perception that Barry has had Fenton's number. He's kept him scoreless before and limited his influence, maybe up until the last time they faced each other.\nFenton is a talismanic figure for Dublin. He often dictates the tempo, like we saw in the semi-final against Monaghan when his two second-half points kick-started their revival.\nIt could be a key match-up. If Barry gets the upper-hand, it will be seen as a serious statement of intent from Kerry, but if Fenton prevails, the Dublin players will get a lift from seeing one of their leaders taking this final by the scruff of the neck.\nIt could be a huge day for these counties. Kerry have not won back-to-back All-Irelands since 2007 and have not beaten Dublin in a Sam Maguire decider since 1985.\nBut there's potentially a big story for three of Dublin's stalwarts as Stephen Cluxton, James McCarthy and Mick Fitzsimons are all going for a record ninth All-Ireland medal. A win would see them surpass a few Kerry greats who won eight, and while they would be quick to downplay individual accomplishments, that's got to be a major incentive for the entire Dublin group.\nWhatever way you look at it, it's going to be an epic conclusion to the inter-county season and a major new chapter written in this storied rivalry.\nPrediction: Dublin by two points\nMichael Murphy was speaking to BBC Sport NI's Matt Gault", "url": "https://www.bbc.com/sport/gaelic-games/66325796"}