{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-20 13:03:16", "date_modify": "2025-05-20 13:03:16", "date_publish": "2023-08-01 09:47:25", "description": "BBC Sport profiles five youngsters to look out for in the 2023-24 season, all aged 21 or under when the first ball of the new campaign is kicked.", "filename": "sport_football_66364178_1747746196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C8C8/production/_130600415_bbc-sport-index-imagery-2-split-images-gradient-21411c81-f40d-4b7d-a284-6b7bfc74a0ed.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66364178_1747746196.html", "title": "Premier League: James Trafford and Kobbie Mainoo among five 2023-24 breakthrough prospects", "title_page": "Premier League: James Trafford and Kobbie Mainoo among five 2023-24 breakthrough prospects - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The start of the month brings into focus the return of the Premier League, which begins on 11 August.\nBut who will be looking to make their mark in the English top flight? Which new faces could be the next Evan Ferguson or Rico Lewis?\nBBC Sport profiles five youngsters looking to break through in the 2023-24 season. The players we have selected will be aged 21 or under when the first ball of the new campaign is kicked.\nBurnley's James Trafford could well be a future England number one.\nThe 20-year-old goalkeeper starred for the Young Lions as they won the European Under-21 Championship this summer and the Clarets have brought him to Turf Moor from Manchester City in what could prove to be a club record deal worth £19m.\nAn incredible shot stopper, Trafford kept a record six clean sheets in the Euros triumph and brilliantly saved a late penalty before keeping out the rebound in the final win over Spain.\nTrafford is expected to compete for a regular slot with Arijanet Muric, who was a mainstay in goal for the Clarets as they won the Championship title at a canter last season.\nKobbie Mainoo is the teenager causing a stir among Manchester United fans after a promising pre-season, in which he started four games.\nThe technically gifted academy graduate is a holding midfielder, who can be utilised in other roles, with a calmness and poise in possession which belies his years.\nThe 18-year-old came off the bench in last season's win over Leicester to make his Premier League debut in February, and manager Erik ten Hag looks set to keep the teenager at Old Trafford this season rather than send him out on loan.\nMainoo will miss the start of the campaign after suffering an ankle injury against Real Madrid in pre-season, but expect him to challenge for a spot in the United side when he returns to fitness.\nAston Villa forward Cameron Archer has what it takes to trouble top-tier defenders.\nBlistering speed, close ball control and an eye for goal - Archer was influential on loan in Middlesbrough's run to the Championship play-offs last season, scoring 11 goals in 20 games.\nOllie Watkins is likely to lead the line again after excelling for Unai Emery's side last term, but Archer could be deployed alongside the more experienced 27-year-old or as a deputy from the bench if it is decided he will remain at Villa Park.\nHe scored the opening goal of England's winning campaign at the Under-21 Euros this summer and will be looking to add to his previous eight appearances in the top flight, which all came as a substitute after the 80-minute mark.\nBrighton have a successful record of unearthing young talent as academy graduate Evan Ferguson, 18, and summer signing Julio Enciso, 19, both broke into the first team last season.\nIvorian winger Simon Adingra could be the latest to emerge, having demonstrated he is a composed marksman with the pace to stretch defences.\nHe scored 10 league goals in 30 appearances on loan at Belgian side Union SG last season, following his move to Brighton from Danish club Nordsjaelland for around £6m in June 2022.\nThe 21-year-old has yet to make his competitive debut for the Seagulls, but he demonstrated prowess with both goals in Brighton's recent pre-season win over Brentford.", "url": "https://www.bbc.com/sport/football/66364178"}