{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:48", "date_modify": "2025-05-20 14:34:48", "date_publish": "2023-07-25 15:02:54", "description": "The date of the Irish Premiership match between Linfield and Cliftonville at Windsor Park has been switched from 5 August to 22 August.", "filename": "sport_football_66303807_1747751688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53B7/production/_130513412_ronandoherty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66303807_1747751688.html", "title": "Linfield v Cliftonville: Date of Irish Premiership Belfast derby at Windsor Park moved to 22 August", "title_page": "Linfield v Cliftonville: Date of Irish Premiership Belfast derby at Windsor Park moved to 22 August - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The date of the Irish Premiership match between Linfield and Cliftonville at Windsor Park has been switched from Saturday 5 August to Tuesday 22 August.\nThe game had been scheduled to take place at 17:30 BST on the first Saturday of the new league season.\nLinfield's continued involvement in the Europa Conference League led them to request an alternative date however.\nThe match will be streamed live on BBC iPlayer, the BBC Sport website and the BBC Sport app.\nA new date for the fixture was understood to be a matter of some debate between the clubs, who have now settled for a Tuesday night kick-off.\nLinfield will play the second leg of their Europa Conference League second qualifying round tie against Polish side Pogon Szczecin on Thursday 3 August.\nMeanwhile the fixture between Crusaders and Carrick Rangers at Seaview has also been moved from its initial date of 5 August to 22 August because of the Crues' participation in the Europa Conference League, in which they face Norwegian side Rosenborg.\nThe new Premiership season will begin with a derby encounter between Coleraine and Ballymena United on Friday 4 August, with that match also live on the BBC iPlayer, BBC Sport website and app.", "url": "https://www.bbc.com/sport/football/66303807"}