{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-05-21 07:46:22", "date_modify": "2025-05-21 07:46:22", "date_publish": "2025-05-20 11:35:58", "description": "Newcastle news: Opinion - 'Nobody wanted it to come down to this'", "filename": "sport_football_articles_c5yg54r1wy4o_1747813582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yg54r1wy4o_1747813582.html", "title": "Opinion - 'Nobody wanted it to come down to this' - BBC Sport", "title_page": "Newcastle news: Opinion - 'Nobody wanted it to come down to this' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We don't half make it hard for ourselves, do we? A loss at the Emirates this weekend sees us going into our last game of the season needing to win. Nobody wanted it to come down to this.\nIt is worth pointing out, though, that if someone told me in December that this is the position we would be in with one game to go - third, vying for a Champions League spot and ahead of Chelsea and Manchester City, I would have been absolutely buzzing.\nSo that is the feeling I'm trying to carry me through this week, instead of abject terror and generalised anxiety.\nOn the plus side, we get to end what will, however we place, go down as one of the best seasons we have ever had. Add to that the fact we get to end the season at home, St James' Park, cheering this group of players who made history for us, for themselves and for the city.\nAnd what of this group of players? We have to turn our attention to the window almost as soon as we finish the season. The wheels keep rolling. If we secure Champions League, we need to strengthen the squad. That means losing players. If we do not, we have less incentive for some of them to stay. That also means losing players.\nAs a fanbase, we are collectively getting our head around the idea that in this PSR age we will have to make some sacrifices. It tempers it all, I think, that we won a cup this season. Any of our players could leave Newcastle with a guard of honour now.\nIt will be interesting to see what movement there is this summer - but whatever happens, I'm glad St James' Park is the last game and we can give them the reception they all deserve, one last time.", "url": "https://www.bbc.com/sport/football/articles/c5yg54r1wy4o"}