{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:30", "date_modify": "2025-05-21 06:39:30", "date_publish": "2025-01-31 10:22:39", "description": "BBC Sport columnist Nedum Onuoha explains the effect the different mindsets of managers, physiotherapists and players can have on managing injuries.", "filename": "sport_football_articles_cy08p5jlvjyo_1747809570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e652/live/31f4e0b0-df59-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy08p5jlvjyo_1747809570.html", "title": "Nedum Onuoha column on Tottenham's injury crisis", "title_page": "Nedum Onuoha column on Tottenham's injury crisis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Whenever clubs suffer an injury crisis, it feels to me as if people often decide what is causing it without actually showing anything that backs it up.\nTottenham Hotspur are probably the best example of some of the myths that exist around this subject at the moment.\nAlthough they are far from being the only Premier League club to have several players sidelined at the same time, Ange Postecoglou's playing style, training methods and selection decisions are widely assumed to have been a major cause of their issues.\nMy concern about focusing on those aspects is that people are not considering the perspectives of the actual people involved - the manager, the medical staff and the players themselves.\nAll three will have a very different mindset when it comes to managing injuries, and will be feeling different pressures that affect their decisions.\nMore than anything else, that is what has led to the kind of scenario we are seeing at Spurs.\nI am certainly not against using data, as a broad term, to help explain why injuries happen - as long as it is relevant.\nThere are times, however, where people seem to want to use a subconscious bias to decide why something is happening. In the case of Spurs, it has been suggested their players get injured because Postecoglou makes them run around too much.\nHistorically, when I think about teams who have played with a high intensity, and sustained it over multiple seasons, then Jurgen Klopp's Liverpool instantly stand out. Not only were they successful, they were not known for suffering multiple injuries that derailed them the way it has happened at Spurs.\nI am not even sure Tottenham's style is that demanding anyway. People seem to have made their minds up about that, without watching them that closely.\nIs it their centre-backs or full-backs being asked to get forward into midfield that is meant to be causing them to break down? Because we have seen plenty of other teams doing the same without the same issues, including Celtic's defenders when Postecoglou was manager.\nWith Tottenham's centre-backs specifically, they are often on the halfway line and standing one-on-one with the opposition forwards, chasing players. That's exactly the same way Arsenal, Manchester City and Liverpool play, but there seems to be this idea that Spurs do something different.\nIt's similar when people talk about their intensity in training. I don't know exactly what they do in their sessions, but I saw an interview on the BBC website with someone who does - Anton McElhone, Postecoglou's former fitness coach at Celtic.\nMcElhone says the biggest adaption the players go through is when Postecoglou first arrives. He spoke about how it took Celtic's players a period of time to get used to that way of playing and training, which was when they were more susceptible to injury, but once they had done that, they were fine.\nHe seemed surprised Spurs are going through this now, because it is something he thought could have happened last season.\nIf it is happening in year two, then it is down to something different.\nIn an ideal world, the manager listens to the medical staff, who are in tune with the players' fitness levels and their needs around any injuries.\nWhen all three groups are working in harmony like that, it is best for everyone. But if results become an issue then all of a sudden everyone feels a different kind of pressure. People are more willing to take a risk.\nIf you are winning you can keep someone on the sidelines for longer, but no-one feels that way if the team is struggling.\nSuddenly the manager, physiotherapist and the injured player all feel the need for them to get back as quickly as possible, in order to help.\nI have seen situations where a player is out for four-to-six weeks, but by week three the manager is asking if he is nearly ready yet. As a player, what do you say to that? You don't want to be seen as reluctant to return.\nIn an ideal world, the physio is obviously the one who should be empowered to make the decision whether someone is fit or not, but no physio feels under more pressure than when their treatment room is full.\nThey can be questioned both ways - if a player gets injured again, or if they are not coming back quickly enough. Often they are led by what a player tells them, and it is hard to say no.\nIf you have spent time in a professional dressing room then you will know there are many players who carry niggles almost constantly, but they will do anything they can to make themselves available for the team.\nThey might not be 100% fit, and they might be taking painkillers or having extensive treatment, but a lot of the time they will say they are fine.\nThey feel they can play and they want to play, to do their bit for the team, and that is even more the case if - like Spurs - the team is not doing very well or is short of players and they are desperate to help.\nThat was the case with Pape Matar Sarr in Tottenham's defeat by Leicester - Postecoglou said afterwards that he wasn't fit but he still wanted to play.\nThe medical team will give their opinion to the manager too, but in my experience the player's desire is key.\nSo, while a lot of Spurs fans might see the return of Cristian Romero and Micky van de Ven from injury against Chelsea in December as being a risky Postecoglou decision that has proved extremely costly, I don't see how you can put it down to it being his call.\nAlthough they were both forced to come off in that game and have not played since, it is highly likely they were desperate to play and, like Sarr, went out there thinking they could make a difference for the team - but instead ended up back in the treatment room.\nFrom experience, your playing schedule is likely to have far more impact in terms of injuries than your team's playing style.\nPlaying games every three or four days, and going on international duty as well, adds up over time, but it becomes a bigger issue when you have a few injuries to deal with too.\nThe hardest thing in football comes when you are never able to get on a run of games because you are never really match-fit.\nThe more people who are like that in your squad, the bigger the problem is, and the greater the likelihood is of getting recurring injuries.\nManchester City's issues with their centre-backs this season is a prime example of that. In the past, the likes of Ruben Dias, John Stones, Nathan Ake and Manuel Akanji have all been rotated by Pep Guardiola, but they have largely been selected - or not - by choice.\nThis time, they have all suffered injuries that have seen them come in and out of the team. It has largely only been one little niggle after another, rather than anything long term, but it has still had a massive effect.\nWhen you have a full squad available, you can make little changes the way City usually do and, as a consequence, spread out the workload and allow people to come in and out of the team.\nBut if you have a few injuries, including the ones you pick up randomly from bad tackles, which are out of your control and are the element of bad luck I mentioned earlier, things can quickly snowball.\nFrom the moment you are missing a few players the situation can escalate the way it did for City and Spurs, because you are left with so few fit senior players that you cannot rotate them to try to help them out.\nInstead, you are stuck in the same cycle and things are more likely to get worse - even when you are doing things for the right reasons.\nNedum Onuoha was speaking to BBC Sport's Chris Bevan.", "url": "https://www.bbc.com/sport/football/articles/cy08p5jlvjyo"}