{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:20:33", "date_modify": "2025-05-21 06:20:33", "date_publish": "2024-12-24 12:18:31", "description": "Ireland wing Jacob Stockdale ends speculation over his future by signing a new two-year deal with Ulster, keeping him at the club until 2027.", "filename": "sport_articles_c9vkxd0zy3zo_1747808433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4743/live/8cb78ae0-c1f2-11ef-b28c-1f5932281567.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9vkxd0zy3zo_1747808433.html", "title": "Jacob Stockdale: Ireland winger signs new two-year deal with Ulster", "title_page": "Jacob Stockdale: Ireland winger signs new two-year deal with Ulster - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland wing Jacob Stockdale has ended speculation over his future by signing a new two-year deal with Ulster, keeping him at the club until 2027.\nThe 28-year-old had been linked with a move to France, but has committed his future to the Belfast-based club for the duration of the current World Cup cycle.\nStockdale enjoyed a strong 2023-24 season with nine tries in 16 United Rugby Championship games and has added three this term, leading to his Ireland return in last month's Autumn Nations Series win over Fiji.\nThe 2018 Six Nations Grand Slam winner and player of the tournament has made 127 appearances for Ulster having broken into the team in 2016.\n\"I'm delighted to sign for the next couple of seasons here,\" said Stockdale, who has 38 Ireland caps.\n\"I feel good about where my game is at and where this team is heading. There is a lot of excitement around the place with the young players coming up and I am enjoying my role as one of the experienced players in the team.\"\nStockdale has not played for Ulster since 18 October having returned from Ireland duty with what the club's head coach Richie Murphy described as a \"significant\" hamstring injury.\nUlster general manager Bryn Cunningham said: \"Securing Jacob's future is key for us, given his importance in the team. It was no surprise to hear about interest in his signature from elsewhere, given his talent and special skillset.\n\"We believe we are seeing Jacob get back to the form he was showing before his long-term ankle injury a couple of years ago. He has showed great resilience and hard work to get back to that level of strength and fitness.\n\"A fit and confident Jacob is one of the deadliest wingers in rugby and we think the next couple of seasons will see the peak years of his career, both for Ulster and on the international stage in a green jersey.\"\nStockdale is the latest in a series of Ulster contract extensions in recent weeks with Ben Carson and Mike Lowry also having extended their deals. Ireland Sevens star Zac Ward also penned a three-year contract with the province after a successful trial period.", "url": "https://www.bbc.com/sport/articles/c9vkxd0zy3zo"}