{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:03:48", "date_modify": "2025-04-26 04:03:48", "date_publish": "2025-03-03 19:39:56", "description": "All you need to know about Natasha Jonas and Lauren Price's unification fight on Friday night.", "filename": "sport_boxing_articles_clyrrzpm23jo_1745640228.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a558/live/cd91e560-f9f1-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_clyrrzpm23jo_1745640228.html", "title": "Natasha Jonas v Lauren Price: Date, UK time, records, radio, full card including Dubois fight", "title_page": "Natasha Jonas v Lauren Price: Date, UK time, records, radio, full card including Dubois fight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Welterweight world champions Natasha Jonas and Lauren Price collide in a brilliant fight on Friday night in London.\nThe domestic rivals headline an all-women fight card at the Royal Albert Hall, with world champion Caroline Dubois also in action.\nJonas, 40, is the underdog against rising-star Price, formerly an Olympic champion in the amateur ranks.\nLive text commentary will begin at 20:00 GMT on fight night, with radio commentary from 21:00 available on the BBC Sport website and app.\nWill there be a passing of the torch? Can Jonas become the first fighter to defeat Price?\nHere's everything you need to know about the exciting fight night...\nLive text commentary of the fight night will begin at 20:00 on the BBC Sport website and app.\nYou will be able to follow build-up to the main event, as well as coverage of Dubois' world title fight.\nRadio coverage starts at 21:00 on BBC Radio 5 Live and BBC Sounds.\nBBC Sport will bring you coverage from the entire fight week, with Steve Bunce also delivering episodes of his 5 Live Boxing with Bunce podcast.\nOn fight night, Becky Ives will present from ringside, with commentary from Ronald McIntosh, Bunce and unified super-bantamweight champion Ellie Scotney.\nExperience is the biggest difference between Jonas and Price. Jonas has 19 pro fights under her belt and made her amateur debut way back in 2006. She made history as the first female boxer to represent Team GB at the Olympics in 2012 and has won world titles in two different weight classes.\nPrice made her amateur debut in 2011 and, using the path Jonas blazed for her, was able to achieve her ultimate goal of becoming an Olympic champion at the Tokyo Games.\nShe is 8-0 in her pro career, winning her maiden world title in just her sixth fight.\nWhile experience may be against her, age is certainly on Price's side. She is 10 years Jonas' junior, who will turn 41 in June.\nJonas, however, is in the form of her life and put on hold her plans to retire when she entered her current purple patch. She has won her last seven fights, winning five world titles across two weight divisions.\nThe Liverpudlian has also faced the best of the best in Katie Taylor, Terri Harper and Mikaela Mayer. Jonas' two losses were to Ireland's Taylor and Viviane Obenauf, while she drew with Harper, making her record 16-2-1.\nPrice's best win came over former undisputed champion Jessica McCaskill last year, when she outclassed the American to win the WBA belt. She has won almost every round of her pro career and is yet to be truly tested by an opponent, albeit against much less prestigious opponents than Jonas.", "url": "https://www.bbc.co.uk/sport/boxing/articles/clyrrzpm23jo"}