{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:15", "date_modify": "2025-05-21 07:31:15", "date_publish": "2025-03-29 00:00:00", "description": "All the reaction as England score 11 tries on the way to a comprehensive win over Wales in Cardiff.", "filename": "sport_rugby-union_live_crk0505z7ykt_1747812675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8454/live/23da1fb0-0cca-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_crk0505z7ykt_1747812675.html", "title": "Watch Women's Six Nations: Wales 12-67 England", "title_page": "Watch Women's Six Nations: Wales 12-67 England - reaction to England's 11-try victory in Cardiff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye from Cardiff\nFT: Wales 12-67 England\nWell just for a moment, for 10 minutes, we wondered if Wales could mark the 10-year anniversary of their last win over England with a repeat after Jenni Scoble's early try.\nBut that simply stirred the beast as England smashed their hosts with 11 tries to stay in control of the Six Nations.\nEllie Kildunne celebrated her 50th cap with a hat-trick of tries and a player of the match display as the world's number one team showed their class.\nMaddie Feaunati and Abby Dow both scored twice - as did Abi Burton in a remarkable nine-minute emotional Test debut.\nCardiff-born Meg Jones and Sarah Bern added scores as England ran riot.\nKate Williams crossed in the second half for Wales as the Sean Lynn era waits for its first win.\nBut at least it gave a Welsh record crowd of 21,186 something to cheer.\nThe Six Nations takes a break next week but you can follow all the latest news on the BBC Sport website.\nSo from Cardiff... hwyl fawr.\nReport: England in 11th heaven in front of record Wales crowd\n'Positives to take from game' - Jones\nFT: Wales 12-67 England\nWales captain Hannah Jones told BBC Sport: \"We can take some positives from the game.\n\"There's a lot to learn and we've got to learn fast, they're the number one in the world for a reason.\n\"At times we took them to a dark place and that's what we wanted to do.\n\"Sean Lynn brings us passion and energy, he's a proud Welshman.\n\"He's got the experience of working with us at Gloucester Hartpury, he's got that winning mentality.\"\n'We can't afford to get bored with the basics' - Mitchell\nFT: Wales 12-67 England\nEngland head coach John Mitchell told BBC Sport: \"We didn't start particularly well, but we grew into the second half, and built some good pressure.\n\"I'm really glad the way we responded to what Wales did to us.\n\"I think we're a side that can't afford to get bored with the basics, because when our basics are poor that lets us down and brings the opposition into the game.\n\"I think we had 450 more kicking metres, we went after the middle of the pitch and eventually the back-field came.\n\"I think we've got the best team in the world in terms of where our kicking is progressing. Andrew Holloway that works with girls is really advancing in that area.\"\nA lot of emotions for England's Cardiff-born Jones\nFT: Wales 12-67 England\nEngland's Cardiff-born centre and try-scorer Meg Jones told BBC Sport: \"I haven't played here [at the Principality Stadium] since I was 12 years old so it was great to get a runout.\n\"There have been a lot of emotions this week that I've tried to hold in but then I heard both anthems and it was emotional.\n\"I just tried to enjoy it as much as possible.\n\"We played some good rugby but we're always hyper-critical and there were a few errors out there. But we stayed on top.\n\"The competition is really pushing us on. Emily Scarratt is my competition so you can imagine how that pushes you.\n\"But we have to keep our feet on the ground as we look to progress. It's about the here and now.\"\n'Every game we've got to get better' - Lynn\nFT: Wales 12-67 England\nWales head coach Sean Lynn told BBC Sport: \"A massive thank you to everyone that's come here today, what an amazing occasion.\n\"Everything I've talked about is making sure we're always moving forward, I thought some of our attack today was outstanding but we just fell away.\n\"We have to remember we're playing against the best team in the world.\n\"We have to get better, every game we've got to be getting better. We've got France, Ireland and Italy left, and we've got to keep getting better and better. Simple.\n\"I was asking them 'how hard are they willing to fight for each other' and they certainly showed they could today.\"\n'We're going to keep on getting better' - Kildunne\nFT: Wales 12-67 England\nPlayer of the match Ellie Kildunne told BBC Sport: \"Honestly it doesn't get better than that\n\"You can't write it, I couldn't have imagined it, everything today has just fit in.\n\"We've still got a lot to work on, but to walk out on my 50th cap in front of such a great crowd in an amazing stadium is something I'm very honoured for.\n\"Pressure is definitely a privilege, every time we step out as an England squad we want to surprise, and raise the expectation because we want to keep on going. We're not at our best yet, we're going to keep on getting better and there's a lot more to come.\n\"[We could achieve] the unimaginable. We're going to keep on getting better, I really think we're going to go to levels we've never been to before!\"", "url": "https://www.bbc.com/sport/rugby-union/live/crk0505z7ykt"}