{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:29", "date_modify": "2025-05-21 03:49:29", "date_publish": "2025-04-07 11:56:42", "description": "Celtic fan views: 'Appalling attitude from the players'", "filename": "sport_articles_cy70x83jp1zo_1747799369.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd61/live/1632f6b0-139c-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy70x83jp1zo_1747799369.html", "title": "'Appalling attitude from the players'", "title_page": "Celtic fan views: 'Appalling attitude from the players' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic fans, we asked for your views on the 1-0 defeat to St Johnstone at the weekend.\nHere's what some of you said:\nBrian: Lots of mentally tired players in Celtic these days. Hopefully they will bounce back at the next game, still a comfortable lead in the title race. Lots of good players just lacking composure in the final third and lacking a full-time striker.\nDavid: It was obvious from kick off that the Celtic players were complacent and their opponents were much more motivated. Nicolas Kuhn has been woeful in a number of games and Celtic's style of play needs fully functioning wingers. Yang Hyun-Jun needs to start and Luke McCowan should be given a starting berth. Their mindset is not 'on it' and it's not fair on travelling fans.\nMartin: An appalling attitude from the players overall. We seem unable to defend cross balls and our finishing was poor. Individuals can have a bad game occasionally, but we seem to have them in unison.\nStephen: That was awful to watch, just awful. Saints deserved their victory, and I hope they can do enough to stay up. Far too many players not showing up at the moment! I'm also at a loss as to why Auston Trusty was brought in to improve our forward advancement on the left, when he then passes the ball across to Cameron Carter-Vickers? Simo Valakari would have known how to set up against Celtic when he managed Riga. As for Brendan Rodgers' strategy? Bring on substitutions around 60 minutes, it's becoming boring and predictable, and I think it's time for change.\nMark: Celtic had enough chances to at least have had a draw, it wasn't a performance to set alarm bells ringing, it was just that we were up against a team that were fighting for their Premiership lives, the title is already won.", "url": "https://www.bbc.com/sport/articles/cy70x83jp1zo"}