{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:44:51", "date_modify": "2025-05-21 04:44:51", "date_publish": "2025-02-09 00:00:00", "description": "Watch live BBC television coverage, listen to radio commentary and follow text updates as Scotland host Ireland in the Men's Six Nations.", "filename": "sport_rugby-union_live_cwy34169yn9t_1747802691.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_cwy34169yn9t_1747802691.html", "title": "Scotland vs Ireland LIVE: Six Nations rugby kick-off time, score, TV stream, lineups & updates", "title_page": "Scotland vs Ireland LIVE: Six Nations rugby kick-off time, score, TV stream, lineups & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ta-ra\nFT: Scotland 18-32 Ireland\nRight, that's all from us this afternoon as Ireland cruise past Scotland at Murrayfield in their quest for a third successive Six Nations title.\nYou can read Tom English's report or scroll back through this page to relive the action.\nThanks for your company. Go and enjoy the rest of your evening, or sit in a darkened room if that's what you need.\n'We managed the game well throughout'\nFT: Scotland 18-32 Ireland\nIreland interim head coach Simon Easterby tells BBC Sport: \"We did what we set out to do in the game. We started strongly and limited Scotland to a few opportunities in the first half.\n\"We felt like we had control of the game in the first half and the scoreline reflected that.\n\"We were good at not giving their individuals opportunities. They were hamstrung by injuries to Finn Russell and Darcy Graham, but we delivered an intent to attack in the right way.\n\"I thought Sam Prendergast put us in the right areas more often than not and that is what you need.\n\"We managed the game well throughout.\"\n'Scotland have to fix drop-offs'\nFT: Scotland 18-32 Ireland\nJohn Barclay\nFormer Scotland captain on BBC One\nThe nature of that game is slightly alarming for Scotland, the first 30 minutes or so.\nAgainst a team you have such a poor record against, you have to start well.\nThey have to look at how they fix these drops in performances in matches. That level of consistency, especially away from home - they will have to be much better against England.\n'Ireland showed how clinical they are' - Townsend\nFT: Scotland 18-32 Ireland\nScotland head coach Gregor Townsend has been talking to BBC Sport, and starts with a couple of injury updates:\n\"Finn [Russell is] fine. He actually passed his HIA but our staff sensed he wasn't totally aware of what was going on, so we made the call to not put him back on.\n\"Darcy [Graham] is at hospital now, I've not had an update. I think everything was OK with his neck but they were checking out concussion.\n\"Both Stafford McDowall and Jamie Dobie did really well, and Tom Jordan going to 10 did well too.\n\"When they had the ball, they scored. The yellow card made it tough for us to get back in the game. Then the injuries disrupted things.\n\"I felt the players were building back into the game, but once Ireland got back into our 22 they showed how clinical they are. When you are behind on the scoreboard against a quality side, you need to make sure they don't get more opportunities.\n\"We'll get learnings. Accuracy would be the number one thing.\"\n'Scotland have underperformed against Ireland again'\nFT: Scotland 18-32 Ireland\nDonncha O'Callaghan\nFormer Ireland lock on BBC Radio 5 Live\nThis Ireland team can get an awful lot better.\nThey'll come away from this game and have areas to improve on and get better.\nI think Scotland got the wrong set-up today - they tried to run from too far in their half, the players lacked physicality and though they brought that in the second half, they left themselves too much work to do.\nThey'll be frustrated because yet again Scotland have underperformed against Ireland.\n'That's a sore loss'\nFT: Scotland 18-32 Ireland\nScottish co-captain Rory Darge has been speaking to BBC Sport.\nOn the loss of Finn Russell and Darcy Graham in the first half: \"Obviously it's tough to deal with. Two very important players going down.\n\"Hopefully they're all right. I think they're both OK but I'm not sure.\"\nOn the difference between the two sides: \"The boys hung in there but we're obviously disappointed with the result in the end.\n\"The difference was probably their clinicalness in the finish zone. We had a few opportunities, showing a little bit, but not taking them or converting them into scores.\"\nOn preparations for England next up: \"Initially with the week off, get some time away. That's a sore loss we've to take on the chin.\n\"But by the time we come back into camp, make sure that we're ready to go.\"\n'Ireland on for three-peat'\nFT: Scotland 18-32 Ireland\nJohnnie Beattie\nFormer Scotland back row on BBC Radio 5 Live\nIreland were probably in third gear. Two or three tries went begging where they were held up over the line in the first period. I don't think the personnel leaving the field actually made that much of a difference.\nThe difference in quality was there for all of us to see.\nIreland are on for a three-peat - they're an outstanding outfit.\n'It felt like a 40-point win'\nFT: Scotland 18-32 Ireland\nRonan O'Gara\nFormer Ireland fly-half speaking on BBC One\nIf you're looking for a formula of how to go away and win in the Six Nations I think you should study that.\nIt was ruthless from minute one. Total domination. Scotland didn't get any in. Normally in a Test match the lead changes hands a couple of times and it's in the balance.\nToday the biggest surprise is that it finished 32-18. It felt like a 40-point victory and maybe if Ireland need to, I think they've another couple of gears to go.\n'Not perfect but better' - Prendergast\nFT: Scotland 18-32 Ireland\nIreland fly-half Sam Prendergast has been given the player of the match award: \"It was an unbelievable game and a savage atmosphere. The anthems were pretty special.\n\"I thought we started unbelievably in the game. We put so much pressure on. We did really well in the second half when they got their purple patch to come back.\n\"It wasn't perfect from us but it was better than last week and we'll keep trying to get better week on week.\"", "url": "https://www.bbc.com/sport/rugby-union/live/cwy34169yn9t"}