{"authors": ["Carl Roberts", "www.facebook.com"], "date_download": "2025-05-21 07:35:23", "date_modify": "2025-05-21 07:35:23", "date_publish": "2025-05-20 15:59:02", "description": "Former Wales striker Sam Vokes is \"truly gutted\" to be leaving Wycome Wanderers after four years.", "filename": "sport_football_articles_cgegg1e3j8yo_1747812923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b522/live/650946a0-3583-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgegg1e3j8yo_1747812923.html", "title": "Sam Vokes: Ex-Wales striker 'gutted' to leave Wycombe Wanderers", "title_page": "Sam Vokes: Ex-Wales striker 'gutted' to leave Wycombe Wanderers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wales striker Sam Vokes says he is \"truly gutted\" to be leaving Wycombe Wanderers after spending four years at Adams Park.\nWycombe announced on Tuesday that Vokes was among six senior players leaving the club at the end of their contracts.\nThe 35-year-old striker scored 28 goals in his 125 League One appearances for the club after joining from Stoke City in 2021, and has more recently been involved in the Wanderers' coaching team.\nWycombe were knocked out of the League One play-offs by Charlton Athletic after finishing fifth.\n\"After finding out this morning I'll be leaving this special club after four years, I can only say I'm truly gutted,\" said Vokes, who is part of the BBC Sounds Feast of Football podcast team.\n\"I'd always heard about the great culture and good people at the club, so to be brought in by [former manager] Gareth Ainsworth to be part of that group and getting to know the players and staff has been an absolute pleasure.\n\"When I joined Wycombe, I was desperate for success and to be part of something special. While we've come very close a few times, it's been amazing to create and be part of some truly special moments.\"\nA knee injury and a recent broken arm - picked up in the final regular League One fixture of the season against Stockport County - limited Vokes to seven substitute appearances in the league this season, scoring twice.\nIn an open letter written to Wycombe fans, Vokes said he had \"more to offer on the pitch\" but did not give any hints as to his future plans.\nVokes won 64 caps for Wales between 2008 and 2019, scoring 11 goals, including one of the most memorable goals ever scored by a Welshman against Belgium in the quarter-finals of Euro 2016.\nHe has also played for Burnley and Wolverhampton Wanderers in the Premier League.\nVokes said a recent stint as part of the Wycombe coaching team under interim manager Sam Grace and then Mike Dodds has been \"an honour and a huge learning curve\".\n\"I'd like to take this opportunity to thank every player, staff member and fan of this club for being part of my journey here at Wycombe,\" he added.\n\"I know this club has changed a lot over my four years, but I hope that culture, work-ethic and core values remain and I wish the club every success going forward.\n\"Up the Chairboys, Vokesy.\"", "url": "https://www.bbc.com/sport/football/articles/cgegg1e3j8yo"}