{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 05:20:12", "date_modify": "2025-05-21 05:20:12", "date_publish": "2025-01-23 09:51:09", "description": "Tom English on Amad Diallo's ascent from an underwhelming loan spell at Rangers to be the shining light amid Manchester United's gloom.", "filename": "sport_football_articles_cwypj8dx5ryo_1747804812.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ae0/live/93d75750-d927-11ef-a37f-eba91255dc3d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwypj8dx5ryo_1747804812.html", "title": "Manchester United v Rangers: Amad Diallo's rise from loan spell", "title_page": "Manchester United v Rangers: Amad Diallo's rise from loan spell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The moment Amad Diallo appeared at Ross County's back post to score five minutes into his debut for Rangers in January 2022, some of the 19-year-old's new team-mates looked at each other with a sense of excitement and anticipation.\nThey had heard about the young Ivorian's £19m (plus almost the same again in add-ons) move from Atalanta to Old Trafford and in the early training sessions of his six-month spell in Scotland they had seen his pace, his trickery and his two-footedness.\n\"I remember everyone speaking about how good a signing this boy was going to be for us,\" recalls Scott Arfield, a member of that Rangers squad.\n\"Watching him in training, he reminded me a bit of James Maddison, who I'd played with at Aberdeen,\" says Ryan Jack, the former Rangers and Dons man.\n\"When you looked at Amad, you knew he had something different. There were things that were next level about him. Passing drills, finishing drills, small-sided games. The way he struck a ball.\n\"You could tell in his first sessions with us he had this ability to step past players with relative ease,\" says Steven Davis, a veteran of that Rangers side.\n\"He wasn't big, but he was deceptively strong. He was hard to knock off the ball. And then he scores a few minutes into his debut.\"\nThis is the story of Diallo's time at Rangers, a time that most football people in Scotland - including many at Ibrox - cannot remember a whole lot about.\nDiallo is now a bright light in the Old Trafford gloom, the scorer of a late hat-trick against Southampton, the guy who came up with the 80th-minute equaliser against Liverpool and the 90th-minute winner against Manchester City at Etihad Stadium.\nHe scored a 120th-minute winner against Liverpool in a 4-3 FA Cup epic last season. He got 14 goals during a coruscating loan spell at Sunderland the season before.\nBefore that, it was Rangers and the terrific start in front of fewer than 6,500 people in Dingwall. But after that promising beginning, well, it got difficult, put it that way.\nLike a giddy kid, which he was, he went on Instagram after the Ross County game and posted a highlights reel of his best moments. Scotland wasn't having it. He got pilloried, which was the start of what Jack calls his \"massive learning curve\".\nRangers played 29 games in Diallo's time in Glasgow, he appeared in 13 of them and started just six. Celtic away was his second game.\nThat night was peak Ange Postecoglou at Celtic; 3-0 ahead at the break, and cruising. Players-turned-pundits lined up to kick Diallo in the aftermath - \"a rabbit in the headlights\", \"in the wrong movie\", \"half-hearted\".\nHe did not reappear for the second half and now the brutal reality of how claustrophobic and unforgiving life can be if you are playing for the beaten half of the Old Firm hit him between the eyes.\n\"There was a big reaction to his performance that night and it was unwarranted,\" recalls Davis. \"We know what the goldfish bowl is like in Glasgow and when you don't have a good performance, you're the worst in the world.\"\nArfield said he was troubled when Diallo came in for such stick at the time: \"I didn't think you could pin that defeat on him. We were miles off it as a team, all of us. But he seemed to come in for particular criticism. And I remember just thinking, 'wow, this is a real welcome to Rangers'.\"\nThe intensity was too much and Diallo faded away. Arfield, Aaron Ramsey, Joe Aribo and Scott Wright were all given time in his position. He got five minutes against Heart of Midlothian and 17 minutes against Dundee United.\nAgainst United, he hit the post at 1-1. Had he squared it instead of going for goal, Rangers would have scored. They dropped points they could ill afford to drop that day.\nThen, 23 minutes against Dundee, 27 minutes against St Mirren, half an hour against Motherwell, three minutes against Celtic. He was still only 19. Alien city, demanding club and now racism.\nOn Instagram he spoke about getting racist slurs and insults about his mother. He did not elaborate on where the abuse came from - in a stadium or online - but it was a grim period for him.\n\"As a practising Muslim I was raised differently and my education is to respect everyone,\" he wrote.\nRangers were galloping through the Europa League at this point. Borussia Dortmund, Red Star Belgrade, Braga, RB Leipzig and then Eintracht Frankfurt in a final they lost on penalties. Diallo was an unused substitute all the way.\nHe scored a couple of goals in his last games, played an anonymous part in their Scottish Cup final win over Hearts, then headed back to Manchester.\nHe was another kid from a big English club that came up the road with a big reputation and went back down a diminished character.\nOr so we thought. Arfield tells a story from that Europa League run, a morning training session after an away game against either Red Star or Leipzig. It is an insight that reveals Diallo's character and quality.\n\"It was a runout for those of us who didn't play the night before or who only got a few minutes,\" Arfield says.\n\"I'm there with Amad, a kid who's not playing much and who must have been feeling a bit low. He trained the house down. Honestly, he absolutely tore into it.\n\"We were only supposed to be getting a bit of a sweat on, but he was a proper mentality monster. I'm thinking, 'with that talent and desire, this boy is going to be worth watching'.\n\"Did I think then that he would make it at Manchester United? The honest answer is probably 'no'. The way they buy and sell players I didn't think he'd get the opportunities.\n\"But when I saw him ripping it up with Sunderland after he left us I'm was thinking, 'he's learned from the experience in Glasgow and he's better for it'.\"\nJack talks about talent not being enough in the rarefied air of Premier League football.\n\"There are plenty of players with talent, but they need more and Amad has it,\" he adds.\n\"He was so young when he joined Rangers, he was quiet and in a dressing room of big characters.\n\"The language barrier, that Celtic game, all that time sitting on the bench. All of that played its part in his journey. Now look at him. It's an amazing story.\"", "url": "https://www.bbc.com/sport/football/articles/cwypj8dx5ryo"}