{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:13:09", "date_modify": "2025-05-20 12:13:09", "date_publish": "2023-08-04 17:14:02", "description": "MK Dons sign former Morecambe forward Ashley Hunter, the third time he will have played under boss Graham Alexander.", "filename": "sport_football_66410041_1747743189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0E7A/production/_130660730_shutterstock_editorial_13794834aa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66410041_1747743189.html", "title": "Ashley Hunter: MK Dons sign former Morecambe forward ahead of new season", "title_page": "Ashley Hunter: MK Dons sign former Morecambe forward ahead of new season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "MK Dons have signed former Morecambe forward Ashley Hunter, their seventh recruit of the summer transfer window.\nThe 27-year-old made 21 appearances for Morecambe last season, with his only goal coming in a 1-1 draw with Oxford.\nHunter began his career at Fleetwood Town before moving to Salford City, playing for current Dons boss Graham Alexander at both clubs.\n\"I'm really happy to sign her and work with the gaffer again,\" he told the Dons website, external.\n\"This is a tricky division and it can be tough to get out of it but I think we have a team that can do well and hopefully we can have a successful season.\"\nHead coach Alexander added: \"He can play in a number of attacking positions and provides a creative spark in the final third. He's good on the ball and provides a real threat in terms of end product. He's got a small frame but a big personality and heart.\n\"I know he's got that bit between his teeth to prove what a good player he is - he knows that in me and Chris Lucketti, he's also got people who believe in him and are delighted to have him here.\"\nFind all the latest football transfers on our dedicated page.", "url": "https://www.bbc.com/sport/football/66410041"}