{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-21 06:30:37", "date_modify": "2025-05-21 06:30:37", "date_publish": "2025-01-31 11:08:22", "description": "Tottenham 3-0 Elfsborg: Mikey Moore, Dane Scarlett and", "filename": "sport_football_articles_cly5dzxk473o_1747809037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a723/live/6c2a62d0-dfb0-11ef-88d3-dd7c96a87c10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly5dzxk473o_1747809037.html", "title": "Tottenham 3-0 Elfsborg: Mikey Moore, Dane Scarlett and", "title_page": "Tottenham 3-0 Elfsborg: Mikey Moore, Dane Scarlett and  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham had three academy graduates find the net on Thursday - but who are they?\nDane Scarlett had been on loan in the Championship at Oxford United until recently.\n\"There was a certain number nine, Harry Kane, at this football club that went on loan to Leyton Orient, Millwall, Leicester, and ended up becoming a legend of this club,\" former Tottenham striker Peter Crouch said on TNT Sports.\n\"Of course that is a lot for Dane Scarlett to live up to, that calibre of player. But when he came on, I thought his all-round game was brilliant.\"\nForward Scarlett has also had loan spells in the Championship at Ipswich and in League One with Portsmouth.\nLondon-born Damola Ajayi was at Bromley before joining Tottenham's academy.\nThe forward made two appearances for the under-18s in 2021-22 while still a schoolboy.\nMeanwhile, attacking midfielder Mikey Moore joined Tottenham a decade ago and has progressed through the ranks to play for the first team.\nEarlier this season, Tottenham's England midfielder James Maddison likened Moore to Brazil's Neymar.\n\"From minute 45 to 65 I thought we had Neymar on the left wing,\" said Maddison about Moore after the Europa League win over AZ Alkmaar on 24 October.\n\"He was brilliant. Just demanding the ball and fearless.\"", "url": "https://www.bbc.com/sport/football/articles/cly5dzxk473o"}