{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:39:26", "date_modify": "2025-05-20 13:39:26", "date_publish": "2023-07-25 14:02:45", "description": "Spain and Japan can secure their places in the last 16 of the Women's World Cup on Wednesday.", "filename": "sport_football_66269327_1747748366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15A91/production/_130512788_alexiaputellas.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66269327_1747748366.html", "title": "Fifa Women's World Cup day seven: Japan v Costa Rica, Spain v Zambia, Canada v Republic of Ireland", "title_page": "Fifa Women's World Cup day seven: Japan v Costa Rica, Spain v Zambia, Canada v Republic of Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spain and Japan can secure their places in the last 16 of the Women's World Cup on Wednesday.\nSpain beat Costa Rica 3-0 and Japan thrashed Zambia 5-0 to put themselves in a strong position before the second round of Group C fixtures.\nThe Republic of Ireland take on Canada looking for their first win in Group B.\nHere's everything to look out for on day seven of the tournament in Australia and New Zealand.\nGroup C | Dunedin | 06:00 BST | ITV\nJapan forward Mina Tanaka says there is more to come from the 2011 World Cup winners.\nTanaka scored one goal and had two ruled by the video assistant referee as Japan laid down a marker against Zambia.\n\"The first match was tough. We still got five goals. They got zero shots. We did it as a team and that was wonderful,\" she said.\n\"This is the second match and we're less nervous. We can play better. I want to be more relaxed and contribute more to the team.\"\nCosta Rica have never won a World Cup game or kept a clean sheet in the competition.\nGoalkeeper Daniela Solera made 10 saves to ensure Spain did not win by a bigger margin, and will once again be crucial in keeping out Japan.\nRachel Brown-Finnis' prediction: I watched Costa Rica's defeat against Spain and they are probably the worst team I have seen so far at this World Cup.\nI expected Spain to start by making a statement, but Costa Rica made it far too easy for them and they were taken apart.\nJapan made quite a splash too, with their big win over Zambia. If Costa Rica are as open again, then the same will happen to them here. 4-0.\nKey stat: Japan are looking to win their opening two games at a World Cup for the third time, having done so in 2011 and 2015.\nGroup C | Auckland | 08:30 BST | BBC\nSpain could hand two-time Ballon d'Or winner Alexia Putellas her first start of the tournament.\nThe Barcelona midfielder, recovering from a long-term knee injury, came on as a second-half substitute against Costa Rica on Friday.\n\"In the 15 minutes that she played the other day she showed that everything was fine,\" said Spain coach Jorge Vilda.\n\"The training sessions, she's completed them very well and kept up a very high rhythm. It's an ongoing process and we're very happy with her progress.\n\"I can't tell you who's going to play or who's not going to play. We're not going to give the other team the advantage of knowing that.\"\nZambia, who are ranked 77th in the world, are making their debut in the tournament and opening fixtures rarely come more difficult than Japan and Spain.\nZambia initially did well against Japan, restricting them to one goal before half-time, and will be determined to build on that against Spain.\nHowever, they will be knocked out if they lose and Japan secure at least a point against Costa Rica.\nRachel Brown-Finnis' prediction: Zambia will hopefully have learned from what happened to them in their first game, but the scoreline here depends a lot on Spain, who have a tendency of taking their foot off the gas a little bit.\nI still think Spain will win and go through, but it could be a closer contest than their win over Costa Rica. 3-1.\nKey stat: Spain managed 46 shots against Costa Ricat, while Zambia did not manage any against Japan.\n\"We absolutely don't want to leave this pitch without those three points,\" said manager Bev Priestman.\n\"The Republic of Ireland are very well drilled and difficult to break down. By no means are we going into this game thinking this is going to be an easy game.\"\nRachel Brown-Finnis' prediction: I can understand why the Republic of Ireland were cagey against Australia - it was their opening game of their first World Cup, and it was against the co-hosts - but they don't look like a side that is suddenly going to start getting lots of goals now.\nCanada have got more quality and they also really need a win here. I think they will get it too, although I can see Ireland scoring one and keeping it close. 2-1.\nKey stat: After failing to score against Nigeria and in their last-16 loss to Sweden in 2019, Canada could go three World Cup games without a goal for the first time in their history.", "url": "https://www.bbc.com/sport/football/66269327"}