{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-05-21 06:06:26", "date_modify": "2025-05-21 06:06:26", "date_publish": "2025-04-01 14:09:57", "description": "Ivan Juric press conference: Southampton vs Crystal Palace preview", "filename": "sport_football_articles_c33zvj7dxjxo_1747807586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a33/live/a2f7f080-c9bb-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c33zvj7dxjxo_1747807586.html", "title": "Ivan Juric press conference: Southampton vs Crystal Palace preview", "title_page": "Ivan Juric press conference: Southampton vs Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Will Smallbone is unavailable but he hopes the central midfielder will be back in contention \"next week or in the final part of this week\".\nJan Bednarek and Taylor Harwood-Bellis are both fit despite picking up slight knocks on international duty. James Bree is also in contention.\nHe had a squad of 10 players to work with during the international break, who have been working \"really hard and with enthusiasm\" during the two-and-a-half-week period. He added: \"In the past two or three days, we have all come back together and been working.\"\nThe goal for the remaining nine games of the season is to \"take it game by game\", \"do their best\" and \"not be the worst team in the history of the Premier League\".\nOn Oliver Glasner's Palace team: \"They have really great players. They play in the 3-4-3 - it is always the same. Normally he repeats his first XI continuously. They are great players, with great ability, and they are technically fast.\" He said it was a \"tough game\" in the reverse fixture but added that it \"wasn't easy\" for the Eagles to get their win.\nThey have \"a good opportunity\" to get a result because the squad is in \"good shape\", but he is aware that they will have to stop Crystal Palace's attack: \"They are really good. They only need a really small space to score a goal or create chances. They are technically fast and physically strong.\"\nWhen asked if he regrets anything from the last few games, such as the Wolves defeat, Iraola replied: \"There have been some games where it hasn't been easy to compete for us. I was angry against Wolves because my feeling was that we just weren't focused enough in some moments.\"\nOn whether he puts tactical formation before the players he has available, he responded: \"You have to be able to change a little bit. You have to do your best to make sure the players feel good on the pitch. But, if you want to create something, then you have to have someone with a strong idea and who knows what they want. Only then can you start to create something, and sometimes you have to try to do it best with the players you have.\"", "url": "https://www.bbc.com/sport/football/articles/c33zvj7dxjxo"}