{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:21:31", "date_modify": "2025-05-20 12:21:31", "date_publish": "2023-07-26 07:02:50", "description": "Before the third season of The Hundred begins, get to know Oval Invincibles and find out who their key players will be.", "filename": "sport_cricket_66228526_1747743691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14B40/production/_130500848_-8ac39adb-2dce-4f19-88a9-ae5dc37169a5.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66228526_1747743691.html", "title": "The Hundred 2023: Meet Oval Invincibles as Alice Capsey & Saqib Mahmood name players to watch", "title_page": "The Hundred 2023: Meet Oval Invincibles as Alice Capsey & Saqib Mahmood name players to watch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport has collaborated with data analysts CricViz to look at the strengths and weaknesses of each side.\nMen's team\nThe Invincibles have plenty of firepower to exploit the small boundaries at The Oval. Will Jacks and Jason Roy should provide fast starts at the top, with left-hander Sam Curran and South Africa's Heinrich Klaasen capable of providing some big hitting during the middle overs.\nKent duo Sam Billings and Jordan Cox bring added depth to the batting alongside all-rounder Tom Curran who scored quickly at the back end last year. The form of Roy and Billings, both during the last Hundred season and since, may be of concern.\nQuality and variety runs through their bowling attack, with spinners Sunil Narine and Adam Zampa capable of turning the ball both ways and bamboozling batters.\nThe Curran brothers offer plenty of variation, with Sam's left-arm angle and mixture of yorkers and quick bouncers complemented by right-armer Tom's slower balls and hard lengths.\nTheir domestic bowling depth may come into question after losing Topley during the off season as well as Saqib Mahmood through injury recently. Surrey quick Gus Atkinson and Durham leg-spinner Nathan Sowter could be called upon after impressing on the domestic circuit this season.\nWomen's team\nOpting for continuity leading into this year's competition, the Invincibles have re-signed Suzie Bates and skipper Van Niekerk in the draft and kept together the vast majority of the squad who delivered back-to-back titles.\nThe loss of Shabnim Ismail to Welsh Fire will be sorely felt, coupled with the prolonged injury to Tash Farrant. It means extra responsibility will be placed on the shoulders of all-rounder Marizanne Kapp in the pace bowling department. She had a stellar Women's Premier League in March with the ball and shows no sign of slowing down at 33.\nPoster child of the Hundred and 18-year-old superstar Alice Capsey will be key with both bat and ball, having excelled yet again in international cricket and in the WPL for the Jon Batty-led Delhi Capitals. Her aggressive brand of cricket will be an essential part of the Invincibles make-up.\nEngland's Lauren Winfield-Hill is enjoying a white-ball renaissance at the back end of her career and will look to set a strong platform for her team at the top of the order.\nThe Invincibles will be the side to beat yet again as they look to build the tournament's first dynasty.", "url": "https://www.bbc.com/sport/cricket/66228526"}