{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:52:35", "date_modify": "2025-04-26 03:52:35", "date_publish": "2025-03-03 10:10:06", "description": "Ephron Mason-Clark tells BBC CWR's Sky Blues Fancast that Coventry City are confident amid their Championship play-off push.", "filename": "sport_football_articles_cewkdzy524do_1745639555.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afce/live/d35a07c0-f811-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cewkdzy524do_1745639555.html", "title": "Coventry City: Ephron Mason-Clark says Sky Blues are full of belief", "title_page": "Coventry City: Ephron Mason-Clark says Sky Blues are full of belief - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ephron Mason-Clark admits Coventry are \"up there to be shot at\" after climbing to fifth in the Championship but says the Sky Blues believe in themselves.\nCity's eighth win in nine league games saw them rise to their highest position this season, with 11 games to go.\nIn just his second start since missing eight games through injury, Mason-Clark put Coventry 2-1 up in a crazy 18-minute second-half spell at Oxford United, which featured four goals and City missing a penalty before running out 3-2 winners.\nThe 25-year-old told BBC CWR: \"That stint there showed how together we are as a team. The support from the fans gave us that extra push that got us across the line.\n\"It's part of football. The fact none of us dropped our heads and that we looked after each other, just kept going, it just shows the character of everyone.\n\"You can see the squad is getting stronger and it's really competitive. We didn't play the greatest but we are happy to leave with a result.\"\nFrank Lampard's side were 17th, just two points above the drop zone, when he took over from Mark Robins in late November.\n\"We've just got to keep that momentum going,\" said Mason-Clark. \"Prepare for each game individually and not look too far ahead in the future. We are just staying as focused as we can.\n\"We're fighting for our places - every top team, whether in this league or above, has a squad which competes with each other.\n\"Fifth looks good but we are not focused on that, we are taking each game as it comes. (Other teams) can shoot at us if they want - the team we have got, we're confident, not cocky.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cewkdzy524do"}