{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:33:12", "date_modify": "2025-04-26 07:33:12", "date_publish": "2025-02-27 16:19:09", "description": "Fulham news: Fan views on what nobody is talking about", "filename": "sport_football_articles_c8j8kwn9pz9o_1745652792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8j8kwn9pz9o_1745652792.html", "title": "Fulham news: Fan views on what nobody is talking about", "title_page": "Fulham news: Fan views on what nobody is talking about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the one thing going on at Fulham that is being overlooked.\nHere are some of your comments:\nSteve: We are missing Kenny Tete as we have less of an attacking threat down the right side without him. It's a pity we were unable to sign another right-back in the January window.\nChris: The fact we didn't get a decent right back in the January transfer shocks me. Fair play that Timothy Castagne stepped up when Tete was injured but I feel he is looking tired and doesn't have the speed to run up the wing.\nBarry: If the owners are serious about progress at Fulham they should give Marco Silva a new contract. He is working wonders with the squad at his disposal. Not sure we can compete in Europe with such a small squad, as good as they are.\nBen: Adama Traore continues to puzzle me (as he has done for many teams). He looks like the best player on the pitch some weeks and then he's totally impotent the next.\nMartyn: The problem is simple: no home support, no noise. Since early December we have only won twice at Craven Cottage. We have had too many home draws with teams we should have beaten. The team needs to hear its fans but in my opinion the fans have been priced out.", "url": "https://www.bbc.co.uk/sport/football/articles/c8j8kwn9pz9o"}