{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:16", "date_modify": "2025-05-21 05:49:16", "date_publish": "2024-12-24 18:57:15", "description": "Dundee United eager to 'kick on' from Celtic draw - Gallagher", "filename": "sport_articles_c5yw55xyqqwo_1747806556.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b121/live/c22a09b0-c228-11ef-8f37-8d8e53f2cb82.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5yw55xyqqwo_1747806556.html", "title": "United eager to 'kick on' from Celtic draw - Gallagher", "title_page": "Dundee United eager to 'kick on' from Celtic draw - Gallagher - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Declan Gallagher says the \"protein bars were brought out in the changing room\" immediately after the draw with Celtic as Dundee United quickly switched their focus to St Johnstone on Boxing Day.\nJim Goodwin's well-organised side became just the second team to take Premiership points from runaway leaders Celtic this season with a gritty goalless draw at Tannadice on Sunday.\nAnd the big games keep on coming, with a Tayside derby at McDiarmid Park up next.\nCentre-back Gallagher said: \"The protein bars were brought out in the changing room. That's the first time I've seen them this season.\n\"So we are definitely concentrating on the St Johnstone game. The recovery starts now and it's a good group of boys in there.\n\"They know they have to rest and recover. We are in a good place for the games coming up, absolutely.\n\"If you looked at the Celtic game most people would say it's a free hit and they were coming here to run over the top of us.\n\"But the fact that we started well and took a point is excellent for us. Now we just need to look forward and try and pick up as many points as we can in this tough period.\n\"We just want to kick on and try and get another three points against St Johnstone.\n\"So it all has to be fully focused on that. It was a great result and we know that. But we don't get too carried away with it.\"", "url": "https://www.bbc.com/sport/articles/c5yw55xyqqwo"}