{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:13", "date_modify": "2025-05-21 03:41:13", "date_publish": "2025-01-27 00:00:00", "description": "Burnley register their 20th clean sheet of the season as they hold Championship leaders Leeds United in an uneventful goalless draw.", "filename": "sport_football_live_c5yex73dle4t_1747798873.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5yex73dle4t_1747798873.html", "title": "Burnley 0-0 Leeds United: Leaders held by Clarets in low-key match", "title_page": "Burnley 0-0 Leeds United: Leaders held by Clarets in low-key match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It always seemed likely that this game could end goalless but a bright opening few minutes at least briefly suggested an open game.\nIt was not to be the case though, and although Leeds had the better of the possession for much of the game they were unable to move the well-drilled home side out of position.\nBurnley had scored five goals in their thumping win at lowly Plymouth last week, the first time they had scored more than twice in a league match since August, but had just eight touches in the Leeds area all night and Whites goalkeeper Illan Meslier was unworked.\nIndeed, the West Yorkshire side have now gone successive matches without allowing the opposition a shot on target after shutting Norwich out 2-0 last Wednesday.\nDaniel Farke's men are the league top scorers with 53 goals but just 18 of them have come on the road and, as the season heads towards the final stages, the ability to turn tight games in their favour could be pivotal in their bid for automatic promotion.\nThey host improving Cardiff on Saturday, while Parker takes his side, who are three points behind Leeds and one off second-placed Sheffield United, to struggling Portsmouth on the same day.\nBurnley boss Scott Parker told BBC Radio Lancashire:\n\"I think I'm pleased with the point overall.\n\"There's no denying we played against a very good side, an attack-minded team with some real quality in their squad.\n\"I thought first half we had some moments to be fair and we approached the game in the right way. Second half they were probably the more dominant and we lacked a little something.\n\"I get it's not fashionable but it's nothing short of remarkable what we've done defensively as a group and as a team, it's given us a platform.\n\"There's elements of our game that we need to improve and get better at and that probably comes in that final third. I don't think that was our big issue today, I just felt it was our general control in the game and that's down to Leeds as well really.\"\nLeeds boss Daniel Farke:\n\"It's a good point for us and a good point on the road. I'm happy with our defensive behaviour. It was two of the best teams in the league against each other in difficult circumstances with the weather.\n\"I think both teams were there without crucial mistakes. I'm pretty happy with how we controlled their processes but without the ball I wished we had been a bit more confident around the box.\n\"It wasn't an unbelievable advertisement today, it wasn't a nice piece of football, but that is quite often the way when two of the best teams in the league play each other.\n\"It wasn't the most entertaining one but our supporters have a good knowledge of the game and they know how complicated it is to play such a game against a good opponent.\"", "url": "https://www.bbc.com/sport/football/live/c5yex73dle4t"}