{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 06:22:19", "date_modify": "2025-05-21 06:22:19", "date_publish": "2025-03-31 14:33:17", "description": "Last year's winner I Am Maximus heads the runners for the Grand National at Aintree on Saturday.", "filename": "sport_horse-racing_articles_cvgpllwy3pyo_1747808539.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f082/live/d16c7b80-106e-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cvgpllwy3pyo_1747808539.html", "title": "Grand National 2025 preview: I Am Maximus seeks second win in Aintree race", "title_page": "Grand National 2025 preview: I Am Maximus seeks second win in Aintree race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last year's winner I Am Maximus heads the runners for the Grand National at Aintree on Saturday.\nThe Willie Mullins-trained horse, owned by JP McManus, triumphed by seven and a half lengths in 2024.\nMcManus, who is seeking a record fourth victory for an owner in the contest, also has leading hopefuls Iroko and Perceval Legallois in the field.\nRachael Blackmore, the only female jockey to win when she triumphed in 2021 aboard Minella Times, rides Minella Indo for trainer Henry de Bromhead.\nA maximum line-up of 34 runners will take part after the field was reduced last year from 40 as part of safety changes.\nBookmakers expect more than £150m to be wagered on the 177th running of the big race.\nI Am Maximus would be the first runner to carry top weight to victory since triple winner Red Rum in the 1970s, and only one horse - Tiger Roll in 2019 - has defended their title since then.\n\"He's in great shape and I'm very happy with him,\" said Mullins, who also has Nick Rockett and Grangeclare West towards the top of the weights.\nGavin Cromwell is set to run Cheltenham Festival winner Stumptown, Perceval Legallois and 2023 runner-up Vanillier.\nBargain buy Hewick, who cost just £800 and won the King George VI Chase in 2023, will be saddled by John 'Shark' Hanlon.\n\"He's a horse of a lifetime and no one will ever have a horse like him,\" said Hanlon, who plans to take his horse to the local pub to celebrate if he wins.\nThe Irish contingent also includes last year's third-place finisher and 2021 Cheltenham Gold Cup winner Minella Indo, as well as 2024 Irish Grand National victor Intense Raffles.\nGordon Elliott's team will be led by Three Card Brag, the mount of Sean Bowen, who is on the verge of becoming British champion jockey despite being allergic to horse hair.\nApproximate odds: 6-1 I Am Maximus, 8-1 Iroko, Stumptown, 11-1 Hewick, Perceval Legallois, 12-1 Intense Raffles, Vanillier, Minella Cocooner, 20-1 Bar\nThe big race is due off at 16:00 BST, with runners and riders negotiating 30 fences - including Becher's Brook, The Chair and Canal Turn - over four and a quarter miles.\nMr Incredible has been barred from running after either being pulled up or refusing to race in his last four outings.\nThe 14-time British champion trainer Paul Nicholls has five contenders as he seeks a second National win - Kandoo Kid, Bravemansgame, Threeunderthrufive, Hitman and Stay Away Fay.\nIroko has been aimed at the race all season by Oliver Greenall and Josh Guerriero, while the Nigel Twiston-Davies-trained Beauport will carry the colours of Bryan Burrough, whose Corbiere won in 1983 as Jenny Pitman became the first female trainer to triumph.\nTwiston-Davies, who has won the race twice before, is also set to saddle Broadway Boy.\nThe forecast is mainly dry and sunny, with temperatures of 16C to 18C expected.\nOfficials have been watering the course and the going is likely to be good to soft.\nGina Bryce, BBC Radio 5 Live presenter\n1 I Am Maximus; 2 Perceval Legallois; 3 Hewick; 4 Three Card Brag\nAlthough we've not seen him at his best this season, it's a vote of confidence that jockey Paul Townend has opted to stay with I Am Maximus. There are a lot of positive noises about how much this horse has improved.\nJohn Hunt, BBC Radio 5 Live commentator\n1 Perceval Legallois; 2 Iroko; 3 Hewick; 4 Threeunderthrufive\nGavin Cromwell attempts to become one of only a handful of trainers to win the Cheltenham Gold Cup and the Grand National in the same season. He also has Stumptown and Vanillier, but Perceval Legallois comes here a fresh horse and has all the talent required to win a National.\nGary O'Brien, Racing TV and BBC Radio 5 Live pundit\n1 Perceval Legallois; 2 I Am Maximus; 3 Iroko; 4 Beauport\nPerceval Legallois can crown a wonderful season for trainer Gavin Cromwell. An easy winner of the valuable Paddy Power Chase at Leopardstown's Christmas festival, returned to the Dublin venue to land another nice prize over hurdles and looks on a nice mark in this sphere.\nAndrew Thornton, BBC Radio 5 Live analyst and former jockey\n1 Vanillier; 2 I Am Maximus; 3 Beauport; 4 Three Card Brag.\nThe better ground will help the 2023 runner-up Vanillier and he is well weighted. I Am Maximus has more weight this time but is built to carry it.\nOrganisers introduced a series of new safety measures last year for the Grand National.\nAs well as reducing the line-up, there is a shorter run to the first fence to slow horses down and a reduction in height to one of the fences. A standing start was reintroduced along with further veterinary checks.\nThe National time was brought forward an hour and 15 minutes to reduce the build-up and provide safer ground for runners in case of drying conditions.\nThere were no fallers last year and 21 horses completed the race - the highest number across the finish line since 1992 - with four horses unseating their riders and seven pulled up.\nActivist group Animal Rising has said that - as with last year - it has no plans to disrupt the event but remains opposed to the race.\nThe 2023 National was delayed by 14 minutes after protesters from the group entered the track and police arrested 118 people on the day of the race, in which the gelding Hill Sixteen suffered a fatal injury.\nOne horse, Willy De Houlle, died on the first day of this year's meeting after falling in the juvenile hurdle", "url": "https://www.bbc.com/sport/horse-racing/articles/cvgpllwy3pyo"}