{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 06:13:58", "date_modify": "2025-05-21 06:13:58", "date_publish": "2025-01-14 07:46:12", "description": "Everton news: David Moyes in 'relaxed but realistic mood' on Blues return", "filename": "sport_football_articles_c05lzneq1e7o_1747808038.html", "image_url": "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/a00f/live/4064a930-2f60-11f0-b26b-ab62c890638b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05lzneq1e7o_1747808038.html", "title": "Everton news: David Moyes in 'relaxed but realistic mood' on Blues return", "title_page": "Everton news: David Moyes in 'relaxed but realistic mood' on Blues return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Moyes faced the media on Monday after returning as Everton manager and there was not a spare seat in the house.\nWith widespread interest on his comeback, the 61-year-old was dressed in a sharp, navy-coloured suit and entered the packed press room at the Finch Farm training ground with a beaming smile on his face, before holding aloft the home jersey and posing for photographs.\nHe took his seat and started with a light-hearted gag, stating there were \"many old faces\" in attendance, including his own - he can't have been talking about me there because I was still in high school when he began his first spell 23 years ago.\nMoyes spoke about having to stay in the Premier League in order to head to the new stadium next season as a top-flight club, as well as the need to score more goals to win more games.\nHe also urged the out-of-confidence number nine Dominic Calvert-Lewin to find his \"goalscoring boots\" with the requirement to \"start to deliver\" on the pitch again.\nEverton is a club close to Moyes' heart, having given him his first opportunity to manage in the Premier League.\nMoyes said he has turned down jobs since leaving West Ham in the summer and I asked him if Everton was the only club job he would have taken.\n\"Yeah, I believe so because I don't think there is anything else,\" he replied. \"I want to show I can go again. In football, you always have to prove yourself and I'll try to do that again.\"", "url": "https://www.bbc.com/sport/football/articles/c05lzneq1e7o"}