{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:27:07", "date_modify": "2025-04-26 06:27:07", "date_publish": "2025-02-28 19:07:25", "description": "Three of America's biggest boxing stars will fight in separate bouts in Times Square, New York on 2 May.", "filename": "sport_boxing_articles_cz031m18nypo_1745648827.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4920/live/d000fdd0-f605-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cz031m18nypo_1745648827.html", "title": "Boxing: Ryan Garcia, Devin Haney & Teofimo Lopez to fight in separate bouts in Times Square", "title_page": "Boxing: Ryan Garcia, Devin Haney & Teofimo Lopez to fight in separate bouts in Times Square - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "American star Teofimo Lopez and bitter rivals Devin Haney and Ryan Garcia will fight in separate bouts at an event held in Times Square in New York on 2 May.\nLopez, 27, will defend his WBO light-welterweight title against Arnold Barboza Jr.\nThe Times Square event will feature three fights, with Lopez opening the bill and Garcia headlining.\nLopez, a two-weight world champion, has just one loss on his record to George Kambosos Jr and has won his five fights since that defeat.\nHaney and Garcia compete in separate fights with a view to staging their rematch in Saudi Arabia in October.\nHaney will fight at welterweight against Jose Ramirez and Garcia will face Rolando Romero.\nGarcia, 26, has just served a one-year doping ban and has not fought since his dramatic win over Haney in April 2024.\nThe American missed weight for that fight, pulled off an upset before the victory was overturned to a no-contest following a failed drug test.\nHaney, 26, has also not fought since then and took a break from boxing after his first career loss to Garcia.", "url": "https://www.bbc.co.uk/sport/boxing/articles/cz031m18nypo"}