{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:40:31", "date_modify": "2025-05-21 06:40:31", "date_publish": "2025-03-31 06:42:24", "description": "Fulham 0-3 Crystal Palace: Fulham fans on the FA Cup defeat", "filename": "sport_football_articles_cn529renlrqo_1747809631.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn529renlrqo_1747809631.html", "title": "Fulham 0-3 Crystal Palace: Fulham fans on the FA Cup defeat", "title_page": "Fulham 0-3 Crystal Palace: Fulham fans on the FA Cup defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Fulham's 3-0 defeat by Crystal Palace in the FA Cup quarter-finals.\nHere are some of your comments:\nAdam: Dreadful. Should have scored one of the two chances we had early on, Adam Wharton should have been sent off for a second yellow for a stamp and then they scored two in quick succession and it was game over. Palace just seem to have our number, and we can't play against a low block. So disappointing - especially as the atmosphere in the first 30 minutes was the best we've had in years!\nFernando: It's the story of the season - missed opportunities to go in front and then we get punished for not taking those chances. Sad day, but we move on and hope for a strong finish and maybe qualify for a European tour.\nRobert: Very poor performance. Real chance of winning the cup but couldn't rise to the occasion. Very disappointing.\nJimbo: Gutted. Carbon copy of the league game, though we were on top before Eberechi Eze's wonder goal. We didn't ever look like scoring and were soft at the back. Very disappointing to limp out of the competition. Felt like a boxing match and losing to the jab, constantly kept at arm's length.\nAlan: Disappointing. No one played well except maybe Calvin Bassey and exactly the same playbook as last game vs Palace; a well marshalled defence - our numerous corners were dealt with comfortably - and ruthless on the counter. We lacked creativity and ambition in midfield. Personally, I would have started Ryan Sessegnon.", "url": "https://www.bbc.com/sport/football/articles/cn529renlrqo"}