{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:24:55", "date_modify": "2025-05-21 06:24:55", "date_publish": "2025-03-31 12:31:11", "description": "Boss Nigel Clough says Mansfield Town have more to do to ensure League One safety despite moving 11 points clear of the relegation places.", "filename": "sport_football_articles_cx26n2l8yjno_1747808695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ca9/live/4f2ed980-0e23-11f0-9a68-1b75bf032378.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx26n2l8yjno_1747808695.html", "title": "Nigel Clough: Mansfield Town boss says more to do to ensure League One safety", "title_page": "Nigel Clough: Mansfield Town boss says more to do to ensure League One safety - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Nigel Clough says Mansfield Town still have more to do to ensure League One safety despite moving 11 points clear of the relegation places.\nStags' 2-1 win at Bristol Rovers on Saturday lifted them up to 14th in the table and seven places above the drop zone with eight matches remaining.\nIt was a second successive win for a Mansfield side that had endured a 13-match winless league run between early January and mid-March.\n\"We want to keep getting results,\" Clough told BBC Radio Nottingham.\n\"We are taking nothing for granted. It's good that it's 11 points, it's a little more comfortable, but we need to get mathematically safe.\"\nClough has long stated he felt 50 points would be enough to keep Mansfield in the third tier but now that they are three points off that tally, he is determined to see his side aim for more.\nAnd it is the form of sides in the relegation places that has the Stags boss reassessing what could be needed to stay in the division.\nBack-to-back wins for Crawley Town since Scott Lindsey's return and the form of Clough's former side Burton Albion since the start of 2025 have given both sides renewed hope of getting out of the drop zone.\n\"I'm not sure 50 points will do it,\" Clough said.\n\"All of a sudden Scott Lindsey has gone back at Crawley and they have got two outstanding wins and two clean sheets and they are the sort of team that can put a run together and win four or five games.\n\"We also know, having won at Stockport on 4 January then lost however many games on the spin, that if we do that again then we will go down.\"", "url": "https://www.bbc.com/sport/football/articles/cx26n2l8yjno"}