{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:29:09", "date_modify": "2025-05-21 06:29:09", "date_publish": "2025-01-04 16:59:24", "description": "Irish Premiership sides Ballymena United and Portadown are knocked out of the Irish Cup by Championship outfits Ards and Annagh United.", "filename": "sport_football_articles_c5y75nwg7neo_1747808949.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6afb/live/7ead5ef0-cab4-11ef-8fb8-75874e244aea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y75nwg7neo_1747808949.html", "title": "Irish Cup: Annagh United and Ards stun Portadown and Ballymena United", "title_page": "Irish Cup: Annagh United and Ards stun Portadown and Ballymena United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish Premiership sides Ballymena United and Portadown have been knocked out of the Irish Cup by Championship outfits Ards and Annagh United.\nLee Newell and Aidan Steele scored as Ards stunned Ballymena United 2-1 in the fifth round at the Showgrounds.\nAnnagh United held off a late fightback from Portadown as the Championship side progressed with a 3-2 win over their neighbours.\nCarrick Rangers avoided an upset as they defeated Championship strugglers Newry City 4-3 in a thrilling match at Taylors Avenue.\nIn an all-Championship encounter, leaders Bangor defeated bottom side Newington 2-1 after extra-time.\nBallinamallard United, who reached the final in 2019, safely reached the last-16 with a 2-1 win away to Ballymacash Rangers.\nElsewhere, Larne were stunned by Limavady United while Linfield, Cliftonville, Coleraine, Crusaders and Dungannon Swifts all booked their place in the next round.\nOne of the big shocks came at the Showgrounds as Ards, who have one win in five games in the Championship, knocked out Ballymena United with a 2-1 win.\nThe visitors went in front on 13 minutes when, after Ballymena initially had appeared to clear an Ards attack, the ball ricocheted across the face of goal to Newell who beat Sean O'Neill from 12 yards.\nThe visitors doubled their advantage on 25 minutes after Danny Lafferty brought down Ciaran Dobbin in the penalty area and Steele blasted the resultant spot kick straight down the middle.\nIn the second half, Ben Kennedy saw a 30-yard free kick flicked over the bar by keeper Marc Matthews before the home side, who reached three finals in the past five seasons, halved the deficit on 77 minutes.\nSubstitute Ethan Devone took a clever touch from Kennedy's pass before drilling a shot past Matthews.\nBallymena pressed for an equaliser but Ards held firm to pull off a shock win over the Premiership outfit.\nThere was also a shock at the BMG Arena as Annagh United defeated derby rivals Portadown 3-2.\nThe Irish Premiership side took an early lead through a debut goal from James Teelan after good work from Lee Chapman down the right.\nHowever, the hosts came roaring back into the game as the in-form Ryan Swan and Jack Evans put Ciaran McGurgan's men in ahead at the break.\nNiall Currie's side fell further behind when former Ports striker Stephen Murray netted to put Annagh two goals in front.\nSteven McCullough set up a grandstand finish as he headed home a cross from Ryan Mayse with 20 minutes to play.\nPortadown pushed for a crucial goal but Annagh held firm to book their place in the last-16.\nBangor needed extra-time to defeat Newington 2-1 at Clandeboye Park.\nNew Bangor recruit Michael Morgan won possession 35 yards out and sprinted into the Newington box before calmly sliding the ball beyond Dean Smyth in goal.\nNewington levelled six minutes later when Robbie Morrow slotted home into the bottom right-hand corner.\nIf the first half was evenly matched, the second period was all about Bangor, who had big chances through Matthew Ferguson and Ben Arthurs but could not find a winner in normal time.\nHowever, Lee Feeney's men were rewarded in the 105th minute when a goalmouth scramble resulted in Martin Bradley slotting home the winner.\nElsewhere, Championship side Ballinamallard United battled past third-tier Ballymacash Rangers 2-1 at the Bluebell Stadium.\nAaron Harkin netted a first-half penalty for the Mallards before Alex Holder doubled their advantage before the break.\nStriker Benny Igiehon pulled a goal back for Ballymacash with 12 minutes to play but Ballinamallard, who reached the final in 2019, held on to win.", "url": "https://www.bbc.com/sport/football/articles/c5y75nwg7neo"}