{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:24:57", "date_modify": "2025-05-21 06:24:57", "date_publish": "2025-04-04 00:00:00", "description": "Scotland fall to a third successive Nations League defeat as group leaders Germany score twice in either half at Tannadice.", "filename": "sport_football_live_cy4vyedxqe1t_1747808697.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy4vyedxqe1t_1747808697.html", "title": "Scotland 0-4 Germany: Hosts fall to third successive Nations League defeat", "title_page": "Scotland 0-4 Germany: Hosts fall to third successive Nations League defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland conceded the first of four goals to Germany inside the first minute as they fell to a third successive Nations League defeat and remain bottom of Group A1.\nWith 57 seconds on the clock at Tannadice, Elisa Senss smashed a thunderous strike into the roof of the net, leaving stretching goalkeeper Lee Gibson without a chance.\nThough they were dealt the worst imaginable start, Michael McArdle's side responded well and dominated much of the first half before suffering a second sucker-punch.\nImmediately after Hibernian forward Eilidh Adams squandered a superb headed chance, the visitors roared forward through Jule Brand and the winger's cross was turned into her own net by Sophie Howard, Scotland's Germany-born defender.\nThe Scots have been taught many a tough lesson over the past few campaigns and this was another.\nThe top seeds and third-ranked side in the world showed their superiority in the second half and boosted their goal difference further.\nHalf-time substitute Cora Zicai caressed a beauty by Gibson before Lea Schuller latched on to a launched ball, unmarked, to leather in a fourth.\nLauren Davidson was denied a late consolation when her close-range shot was brilliantly touched on to the crossbar by Ann-Katrin Berger.\nThe sides meet again in Wolfsburg on Tuesday - live on BBC Scotland - where Scotland will need to be much improved to return home with a positive result.\nIf ever a team typified the tagline of being 'in transition', this Scotland team is it.\nDipping into his experience at youth level, interim head coach McArdle has piled his trust on callow shoulders with the future at the forefront of his mind.\nBut Scotland, at present, are in need of a pick-me-up, having gone five games without a win and scoring only once in that time.\nThe hosts might have thought their first-half efforts in Dundee merited at least one, but again profligacy has caused them pain.\nIt's a tight turnaround until the sides meet again next week and in that short time McArdle has a long list of issues to contend with.\nAs well as the required ruthlessness up top, they need to be much more solid at the back. At times, they were scattered all over the shop.\nThis is a team for tomorrow, but there are areas which need to be addressed now.\nScotland interim head coach Michael McArdle: \"It was a sore scoreline but I'm very proud of how the girls played.\n\"They were brave, we had a high block, we didn't want to sit back and give them too much space, so very brave in that sense. There's lots of positives that I'm sure we'll reflect on as the days go by but at the moment the scoreline hurts.\"\nScotland captain Erin Cuthbert: \"I think we maybe needed to get a bit more compact but it's hard when you're 4-0 down.\n\"You want to get a goal. You want a bit of pride. You want to give the fans something to cheer about.\n\"So I think we could see that right until the end, we were at least chasing a goal and we don't accept 4-0.\"", "url": "https://www.bbc.com/sport/football/live/cy4vyedxqe1t"}