{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:43:29", "date_modify": "2025-04-26 03:43:29", "date_publish": "2025-03-05 08:53:15", "description": "Club Brugge 1-3 Aston Villa: Fan views", "filename": "sport_football_articles_cqly00g1ny5o_1745639009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cqly00g1ny5o_1745639009.html", "title": "Club Brugge 1-3 Aston Villa: Fan views", "title_page": "Club Brugge 1-3 Aston Villa: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your thoughts after Tuesday's Champions League game between Club Brugge and Aston Villa.\nHere are some of your comments:\nPrit: This really was a game within a game. In large parts, Club Brugge were in control with very sharp and quick passing, but for me above all, this game was about the redemption of Tyrone Mings. He set up Leon Bailey's goal and did an astonishing clearance to keep Villa in the game. While Ollie Watkins was quiet (again), it looks like Marco Asensio is making up for lost time as he put away another penalty. At the halfway mark in the tie, I'm not getting carried away, but I would be so happy with a very dull 0-0 at Villa Park next Wednesday.\nPhil: Absolutely delighted with the result of course - not so the overall performance. Felt we were too passive/pedestrian for large parts of the game and rode our luck a bit. When we moved the ball quickly we looked much more threatening. Good to see Boubacar Kamara get some minutes too. Need to be careful next week but we should have enough to see us into the last eight.\nMatt: A generous dollop of luck there! Brugge were asking all the questions but two mistakes and we take a two-goal advantage back to Brum. Mings made a heroic clearance and Emi Martinez made some smart saves. Hopefully Kamara can get match-sharp quickly and we can get a lot more control of the tempo in the home leg.\nRob: Mings was man of the match by a mile - let's not get carried away, we could have easily lost. But we still have players coming back and have room for improvement. The best is yet to come.", "url": "https://www.bbc.co.uk/sport/football/articles/cqly00g1ny5o"}