{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:43", "date_modify": "2025-05-20 14:14:43", "date_publish": "2023-07-30 00:00:00", "description": "Follow live text and BBC Radio 5 Sports Extra commentary from the Belgian Grand Prix.", "filename": "sport_live_formula1_63208186_1747750483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11D80/production/_130588037_gettyimages-1565284922.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_formula1_63208186_1747750483.html", "title": "F1 LIVE: Belgian Grand Prix latest", "title_page": "F1 LIVE: Belgian Grand Prix latest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Verstappen makes it eight in a row with Belgium win\nAndrew Benson\nBBC Sport’s chief F1 writer\nMax Verstappen was in imperious form as he came from sixth on the grid to win the Belgian Grand Prix.\nThe Red Bull driver's eighth consecutive victory in the final race before the summer break extended his championship lead to 125 points.\nVerstappen led Sergio Perez home to a Red Bull one-two but was in another league from his team-mate.\nFerrari's Charles Leclerc took third ahead of Mercedes' Lewis Hamilton and Aston Martin's Fernando Alonso.\nRead the full race report here\nGoodbye\nMax Verstappen and Red Bull have been unstoppable in the first 12 races but can another driver rise to the challenge and take a race victory when we return from our summer holidays in August?\nOr will the records continue to be broken by the Dutchman and his RB19 rocket ship?\nThanks for all your comments and thumbs, folks. Only 10 more grands prix for us to enjoy of the 2023 campaign.\nTake care of yourselves and we'll meet up again once we're all tanned and refreshed on Friday, 25 August for first practice at the Dutch Grand Prix.\nSee you soon!\n'It's a tricky one' - Piastri\nOscar Piastri spoke to Sky Sports, having had to withdraw from the race after a collision in the first turn:\n\"I had a good launch and got to Carlos' back wheel and obviously he jinked quite hard to the right and locked up, and I had to take a bit of avoidance from that.\n\"At that point I was still there and with how I had to get out of the brakes it was quite hard to then back out of it fully, so I either had to stay where I was or try and commit more.\n\"It's always tight into turn one like that, and it's disappointing to end it at the first corner.\"\n'Stewards are calling it a racing incident, do you see it as a learning experience?'\n\"I've seen the video. It's difficult. Obviously Carlos didn't have much space - I also didn't give that may options. It's a tricky one. I'm sure we'll see I could have done a few things differently, but just a shame to be out so early.\"\n'The beginning was painful' - Norris\nLando Norris spoke to Sky Sports after his seventh place finish in the Belgium Grand Prix: \"The beginning was so painful. We had one thing left to try and that was to put a soft tyre on. We were somehow in seventh. I pushed the tyre so much. We kept the tyres alive.\"\nOn his underperforming car: \"Everyone was overtaking me before the DRS activation zone. It was just painful, I actually could not overtake a car on the straight today, no matter how good our exit was. We got it wrong.\"\n'Driver has no right to get that angry\nMarc Priestley\nF1 commentator on BBC Radio 5 Live\nThe exchange that happened in qualifying wasn't Max Verstappen's finest hour. There was a lot of swearing and what he was really doing was criticising his engineer, who has in that moment a lot more information to hand over and above what Max has. I always feel it is difficult to take those things.\nThis is a team sport and a driver is as much a part of the team as anyone else in it, so I always feel that the driver has no right to get that angry when everyone in the team is actually trying to help them do the best job possible.\n'Both engineer and driver right in own way'\nJack Aitken\nFormer Williams reserve driver on BBC Radio 5 Live\nI think drivers always regret that kind of a rant. You don't have the right to go off on someone like that especially when thy have a valid point.\nFor Gianpiero (GP) Lambiase and Max, who keeps proving himself right, it's painful.\nMax manages them so well because his pace is so good and validates it but GP is right for warning him as well - and Max needs to respect that.\nThey are both right, in their own way.\n'We can be proud of points on Saturday and Sunday' - Brown\nMcLaren boss Zak Brown is the latest paddock member to give his views on Twitter.\n\"We never gave up! It wasn't an easy race, made harder with Oscar's early retirement but credit to the team and to Lando for managing his tyres to bring the car home in P7,\" he wrote.\n\"We can be proud of points on Saturday and Sunday.\"\nNorris' six points at Spa added to yesterday's haul takes McLaren from 97 points after the sprint to 103 heading into the mid-season break.\n'I didn't expect us to be that strong' - Leclerc\nCharles Leclerc spoke to Sky Sports after finishing third in the Belgium Grand Prix: \"I don't think you can call that confidence. I think it is something really interesting that we can look into. This is exactly what we need to understand to maximise our package going into the second half of the season.\n\"It's not a worry. I did not expect us to be that strong.\"\n'On the right trajectory' - Wolff\nMercedes team principal Toto Wolff spoke to Sky Sports after the team finished fourth and sixth at the Belgian Grand Prix: \"Not great. The car was ok. It was a track where we were not good last year. You're going into the summer at least, a three week break. I think we're on the right trajectory.\"\nOn Lewis Hamilton going for the fastest lap instead of chasing down Charles Leclerc: \"I don't think we could have made the top speed on the straight line. It wasn't enough to chase Leclerc. With that respect, at least take another point.\"\n'Kind of a non-eventful race' - Hamilton\nLewis Hamilton spoke to Sky Sports after finishing fourth in the Belgium Grand Prix: \"It was kind of a non-eventful race really. I wasn't able to keep up with the cars ahead. We had big bouncing this weekend, we were back to what we had last year. We got the fastest lap at the end. It was gusty today.\"\nOn the bouncing he experienced in the car: \"They don't know. To me that is a concern. They're trying to figure out what it is.\"\nPost\nLewis Hamilton says it was an uneventful race in the Mercedes but ends his interview with Sky Sports saying: \"I know what I want, I'm praying for it and waiting for the day we get it.\"\nQuotes to come from the seven-time world champion but meanwhile, rookie Oscar Piastri has tweeted following his disappointment in the Belgium Grand Prix.\n\"The highs and lows of Spa. Early summer holiday for me,\" wrote the Australian.\nYou still have that excellent P2 medal from the sprint, Oscar.\n'It's mind blowing' - Horner\nRed Bull Principle Christian Horner spoke to Sky Sports: \"It's all about team work and everyone doing our bit. It's what the team's done in the first part of this year and it's why we remain unbeaten so far. It's mind blowing. We need to keep this level going. Everyone deserves a well earned break.\"\nOn Sergio Perez: \"I think he had a really good first lap. I don't think he was as comfortable as Max on the medium tyre.\"\nOn changes to car: \"I think that's pretty much it. It'll be circuit specific. We've got six months to come up with another one.\"\nOn whether Red Bull can win the remaining 10 races: \"I'm not going to project that far ahead. We'll come back after the break and try to keep this amazing momentum going.\"\n'We still have a lot of work to do' - Leclerc\nCharles Leclerc, who finished third for Ferrari: “We’ve had quite a positive weekend on our side. Of course the race was good on my side, a shame for Carlos as we had good pace. When you look at the Red Bulls we still have a lot of work to do.”\nOn whether he felt confident he could keep Lewis Hamilton behind him: “Yes, until I was told to do some fuel saving. This was at the end of the race, I was struggling a bit more, but the pace was there to keep Lewis behind. I knew he was going to pit for fastest lap so that made it easier.”\n'I'll come back really strong' - Perez\nSergio Perez, who finished second at the Belgium Grand Prix: \"It was a good race for the team. We had a good start. I was just doing my own race and Max came through really fast. There was nothing I could do there.\n\"It's been a bit of a rough patch, but I'm very pleased for the team. I really need this summer break, it's been really intense. I'll come back really strong for Zandvoort.\"\n'I made the right moves' - Verstappen\nRace winner Max Verstappen, who took his eighth consecutive F1 victory: \"It's a new spot, that's for sure - P6. I knew that we had a great car. It was just about surviving turn one.\n\"I could see it was all getting really tight. I've been in that position before myself so I am just going to stay out of that and it worked out. From there onwards I made the the right overtakes, moves. I just got a little bit stuck in the beginning in a DRS Zone and once that cleared I could just do my own thing - really enjoyable.\"\nOn the exchanges with his engineer (Gianpiero Lambiase) on the use of his tyres: \"I did slow down. we all look at the numbers, we look at the wear on the tyres and this track is super-hard on the tyres. You don't want to do any unnecessary things, and that's what we did until the end.\"\nOn the fright at Eau Rouge: \"That is probably the worst corner to have a moment. It was tricky on those laps when it was raining - you could see it was raining but not how much and I had a little sideways moment.\n\"Luckily nothing happened but it is definitely a corner where don't want anything to happen.\"", "url": "https://www.bbc.com/sport/live/formula1/63208186"}