{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:33:29", "date_modify": "2025-05-20 13:33:29", "date_publish": "2023-07-25 06:07:41", "description": "Erik ten Hag press conference: Man Utd boss previews Wrexham and Real Madrid", "filename": "sport_articles_c514p6n6jp2o_1747748009.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c514p6n6jp2o_1747748009.html", "title": "Erik ten Hag press conference: Man Utd boss previews Wrexham and Real Madrid", "title_page": "Erik ten Hag press conference: Man Utd boss previews Wrexham and Real Madrid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Although Amad Diallo left the MetLife Stadium in a golf buggy after injuring himself in Saturday's victory over Arsenal, Ten Hag played the problem down: \"He's not too bad. Today he was running again. He wasn't involved in the group, but tomorrow we hope he can join in training.\"\nHe says Anthony Martial could still have a role to play if he stays fit: \"When you have a player in your squad you have to expect he is available and players have to take responsibility. He is a brilliant football player so he will help us score goals. With other areas, like pressing and combinations, he's also a great player. We hope he's fit and he stays fit.\"\nOn the search for a striker: \"In an ideal situation, he was already here. We do everything in our power to get it done.\"\nOn preparations to play Wrexham on Tuesday and Real Madrid on Wednesday: \"We planned this for months, so we know what it has to look like. One team will stay behind, I will stay as well, and we will bring in Darren Fletcher, an analyst and the kit men will stay behind. [Under-21 coach] Travis [Binnion] will lead the team. I will help and support him.\"", "url": "https://www.bbc.com/sport/articles/c514p6n6jp2o"}