{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:49", "date_modify": "2025-04-26 06:25:49", "date_publish": "2025-02-28 21:37:15", "description": "Championship leaders Bangor stun Premiership opponents Glentoran with a 3-1 victory in their Irish Cup quarter-final tie at Clandeboye Park.", "filename": "sport_articles_ce982z31p8ko_1745648749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/52aa/live/a6a5ae70-f62a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ce982z31p8ko_1745648749.html", "title": "Irish Cup: Bangor stun Glentoran in quarter-final tie at Clandeboye", "title_page": "Irish Cup: Bangor stun Glentoran in quarter-final tie at Clandeboye - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Championship leaders Bangor produced a stunning display to upset Premiership opponents Glentoran 3-1 in their Irish Cup quarter-final at Clandeboye Park.\nThe Seasiders belied their underdog status by going in three goals to the good at half-time thanks to goals from Ben Arthurs, Ben Cushnie and Lewis Harrison.\nThe shell-shocked Glens replied with a 70th-minute Charlie Lindsay strike but Lee Feeney's second tier side saw out the game to book their place in the semi-finals of the competition and remain in contention for a second Irish Cup success, their only previous triumph coming back in 1993.\nFor the Glens, it was a first defeat in a cup competition this season, Declan Devine's men having won the County Antrim Shield and reached next weekend's final of the BetMcLean Cup.\nThe east Belfast club had been on a 16-game unbeaten run in all competitions before losing 2-0 to Cliftonville in a Premiership game last week.\nSaturday's Irish Cup quarter-finals see Crusaders host Cliftonville in a north Belfast derby, Carrick Rangers face Dungannon Swifts and Ards entertain Loughgall.\nIt was an eventful start to the game with Patrick Solis Grogan producing a good save to deny Christie Pattison's strike and Bangor going straight down the other end and nearly opening the scoring with Cushnie's effort denied by the left-hand post on the fourth minute.\nBangor's early pressure paid off and they opened the scoring on 14 minutes after Kodi Lyons-Foster did well to block Ben Arthurs' strike from a Tiarnan Mulvenna cross. However, Bangor's top goalscorer Arthurs was able to convert the rebound from close range.\nThe home side thought they had doubled their lead almost instantly when Callum Byers found the back of the net, but the effort didn't stand as he was adjudged to have strayed offside.\nThey were able to double their lead on the 23rd minute though when Mulvenna controlled Reece Neale's drop ball and played the ball back for Cushnie with the striker finding the back of the net from 25 yards against his former club.\nThe visitors, who were forced to make two changes in the first half with Marcus Kane and Joe Thomson picking up injuries, struggled to break down the Bangor defence with the home side looking dangerous when they broke forward.\nSubstitute Frankie Hvid then made a crucial clearance off the line to deny Arthurs another goal after he had tried to take advantage of a mistake from Daniel Gyollai, who had tried to come out to clear Robbie Garrett's long delivery.\nSolis Grogan had a quiet first half but made a comfortable save to thwart a free-kick from Danny Amos as the first half came to an end.\nHowever the goalscoring didn't end there with Bangor adding a third on the 44th minute when Arthurs headed down Neale's throw-in for skipper Harrison, who took multiple clever touches to control the ball and beat his marker before firing into the bottom left hand corner.", "url": "https://www.bbc.co.uk/sport/articles/ce982z31p8ko"}