{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 06:56:17", "date_modify": "2025-05-21 06:56:17", "date_publish": "2025-01-31 09:34:09", "description": "Remarkable tale of Czar of Hearts Vladimir Romanov", "filename": "sport_football_articles_cq5gq2dl842o_1747810577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/035d/live/77c94720-df1d-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5gq2dl842o_1747810577.html", "title": "Remarkable tale of Czar of Hearts Vladimir Romanov", "title_page": "Remarkable tale of Czar of Hearts Vladimir Romanov - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The life and times of Vladimir Romanov should be a movie by now, an epic tale of the son of a Red Army veteran who grew up to be a submarine man in the Soviet Navy.\nIt would kick on into his ownership of Heart of Midlothian, his years of chaos on the Gorgie Road and would end with his current status, which is, in keeping with pretty much everything he has done in his life, quite mysterious.\nIs he living in Nikul'skaya, a village in north-west Russia, as was reported a while back?\nDoes he still have his K19 submarine, supposedly his home for a spell?\nAre Lithuanian prosecutors still on his tail for alleged financial crimes?\nIs he still looking at an eight-year stretch if he ever returns to Lithuania, where he moved to when he was a young boy?\nThere hasn't been a movie, but now there's a podcast, a nine-parter on BBC Sounds. Romanov: Czar of Hearts is coming, the first three episodes landing on Saturday.\nPresented by BBC journalist and Hearts fan Martin Geissler, it is the deepest dive there has been on an extraordinary man of 5ft 7in who bestrode Scottish football when he took over the debt-ridden and desperate Edinburgh club in January 2005.\nRomanov's arrival stopped the sale of Tynecastle to property developers and he was worshipped for it. He was a disrupter in a football landscape dominated by the Old Firm. He went to war against, well, everybody.\nIn Vlad's world, everyone outside of Hearts was corrupt. Other clubs, referees, journalists, the Scottish FA, Celtic and Rangers. He would rise above them all and conquer.\nHe vowed that Hearts would win a league title that nobody bar the big two in Glasgow looked capable of winning and, what's more, it would be a mere stopping off point on their route to Champions League glory.\nHe backed up his bombast with hard cash. Romanov signed a lot of dross, but he also got a Champions League winner and a Euro 2004 winner - and Rudi Skacel, who scored in his first seven games for the club and became an idol to the fans.\nVlad buttressed that with talented players from Scotland and beyond. A formidable team was put together and he lured George Burley to Tynecastle to manage it. Burley had been a stellar boss in England and his capture was a coup.\nHearts started taking it to the Old Firm and everybody went along for the ride. The debt was gone, the football was good, the scene was wild. Vlad was noising up anybody who dared get in his way and Hearts were top of the league.\nThen he blew it all up.\nEverybody has a theory on why Vlad sacked Burley with the team sitting above of the Old Firm in the table. He made some wild claims about why he did it, but some of the views expressed on the podcast are surely much closer to the mark.\nRomanov's ego was as tall and as wide as Tynecastle itself. While the Hearts fans were serenading him and him alone, all was well. He lapped up the adulation and came back for more.\nBut now the songs of praise were for Burley, too. And for the players.\nIn Romanov's mind, there was only one person responsible for the revolution in the east and it was him. Was he jealous and angry at Burley's popularity?\nEye-witnesses speak on the podcast about his paranoia. Whatever. At precisely the moment when Hearts looked like title contenders, the manager got bulleted.\nAnd so the fun and games began in earnest. Hearts split the Old Firm in the league in 2005-06, then won the Scottish Cup that May, only their second trophy in more than 40 years.\nTynecastle became a place of delirium and rumour.\nWas Vlad picking the team?\nWhat was this about him wanting to change the club colours from maroon to green and yellow, the colours of Lithuania?\nWas there truth in the gossip that he wanted Hearts to become Dynamo Hearts or Sparta Hearts?\nNames came and went in a blur.\nThe suits: Sergejus Fedotovas, Liutauras Varanavicius, Vitalijus Vasiliauskas, Julija Goncaruk (introduced as Vlad's niece…), Roman Romanov (definitely Vlad's son and once allegedly banished to an aluminium smelt in Minsk after annoying his father).\nThe managers: John Robertson (lasted five months), Burley (four months), Graham Rix (five months). Valdas Ivanauskas (seven months), Eduard Malofeev (one month), Ivanauskas again, then Anotoly Korobochka, Stephen Frail, Csaba Laszlo, Jim Jefferies, Paulo Sergio, John McGlynn, Gary Locke.\nStories about Vlad's interference in team selection increased - 'here is your line-up for Saturday' - as Tynecastle leaked like a sieve.\nPersonally, I saw a fax with his team instructions to the manager of the day, who promptly rolled it up and chucked it in the ban. Six days later, he was fired.\nEvery week brought new information about Romanov's singular way of doing things.\nA second Scottish Cup was won, but this was different. Hearts annihilated their rivals, Hibernian, 5-1 in the final, an almost out-of-body experience for the fans and one they will revel in until their last breath.\nRomanov: Czar of Hearts documents the rise and the fall - and, when that fall came, it was always going to be dramatic. The money ran out, the debt soared and Romanov did a runner.\nHearts collapsed into administration. The roof leaked, literally. From the ashes, of course, came the Foundation of Hearts, the most profoundly significant fan ownership model Scotland has ever seen.\nIf the Hearts fans could live it all again, would they? If they knew how it was all going to end, would they sign up for the Romanov years and go again?\nPlenty, you fancy, would say yes. The pleasure was worth the pain.\nRomanov did not do what he said he was going to do in Scotland, but his ego will enjoy the fact that he is immortal here.\nLong after he has danced his way to the stars - oh yes, in 2007, he won Lithuania's version of Strictly Come Dancing - he will be remembered.\nRomanov - czar of Hearts, tormentor of authority, king of all bonkerdom.", "url": "https://www.bbc.com/sport/football/articles/cq5gq2dl842o"}