{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 05:21:34", "date_modify": "2025-05-21 05:21:34", "date_publish": "2025-04-03 12:20:21", "description": "Chloe Kelly returns to Arsenal for treatment on a foot injury and will miss both of England's games against Belgium in the Women's Nations League.", "filename": "sport_football_articles_cwy6g23r4j9o_1747804894.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/39d6/live/09338d10-1173-11f0-b594-f7ec3c1d2e0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy6g23r4j9o_1747804894.html", "title": "England's Chloe Kelly to miss Belgium double-header and return to Arsenal with foot injury", "title_page": "England's Chloe Kelly to miss Belgium double-header and return to Arsenal with foot injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Winger Chloe Kelly has returned to Arsenal for treatment on a foot injury and will miss both of England's matches against Belgium in the Women's Nations League.\nOn Thursday, Lionesses boss Sarina Wiegman said Kelly and Fran Kirby would not play in Friday's fixture at Ashton Gate because of minor injuries.\nBut the FA has revealed Kelly will now return to Arsenal to \"aid her rehabilitation\", and will miss Tuesday's return fixture against Belgium as well.\nThe 27-year-old, who scored the winning goal in the Euro 2022 final, is a loss to Wiegman's squad, who are already without several key players as they build up to Euro 2025.\nKirby took part in training on Thursday, but Kelly - who joined Arsenal on loan from Manchester City in January - was not involved after both picked up \"little niggles\".\nBrighton's Kirby, 31, could be fit for the trip to Leuven next week though.\n\"We are still working towards Tuesday's game,\" England manager Wiegman said.\n\"It's really disappointing for them because they are in a very good place. It's disappointing for the team too.\n\"But as always, we prepare for the next steps and think about scenarios of who is ready to play and is ready to come in.\"\nAttacking midfielder Kirby has impressed since joining Brighton in the summer, scoring five goals and assisting two in 13 Women's Super League appearances.\nShe missed February's matches against Portugal and Spain because of injury but was recalled to the squad for this double-header with Belgium.\nDefender Alex Greenwood, midfielder Georgia Stanway and forward Lauren Hemp are among those already missing through injury, but Wiegman was in a positive mood as she previewed Friday's match.\nEngland began their Women's Nations League campaign with a draw in Portugal before beating world champions Spain 1-0 at Wembley in February.\nSeveral Lionesses players have been in good form recently, including Arsenal striker Alessia Russo, who is the WSL's second top scorer this season.\n\"What we have seen [since] the last camp, has been many competitive games. It has been really enjoyable to watch and you saw the level went up again,\" said Wiegman.\n\"There have been big challenges with games involving many England players, so that was really good to see.\n\"You could see a lot of players grew in confidence and are in a good place.\"\nEngland captain Leah Williamson, who plays alongside Russo at Arsenal, agreed that the forward is playing with self-belief.\nRusso has scored 17 goals in all competitions this season and is the top scorer in the Women's Champions League.\n\"I think everyone will always say how nice a person Alessia is and everyone wants to see her do well for that reason,\" said Williamson.\n\"But to be a number nine in any team you do have to have that sort of - not arrogance - but confidence about you.\n\"We all want to see Alessia playing the way she is and I hope she carries that on because she deserves it as a human and works hard for it.\n\"We know what a talent she is. When she is scoring goals, she is getting confidence and is giving back to the team. The team appreciates it as well.\"", "url": "https://www.bbc.com/sport/football/articles/cwy6g23r4j9o"}