{"authors": ["Charles Bannerman", "www.facebook.com"], "date_download": "2025-05-21 06:53:04", "date_modify": "2025-05-21 06:53:04", "date_publish": "2025-03-29 18:25:51", "description": "MacTavish Cup holders Kingussie progress on penalties while Lovat also win", "filename": "sport_articles_cq8022qevleo_1747810384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34bd/live/a8b2d490-0cc8-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cq8022qevleo_1747810384.html", "title": "MacTavish Cup holders Kingussie progress on penalties while Lovat also win", "title_page": "MacTavish Cup holders Kingussie progress on penalties while Lovat also win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "W M Donald MacTavish Cup holders Kingussie came close to suffering a first round shock and only progressed on penalties when underdogs Beauly held them to a 2-2 draw.\nThere was also a shootout in the tie of the round at Kiltarlity between Lovat and Caberfeidh, where Lovat edged it after six goals were shared.\nGlenurquhart eliminated Inverness 3-0 at Drumnadrochit and Kilmallie thrashed hosts Strathglass 9-2.\nAt The Dell, Kingussie looked set to dispose comfortably of the Premiership's bottom side, recent victims of four consecutive defeats.\nHowever, Louie McLellan put the underdogs ahead after just two minutes and it was into the second half before Savio Genini sent the tie to extra time.\nThe deadlock remained into the final 15 minute period, when Dylan Borthwick gave Kingussie the lead and Colin MacDonald's strike created the shootout after which Kingussie prevailed 2-0.\nGavin MacLaughlin's opener for Cabers, midway through the first half, was quickly cancelled by James MacPherson.\nCraig Morrison edged Cabers ahead again on the half hour and only seven minutes remained when Marc MacLachlan's penalty sent the tie to 30 further minutes.\nCallum Cruden gave Lovat the lead for the first time, but a Kevin Bartlett penalty against his old club produced further deadlock, setting up another shootout and a 3-2 success for Lovat.\nIt took Glenurquhart almost half the game to break down lowly Inverness.\nJohn Cameron made the breakthrough, Charlie MacLeod made it 2-0 and Cameron then completed his double.\nAt Cannich, Calum MacDougall set Kilmallie on their way after seven minutes with the first of his five-goal tally.\nLewis Birrell followed with a quick double and Innes Blackhall also contributed as the score reached 8-0.\nTwo from Donald Fraser salvaged something for Strathglass before Jay MacLeod grabbed Kilmallie's ninth.\nThere were widespread postponements due to waterlogging and both National Division games - Inveraray v Glasgow Mid Argyll and Bute v Col Glen - were also off.\nMid Argyll and Col Glen both suffered a virus outbreak, having played each other seven days previously.", "url": "https://www.bbc.com/sport/articles/cq8022qevleo"}