{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-05-21 05:28:58", "date_modify": "2025-05-21 05:28:58", "date_publish": "2025-01-23 08:03:09", "description": "Consultant director of rugby Steve Diamond remains upbeat despite a challenging first 12 months at Kingston Park.", "filename": "sport_rugby-union_articles_czj34keyywdo_1747805338.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa26/live/95dd5bf0-d8e4-11ef-96e3-7ddb8edc83e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_czj34keyywdo_1747805338.html", "title": "Newcastle Falcons: Steve Diamond reflects on one year in charge", "title_page": "Newcastle Falcons: Steve Diamond reflects on one year in charge  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is now just over a year since Steve Diamond walked through the door at Newcastle Falcons.\nThe consultant director of rugby has had to contend with being in charge of the Premiership's paupers, who lost every match last season and are bottom after 10 games this season.\nAgainst this backdrop, the club and owner Seymore Kurdi are actively looking for fresh investment to make Falcons more competitive and ultimately a force in English rugby.\n\"I don't think anybody else would have taken this on,\" Diamond told BBC Sport.\n\"It's almost unfair as a coach that you're asked to work with half of the resources as anybody else.\n\"It's not an equal playing field, but I'd rather be where Newcastle are, than Worcester or London Irish.\"\nDiamond is referring to the demise of Worcester Warriors, London Irish and Wasps, who were not able to survive crippling financial problems.\nIn fact, he was director of rugby at Worcester when they went out of business in 2022.\nNewcastle have been challenged financially, but they are still in the fight. Life is not easy as the Falcons battle against the odds, operating with a slimline squad on a much lower budget than the other nine Premiership clubs.\nTheir best players get picked off by rivals with loftier ambitions and deeper pockets, as shown by Argentina lock Pedro Rubiolo heading to Bristol Bears and, only this week, England wing Adam Radwan leaving immediately to go to Leicester Tigers.\nThere is a potential relegation play-off at the end of the season to preserve their Premiership status, and they were the only club not to secure a single point in the group stages of either the Champions Cup or the Challenge Cup.\nBut Diamond remains honest and upbeat about the challenges he faces at Kingston Park in rugby's most northerly outpost.\n\"I think I knew the job in hand and what I was coming into,\" he said.\n\"I am a positive force in the building, it's a great environment to work in, the players maintain a real professionalism about them even when the results don't go their way.\n\"The back office is in good spirits, too, so you wouldn't think it is a club that doesn't win many games.\n\"When the good times come, which they will, periods like the last 12 months will at least bring continuity.\"\nOut of work after a short spell as a consultant at Edinburgh, Diamond was parachuted into Kingston Park in mid-season last January to replace head coach Alex Codling.\nThe rot had already set in, the team having lost all Premiership games before he arrived, and he was not able to stop it as Newcastle racked up 18 consecutive losses, including a record 85-14 hammering away to Bristol Bears.\nThere was a clear-out in the summer and it took five games to record a victory before they defeated Exeter Chiefs in October.\nAnother win followed against Saracens the month after, but the Falcons are back on a sticky run with seven straight defeats in the league and Europe since that November night.\nBut there is always hope, and Diamond is excited by some of the local prospects in his squad like 23-year-old Max Pepper, who is set to take Radwan's place on the wing.\nFinding, developing and keeping rugby players from the north of England is an integral part of the blueprint with which Newcastle want to attract new investment.\nAnd Diamond compares the Falcons to French club La Rochelle - one that is fervently supported and has grown over the last decade to win the European Cup in 2022 and 2023.", "url": "https://www.bbc.com/sport/rugby-union/articles/czj34keyywdo"}