{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:46", "date_modify": "2025-05-21 07:31:46", "date_publish": "2024-12-23 17:22:00", "description": "Ulster head coach Richie Murphy says he is \"very proud\" of his sons Ben and Jack as they prepare to potentially face each other on Saturday.", "filename": "sport_rugby-union_articles_cgrw1egyq5no_1747812706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9de8/live/b7e83e50-c150-11ef-9c2a-c910c1a61425.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cgrw1egyq5no_1747812706.html", "title": "Connacht vs Ulster: 'A sideshow for my wife'", "title_page": "Connacht vs Ulster: 'A sideshow for my wife' - Ulster boss Murphy on sons facing each other  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster head coach Richie Murphy says he is \"very proud\" of his sons Ben and Jack as they prepare to potentially face each other for the first time in senior rugby on Saturday.\nBen Murphy and Connacht will welcome dad and younger brother to the Sportsground in Galway for Saturday's United Rugby Championship encounter.\nThe Connacht scrum-half, 23, has made eight appearances for the Westerners since joining from Leinster in the summer, while 20-year-old Jack earned his Ulster debut in last week's loss to Munster.\n\"It's more of a sideshow for my wife,\" said a smiling Richie Murphy, who faced Ben in October when Ulster beat Connacht in Belfast.\n\"She's the one that has to deal with all three of us. I definitely don't envy her position at the moment.\"\nMurphy, whose side have suffered five straight defeats, added: \"I haven't been a very happy husband over the last couple of weeks with not getting those victories that you're talking about.\n\"In that, you've got Jack at 20 years of age, coming in and making his senior debut and Ben down in Galway. This time last year, the four of us were sitting in Bray: Ben was at Leinster, Jack was getting ready for the Irish [Under]-20s, our whole lives have changed very quickly.\n\"But we're very proud of the two lads, they work very hard at their craft and we'll see what happens at the weekend I suppose.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cgrw1egyq5no"}