{"authors": ["Adam Pope", "www.facebook.com"], "date_download": "2025-04-26 07:33:28", "date_modify": "2025-04-26 07:33:28", "date_publish": "2025-02-27 16:08:25", "description": "Leeds United head coach Daniel Farke gives the latest news on his injury list, among other things, ahead their Championship match with West Brom.", "filename": "sport_football_articles_cx2ggq977rko_1745652808.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3164/live/4ab5f7a0-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2ggq977rko_1745652808.html", "title": "Leeds United: Daniel Farke gives injury updates ahead of WBA game", "title_page": "Leeds United: Daniel Farke gives injury updates ahead of WBA game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The team news centres on the captain Ethan Ampadu (knee) who Leeds have opted not to send for surgery in the hope he could still play a part this season.\nIn terms of back-up in central defence, Farke says he has cover with James Debayo, Josuha Guilavogui and also Sam Byram. Meanhwhile he is hoping right-back Jayden Bogle \"does not have to give away a tactical foul\" and earn a tenth caution in the next three games as it would rule him out for two matches.\nOn Patrick Bamford's recovery from a hamstring injury: \"Struggling to give a time frame. At the start of January, I said four to six weeks. He is still feeling something. He is ot back in team training yet and is working desperately to get back.\"\nOn West Bromwich Albion: Farke is an admirer of Tony Mowbray who he says sets up to attack and has noticed that since he became Carlos Corberan's permanent replacement, the Baggies have been far more possession-based and adventurous.\nAfter reports linking CEO Angus Kinnear with a role at Everton: \"If you are doing well as a club there's lots of interest. If a club is progressing well, players and staff will get interest. It belongs to this business of doing well. When I was younger, I would be more bothered by this stuff. Not a topic to comment on.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2ggq977rko"}