{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-20 14:19:59", "date_modify": "2025-05-20 14:19:59", "date_publish": "2023-07-30 06:10:44", "description": "Everton are \"working hard\" to make new signings for their squad but have missed out on transfer targets this summer, says manager Sean Dyche.", "filename": "sport_football_66351579_1747750799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F454/production/_130584526_dyche-index.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66351579_1747750799.html", "title": "Sean Dyche: Everton manager says club have missed out on transfer targets", "title_page": "Sean Dyche: Everton manager says club have missed out on transfer targets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton are \"working hard\" to make new signings for their squad but have missed out on transfer targets this summer, says manager Sean Dyche.\nThe Toffees have brought in full-back Ashley Young on a free transfer and winger Arnaut Danjuma on loan in the summer transfer window so far.\nThe Blues are unbeaten in pre-season but have netted only four goals in four games against lower league opponents.\nDyche said the lack of goals from his team is \"always a concern\".\nEverton escaped relegation on the final day of last season by edging to a 1-0 victory over Bournemouth but scored only 34 goals in 38 league games.\nInjury-prone Dominic Calvert-Lewin struggled to stay fit and managed just two goals all campaign while fellow striker Neal Maupay has netted only once in his past 40 league and cup appearances.\nThe need for a new striker has been evident but they suffered a blow in their pursuit of long-term target El Bilal Toure, who opted to join, external Serie A side Atalanta from Almeria.\nBBC Sport understands there is a mild interest in Leicester City striker Kelechi Iheanacho, though no approach has yet been made.\nIn the build-up to the new season, Everton have defeated Swiss second division side Stade Nyonnais 2-1 and beaten League One Wigan 1-0, before a goalless draw at Bolton.\nThey needed an injury-time Amadou Onana goal to beat Championship side Stoke 1-0 on Saturday, after which the 2,900 travelling supporters ironically chanted: \"We're gonna win the league.\"\nEverton have financial concerns and are set to go before an independent commission in October for alleged breach of the Premier League's Financial Fair Play rules.\nDyche, meanwhile, may have to bring in further temporary solutions with the need to operate on a tight budget at Goodison Park.\n\"It's a tough market,\" he said. \"There is only so much that we can do, so we are working very hard - I can assure everyone of that - to construct deals that can work.\n\"There is no exact moment until it's over the line. There have been situations where we have been into where we thought we were going to get it over the line and we don't - that's the way it goes.\n\"A lack of goals is always a concern because you need to score to win games. We showed in the second half of the season that we needed to find different ways of scoring goals and we are going to have to do that going forwards. That is part of football.\"\nEverton complete their pre-season schedule when they welcome Sporting Lisbon to Goodison Park on Saturday 5 August, beginning their Premier League campaign a week later by hosting Fulham.", "url": "https://www.bbc.com/sport/football/66351579"}