{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:07", "date_modify": "2025-05-21 05:22:07", "date_publish": "2025-04-03 16:14:44", "description": "Everitt urges Edinburgh to maintain 'positive energy'", "filename": "sport_articles_c1jxr1z6l03o_1747804927.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a04d/live/11c53fc0-1090-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1jxr1z6l03o_1747804927.html", "title": "Everitt urges Edinburgh to maintain 'positive energy'", "title_page": "Everitt urges Edinburgh to maintain 'positive energy' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sean Everitt wants Edinburgh to maintain their \"positive energy\" with victory over Lions on Friday night to reach the Challenge Cup quarter-finals.\nEdinburgh head into the European tie on the back of a comprehensive home win over Dragons in the URC last weekend in which several Scotland players returned to club action.\n\"We've put ourselves in a good position,\" said head coach Everitt.\n\"It's always good to take some momentum into a knockout game like this weekend. There's a lot of positive energy around the camp.\n\"We had a lot of guys returning last week, that certainly helps the energy and the guys are really focused on the Lions on Friday.\n\"It's a competition that has got a bit of prestige to it and it is an opportunity for a trophy as well.\"\nRoss McCann starts in place of Scotland wing Duhan van der Merwe, who is out until next month because of an ankle injury, in one of four Edinburgh changes.\nHooker Dave Cherry is back in the XV for the first time since starting all five of Scotland's games in the recent Six Nations, while Paul Hill returns at tighthead prop and Sam Skinner starts at lock.\nFull-back Wes Goosen, who signed a new two-year deal this week, makes his 50th Edinburgh appearance.\nLions were thumped 42-0 by Glasgow in the URC last weekend and Everitt added: \"They'll all be disappointed with that loss, but I know how proud they are as a franchise and as a group of players and I know them quite well, so they'll be looking to bounce back this weekend.\"\nEdinburgh team to face Lions: Goosen, Graham, Currie, Lang, McCann, Thompson, Vellacott; Schoeman, Cherry, Hill, Skinner, Gilchrist, Ritchie, Watson, Bradbury.", "url": "https://www.bbc.com/sport/articles/c1jxr1z6l03o"}