{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:40:00", "date_modify": "2025-05-21 05:40:00", "date_publish": "2024-12-28 09:30:17", "description": "Puerto Rico's champion boxer Paul Bamba has died at the age of 35 less than a week after his last fight.", "filename": "sport_boxing_articles_cm2l99l8lljo_1747806000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff40/live/6447fed0-c4fb-11ef-8626-4def89f8025c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cm2l99l8lljo_1747806000.html", "title": "Paul Bamba: Puerto Rican champion boxer dies aged 35", "title_page": "Paul Bamba: Puerto Rican champion boxer dies aged 35 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boxer Paul Bamba has died aged 35, his manager Ne-Yo has announced.\nPuerto Rican Bamba won the WBA Gold Cruiserweight title by defeating Mexican Rogelio Medina on 21 December.\nSinger Ne-Yo, who signed Bamba to his management company in November, confirmed the news in a joint-statement alongside Bamba's family on Instagram.\n\"It is with profound sorrow that we announce the passing of beloved son, brother, friend and boxing champion Paul Bamba, whose light and love touched countless lives,\" the statement read.\n\"He was a fierce yet confident competitor with an unrelenting ambition to achieve greatness.\n\"But more than anything, he was a tremendous individual that inspired many with his exceptional drive and determination.\n\"We are heartbroken by his passing and kindly ask for privacy and understanding during this difficult time as we collectively navigate our grief.\"\nBamba won each of his 14 fights in 2024 by knockout, culminating in his world title win against Medina in New Jersey.\nFollowing that win last week Bamba posted on his Instagram: \"This year I set out with a goal. I did just that. Wasn't easy, there were many obstacles that I adapted to overcome and kept on the path we set regardless of extenuating circumstances.\nHe added: \"If you've got what some might call an outlandish goal, go chase it. Anyone who thinks that isn't as brave as you, prove people wrong.\"\nIn all Bamba recorded 19 wins in 22 career bouts and earned 18 of those victories by knockout.\nJake Paul, who Bamba had called out for a future fight, posted on X: \"RIP Paul Bamba.\"", "url": "https://www.bbc.com/sport/boxing/articles/cm2l99l8lljo"}