{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:23:26", "date_modify": "2025-05-21 06:23:26", "date_publish": "2025-03-31 13:37:53", "description": "Scottish Premiership: Top-six runners and riders in focus", "filename": "sport_articles_cx2544p4g0vo_1747808606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/83c7/live/94ee94f0-0e33-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2544p4g0vo_1747808606.html", "title": "Top-six runners and riders in focus", "title_page": "Scottish Premiership: Top-six runners and riders in focus - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With two matches to go until the Scottish Premiership splits, only four points separate the teams in sixth and ninth as they fight to squeeze into the top half and potentially secure European football next season.\nDundee United's narrow win in Dingwall means they are almost certain to be in the top half regardless of their results against Hearts and St Johnstone before the split.\nData company Opta give Jim Goodwin's side a 99% chance of being in the top six given their six-point buffer and superior goal difference to St Mirren, Motherwell and Ross County.\nAt the other end of the spectrum, they rate County's chance as next to zero, at 0.3%, given they have a four-point gap to make up on sixth-placed Hearts with a far poorer goal difference.\nHearts are only one point above both St Mirren and Motherwell, but the Tynecastle side's superior goal difference is almost worth an extra point at this stage, and they are heavy favourites to sneak in with a 66% chance.\nHowever, Neil Critchley's side play Motherwell away in their final match before the split, which could prove crucial given the congested nature of the table.\nSt Mirren are away to Dundee and home to Ross County as they attempt to overhaul Hearts, buoyed by their dominant 5-1 win over Kilmarnock on Saturday.\nAnd Motherwell boss Michael Wimmer is hoping to bounce back from their defeat by Aberdeen when they travel to Rugby Park next weekend before that all-important match against Hearts.\n\"The league always feels - Celtic and Rangers are a bit different - like you could beat everyone,\" said John Sutton, who played as a striker for three of the sides hoping for a top-six spot in Hearts, St Mirren and Motherwell.\n\"The split gets knocked a little bit, I really liked it as a player. You make the top six, and it's game on, trying to get European qualification.\n\"I think if you take Celtic and Rangers out of things to an extent, every game's a very tricky game. I expect the picture to change this weekend and I expect it to change the following weekend as well.\"", "url": "https://www.bbc.com/sport/articles/cx2544p4g0vo"}