{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:46", "date_modify": "2025-05-20 11:54:46", "date_publish": "2023-08-05 17:32:47", "description": "Truro City boss Paul Wotton says his side's performance in their 5-2 win over Welling United is one of the best in his time in charge.", "filename": "sport_football_66417046_1747742086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1400B/production/_130613918_mediaitem130613917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66417046_1747742086.html", "title": "Truro City 'absolutely magnificent' in 5-2 Welling United victory", "title_page": "Truro City 'absolutely magnificent' in 5-2 Welling United victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City manager Paul Wotton says his side's performance in their 5-2 win over Welling United was one of the best in his time in charge.\nThe White Tigers - making their return to National League South after four years - were 3-0 up inside the first quarter of the game.\nThey went on to lead 5-1 at half time as they put themselves top of the very early National League South table.\n\"I thought first half we were absolutely magnificent,\" Wotton said.\n\"Some of our forward play was outstanding, I thought we ripped Welling apart.\"\nAndrew Neal put Truro ahead after six minutes before Ed Palmer added a second 13 minutes later as he slotted home a Will Dean free kick.\nTwo minutes later Adam Porter made it 3-0 before Cameron Green pulled one back.\nBut Truro again took control as Porter got a second five minutes before the break before Tyler Harvey got the fifth in first-half stoppage time.\nAntony Papadopulos converted a penalty for Welling late in the second half to cut down the deficit.\n\"It's as good as we've played almost in the five years that I've been at the football club,\" Wotton told BBC Radio Cornwall.\n\"A couple of new boys did well today, it's going to take time for everyone to gel, they're having a night out tonight, but they've earned that after a tough pre-season.\n\"We finished last season with a last second win in the pay-off final, so we're on the crest of a wave still and long may it continue,\" he added.\n\"We don't fear anyone, we're not bothered who we play, but I know if we're on it we'll match anyone, if we're not on it we'll get pumped, it's as simple as that.\"", "url": "https://www.bbc.com/sport/football/66417046"}