{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:16", "date_modify": "2025-05-21 07:51:16", "date_publish": "2025-03-28 06:11:31", "description": "Cardiff City: Omer Riza critical of Bluebirds pre-season schedule", "filename": "sport_football_articles_cx2gezree8mo_1747813876.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/942b/live/e7a49d70-0b36-11f0-b7b7-9d88d3000125.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2gezree8mo_1747813876.html", "title": "Cardiff City: Omer Riza critical of Bluebirds pre-season schedule", "title_page": "Cardiff City: Omer Riza critical of Bluebirds pre-season schedule - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City boss Omer Riza says the club probably mismanaged their pre-season and admits it could be a factor in the injury troubles they have had throughout the campaign.\nThe Bluebirds have had a number of hamstring injuries, with Wales captain Aaron Ramsey now ruled out for the season after hamstring surgery, joining goalkeeper Jak Alnwick on the sidelines with the same injury.\nMidfielder David Turnball has just returned from three-and-a-half months out from hamstring surgery and having battled injuries all season, Riza admitted he will look to conduct pre-season differently to previous boss Erol Bulut.\n\"Obviously there are a lot of games in the Championship and it lead to fatigue, but every team is in the same position,\" he said.\n\"But I am not sure if we got pre-season right if I'm honest. I think we went game heavy. I wouldn't do that.\n\"I'd be looking for robustness, strength, power, pace and tactical training in the first week to 10 days, rather than go game loaded.\n\"We lost an element of that physical side with the players early on and we've had a knock-on effect and injuries because of that. Not purely because of that, but that is a factor.\"\nRiza says he has sympathy for Ramsey, who is out of contract at the end of the season and has expressed interest in extending his tenure with his boyhood club.\n\"It's another unfortunate injury for Aaron, it's tough mentally for him to have to come back from another injury and operation,\" Riza added.\n\"He's been injured for a lot of the season. It's unfortunate.\n\"Discussions will obviously take place about where it all moves forward.\"", "url": "https://www.bbc.com/sport/football/articles/cx2gezree8mo"}