{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:49", "date_modify": "2025-05-21 05:31:49", "date_publish": "2025-01-23 00:00:00", "description": "All the latest football news and transfers latest as Kyle Walker leaves Manchester City who bring in Omar Marmoush plus Premier League news conferences and Europa League build-up.", "filename": "sport_football_live_ce8j4r124r2t_1747805509.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce8j4r124r2t_1747805509.html", "title": "Football, transfers & manager news conferences: Walker leaves Man City & Nuno on Cunha", "title_page": "Football, transfers & manager news conferences: Walker leaves Man City & Nuno on Cunha - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you and goodbye!\nThank you for joining us today as we brought you the latest stories and reaction from last night's Champions League matches.\nIf you'd like a catch-up, click on the links in the summary tab.\nSpurs take on Hoffenheim in the Europa League from 17:45 today - follow live text coverage here\nLater, Manchester United face Rangers, from 20:00 - follow here\nJoin us tomorrow for more Premier League manager conferences and latest football news.\nTake care!\nWho's on the way out of Ipswich?\nLiverpool v Ipswich (Sat, 15:00 GMT)\nIpswich Town\nIpswich Town boss Kieran McKenna was asked about potential departures before the transfer window closes: \"Ali Al-Hamadi has been having conversations with different clubs.\n\"George Edmundson has been recalled but there have been discussions there.\"\nOn who he expects to name in his starting line-up for the trip to Liverpool: \"Nothing too drastically different [from last weekend]. [Sammie] Szmodics and Conor Chaplin will still fall short. The boys who missed out last week will still be unavailable.\"\nEnciso in line for debut against Liverpool\nLiverpool v Ipswich (Sat, 15:00 GMT)\nIpswich Town\nIpswich Town boss Kieran McKenna on new signing Julio Enciso: \"He's a very talented young player. He's had some great experiences at a young age and had a really good impact at Brighton. It's a good move for both parties and hopefully it will be a good boost for us.\"\nMcKenna confirmed that the 21 year-old is available for selection against Liverpool on Saturday.\nWhat has Amorim said?\nMan Utd v Rangers (20:00 GMT)\nManchester United\nManchester United manager Ruben Amorim will be in the dugout for the club's home match against Rangers in the Europa League tonight.\nHe was asked in his press conference about the clubs' form playing at Old Trafford: \"It's clear. We are more nervous playing at home than away and it's getting harder.\"\nAnd he added on United's form: \"I am not taking the responsibility from the players. I am saying, and I am really direct in these things, at this moment we are performing really badly and our results are really bad.\n\"I'm saying the obvious. If you want, I can be delusional and say different things. But I say it as I saw it.\n\"I think it is a good thing to be really honest. You saw one thing, I saw one thing. If you are in the stadium you can understand it. So let's face it and work on it.\"\nWhat do Man Utd and Rangers need to qualify for knockout stage?\nMan Utd v Rangers (20:00 GMT)\nAs things stand both Manchester United and Rangers are in spots to qualify for the knockout stage of the Europa League.\nUnited are seventh with 12 points and two group games remaining. Rangers are eighth with 11 points and two group games to go.\nHowever, the table is a tight one with 25th place Elfsborg on seven points and so it is still possible for one or both of Manchester United or Rangers to not qualify.\nThe automatic qualifying spots cut off after eighth place and so both sides will be vying to stay in the top of the table.\nget involved\nPep Guardiola - your verdict\n#bbcfootball, WhatsApp 03301231826, text 81111 (UK only, standard rates apply)\nMatt: Sorry Alex 14:57, but no I much prefer Slot currently, and Klopp before him. Maybe Chelsea fans with their Pep lite in Maresca but no other team has the open cheque book he needs to succeed.\nAndy:Alex @14:57 - Very true. Let’s swap him with a Championship or League One team and see how he fares when he doesn’t have a billion pounds or world-class players.\nBenjamin: Nah I'm alright y'know Alex. I'll stick with Slot.\nJuventus confirm Kolo Muani signing\nJuventus have confirmed the signing of Paris St-Germain forward Randal Kolo Muani on a loan deal until the end of the season.\nKolo Muani, 26, joined the French giants 18 months ago in a £76.4m deal but has failed to reach the heights he did at Eintracht Frankfurt during his time in Paris.\nTottenham Hotspur boss Ange Postecoglou said last week that Spurs had previous interest in the France international, however, the 26-year-old will not be Premier League bound in this window.\nSpurs' form and what they need in Europa League\nHoffenheim v Tottenham (17:45 GMT)\nSpurs' Premier League title hopes have long dwindled with the club currently 15th in the table and 26 points behind leaders Liverpool.\nThey have had inconsistent performances this season and so silverware hopes are all pinned on the cup competitions.\nIn the Carabao Cup, they are in the semi-final and won their first leg against Liverpool 1-0. The second leg is set to be played on 6 February.\nIn the FA Cup they are through to the fourth round where they play Aston Villa on 9 February.\nIn the Europa League table they are currently ninth, which is a play-off spot. They are only outside the top eight qualification places on goal difference with two games left to play. The table is so tight though that they will want to win both of their final group matches to put themselves in the best possible position to progress.\nHoffenheim's form\nHoffenheim v Tottenham (17:45 GMT)\nHoffenheim have a lot of work to do if they are going to progress in the Europa League.\nThey are currently 27th in the table after winning one of six of their matches.\nThe German side have also only won one of their past five games across all competitions.\n'We may not sign anyone this window'\nHoffenheim v Tottenham (17:45 GMT)\nTottenham boss Ange Postecoglou was asked about the transfer window in his news conference before their Europa League match.\nAsked if the club may not sign anyone, he said: \"Potentially. The club is working hard to get some help for the players. As far as I'm aware, there's nothing imminent, but in the last week of the window things happen quickly.\"\n'We'll find a way to play with these two young guys'\nSouthampton v Newcastle (Sat, 15:00 GMT)\nSouthampton\nSouthampton boss Ivan Juric on Kamaldeen Sulemana: \"I think he's had some really good games since I've arrived and he will not play against Newcastle because he has a little injury. Like Tyler Dibling, I think he will stay here. I think we will find a way to play with these two young guys, they did really well and now we are losing them because of their injuries. In the future it will be a good option for us.\"", "url": "https://www.bbc.com/sport/football/live/ce8j4r124r2t"}