{"authors": ["Simon Stone at Old Trafford", "www.facebook.com"], "date_download": "2025-04-26 07:46:51", "date_modify": "2025-04-26 07:46:51", "date_publish": "2025-02-27 00:18:29", "description": "Manchester United manager Ruben Amorim will speak to Alejandro Garnacho about his reaction to being substituted in the 3-2 win against Ipswich.", "filename": "sport_football_articles_c3vwwx02lrwo_1745653611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f3a/live/d76a7f40-f495-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3vwwx02lrwo_1745653611.html", "title": "Man Utd: Ruben Amorim to ask Alejandro Garnacho about substitution reaction in win over Ipswich", "title_page": "Man Utd: Ruben Amorim to ask Alejandro Garnacho about substitution reaction in win over Ipswich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United head coach Ruben Amorim said he would speak to Alejandro Garnacho after the winger went straight to the dressing room when he was substituted in the first half of the 3-2 win against Ipswich.\nAmorim replaced Argentina international Garnacho with defender Noussair Mazraoui two minutes before half-time following Patrick Dorgu's red card.\nIt was raining heavily at Old Trafford and Garnacho seemed to indicate he wanted to take his shirt off, so he headed down the touchline to the dressing room rather than take a place on the bench.\nIt is not known whether he stayed for the second half.\n\"I am going to talk with Garnacho about that,\" said Amorim.\nIn December, the 20-year-old attacker was dropped for the derby against Manchester City at Etihad Stadium along with Marcus Rashford, partly due to his poor performance in training and his attitude.\nUnlike Rashford, who has not played for United since and is now on loan at Aston Villa, Garnacho returned to first-team duties immediately.\n\"You are making a connection with Rashford,\" said Amorim, assessing Wednesday's situation.\n\"It was cold and wet.\"\nAmorim's decision was a tactical one stemming from the red card, allowing his team to largely keep their original shape with five at the back.\n\"The thinking was that we would play 5-3-1. That is a risk because he [Garnacho] is the one who can play one-v-one in pace,\" Amorim said. \"We had to choose someone to go out. It was my choice.\"\nThis has been a tough week at United, with news that more staff members will be losing their jobs.\nUnited's victory therefore will come as little comfort to those directly affected, no matter how entertaining this game proved to be.\nA mid-season home win against opposition who look destined for a swift return to the Championship is not going to live long in the memory.\nHowever, the manner of the success, fighting back from the concession of a shambolic early opening goal and rallying again after a red card and another avoidable goal, was greeted with enthusiasm from the stands at the final whistle.\n\"The fans' support was amazing,\" said Amorim. \"I have felt that since day one.\n\"They want to see the team fight to the end, no matter what the situation. We did that today. All the things in the game were against us, but we fought through that. You feel the connection. It was a good win for us.\"\nPrivately, United officials accept this has been a traumatic week and that chief executive Omar Berrada did not find it easy on Monday to stand before staff and tell them the bad news that up to 200 jobs could go in the next four months.\nIt is perfectly believable when some currently working at the club say morale among the rank and file is at its lowest ebb.\nBut the conviction among those running United is absolute that the changes needed to be made.\nTheir problem is an understanding that off-field decisions are assessed through the prism of results at first-team level. And the results have been terrible.\nEarly in this contest, with Ipswich leading through the atrocious mix-up that offered Jaden Philogene a fourth-minute tap-in, the visiting fans offered their own pretty blunt assessment of United. The words were somewhat more industrial but effectively: \"You're really not very good.\"\nThat's fair enough when assessing opponents who are supposed to be challenging for major honours but started this game 15th in the table.\nYet those responsible for making key decisions are adamant faith in Amorim remains high. They feel what is currently being endured amounts to teething problems with a coach trying to implement a new system.\nAnother change, it is argued, will merely repeat past mistakes. The club have been in a malaise for years, it could be said, and the cycle has to be broken.\nHowever, there is also an acceptance this will not be straightforward.\nAmorim noted that this success - like the robust rearguard action that brought an FA Cup victory with 10 men at Arsenal and a defiant draw against champions-elect Liverpool - was not achieved in the manner he wants his side to play.\n\"We need to survive, but it is hard for me to play like we play in the second half because I feel the players are more comfortable defending the low block,\" Amorim said.\nAmazingly, United have now matched their best form under Amorim by going two Premier League games without defeat.\nThey are up to 14th but are nine points off the top half of the table and a distant 13 away from a Champions League place, even if the Premier League gets five places as expected.\nNo-one at Old Trafford expects Amorim's side to go on a huge winning run to the end of the season.\nHowever, there is a feeling that they can improve – and results in the FA Cup fifth-round tie with Fulham on Sunday and the Europa League last-16 tie with Real Sociedad are crucial to maintaining hopes of European qualification. Dorgu will miss the Fulham game through suspension.\nAmorim has learned already that the price of being associated with United is that any action of significance will be amplified. The glare of publicity is fierce.\nPlenty at the club noted within the reaction to this week's cost-cutting news at United that not many employers offer staff the free lunches that are being taken away. Other companies have made far more people redundant.\nBut the allure of United drives interest and therefore commercial revenues far beyond most comparable-sized businesses.\nThere is always attention on United, whether about matters on or off the pitch.\nDebate surrounding this game will not be about the result but about that ridiculous opening goal when Dorgu and Andre Onana practically waved Ipswich through to score.\n\"When everybody watched that ball, they thought 'here we go again',\" said Amorim.\nAnd there was much to discuss about Dorgu's red card.\nAmorim stressed he saw no malice, explaining: \"He doesn't want to harm anyone. Sometimes you overdo it.\"\nSo, Amorim's fourth home Premier League win as United head coach had plenty of drama about it.\nBut it will take far more than this to sweep away the dark clouds currently hanging over Old Trafford.", "url": "https://www.bbc.co.uk/sport/football/articles/c3vwwx02lrwo"}