{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:02", "date_modify": "2025-05-21 07:27:02", "date_publish": "2025-05-20 20:11:01", "description": "Newcastle will hold talks with Liam Delap but Manchester United lead the race to sign the striker, Manchester City will rival Liverpool for left-back Milos Kerkez, plus more.", "filename": "sport_football_articles_cdj99yrklgwo_1747812422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ab4/live/044bc220-358d-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdj99yrklgwo_1747812422.html", "title": "Football gossip: Delap, Kerkez, Boscagli, Nunez, Jota, Diaz, Martinez, Hato, Cunha, Gyokeres", "title_page": "Football gossip: Delap, Kerkez, Boscagli, Nunez, Jota, Diaz, Martinez, Hato, Cunha, Gyokeres - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle among clubs set to hold talks with Liam Delap but Manchester United lead race to sign Ipswich striker, Manchester City will battle Liverpool for Bournemouth left-back Milos Kerkez.\nNewcastle United are among the clubs set to hold talks with Ipswich Town's 22-year-old English striker Liam Delap this week. (Talksport), external\nManchester United lead the race to sign Delap but a defeat in the Europa League final and consequential inability to offer him European football next season would hand Chelsea the advantage. (ESPN), external\nManchester City will battle Liverpool for 21-year-old Bournemouth and Hungary left-back Milos Kerkez. (i paper - subscription required), external\nBrighton have agreed a deal to sign 27-year-old French defender Olivier Boscagli on a free transfer from PSV Eindhoven. (Sky Sports), external\nLiverpool have received enquiries from the Saudi Pro League over 25-year-old Uruguay forward Darwin Nunez, Portugal forward Diogo Jota and Colombia winger Luis Diaz, both 28. (Sky Germany), external\nManchester United are set to proceed with paying Wolves the £62.5m release clause in instalments for 25-year-old Brazil forward Matheus Cunha. (Fabrizio Romano), external\nManchester United are also hoping they can tempt Sporting and Sweden striker Viktor Gyokeres, 26, to sign for them this summer. (L'Equipe - in French) , external\nAston Villa are not planning to stand in the way of Argentina goalkeeper Emiliano Martinez, 32, if it becomes clear he wants to leave Villa Park. (Givemesport) , external\nChelsea are understood to have opened talks with Ajax over a potential transfer deal for Netherlands defender Jorrel Hato, 19, who is also a target for Liverpool and Arsenal. (Caughtoffside) , external\nBarcelona have reached an agreement with Brazil forward Raphinha over a new deal that will keep the 28-year-old at the club until June 2028. (Fabrizio Romano) , external\nNottingham Forest manager Nuno Espirito Santo might leave at the end of the season because of internal tensions at the club. (Footmercato - in French) , external", "url": "https://www.bbc.com/sport/football/articles/cdj99yrklgwo"}