{"authors": ["Alex Turk", "www.facebook.com"], "date_download": "2025-04-26 03:57:46", "date_modify": "2025-04-26 03:57:46", "date_publish": "2025-03-04 13:39:09", "description": "Man Utd news: Opinion - Fan writer on Chido Obi", "filename": "sport_football_articles_cr5280mnd3no_1745639866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a3e3/live/587ec2b0-b62d-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr5280mnd3no_1745639866.html", "title": "Man Utd news: Opinion", "title_page": "Man Utd news: Opinion - Fan writer on Chido Obi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United's FA Cup defence is over. Dreams of a third consecutive final ended with a whimper against Fulham on penalties in the latest Old Trafford defeat of Ruben Amorim's early reign.\nBut if there was any encouragement from the fifth-round exit, it was that this writer's reluctance over Chido Obi's readiness to start senior matches dissolved.\nRasmus Hojlund struggled to make any sort of impact again, as his goal drought extended to 18 games.\nAmorim introduced Obi to turn the tie in United's favour, which in itself was a damning indicator of his confidence in Hojlund.\nAnd in the 52 minutes he played, the 17-year-old had three big chances.\nShould he have sent the hosts through to the quarter-finals? Probably. But, boy, was it refreshing to see a striker fashion opportunities for himself.\nDebate service all you like, but that is what elite goalscorers do.\nIn comparison, Hojlund has had the same total of big chances in his past 22 league games.\nNow, it is Bilbao or bust, and he has to step up.\nThe Basque city will host the Europa League final on 21 May, and that now represents United's final pathway to Champions League football next season. Real Sociedad await in the last 16.\nObi will not be playing a part though. United did not include him in their revised squad list last month.\nThe Red Devils had three slots for new eligible players in their 'A' list but only added January arrivals Patrick Dorgu and Ayden Heaven. He cannot feature in the 'B' list having only joined from Arsenal last summer.\nIn hindsight, that could be a potentially costly blunder. The talented teen made his senior debut 10 days after the deadline.\nHowever, despite his woes in domestic competition, Hojlund's goal record in Europe since joining United should offer a glimmer of hope.", "url": "https://www.bbc.co.uk/sport/football/articles/cr5280mnd3no"}