{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:15:35", "date_modify": "2025-05-21 05:15:35", "date_publish": "2025-04-03 17:54:55", "description": "Notts County appoint Roberto Gagliardi as their new head of football, and he will take up the role on 1 May.", "filename": "sport_football_articles_c3dkejdkpmlo_1747804535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56ca/live/ec823f20-10b1-11f0-a687-87f1851e5d51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3dkejdkpmlo_1747804535.html", "title": "Roberto Gagliardi: Notts County appoint Italian as head of football", "title_page": "Roberto Gagliardi: Notts County appoint Italian as head of football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Notts County have appointed Roberto Gagliardi as their new head of football.\nThe Italian replaces Richard Montague, who left Meadow Lane in February to become director of football at Championship club Swansea City.\nGagliardi was formerly head of European scouting, then head of football operations at Portsmouth before working as head of recruitment at Turkish club Goztepe and taking a seat on the board.\nNotts joint owners Chris and Alex Reedtz said in a statement: \"Following Richard Montague's departure, we have taken some time to evaluate the club's structure and identify the qualities that would be most valuable to us in his replacement.\n\"Roberto will lead on all aspects of our recruitment and negotiations with agents and clubs – areas he is highly skilled in thanks to the experience he's gained and the notable people he's learned from throughout his career.\n\"He has an excellent understanding of the game, both tactically and in terms of player recruitment, shares our way of thinking and comes highly recommended by people we trust.\"\nGagliardi will take up his new role on 1 May just before County's final game of the season against Doncaster Rovers as they look to win promotion to League One.\nThey are fourth in the table, just two points outside the automatic promotion spots.\n\"I'll be coming into the role at the busiest time of the year. It's a really important period for setting strong foundations for both the transfer window and the season ahead,\" he said.\n\"In terms of attracting players, Notts County has many strong selling points. It's very difficult for clubs, even those from higher divisions, to compete with our brand, history, city, fanbase and project.\"", "url": "https://www.bbc.com/sport/football/articles/c3dkejdkpmlo"}