{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:21:49", "date_modify": "2025-05-21 04:21:49", "date_publish": "2025-04-06 06:06:47", "description": "Olympic medallist Matthew Hudson-Smith wins the 200m at the Grand Slam Track in Kingston, Jamaica to scoop $100,000 (£77,500).", "filename": "sport_athletics_articles_c4g2385kdxzo_1747801309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b92c/live/e2433140-12aa-11f0-8637-6f1afd34d406.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c4g2385kdxzo_1747801309.html", "title": "Grand Slam Track: Briton Matthew Hudson-Smith claims $100,000 prize", "title_page": "Grand Slam Track: Briton Matthew Hudson-Smith claims $100,000 prize - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Olympic medallist Matthew Hudson-Smith won $100,000 (£77,500) on Saturday after victory in the 200m at the inaugural Grand Slam Track in Kingston, Jamaica.\nThe English sprinter's 200m win, added to his second place in the 400m on Friday, meant he topped the combined standings to win the top prize.\nHudson-Smith, 30, crossed the line in 20.77 seconds with Trinidad and Tobago's Jereem Richards second and Deandre Watkin of Jamaica in third.\n\"It's great to win the first Grand Slam championship, I'm really excited and grateful,\" Hudson-Smith said.\n\"I'm getting to the end of my career so it's time to start saving.\"\nWolverhampton's Hudson-Smith, who won 400m silver at Paris 2024, was the first athlete to claim a share of the cash prize at the innovative event launched by four-time Olympic champion Michael Johnson.\nThe Grand Slam Track concept features four weekend meetings, with the next three taking place in the United States, and athletes compete across two disciplines.\nA further three competitors also ended Saturday with a much healthier bank account, including Olympic champion Gabby Thomas.\nThe American clinched top spot after finishing second in the 400m to back up her victory in the 200m.\n\"I'm not sure I've ever been more tired in my life,\" Thomas said.\n\"I heard them saying on the home stretch '$100K on the line' and it really, really motivated me.\"\nFellow American Kenny Bednarek backed up his 100m triumph with victory in the 200m, while Ethiopia's Diribe Welteji topped the field in the short distance group.\nWelteji won the 1500m after coming in second during Friday's 800m.\nThere was a shock in the men's 1500m with Kenya's Emmanuel Wanyonyi upsetting a high-calibre field.\nUS runner Yared Nuguse was second with Cole Hocker, who won Olympic gold in the event, settling for third.\nBritain's Josh Kerr, the reigning 1500m world champion finished fifth.", "url": "https://www.bbc.com/sport/athletics/articles/c4g2385kdxzo"}