{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:10", "date_modify": "2025-05-21 04:38:10", "date_publish": "2025-04-04 16:13:50", "description": "Burnley boss Scott Parker says he has \"massive respect\" for Coventry City boss Frank Lampard before the teams meet on Saturday.", "filename": "sport_football_articles_cqx48z3ryr1o_1747802290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df61/live/f7dca210-116b-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx48z3ryr1o_1747802290.html", "title": "Burnley: Scott Parker on Frank Lampard and dressing-room leaders", "title_page": "Burnley: Scott Parker on Frank Lampard and dressing-room leaders - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley boss Scott Parker said he has \"massive respect\" for Coventry City counterpart Frank Lampard as his side prepare to visit the Sky Blues on Saturday (12:30 BST).\nParker and Lampard previously played together at Chelsea in the 2004-05 season, as well as with the England national team.\n\"Massive respect, not just as a player for Frank. We all know the quality, but just generally what he is, what he's about,\" Parker told BBC Radio Lancashire.\n\"He's doing very well now and he's done very well in a short space of time in his career, probably similar to myself.\n\"Frank's gone in, done an incredible job, and they are in a really good run, really good form.\"\nBoth men became managers within two years of their retirements as players [Parker with Fulham in 2019; Lampard with Derby County in 2018], and the Clarets boss said you can get \"a clear view\" of the players who will follow suit.\nThough it is the veterans who make their voices heard in the dressing room who Parker values most as a boss.\n\"Them experienced guys - them ones that are not just the guys who are experienced and got the t-shirt - but those guys that can voice things, lead, and the players listen, it's infectious,\" he added.\n\"Their whole demeanour and their whole communication... is vitally important to me.\n\"As a coach, it's one voice and you have an understanding with it. There's nothing more powerful than having certain players in there that can help push that message as well.\"", "url": "https://www.bbc.com/sport/football/articles/cqx48z3ryr1o"}