{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:20", "date_modify": "2025-05-21 07:30:20", "date_publish": "2025-03-28 17:28:49", "description": "Aston Villa news: Barkley out for Preston FA Cup tie but 'so close' to return", "filename": "sport_football_articles_crknk6k2720o_1747812620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2368/live/4214fc50-0bf5-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crknk6k2720o_1747812620.html", "title": "Barkley out for Preston FA Cup tie but 'so close' to return", "title_page": "Aston Villa news: Barkley out for Preston FA Cup tie but 'so close' to return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross Barkley will miss Sunday's FA Cup quarter-final at Preston but is \"so close\" to returning to training, says Aston Villa boss Unai Emery.\nMidfielder Barkley has missed 15 games since injuring his knee against West Ham in January.\n\"We are recovering players,\" said Emery. \"The only player ruled out is Barkley. The past two months have been really bad for him while he has been injured.\n\"He is now so, so close to start training with us. Maybe even today [Friday], tomorrow or Monday. He is feeling good now.\"\nDefender Axel Disasi is cup-tied for Sunday's game due to featuring for parent club Chelsea earlier in the season, but Emery expects to have the rest of his squad available and hopes a win can be the start to a strong end to the season.\n\"Hopefully we can keep the players we have now being available for the last two months,\" he added.\n\"Two years ago we finished the season strongly and we achieved the objective in the last two matches playing against Liverpool and drawing, and against Brighton and winning at home.\n\"Last year we finished the season so, so tired. A lot of players were injured, didn't have enough energy and we lost the last match against Crystal Palace away.\n\"This year, my objective and how we are now planning the rest of the season is to try to be full energy again, with every player focusing individually and collectively on the objective we are going to face.\"", "url": "https://www.bbc.com/sport/football/articles/crknk6k2720o"}