{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-04-26 04:21:32", "date_modify": "2025-04-26 04:21:32", "date_publish": "2025-03-03 14:43:12", "description": "Former Celtic player and manager Neil Lennon believes there is a \"chasm\" in quality and attitude between his old club and rivals Rangers.", "filename": "sport_football_articles_cevx4p8nvzvo_1745641292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9c12/live/b22b3630-f83b-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cevx4p8nvzvo_1745641292.html", "title": "Rangers: Chasm between Ibrox club and Celtic", "title_page": "Rangers: Chasm between Ibrox club and Celtic - Neil Lennon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Celtic player and manager Neil Lennon believes there is a \"chasm\" in quality and attitude between his old club and rivals Rangers.\nCeltic need just three more wins to wrap up a fourth straight Scottish Premiership title before the league splits with five games to go.\nRangers suffered a third home defeat in a row against Motherwell as Barry Ferguson endured a first loss in interim charge of his former club, who are 16 points adrift of their Glasgow rivals.\n\"Everyone talks about a rebuild - for me it's a change of culture and psychology [needed at Rangers], more than anything else,\" Lennon, who won 10 league titles as player and manager in Scotland, said.\n\"I think they've got some good players there, but obviously the psychology of the team isn't right.\n\"They do well when they're not expected to do well. And when they are expected to win games, they can't do it.\"\nThe defeat by Motherwell was the 11th time Rangers have failed to take maximum points in their 29 league games this season.\nHaving lost one derby meeting with Celtic 3-0 in September, they triumphed by the same scoreline at Ibrox in the other league game this season.\nHowever, Rangers have failed to beat eight of the other 10 sides in the Premiership at least once during this campaign and were knocked out of the Scottish Cup by second-tier side Queen's Park.\nFerguson stepped in until the end of the season after Philippe Clement - who had guided Rangers to the last 16 of the Europa League - was sacked following a home defeat by St Mirren at the end of last month.\n\"The culture at Celtic and the culture at Rangers is miles apart,\" Lennon added.\n\"There has to be a change for me in the psychology of the dressing room, rather than a complete rebuild, because I don't think that will work either.\"\nFormer Rangers striker and ex-Heart of Midlothian head coach Steven Naismith also believes major changes are needed at Rangers.\nA takeover of the Ibrox club involving the San Francisco 49ers' investment wing - which also holds a majority stake in Leeds United - could be completed by the summer and Naismith believes that could be the starting point for Rangers to improve.\n\"The only real way to close the gap and get competitive again is a takeover and large investment,\" the former Everton and Scotland forward said.\n\"Rangers have been playing catch-up, so I think they need to close that gap quickly.\n\"The takeover brings a bit of optimism, but you still need to make the right choices and make the right decisions when you're recruiting, when you're picking a coaching staff and beyond. So there is a lot of work to be done.\"\nNaismith believes too many of the current squad are \"scared\" of taking responsibility in games Rangers are expected to win, and any increase in budget from a takeover should be invested in changing the profile of the squad.\n\"The investment side of it has to come and be put into players that are ready-made to deal with the pressure and have leadership and a mentality of winning.\n\"That, for me, is the thing that's been missing.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cevx4p8nvzvo"}