{"authors": ["Ali Speechly", "www.facebook.com"], "date_download": "2025-05-21 05:48:42", "date_modify": "2025-05-21 05:48:42", "date_publish": "2025-01-14 12:18:18", "description": "Tottenham news: Opinion - Spurs have weathered the worst of this storm", "filename": "sport_football_articles_cdd94p2en4eo_1747806522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a33b/live/307e0f30-b62f-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdd94p2en4eo_1747806522.html", "title": "Opinion - Spurs have weathered the worst of this storm - BBC Sport", "title_page": "Tottenham news: Opinion - Spurs have weathered the worst of this storm - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A week is a long time as a Spurs fan.\nFrustrated by the loss to Newcastle, delighted with the victory over Liverpool, and completely bewildered by the performance against Tamworth - the emotional rollercoaster that is Ange Postecoglou's Tottenham Hotspur continues to twist and turn.\nLast week, I focused on the strength of character in our squad, and on Sunday Ange said the message to his players going into extra time was to \"stay calm and persistent\".\nOne thing that has impressed me most this season is our players' resilience in the face of what has felt like relentless adversity.\nNo, the results in the Premier League have not been good enough and yes, we should easily be securing victory over teams like Tamworth within 90 minutes. Yet it feels like our squad has weathered the worst of this storm and, relatively speaking, we have not come out of it too badly.\nSomehow, despite the inconsistencies, injuries and illnesses, we are still competing for three cups – and I feel optimistic about our chances.\nObviously, the ultimate goal is to be consistently good in all competitions but, realistically, how many Spurs fans would moan if we won a cup this season - even if it meant finishing mid-table in the league?\nWhile our league performance has been particularly disappointing and disjointed so far, we are only just over halfway through the season, with key players due to return from injury and hopefully some additional reinforcements on their way in this transfer window.\nA win at our noisy neighbours on Wednesday could be just the boost we need and could also act as a catalyst for a strong finish to the season.\nOur players must produce the best of themselves - and Angeball - to win the north London derby. If they dare, they will do.", "url": "https://www.bbc.com/sport/football/articles/cdd94p2en4eo"}