{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:58", "date_modify": "2025-05-21 04:58:58", "date_publish": "2025-02-12 00:00:00", "description": "Sheffield Wednesday boost their Championship play-off hopes as Michael Smith's goal secures a hard-fought victory at Swansea City.", "filename": "sport_football_live_c75z95gg30dt_1747803538.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c75z95gg30dt_1747803538.html", "title": "Swansea City 0-1 Sheffield Wednesday: Michael Smith scores Owls winner", "title_page": "Swansea City 0-1 Sheffield Wednesday: Michael Smith scores Owls winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday boosted their Championship play-off hopes as Michael Smith's goal secured a hard-fought victory at Swansea City.\nSubstitute Smith produced a cool first-time finish as Wednesday took full advantage after Harry Darling's misplaced pass was picked off by Josh Windass.\nSmith's eighth goal of the season - and his third in his Wednesday's past four games - was enough to settle a game of few clear-cut chances.\nSwansea kept plugging away, with Jay Fulton thinking he had equalised with almost the last kick of the night only for the offside flag to save the Owls.\nAway league victory number seven of the season sees Dany Rohl's Wednesday move to within two points of the top six having won for just the second time in their past seven league games.\nBut this was another dispiriting night for Swansea, who failed to build on their weekend win at Bristol City as they suffered a third successive home defeat.\nIt is now six losses in the past eight league games for Luke Williams' team, who are eight points above the relegation places in 17th.\nSwansea have laboured at times on their own ground this season, and it was a similar story despite the shot in the arm delivered by their victory at Ashton Gate.\nThe lack of firepower which has been a long-standing issue was summed up during a first half in which Swansea managed only one effort on goal, a 25-yard half-volley from Zan Vipotnik which sailed harmlessly over the bar.\nSwansea huffed and puffed, but Wednesday carried greater threat almost throughout.\nIke Ugbo thought for a moment he was through on goal early on only for a recovery challenge from Darling – who was back in action after a three-match ban – to save Swansea.\nThe most presentable chance of a forgettable first half fell to Josh Windass, who was picked out by Yan Valery on the edge of the area, but dragged his shot a yard wide.\nJames Beadle was called into action for almost the only time early in the second period, the Wednesday keeper getting down to smother Myles Peart-Harris' header after a measured cross from Ronald.\nSwansea were playing with more intent at that point, yet Wednesday seized the initiative.\nSwansea head coach Luke Williams:\n\"It was quite a dull game. There wasn't too much going on out there.\n\"Ultimately it was a bit of an error that cost us and we were nowhere clinical enough at the other end of the pitch.\n\"We got into a very good positions, we put balls into the box, but I think we made one first contact from a cross. It's not enough.\n\"We have to keep trying to find the balance between attacking and defending effectively.\n\"At 0-0 we looked fairly solid, we didn't give up big chances. If you draw the game it's a very different feeling, but then the game got away from us and we couldn't find a way back in.\"\nSheffield Wednesday manager Danny Rohl:\n\"I think the win was fully deserved, especially second half we had a lot of good pressing moments.\n\"We were very compact, good pressing and in the right moment we scored.\n\"The game management, we learned from the West Brom game, especially the last four or five minutes.\n\"When a home team has just four shots, I think it shows a lot about how we pressed as a group. This is how we have to play – a clean sheet always gives us the opportunity to win games.\"", "url": "https://www.bbc.com/sport/football/live/c75z95gg30dt"}