{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:00:48", "date_modify": "2025-05-20 15:00:48", "date_publish": "2023-07-28 00:00:00", "description": "Relive the action as England beat Denmark to maintain their 100% start at the Women's World Cup.", "filename": "sport_live_football_65468314_1747753248.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BCA7/production/_130559284_england9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65468314_1747753248.html", "title": "England vs Denmark LIVE: Fifa Women’s World Cup 2023 score, commentary & updates from Lionesses’ Group D game", "title_page": "England vs Denmark LIVE: Fifa Women’s World Cup 2023 score, commentary & updates from Lionesses’ Group D game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nFT: England 1-0 Denmark\nThat's all for this page and don't forget the China v Haiti match is ongoing.\nIt's currently goalless in that one, but China have just had Zhang Rui sent off for an awful knee-high challenge. If China don't win then England are in the last 16 and you can follow that match here.\nEngland are next in action against China on 1 August and will be looking to secure progression as group winners.\nFor today, Lauren James is the match-winner as England make it two victories out of two.\nThanks for joining us and for your comments and until next time, bye for now.\n'Let's not make assumptions'\nFT: England 1-0 Denmark\nEngland\nSarina Wiegman speaking about Keira Walsh's injury to BBC Radio 5 Live: \"We are very happy with the three points and we are very sad with Keira the way she had to go off. She is doing alright.\n\"She is in the dressing room with the medical staff and we will see what the situation is.\n\"It was her knee but we don't know what's going on in her knee. Let's not make any assumptions. Let's find out what's going on.\"\n'We showed resilience'\nFT: England 1-0 Denmark\nEngland\nEngland manager Sarina Wiegman, speaking to BBC Radio 5 Live, after the win over Denmark about the performance\nOn the performance: \"The game against Denmark was different to the game against Haiti. Two totally different opponents and we started really well. We wanted to exploit the pockets and get in behind and that's what we did really well. It was really moving and that looked really good and then after 25 minutes we lost the ball a couple of times when we shouldn't and they had some counter-attacks.\n\"But still we looked really good and of course, when Keira got inured we needed to find our feet again. We really showed resilience then and then at the end Denmark start to force and we showed we can fight too. I am very proud of the team.\"\nOn Lauren James' display: \"I think we have a squad of 23 and we still have a very talented group, that's what we showed. The environment is all new and the players playing for the first time they are now getting these experiences and that's the same with LJ. We are being careful with her too.\"\nLooking ahead to China... \"Let's see what the game tonight will bring us. We will review this match and then start talking about China.\"\nJames stars as England close in on last 16 with win - read the report\nFT: England 1-0 Denmark\nEmma Sanders\nBBC Sport at Sydney Football Stadium\nEngland are on the brink of last 16 qualification in the Women's World Cup after producing a much-improved performance to beat Denmark - though they lost key midfielder Keira Walsh to a worrying injury.\nLauren James announced herself on the global stage with a superb strike from the edge of the box just six minutes into her first World Cup start and it proved to be the decider in Sydney.\nHowever, a serious-looking injury to Barcelona midfielder Walsh dampened what was a positive, attacking performance from the Lionesses after a struggling 1-0 win over Haiti in their opening group match.\nWalsh went down under little contact and immediately gestured to the dugout, appearing to say \"I've done my knee\". Visibly in pain, she was taken off on a stretcher after 38 minutes.\nThe sight of an injured Walsh - arguably England's most crucial player - flattened the atmosphere in a Sydney Football Stadium dominated by Lionesses' supporters.\nDenmark capitalised on the change of mood, creating a chance for ex-Chelsea striker Pernille Harder which she scuffed wide, though England's half-time lead was deserved.\nJames continued to impress throughout, providing the creativity and unpredictability that has excited fans in the Women's Super League this season, and she is more than deserving of a regular starting spot with England.\nShe had chances in the first half either side of a header from Lucy Bronze which went over the bar, though Denmark pounced on defensive errors with Rikke Madsen and Janni Thomsen coming close.\nDenmark continued to search for an equaliser and almost found one when substitute Amalie Vangsgaard - who scored a 90th-minute winner over China - headed a cross against the post.\n'I'll take a 1-0 win any day'\nFT: England 1-0 Denmark\nEngland\nMore from Millie Bright, speaking to the BBC after the win over Denmark:\nOn Rachel Daly playing left-back: \"She's an unbelievable player. She will do anything for the team. She's so versatile and we have a team full of very talented players who are willing to do anything. It is an honour to be a part of this squad.\"\nHappy with the result? \"Performance always plays a part but ultimately the tournament is about winning. It's about getting the job done. We have proved that in both games that we are prepared to do absolutely anything to get that win and that clean sheet.\n\"I'd take that any day, a clean sheet. It's the second game in and you want to build your momentum. I would take the last two performances any day and I'm really proud of them.\"\n'We continue to give everything for the badge'\nFT: England 1-0 Denmark\nEngland\nEngland captain Millie Bright speaking to BBC Radio 5 Live after the win over Denmark: \"It was a pretty exciting game, pretty end-to-end, but we're pleased we've got in this position. Two games, two wins, two clean sheets. Some really good parts of both games but I think tonight mentality and character was a big part of the second half especially. First half [was] really good, really good goal from LJ but yeah, overall, really happy to be in the position we are in.\"\nOn Keira Walsh's injury: \"I've not spoken to her yet. I'm sure we will all be around her and we hope for the best in that situation. It's not nice to see anyone go off like that but as a player it's really hard. You have a split-second when you have so many things in your head and you have to adapt and make changes.\n\"The first half that was what was the most different from the first game as it felt more fluid and we really found our rhythm. Anyone going off like that rocks the boat, but credit to the girls' character and mentality, it's massive.\n\"In tournament football you need character and you need mentality. It's not going to be easy but we are prepared to keep playing, keep improving and give everything for the badge.\"\n'Who fills the gap?'\nFT: England 1-0 Denmark\nKaren Bardsley\nFormer England and Manchester City goalkeeper on BBC Radio 5 Live\nHow do you fill the shoes of someone like Keira Walsh. She is essentially the link. She brings others into play and [chances that] typically end in a goal or a shot on target come through Keira Walsh.\nWe saw in the Euros Georgia Stanway playing alongside her at times and thoughts are going to be with her [Walsh] and make sure she's OK.\nBut the thoughts will at some point turn to who is going to play that role and who will play it in the best way possible.\nWhat we have seen with this team, though, is that they will do whatever it takes for each other and when that time comes if it's going to be Georgia Stanway who plays there. There's a lot of versatility in this squad.\n'Walsh goes under the radar and will be a massive miss'\nFT: England 1-0 Denmark\nGilly Flaherty\nFormer England defender on BBC Radio 5 Live\nKeira Walsh looked straight over to the bench and says 'it's my knee, it's my knee'. We all hope and pray it's not that. I feel for England as well as she's going to be such a big loss. She's a player that goes under the radar.\nWe talk about the goalscorers and the flair of the attack but for me, Keira Walsh dictates play for England. She controls the middle.\nNine times out of ten when teams play against England they want to double up on Keira Walsh because she's so effective and then defensively she's that brick wall in front of the back four.\nI just worry because Laura Coombs and Georgia Stanway are both attacking players.\n'Only chances Russo had she made for herself'\nFT: England 1-0 Denmark\nEllen White\nFormer England striker on BBC One\nAlessia Russo created a lot of chances herself today.\nShe's had to control the ball [with her back to goal], turn, spin - she hasn't had any clear-cut opportunities in front of goal.\nThe chance in the second half, she made it for herself by turning on a sixpence and driving at goal.\nWhere she could have done better is to have gone across the keeper [with the shot], she needs to either work the keeper or find someone in the box.\nBut again she didn't have many chances at all throughout the game.\n'Keira is a special person and a special player, let's hope it isn't serious'\nFT: England 1-0 Denmark\nEngland left-back Rachel Daly speaking to the BBC after the win over Denmark about Lauren James' winning goal: \"I'm going to claim a little bit of credit because I said you've got to cut in! We know she's incredible. She brings a different presence to the team and a load of ability. I'm buzzing for her. She is so special and you can see what she can do in tight spaces.\"\nWere you disappointed to be at left-back and not striker? \"Not at all. I'm going to say what I always say. It is an honour to be on this pitch with this team. It's a little different from where I have been playing but not too far from where I was playing last year.\"\nIs it tough to see a team-mate get stretchered off like Keira did? \"It's not nice to see anyone go off injured but Keira is Keira and she is an integral part of the team. I am really really hoping with everything that it isn't anything too serious. She is a special player an special person. Let's hope it isn't as bad as it looked and it was only a precaution.\"\n'Earps positioning excellent'\nFT: England 1-0 Denmark\nJonas Eidevall\nArsenal manager on BBC One\nWith goalkeeping, a lot of the time it is about the positioning.\nToo many times you see keepers get attracted to the front post, and if Earps had done that [for the looping cross in the second half], no matter how well she moved her feet, it would have been a problem.\nBut, Earps had such a good starting position that she made it look like a relatively easy save.", "url": "https://www.bbc.com/sport/live/football/65468314"}