{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 03:53:34", "date_modify": "2025-05-21 03:53:34", "date_publish": "2025-04-07 14:59:30", "description": "'We have got a lot of good players and players that are going to put up a fight.' - Jack Grieves", "filename": "sport_articles_c86j390e569o_1747799614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/85ce/live/b315ff90-13bf-11f0-b1c4-498f305c3d3a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c86j390e569o_1747799614.html", "title": "'We have got a lot of good players and players that are going to put up a fight.'", "title_page": "'We have got a lot of good players and players that are going to put up a fight.' - Jack Grieves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County striker Jack Grieves has vowed they have got the character and quality in the dressing to get them out of relegation danger.\nThe Staggies lost 1-0 at home to Aberdeen on Saturday and are precariously placed 10th in the Premiership table, just one point above Dundee in the relegation play-off spot.\nDespite their recent struggles, Grieves is optimistic about their chances in the ongoing relegation battle.\n\"Obviously we are in a bit of tough period now but I know the character of the boys in that changing room there and we are going to go out there and we are going to give everything we have got for the last six games,\" he said.\n\"We are just focusing on the next game, focusing on winning against St Mirren. I think that is the main thing and if we take it game by game then hopefully by the end of the season we will be in a good place.\n\"For every team there are ups and downs in a season. We have got a lot of talent here and players that are going to put up a fight between now and the end of the season, so I am confident that we can pick back up turn another corner.\"\nIt is not just results which are of concern for County, a lack of cutting edge has become a real problem, having scored only one goal in their past five matches.\n\"To win football matches you have got to score goals,\" Grieves said. \"We struggled to find that moment of quality that meant we could score and give ourselves the chance to win the game.\n'It is frustrating but we have just got to keep going, keep training well and keep giving ourselves the best chance to go out there and win the game. The more we keep at it, it will come.\"", "url": "https://www.bbc.com/sport/articles/c86j390e569o"}