{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 14:06:04", "date_modify": "2025-05-20 14:06:04", "date_publish": "2023-07-30 21:24:32", "description": "Chelsea beat Fulham to win the Premier League Summer Series as Aston Villa and Brentford played out an exciting 3-3 draw in Washington.", "filename": "sport_football_66355876_1747749964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4BC6/production/_130589391_gettyimages-1581168354.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66355876_1747749964.html", "title": "Premier League Summer Series: Chelsea beat Fulham to win pre-season tournament", "title_page": "Premier League Summer Series: Chelsea beat Fulham to win pre-season tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea won the Premier League Summer Series pre-season tournament as they beat Fulham 2-0 at FedEx Field in Maryland.\nA 20th-minute Thiago Silva header from a Ben Chilwell corner opened the scoring.\nA tap-in from Christopher Nkunku just before half-time after good work from Carney Chukwuemeka sealed the win.\nIt was Nkunku's third goal of pre-season following the French striker's £52m move from RB Leipzig.\nThe game was played at the home of NFL team Washington Commanders.\nFulham did not provide much of an attacking threat although Calvin Bassey, playing for the club for the first time since his £19m move from Ajax, headed over from a corner in the second half.\nOne negative for Chelsea was when defender Trevoh Chalobah had to be substituted after receiving treatment for a knock on the pitch.\nThat potential injury will be a worry for new Chelsea manager Mauricio Pochettino, with fellow centre-back Benoit Badiashile not set be fit for the start of the Premier League season.\nChelsea have, however, reached an agreement to sign defender Axel Disasi from AS Monaco for 45m euros (£38.57m).\nVictory means Chelsea have won the first Premier League Summer Series - the pre-season tournament also featuring Aston Villa, Brighton, Brentford, and Newcastle - without losing a game.", "url": "https://www.bbc.com/sport/football/66355876"}