{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:11:30", "date_modify": "2025-04-26 08:11:30", "date_publish": "2025-02-26 12:01:08", "description": "Nottingham Forest news: Reds are 'worthy of the European places'", "filename": "sport_football_articles_c0rzqyz0dxwo_1745655090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/806c/live/fef15400-f434-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rzqyz0dxwo_1745655090.html", "title": "Nottingham Forest news: Reds are 'worthy of the European places'", "title_page": "Nottingham Forest news: Reds are 'worthy of the European places' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Football fans want to see the \"status quo challenged\" as Nottingham Forest try and secure European football, says supporter Ben Marshall.\nThe Reds have gone from a relegation fight last season to the top three of the Premier League, three points clear of Manchester City in fifth. However, that spot could be enough to secure Champions League football next campaign with England leading Uefa's coefficient table for an additional place.\nNuno Espirito Santo's side host Arsenal on Wednesday night as they look to strengthen their position in the race for European football.\n\"We are still in the pinching ourselves phase,\" Marshall told BBC Radio 5 Live Breakfast. \"To have gone from being in relegation scraps for the last couple of years, to be even contemplating the possibility of European football, let alone Champions League football is surreal.\n\"I think the whole city is still in a bit of shock, but all enjoying it while we can. Football is game of fine margins and we know it can change very quickly. The performances have been worthy of the European places, so we just hope we can get it over the line.\n\"In the bigger picture of football, it is great to see teams who are not part of the 'big six' doing well. There is a lot of people who would just like to see the status quo challenged. It is good for football and it gives people hope that their team might go on to succeed and compete at the very top of English football.\n\"There is a real belief we can be in Europe next season. I have preemptively cleared my diary for Thursdays next season.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c0rzqyz0dxwo"}