{"authors": ["Jay Freeman", "www.facebook.com"], "date_download": "2025-05-19 14:42:39", "date_modify": "2025-05-19 14:42:39", "date_publish": "2017-08-19 20:34:55", "description": "A Walsall fan's unexpected ferry ride to Fratton Park and other things you may have missed in Saturday's EFL games.", "filename": "sport_football_40986712_1747665759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1E7D/production/_97450870_gettyimages-835536762.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40986712_1747665759.html", "title": "EFL: A Walsall fan's ferry ride to Fratton Park and other things you may have missed", "title_page": "EFL: A Walsall fan's ferry ride to Fratton Park and other things you may have missed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The English Football League season is already a few weeks old, but not everyone, it seems, has found their bearings.\nThere was an unusual arrival to an away day, a return to remember for one player and one to forget for another, as well as goals galore for one League Two team.\nBBC Sport takes a look at the stories you might have missed from Saturday's EFL action.\nOne Walsall fan has found himself with an invitation to meet the team and have his travel to Portsmouth reimbursed after taking to social media to say he got his accommodation plans a little wrong.\nIn an effort to find a \"cheap\" hotel room for a weekend away to watch the Saddlers take on Portsmouth, fan Davey Drew apparently booked into digs 11 miles away.\nThat 11 miles, however, unwittingly turned out to be across the Solent on the Isle of Wight... an entire ferry trip away from his intended destination.\nInconvenient, sure. But Walsall boss Jon Whitney and his players saw the funnier side and were quick to offer to help cover costs and arrange to meet the fan who needlessly took to the high seas to follow them.\n\"[Midfielder] Joe Edwards offered to pay his ferry fare. I'll chip in as well,\" Whitney told BBC WM 95.6.\n\"It's a funny one but it's great. It's a story for him to tell people so I think it will be quite popular on social media.\n\"We might get to meet him and bring him out and let him see the fans at one home game. We'll pay his fare for him and help him out.\"\nWhile all the extra travel did not ultimately end with victory celebrations, as Portsmouth and Walsall played out a 1-1 draw, there are worse stops to make on away days.\nAston Villa boss Steve Bruce admitted earlier this week that they had experienced an \"awful\" start to the season after they took just one point from their first three games.\n\"I am the right man for the job, my record in the Championship tells me that,\" the Villa manager said after their 2-1 midweek defeat by Reading.\nFortunately for Villa, their opponents Norwich were without a win at Villa Park since November 1992, in what was the first season of the Premier League, so the omens were on their side.\nBruce's side enjoyed a rousing performance in front of a crowd of 29,157 as Conor Hourihane scored a hat-trick on the way to Villa winning 4-2.\nIn his first game for over a year, Chesterfield goalkeeper Tommy Lee had a day to remember as he kept a clean sheet in their win against Port Vale, which lifted them off the bottom of the League Two table.\nLee, 31, missed all of last season with a shoulder injury picked up ahead of the 2016-17 campaign.\nAnd it was a return to savour for the former Manchester United trainee, as he helped ensure the Spireites celebrated victory for the first time this season.\nChasing something out of the game, Vale added pressure right at the end and Lee was on hand to save Tom Pope's 82nd-minute effort off the line.\nAnd the 2-0 win proved a special one for another reason, as the game against Vale was designated 'Ernie Moss Day' to honour the club legend and record goalscorer, who is suffering from a form of dementia.\nOne thing has become abundantly clear in the early weeks of the EFL this season - you get your money's worth by watching Yeovil Town.\nThere have been 22 goals in their first three League Two games so far.\nHowever, of those 22 goals 14 have been goals they have conceded... so, not great on that front.\nAfter being on the receiving end of an 8-2 drubbing away at Luton on the opening day, they bounced back by beating Accrington.\nAt that stage, you could say their season was back on track, albeit after just two games.\nBut the Glovers managed to lose 4-3 against Forest Green on Saturday, despite twice leading by two goals.\nIn contrast, Northampton Town left it until their third game of the season to register their first league goal. Unfortunately it was a consolation as they were defeated 4-1 away at Charlton.", "url": "https://www.bbc.com/sport/football/40986712"}