{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:29:15", "date_modify": "2025-05-20 14:29:15", "date_publish": "2023-07-29 00:00:00", "description": "England beat Malawi in their second Pool B match at the Netball World Cup in Cape Town - follow BBC radio commentary and live text updates.", "filename": "sport_live_netball_65928395_1747751355.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65928395_1747751355.html", "title": "Netball World Cup 2023 LIVE: England beat Malawi- score, commentary & updates in Pool B game", "title_page": "Netball World Cup 2023 LIVE: England beat Malawi- score, commentary & updates in Pool B game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheerio!\nA comfortable victory in terms of the scoreline but plenty for Jess Thirlby's England side to work on heading into their final Pool B match against Scotland on Sunday.\nTheir place in the next phase is all but secured but victory tomorrow will see them top the group with results from this stage carried over to the next.\nWe'll be back with live text and radio commentary from around 15:00 BST tomorrow - until then you can keep up with everything netball here.\nThanks for joining us, see you soon!\n'First quarter not good enough'\nFT: England 62-39 Malawi\nEngland shooter and player of the match Helen Housby speaking on Sky Sports:\n\"We have been trying to work on our connection. When the crowd is so loud sometimes you can't hear each other so you should be able to know where your team-mate is going. We have gone from strength to strength on that.\n\"The first quarter wasn't good enough for us so we'll certainly be looking at that.\"\n'Lots to work on'\nFT: England 62-39 Malawi\nAma Agbeze\nFormer England captain on BBC Radio 5 Live\nWhen they come up against say Australia and New Zealand the physical pressure is going to be immense.\nYou might only have a split second to make a decision and let the ball go, when you have the ball you need to categorically take it to goal.\nIn this game there were lots of errors, there were lots of dropped passes and people pulling the ball way in front of team-mates. There were lots of balls splayed off the backline and that's not the level of play that England expect from themselves or that Jess Thirlby will want.\nShe is a perfectionist, she will be frustrated - happy with the win but lots to work on.\nEngland get the job done\nThat victory also marks England's 100th at a World Cup, not bad.\nThey probably won't care about that - they got the job done here, despite having a few things to clean up on in the coming days.\nNext up they face Scotland in their final Pool B match and victory there will see them top the group which will stand them in excellent stead for the next stage, where results from these matches are carried over.\nMetcalf praises 'awesome' shooters\nFT: England 62-39 Malawi\nEngland captain Nat Metcalf speaking on Sky Sports after the win:\n\"Awesome for us [to have 95% shooting accuracy], something we want to keep building on. Whichever combination is in there they've been doing awesome so we just need to get the ball to them.\n\"When we won ball we really grew into the game - Malawi are an incredible side and happy with the ball so it's really hard to win possession from them. So as we grew into the game we started to do that and take care of it.\"\nFULL-TIME\nQ4: England 62-39 Malawi\nAhh that's a shame! Liv Tchine wanted a repeat of last night where she quickly put the ball in the net to bring up 90 goals for her side.\nThis time it was to take their tally to 63 goals but the whistle had already blown for a contact call in the build-up.\nOne second on the clock and Malawi punt it up court out of danger as the buzzer sounds.\nJob done for England.\nPost\nQ4: England 51-32 Malawi\nA goal apiece for England's shooters as Nat Metcalf brings up the 50 goals for the Roses.\nOne thing to note about having Chelsea Pitman at wing attack and Liv Tchine at goal shooter is that they play together domestically at London Pulse. They have had a ridiculously good season together and know each other well. That can only be a good thing for England.\nPost\nQ3: England 48-29 Malawi\nLess than one minute to go in this third quarter as England continue to make in-roads.\nVictory here sets England well on track to top Pool B. Their spot in the next stage of the tournament is all but secured but results are carried over which means they will want to win, and win comfortably, in these Pool B matches.", "url": "https://www.bbc.com/sport/live/netball/65928395"}