{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 06:19:42", "date_modify": "2025-05-21 06:19:42", "date_publish": "2025-01-14 06:20:10", "description": "Katie Boulter becomes the sixth British player to win in this year's Australian Open singles draws - the most to reach the second round in the nation's history.", "filename": "sport_tennis_articles_cqldr9xnn96o_1747808382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e4c/live/4ae50a40-d26c-11ef-bab6-05d1916ca3e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cqldr9xnn96o_1747808382.html", "title": "Australian Open 2025 results: Katie Boulter wins to set new British record in Melbourne", "title_page": "Australian Open 2025 results: Katie Boulter wins to set new British record in Melbourne - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Katie Boulter became the sixth British player to win their first-round singles match at this year's Australian Open - the most in the nation's history during the Open era.\nBoulter, seeded 22nd, secured the new record with a hard-fought 6-4 3-6 7-5 victory over Canada's Rebecca Marino.\nThe 28-year-old British number one was nowhere near her best against 98th-ranked Marino and needed all of her competitive spirit to get over the line.\n\"That was way too stressful for me, I would have preferred an easier match today,\" said Boulter, who plays Russian Veronika Kudermetova next.\nEmma Raducanu equalled the record earlier on Tuesday when she became the fifth player through to the second round.\nBoulter and Raducanu followed Jack Draper, Jacob Fearnley, Jodie Burrage and Harriet Dart, who all won their opening matches on Monday.\nThe previous record was set in 1974, 1975, 1985 and most recently in 2017.\nHowever, Cameron Norrie was unable to further add to the record tally after he lost to Italy's Matteo Berrettini.\nBoulter enjoyed a fine 2024 season in which she rose into the world's top 25 for the first time in her career.\nA deep run at a Grand Slam tournament remained elusive, though.\nComing into the opening major of the season, Boulter talked about \"putting more emphasis\" on performing well at the sport's biggest events this year.\nBut Boulter, known for her big-serving and heavy-hitting game, almost fell at the first hurdle in Melbourne after meeting her match in the imposing Marino.\nThis was not the same Marino who was thrashed by Boulter's team-mate Raducanu at the BJK Cup Finals in November.\nBoulter was pushed to the limit by Marino, whose powerful game led to a host of untouchable aces and clean winners.\nNot known to get routinely flustered, Boulter was often seeking reassurance from her box and regularly trying to motivate herself with pep talks.\nWhen Marino swatted a thunderous forehand down the line to hold for 2-2 in the decider, a bemused Boulter could only laugh.\nA poor dropshot from the baseline in the next game was a sign of the tension she was feeling and she needed the backing of the Melbourne crowd - well aware of her recent engagement to Australian number one Alex de Minaur - to help save two break points.\nHe appeared on court before the sixth game, having won his opening match a short time before, to add extra support.\nFrom 5-5 0-30 down, Boulter showed her character to hold and took her second match point in the next game with a clinical forehand down the line.\n\"It was a massive mental challenge for me,\" said Leicestershire's Boulter. \"She came out firing and played great.\n\"I'm happy I found a way - sometimes that's what these round one matches are about.\"\nNorrie's ambitions of stringing together some wins at the opening Grand Slam of the season were also hit by the tough draw.\nBerrettini, the 2021 Wimbledon finalist and a former world number four, has suffered with injuries in recent seasons, but is back to 34th in the rankings and possesses one of the most potent serves on the ATP Tour.\nNorrie created five break points in the match but was unable to take the Italian's serve.\nNorrie reached a career-high of eighth in the world following a stellar 2022 season where he reached the Wimbledon semi-finals.\nHampered by form and fitness issues last year, he has now slipped to 52nd in the world.\nBut Norrie remains confident in his ability and is not worried about his falling outside of the top 60 after the Australian Open.\n\"I feel I'm hitting the ball as well as I can and I'm really happy with the work I've been putting in,\" said Norrie, who is unsure if he will be able to play in the Melbourne doubles alongside Marcus Willis.\n\"I feel clear in how I want to play and construct points. That's more important than the ranking.\"", "url": "https://www.bbc.com/sport/tennis/articles/cqldr9xnn96o"}