{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-04-26 04:17:10", "date_modify": "2025-04-26 04:17:10", "date_publish": "2025-03-04 08:08:22", "description": "Will Stuart's Test career seemed in jeopardy after a tough summer, but he has bounced back as one of the major plus points of England's Six Nations", "filename": "sport_rugby-union_articles_c7890gdrykro_1745641030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16d3/live/f20cfae0-f84a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c7890gdrykro_1745641030.html", "title": "Will Stuart: England prop on Six Nations scrum supremacy and Lions", "title_page": "Will Stuart: England prop on Six Nations scrum supremacy and Lions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Will Stuart knows his history.\nAway from the pitch, the England prop has just finished reading Tom Holland's Rubicon, a book on power and plotting in the Roman Empire.\nBeneath that on the bedside table is a biography of military genius Napoleon Bonaparte.\nIn Stuart's earphones has been a podcast detailing the brutality of the Eastern Front in World War Two.\nProfessionally, though he has been stewing over more recent events.\nEight months ago, Stuart was forced into his own retreat, coming under severe scrum pressure in two summer Tests in New Zealand.\nCoach Steve Borthwick publicly admitted he was looking for reinforcements in Stuart's tight-head prop position.\nThe 28-year-old was duly left off the list for the first set of central contracts in October.\nHis job security wasn't helped by a trio of front-row tyros – Afolabi Fasogbon, Billy Sela and Asher Opoku Fordjour – emerging out of England's Under-20 Rugby World Cup success either.\n\"In the summer I knew I hadn't done myself any kind of justice, that I hadn't put my hand forward,\" Stuart tells BBC Sport.\n\"There were open and honest conversations and I was under no illusion that performance-wise I had a lot of work to do.\n\"I just needed to get my head down, fly into club games, get better and try to cement myself more as a starting tight-head.\"\nIn typically understated fashion, he has done just that.\nHis club side Bath are well clear at the top of the Premiership, while he took on the southern-hemisphere's finest at the set-piece in the autumn and held his own. And, so far in the Six Nations, he has been one of England's big plus points.\nStuart and his front-row colleagues are in profit in the tournament, winning five scrum penalties and conceded three across their face-offs with Ireland, France and Scotland - a stat few would have predicted after their struggles in New Zealand.\n\"We have taken a step forward from last summer,\" he adds.\n\"We came into the autumn, we were very clean, good on our own ball, we were trying to be square and rock solid.\n\"Now there is a big onus on trying to take another step forward - to being dominant.\"\nStuart has been helped by the lingering effects of a 2022 elbow dislocation finally dissipating.\nBut that scrum supremacy is also closer thanks to a more collaborative approach in training.\nThe focus has shifted from scrapping for starting spots to laying waste to England's opponents.\n\"When you come in this environment you are competing with other lads to try to play,\" Stuart says.\n\"Scrums are very competitive, combative places and it can end up being messy and a bit of a 'man test', with stuff going on the floor. That is not really how you want to train.\n\"You want to train so that everyone gets better – keeping scrums off the deck and not wasting any reps. It was something that Coley [Dan Cole] spoke about in the summer. Ever since then we have been training very purposefully,\n\"It is still competitive, but you realise there is no point collapsing in a scrum in training when you are about to get sent backwards. It is about taking your medicine, keeping it up, being clean.\n\"It feels like the group has all bought into it. It feels like a big shift in that regard.\"\nIt is perhaps not a surprise this collective approach has brought the best out of Stuart.\nThere have been some big characters among England's biggest men in recent years, with Joe Marler, who retired in the autumn, the most notable. Vice-captain Ellis Genge speaks his mind to those inside and outside the camp, while former skipper Jamie George is still a key leader. Even Cole has his own podcast.\nStuart, who will end the Six Nations on 50 caps if he plays against Italy and Wales, prefers a lower profile.\n\"I am pretty awful,\" he smiles. \"How can I put this? I am not the most sociable person, I am a bit of a hermit.\n\"I live in a little village outside of Bath and it is very quiet, which is my set-up and how I like it.\"\nIt is getting difficult for him to escape the hubbub though.\nHis form, and Ireland tight-head Tadhg Furlong's injury run, has put him firmly into Lions contention.\nStuart would be a first-time tourist - his Lions memories don't stretch as far back as his books.\nHe remembers watching the 2013 trip to Australia at school and then, after turning professional, hearing Bath team-mate Jamie Roberts recount his experiences on repeat.\n\"He was always reminding everyone that he was the Lions man of the tour in 2009, he wouldn't stop going on about it,\" Stuart jokes. \"I think he made us watch his clips.\n\"I haven't really thought about it. After the last summer I just needed to knuckle down, game by game, and play well. I am just trying to stay along those lines.\"\nReading up on the past, while not reading too far into the future, has kept him well on course so far.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c7890gdrykro"}