{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:40:18", "date_modify": "2025-05-21 05:40:18", "date_publish": "2025-02-08 21:27:58", "description": "Carlos Alcaraz will face Alex de Minaur in the Rotterdam Open final on Sunday after defeating Hubert Hurkacz in the semi-finals.", "filename": "sport_tennis_articles_c4g3ypr7mmgo_1747806018.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7212/live/b736c1d0-e661-11ef-bc01-df929f1ad767.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c4g3ypr7mmgo_1747806018.html", "title": "Rotterdam Open: Carlos Alcaraz to face Alex de Minaur in Sunday's final", "title_page": "Rotterdam Open: Carlos Alcaraz to face Alex de Minaur in Sunday's final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlos Alcaraz will face Alex de Minaur in the Rotterdam Open final on Sunday after defeating Hubert Hurkacz in the semi-finals.\nThe 21-year-old top seed won 6-4 6-7 (5-7) 6-3 against Poland's Hurkacz at the ATP 500 indoor hard-court event.\nWorld number eight De Minaur, 25, booked his place in the final with a straight-set semi-final victory over Mattia Bellucci.\nThe Australian third seed cruised past his Italian opponent 6-1 6-2.\nFour-time Grand Slam winner Alcaraz made a slow start to his debut at the event and quickly found himself 3-0 down, before fighting back to take the first set.\n\"I think he had chances to make it 6-0 so I just tried to fight for every ball, every point,\" said the world number three.\nWith the second set going to a tie-break, both players squandered chances to seize the advantage. It was a double fault from Alcaraz at 5-4 up that handed Hurkacz the opportunity to draw level and the 27-year-old took the set after the Spaniard netted a simple backhand.\nAlcaraz found his stride in the third set, however, and he reached the final with a forehand winner after a thrilling contest.\n\"I just tried to stay in there, keep fighting all the time and it paid off,\" added Alcaraz.\nDe Minaur's last-four tie was a stroll in contrast.\nBellucci had knocked out Daniil Medvedev and Stefanos Tsitsipas on his way to the semi-finals but De Minaur was too strong for the 23-year-old qualifier.\nDe Minaur, who won all of his matches in Rotterdam in straight sets, was runner-up to world number one Jannik Sinner in the final last year.\n\"The Dutch crowd always treats me very well, and I love coming back here, so hopefully I can get a title this time,\" he said.\nElsewhere, Norway's second seed Casper Ruud will face Canada's Denis Shapovalov in the Dallas Open final on Sunday.\nWorld number five Ruud beat Spain's Jaume Munar 6-2 2-6 7-6 (7-4) in the semi-finals, while Shapovalov defeated American third seed Tommy Paul 7-5 6-3.", "url": "https://www.bbc.com/sport/tennis/articles/c4g3ypr7mmgo"}