{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 11:59:14", "date_modify": "2025-05-20 11:59:14", "date_publish": "2023-08-06 09:28:52", "description": "Kiernan Dewsbury-Hall scores twice late on in normal time as Leicester City come from behind to beat Coventry City.", "filename": "sport_football_66352123_1747742354.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E5B7/production/_130670885_kdh.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352123_1747742354.html", "title": "Leicester City 2-1 Coventry - Kiernan Dewsbury-Hall scores two late goals to snatch victory", "title_page": "Leicester City 2-1 Coventry - Kiernan Dewsbury-Hall scores two late goals to snatch victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City midfielder Kiernan Dewsbury-Hall struck two late goals as the relegated Foxes began life back in the Championship by beating luckless Coventry City.\nLast season's beaten Championship play-off finalists looked on course for a deserved three points when they led through Kyle McFadzean's 47th-minute opener from a near-post corner.\nThe Gus Hamer-inspired Sky Blues also wasted good chances either side of the City skipper's strike.\nBut Mark Robins' men were made to pay when Dewsbury-Hall levelled on 77 minutes before being fed by new signing Stephy Mavididi to curl home an 87th-minute winner - and earn victory for new Foxes boss Enzo Maresca, in his first game in charge.\nBoth sides opted to play four of their summer signings from the start.\nLeicester keeper Mads Hermansen, midfielder Harry Winks and striker Stephy Mavididi all came in to make their debuts, as well as on-loan Manchester City defender Callum Doyle against the club where he spent last season.\nThe Foxes also gave young striker Kasey McAteer his first league start, while fit-again Danish defender Jannik Vestergaard made his first league appearance since February 2022.\nCoventry, who had keeper Ben Wilson fit following a pre-season back injury, had three new defenders in front of him, Jay Dasilva, Bobby Thomas and Joel Latibeaudiere.\nEllis Simms started up front, while Hamer was also in the line-up despite considerable summer transfer speculation - and the Sky Blues had new record signing Haji Wright to bring off the bench.\nThey were much the better side from the moment Kasey Palmer's chip went just over and he also had another shot deflected wide.\nTwo shots were then blocked from Simms and McFadzean in the same goalmouth skirmish from a Hamer corner just before the break.\nCoventry continued to threaten from the restart and might have gone ahead through Simms, who skewed wide, before McFadzean peeled off his marker at the front post to power home Hamer's left-wing corner.\nMatty Godden, cleverly fed by Palmer, was denied by a one-handed save by Hermansen and then really should have done better from a great 50-yard ball from Hamer, but his low left-foot finish was poor - weak and well wide.\nHamer, who has had a disrupted pre-season, then crucially came off with a calf injury and, without their main influence, the visitors were made to pay for their profligacy when Dennis Praet crossed from the right for Dewsbury-Hall to power home an equalising header.\nCoventry substitute Wright had a chance to put Coventry back in front with a powerful shot deflected onto the bar by Hermansen, but Godden diverted the rebound wide, with the keeper beaten.\nAnd, barely a minute later, Leicester went back up the other end to win it, with Dewsbury-Hall's superb right-foot curler from 15 yards.\nLeicester now face two away tests - a Tuesday night EFL Cup derby at Burton Albion before next Saturday's trip to Huddersfield.\nCoventry go to Wimbledon in the EFL Cup on Wednesday night before hosting Middlesbrough, the team they beat in last season's Championship play-off semi-finals, at the CBS Arena.\nLeicester City boss Enzo Maresca told BBC Radio Leicester:\n\"We conceded from a set-piece. It was not easy to come back but we did it - and the feeling to get three points was unbelievable.\n\"It is never easy, especially against a team that less than two months ago was in the final to get promoted, a very good team with good organisation.\n\"When I checked the numbers of the players in terms of goals and assists, I told them that they have the quality to score more goals and make more assists.\n\"The only way to do it is to arrive in the box. For attacking midfielders like Kiernan, Dennis and Wilfred Ndidi, the only way to score is to arrive in the box - and Kiernan scored because he was there.\"\nCoventry City boss Mark Robins told BBC CWR:\n\"We looked like we can be a really good side this year, but they've got Premier League quality - and they showed it when it mattered.\n\"We got our noses in front from a well-worked corner, but we had good chances to score, which we did not take.\n\"Matty Godden had two or three chances he would normally finish and Haji Wright came on and hit the bar. If we'd have taken just one of them, we'd have won the game.\n\"We were forced into a few changes late on. Gus Hamer was feeling his calf and had to come off.\"", "url": "https://www.bbc.com/sport/football/66352123"}