{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:08", "date_modify": "2025-05-21 05:35:08", "date_publish": "2025-04-02 14:44:21", "description": "Portsmouth defender Connor Ogilvie says he has adapted to life in the Championship during his first season playing at this level.", "filename": "sport_football_articles_cjr74yqg1d3o_1747805708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d9e/live/4210a780-0fcf-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjr74yqg1d3o_1747805708.html", "title": "Portsmouth FC: I've adapted to the Championship", "title_page": "Portsmouth FC: I've adapted to the Championship - Connor Ogilvie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth defender Connor Ogilvie says he has adapted to life in the Championship in his first season playing at this level.\nThe 29-year-old impressed again last weekend during Pompey's 1-0 win over Blackburn Rovers at Fratton Park.\n\"I always try to believe in my ability, I knew I could do it,\" Ogilvie told BBC Radio Solent ahead of the trip to Millwall on Saturday (15:00 BST).\n\"It was just a case of adapting to the Championship and I feel like I've done that now.\"\nOgilvie, who switched from left-back to centre-back in the past two games and has also chipped in with four league goals this season, says he's worked on being \"more aggressive\" and \"subtle details\" in training to improve.\n\"That is why I joined Portsmouth, to be in the Championship,\" said Ogilvie, who spent three years in League One with the club before winning promotion last season.\n\"Obviously it took a little while longer than we hoped for but we got there and we just need to maintain that Championship status now.\"\nPompey are seven points clear of the drop zone in 17th with seven games remaining and Ogilvie says \"results are the main thing now\".\n\"It's in our hands, we've put ourselves in a good place but now it's just about us, what we do on the pitch to get the results needed to stay up,\" he added.\n\"Performances could be here nor there, so we just need to get the results and hopefully the performances to match them.\"", "url": "https://www.bbc.com/sport/football/articles/cjr74yqg1d3o"}