{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:03:52", "date_modify": "2025-05-21 04:03:52", "date_publish": "2025-04-04 06:25:03", "description": "Monaghan legend and BBC pundit Conor McManus explains why the calendar needs tweaked, reflects on the positive impact of the new rules and runs through this year's Ulster contenders.", "filename": "sport_articles_c9w8re9l7pqo_1747800232.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7d5/live/086d1ef0-10a6-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9w8re9l7pqo_1747800232.html", "title": "Ulster SFC 2025: Championship can still deliver despite GAA's crammed schedule", "title_page": "Ulster SFC 2025: Championship can still deliver despite GAA's crammed schedule - Conor McManus column - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two-time Ulster Championship winner Conor McManus will be part of the BBC's championship coverage in 2025, starting with Donegal v Derry on Sunday. Here, Monaghan's recently-retired three-time All-Star forward explains why the calendar needs tweaked, reflects on the positive impact of the new rules and runs through this year's Ulster contenders.\nSitting here, looking out the window at the sun splitting the trees, it's hard not to feel the pangs of longing for the thrill of the championship.\nIt was inevitable. I've been retired a few months now. I'm comfortable with the decision, and while I'm excited to be involved as an analyst for the first time, there is no substitute for being in the thick of it wearing your county colours.\nThings are different now, of course. Traditionally, there was a six or seven-week build-up to the championship after the league.\nAs a player, that in-between period was an important stage of the season. Six weeks of hard training at Cloghan, whipping yourself into shape for the biggest months of the season, it all added to the pre-championship excitement.\nIt was tough going, but rewarding, and once you'd finished that block of training, you felt ready to have a proper rattle at it.\nThat's all gone now: here we have the Ulster Championship starting seven days after the Division One final. It's completely wrong. Teams should be striving to win the league, have a reset period and then focus on championship, but this is where we're at.\nBut even without that lead-in period, the Ulster Championship should still deliver, especially with the new rules which have made the game a better spectacle.\nIt's definitely better to watch, and from speaking to a few of the Monaghan boys, it's more enjoyable to play. You can see that from watching the games, too. There are more opportunities to kick, to attack, to take your man on and express yourself.\nThe forwards are definitely enjoying it - it's become a more forward-oriented game rather than the defence-driven product we all grew tired of in recent years.\nWe're on the right track, but improvements can still be made. A two-pointer for a free? I don't think we need that. It's working out for Monaghan obviously with Rory [Beggan]'s kicking, so we'll not complain, but generally speaking it's too easy for an inter-county player to be given a two-pointer for a free right in front of the goals.\nAs for this year's Ulster Championship, let's start with the reigning All-Ireland champions. Armagh are carrying that tag for the first time in over 20 years and will obviously have a huge say in where the Anglo-Celt ends up.\nThis Armagh squad have been on the go a long time now and haven't managed to win an Ulster title, so that will definitely be in their heads. They've lost the past two finals on penalties and you'd expect them to be there or thereabouts again.\nObviously, Donegal are the holders and they're even stronger than they were last year.\nThey have a few big players back involved. Michael Murphy's the biggest one of those, Odhran McFadden-Ferry's back in there, Finbarr Roarty and Eoin McHugh too, so they've a deeper and better squad.\nJim McGuinness has always put massive stock on the Ulster Championship and this year will be no different.\nTyrone are an interesting case. They were relegated from Division One, but relegated with seven points and victories over Donegal and Dublin, which is pretty unique.\nI don't think they will be overly concerned with where they're at. In fact, they will be relatively content, and knowing Malachy O'Rourke, Ryan Porter and Leo McBride, they will leave no stone unturned getting Tyrone ready to face Cavan in a fortnight's time.\nFor Monaghan, winning games has bred confidence. That's big going into a championship campaign, but it must be said that the standard in Division Two this year was quite poor.\nA lot of Monaghan games I watched, they were very comfortable wins against Cork, Louth and Meath. The standard of those teams isn't comparable to what they'll face in Ulster.\nMonaghan will face the winner of Sunday's preliminary tie between Donegal and Derry. As mentioned earlier, Donegal are looking strong. Derry have had a rough time.\nThey haven't won a game in regulation since they beat Westmeath in the round-robin last year. It's a long time to go without winning a game of any description.\nLooking at it purely on the league table, you'd say they're in trouble heading to Ballybofey, but I don't think it's as bad as that.\nThey should have beaten Kerry bar two late goals and a catastrophe at the end, they drew with Galway who were arguably the in-form team at that point, and were five or six points up after 65 minutes of their defeat by Donegal.\nI don't think their situation is as bad as the league table would have you believe, but they are missing a lot of key players. Look at the defence, for example. Conor McCluskey is out, Gareth McKinless is out and Chrissy McKaigue is retired. That's three All-Star defenders out of the picture.\nThen there are the question marks over Brendan Rogers' fitness. I'd expect him to play on Sunday, but how fit is he? At the other end, they're heavily reliant on Shane McGuigan and if Donegal keep him quiet, it's hard to see where Derry's scores are coming from.\nYou put all that together and the fact they're away to Donegal, who were the form team in the early rounds of the league before putting the handbrake on, it's hard to see how Derry can lift it to a level where they can beat Donegal.", "url": "https://www.bbc.com/sport/articles/c9w8re9l7pqo"}