{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:01:07", "date_modify": "2025-05-20 12:01:07", "date_publish": "2023-07-26 07:07:03", "description": "Before the third season of The Hundred begins, get to know Trent Rockets and find out who their key players will be.", "filename": "sport_cricket_66228528_1747742467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/104AA/production/_130503766_-00f85945-cb93-471b-8e0a-1ba064db3187.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66228528_1747742467.html", "title": "The Hundred 2023: Meet Trent Rockets as Dawid Malan & Nat Sciver-Brunt name players to watch", "title_page": "The Hundred 2023: Meet Trent Rockets as Dawid Malan & Nat Sciver-Brunt name players to watch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport has worked with data analysts CricViz to look at the strengths and weaknesses of each side.\nMen's team\nDefending champions Rockets persisted with a left-right batting combination throughout 2022 and will be looking to do the same this year with Dawid Malan and Colin Munro complementing Alex Hales and Tom Kohler-Cadmore. This strategy suits the lopsided nature of Trent Bridge.\nThe likes of Samit Patel, skipper Lewis Gregory, Daniel Sams and Imad Wasim also provide plenty of firepower down the order.\nWith the ball, Rockets have plenty of variety with the capability to cover pretty much every bowling style in an XI depending on opposition.\nThe only area where they perhaps lack quality is at the death. However, last year they regularly took wickets and mixed up their bowlers to exploit conditions.\nThe late withdrawal of Afghanistan leg-spinner and number one-ranked T20 bowler Rashid Khan is a significant blow, but his replacement for the first three games Imad Wasim is used to conditions at Trent Bridge, having played for Nottinghamshire in the T20 Blast, and offers skills with bat and ball.\nHowever, New Zealand spinner Ish Sodhi, who will come in as planned for the fourth game onwards, offers less with the bat and in the field, and that may affect Rockets as the tournament progresses.\nWomen's team\nTrent Rockets have arguably the in-form batter in the world in Nat Sciver-Brunt - the England all-rounder has taken her game to another level this year for both England and her Women's Premier League outfit Mumbai Indians.\nHarmanpreet Kaur captained champions Mumbai and she should slot in alongside Sciver-Brunt in the middle of the order with Lizelle Lee and Bryony Smith charged with getting the Rockets off to a quick start.\nNat Sciver-Brunt will also be vital for the Rockets with the ball alongside Katherine Sciver-Brunt and leg-spinner Alana King, who returns to the side after taking a hat-trick in Rockets colours at Old Trafford last season.\nLeft-arm spinner Kirstie Gordon and right-arm quick Grace Potts were mid-priced picks for the Rockets and could be valuable in complimenting the star trio of bowlers at the Rockets in 2023.\nBBC Sport spoke to a player from each men's and women's team and asked them to pick two key players to watch, and talk about their chances this year.\nTrent Rockets batter Dawid Malan: \"Alex Hales is obviously one, if he has a good season he will light up any team that he plays in. Last year, Luke Wood had a fantastic year for us and he shows if you can take wickets with the new ball you are in the game.\n\"We've pretty much had the same team for three years, we've had a few additions here and there and released a few players, but predominately, the core has been the same. I's proven over the last two years that if that core of players perform like they should perform, then we will be pushing towards that semi-final or the play-offs, at least.\"\nTrent Rockets all-rounder Nat Sciver-Brunt: \"You can't look past the signing of Harmanpreet Kaur who I've obviously played in India with and then Alana King, she obviously did really well last year and leg spinners in T20 cricket and The Hundred are very important.\n\"We've been building in the past couple of years ... hopefully we can go one better this year and get into that final spot. Obviously with franchise cricket, where you come and play for a month and go again, it's important to gel as a team. Hopefully, we can do that quite quickly and get it done.\"", "url": "https://www.bbc.com/sport/cricket/66228528"}