{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 14:14:48", "date_modify": "2025-05-20 14:14:48", "date_publish": "2023-07-29 18:01:25", "description": "Ireland score four goals in six minutes to turn a 2-1 deficit into a 5-2 victory over Ukraine to win EuroHockey II.", "filename": "sport_hockey_66350981_1747750488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16C40/production/_130584239_ukraineshot.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_hockey_66350981_1747750488.html", "title": "EuroHockey II: Irish fight back to defeat Ukraine in Dublin decider", "title_page": "EuroHockey II: Irish fight back to defeat Ukraine in Dublin decider - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland scored four goals in six fourth-quarter minutes to turn a 2-1 deficit into a 5-2 victory over Ukraine in the EuroHockey Division II final.\nAfter Shane O'Donoghue gave Ireland the lead, goals from Viacheslav Paziuk and Oleksandr Boiko put Ukraine 2-1 in front at half-time.\nWith a shock on the cards two goals in as many minutes from captain Sean Murray put Ireland ahead.\nBen Walker and Lee Cole struck to seal victory for the Dublin hosts.\n\"The doubts certainly began to creep in especially after the third quarter when we had created a lot of chances but hadn't managed to level the game up,\" said Ireland captain Sean Murray.\n\"To be fair Ukraine put up a really strong fight so we're just thankful that in the fourth quarter we managed to get ahead and get the result.\n\"After the semi-final we said you don't get to many chances to win a tournament and at home as well so to achieve both the goals this week of winning a place in the Olympic Qualifiers and then go on a win the tournament in front of a home crowd is very important.\"\nBoth Ireland and Ukraine had secured their places at the Olympic Qualification Tournaments next January after semi-final victories on Friday.\nUkraine had grown into the tournament and the first meeting between the sides only five days ago, when Ireland won 7-0, already seemed like a distant memory after the first quarter.\nThe Irish started well enough O'Donoghue converted their first penalty corner off the stick of Ukrainian goalkeeper Bohdan Tovstolytkin.\nHowever, the visitors weren't behind for long. Davy Harte had already made one spectacular save but there was nothing he could do to stop the effort from a corner by Viacheslav Paziuk.\nThree minutes later Ireland found themselves behind in a game for the first time in the tournament when Oleksandr Boiko capitalised on a poor bit of defending to fairly blast the ball past Harte.\nThe second quarter was dominated by Ireland with Ben Walker and Johnny McKee seeing efforts go wide but at half-time the home side had work to do.\nO'Donoghue rattled the post from another penalty corner in the third quarter as Ireland began to turn the screw but with 10 minutes remaining in the game, and after squandering a few good chances, they still trailed.\nThen up stepped Murray, stealing the ball in midfield and controlling it into the circle before firing an unstoppable shot into the corner.\nBarely two minutes later he was unmarked on the penalty spot to slide home the go-ahead goal.\nThe Ukrainian spirit was ebbing away and Walker scored soon after to open up a two-goal advantage.\nCole secured the top scorer in the tournament award by converting a penalty stroke while Murray was named Player of the Tournament.\nThe Olympic qualifiers will be held in Valencia and Lahore in January with eight countries in each tournament. Ireland will find out which one they will be in at the end of the Continental Championships in November.", "url": "https://www.bbc.com/sport/hockey/66350981"}