{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:59", "date_modify": "2025-04-26 03:40:59", "date_publish": "2025-03-05 09:18:27", "description": "Newcastle defender Lewis Hall is ruled out for the remainder of the season with a foot injury.", "filename": "sport_football_articles_cgm1wdr12p4o_1745638859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec4f/live/934f18a0-f9a1-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgm1wdr12p4o_1745638859.html", "title": "Lewis Hall: Newcastle defender to miss remainder of season with foot injury", "title_page": "Lewis Hall: Newcastle defender to miss remainder of season with foot injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle defender Lewis Hall has been ruled out for the remainder of the season with a foot injury.\nThe 20-year-old England international sustained the injury during his side's 2-0 Premier League defeat by Liverpool in February.\nHall's absence is another blow to Eddie Howe's side who take on Liverpool in the Carabao Cup final on Sunday, 16 March, with forward Antony Gordon set to be banned.\nHall is set to \"undergo surgery before a period of rehabilitation with the club's medical team\", Newcastle said in a statement.\n\"Everyone at Newcastle United wishes Lewis the very best with his surgery and recovery,\" the club added.\nHall has established himself as the Magpies' first-choice left-back this season, making 27 Premier League appearances.\nIn November he made his England debut, coming on as a substitute during the Three Lions' 3-0 Nations League win against Greece.\nHall has been among the Premier League's most consistent left-backs and would have been pushing for a place in new England manager Thomas Tuchel's first squad, announced next Friday, 14 March.\nNewcastle are currently sixth in the Premier League, two points behind Chelsea in fifth and three points behind fourth-placed Manchester City.", "url": "https://www.bbc.co.uk/sport/football/articles/cgm1wdr12p4o"}