{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 13:35:05", "date_modify": "2025-05-20 13:35:05", "date_publish": "2023-08-01 21:38:54", "description": "Bethany Firth claims gold as Great Britain record a one-two-three for the second day in a row at the Para Swimming World Championships in Manchester.", "filename": "sport_disability-sport_66375637_1747748105.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9601/production/_130610483_4c3d86f1d7693f8df83a35893f317607ad186e24.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66375637_1747748105.html", "title": "Para Swimming World Championships: Bethany Firth retains title in Great Britain clean sweep", "title_page": "Para Swimming World Championships: Bethany Firth retains title in Great Britain clean sweep - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain recorded a one-two-three for the second night in a row as they enjoyed more medal success at the Para Swimming World Championships.\nBethany Firth retained her S14 100m backstroke title in Manchester in a new championship record, ahead of Poppy Maskill and Georgia Sheffield.\nIt followed the clean sweep in the women's S14 200m freestyle on Monday.\n\"To get a one-two-three last night and tonight shows how strong we are as a team,\" Firth told BBC Sport.\nThere were also golds on day two for Alice Tai (S8 100m backstroke) and Becky Redfern (SB13 100m breaststroke).\nFirth had finished second behind Jessica-Jane Applegate in the freestyle, but the backstroke is an event where the Northern Ireland woman first won gold when representing Ireland at the 2012 Paralympics and has dominated ever since.\nThe 27-year-old qualified second-fastest behind Maskill but started the final strongly and, although the 18-year-old came back on the second 50m, Firth had enough to win in one minute 5.80 seconds.\nIt bettered her time from the 2019 Worlds in London, with Maskill 0.07 seconds back and Sheffield third on her major championship debut.\n\"Coming out tonight I just wanted to go out and have fun,\" Firth added. \"We have so many new girls up and coming, which is amazing, and being one of the older ones you do get nervous.\n\"I have held the backstroke record for so long that I wanted to enjoy it and whatever happens was going to happen.\"\nTai, who missed the Tokyo Paralympics through injury, opted to have her right leg amputated below the knee in early 2022 and underwent further surgery on her arm in November, only returning to training three months ago.\n\"I felt great to 75m, I was pleased with my last 25m but it really hurt,\" said the 24-year-old, who beat her nearest rival Xenia Palazzo of Italy by 7.29secs.\n\"I never used to get emotional over swimming. I have won so much and achieved so many things and I am so proud of them, but I cried at Worlds last year when I won silver - and I thought I was going to cry here.\n\"I have missed it so much and I am so proud of myself and so happy to be back here with friends and back on the podium.\"\nRedfern, the only mother on the team after giving birth to son Patrick in early 2020, regained the SB13 breaststroke title she had won in London in 2019 after a battle with reigning champion Colleen Young of the United States.\n\"It feels amazing to be back on top of the podium,\" said the 23-year-old. \"It proves to everyone you can go off and live your life but still smash it in the pool so I am pretty happy today.\n\"There has been a lot of hard work and support from my family and coach to get me to this point.\n\"I bring my motherly skills with me at training camp and competition and I think with the younger members of the team I feel like I look after them and mother them and make sure they are OK.\"\nElsewhere, Stephen Clegg narrowly missed out on a second gold when he was beaten into second place by 0.13secs by Brazil's Douglas Matera in the S12 100m butterfly.\nEllie Challis followed up her SB2 50m breaststroke gold with bronze in the SM3 150m IM.\nAnd there were first World Championship medals for debutant Faye Rogers who was third in the SM10 200m individual medley, and for her fellow Scot Sam Downie who took bronze in the S8 100m backstroke.", "url": "https://www.bbc.com/sport/disability-sport/66375637"}