{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:03", "date_modify": "2025-05-21 06:43:03", "date_publish": "2024-12-24 09:08:29", "description": "Opener Sam Konstas is set to become Australia men's youngest Test batting debutant in 71 years in the Boxing Day Test against India.", "filename": "sport_cricket_articles_ckg9j7yr3xzo_1747809783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5903/live/f461ae70-c1d2-11ef-9e92-076070f32991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckg9j7yr3xzo_1747809783.html", "title": "Australia vs India: Sam Konstas, 19, to make debut for hosts in Boxing Day Test", "title_page": "Australia vs India: Sam Konstas, 19, to make debut for hosts in Boxing Day Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Opener Sam Konstas is set to become Australia men's youngest Test batting debutant in 71 years in the Boxing Day Test against India.\nThe 19-year-old was called up to replace Nathan McSweeney last week after he managed only 72 runs across six innings at an average of 14.40.\nThe series is currently tied at 1-1 with two matches left to play.\n\"He's composed, relaxed, knows his game is in a good place at the moment, he'll play Boxing Day,\" said Australia coach Andrew McDonald.\n\"We're really excited for him, Boxing Day, the biggest stage. He might as well get that one out of the way early.\"\nNew South Wales' Konstas will be Australia's youngest batting debutant since Ian Craig in 1953.\nEarlier this season Konstas scored two centuries against South Australia in the Sheffield Shield, becoming the youngest player to do so since Ricky Ponting in 1993.\nMcDonald said he has been selected to take the game to India at the Melbourne Cricket Ground, with bowlers having had the upper hand in the series so far.\n\"We want to throw a different challenge at India at this point in time,\" said McDonald.\n\"We believe Nathan [McSweeney] is good enough for Test level. We weren't sure about how the top order was functioning. We challenged ourselves for that decision. Whether it works or not, time will tell (but) we're really confident that Sam can do the job.\"\nMcDonald was also \"pretty confident\" Travis Head would be fit to play despite a quad strain preventing him from training on Monday.\nThe 30-year-old left-hand batter has scored 409 runs including two centuries in the first three Tests,\nMcDonald also said that paceman Scott Boland would likely come in for the injured Josh Hazlewood, and confirmed all-rounder Mitchell Marsh was fit to play.\nSkipper Pat Cummins is set to reveal the rest of the Australia line-up on Wednesday, with the match starting at 23:30 GMT.\nThere will be ball-by-ball commentary on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app, where video highlights will also be available (all UK users only).", "url": "https://www.bbc.com/sport/cricket/articles/ckg9j7yr3xzo"}