{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:44", "date_modify": "2025-05-21 06:10:44", "date_publish": "2025-01-22 22:32:48", "description": "Arsenal 3-0 Dinamo Zagreb: 'A tough month but keep being positive' - Declan Rice reacts to win", "filename": "sport_football_articles_c4gx24jx40lo_1747807844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/914a/live/9b05d6d0-d910-11ef-91ec-85b7dec6275a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gx24jx40lo_1747807844.html", "title": "'A tough month but keep being positive'", "title_page": "Arsenal 3-0 Dinamo Zagreb: 'A tough month but keep being positive' - Declan Rice reacts to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's Declan Rice, speaking to TNT Sport on sharing collective responsibility: \"It's so important, I think the manager has been on us really hard about midfielders arriving because so many goals can come from there.\n\"It's down to us to make up that extra five, 10 yards.\n\"Martin [Odegaard] obviously did there at the end, I did for the header, so we've got to keep arriving there. Everybody's contributing.\n\"Look it was an important win tonight. It's been a very positive Champions League campaign, so we've got one more to go now, hopefully we can win that as well.\"\nOn taking the momentum into the second half of the season: \"I hope so. What I learned from last year is that you need to be there or there abouts at this time of the season and we are at the minute.\n\"Look, we need to keep winning games. I think the game at the weekend, 2-0 up [against Aston Villa], we drew 2-2. It's a real kick in the teeth, we should be seeing it out but to bounce back tonight and win and now we go into Wolves.\"\n\"It's been a tough month but keep being positive and we go again.\"", "url": "https://www.bbc.com/sport/football/articles/c4gx24jx40lo"}