{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:12", "date_modify": "2025-05-21 04:17:12", "date_publish": "2025-04-05 17:24:45", "description": "English rider Richard Cooper wins two Supersport races and two Supertwins events to take a four-timer at the opening round of the Ulster Superbike Championship at Bishopscourt.", "filename": "sport_motorsport_articles_c62z6gd3p22o_1747801032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c2c/live/af4fcef0-1242-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_c62z6gd3p22o_1747801032.html", "title": "Ulster Superbike Championship: Cooper secures four-timer at Bishopscourt meeting", "title_page": "Ulster Superbike Championship: Cooper secures four-timer at Bishopscourt meeting - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "English rider Richard Cooper won both Supersport races and the two Supertwins events to take a four-timer at the opening round of the Ulster Superbike series at Bishopscourt on Saturday.\nThe BPE by Russell Racing Yamaha-mounted competitor from Nottingham secured healthy advantages of 12.5 seconds and 8.5 seconds over runner-up Korie McGreevy in the Supersport outings, with Graeme Irwin third on both occasions.\nCooper came home ahead of Gary McCoy and Caolan Irwin in the Twins races on his KMR Racing Kawasaki.\nMcGreevy edged out Cooper in the first Superbike race of the day on his McAdoo Racing Kawasaki, with Andy Reid making up the podium positions and McCoy, Michael Sweeney and Jonny Campbell completing the top six leaderboard.\nMcCoy took race two by a mere 0.07 seconds from McGreevy, followed by Cooper, Carl Phillips, Reid and Ross Irwin, with defending champion Campbell, who has switched from Yamaha to BMW machinery, seventh.\nMcGreevy is the early leader of the championship after the Temple Motorcycle Club's meeting.\nRiding his Burrows Engineering by RK Racing machinery, Manxman Conor Cummins was ninth in both Superbike races and claimed fourth and sixth place finishes in the Supersports.\nJack Burrows was a convincing winner of both Lightweight events.", "url": "https://www.bbc.com/sport/motorsport/articles/c62z6gd3p22o"}