{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:52", "date_modify": "2025-05-21 06:48:52", "date_publish": "2025-03-28 20:10:46", "description": "Wigan Warriors full-back Jai Field signs a new four-year deal to remain with the reigning Super League champions.", "filename": "sport_rugby-league_articles_c62z2lv0j71o_1747810132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/806c/live/63cfacd0-0c10-11f0-a9ec-f38dd40b0146.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c62z2lv0j71o_1747810132.html", "title": "Jai Field: Wigan Warriors full-back signs new deal with reigning champions", "title_page": "Jai Field: Wigan Warriors full-back signs new deal with reigning champions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wigan Warriors full-back Jai Field has signed a new four-year deal at the reigning Super League champions.\nThe 27-year-old joined Wigan from NRL side Parramatta Eels in 2021 but suffered an injury-hit start during his debut against Leigh Leopards.\nHe went on to return later that year and had a breakthrough campaign in 2022, winning the Challenge Cup and going on to seal the Super League title in 2023 and a historic quadruple last term.\n\"I'm really pleased to be extending my stay here at Wigan. I'm very grateful to the club and the fans who have shown so much faith in me over the past few seasons,\" he said.\n\"I've enjoyed every minute of being here so far and looking forward to hopefully some more great memories here with this group and club.\"\nField scored a second-half try in the 2022 Challenge Cup final at Tottenham Hotspur Stadium and was shortlisted for the Steve Prescott Man of Steel award that season.\nHe went on to help Wigan to the League Leaders' Shield in successive seasons in 2023 and 2024, the latter of which saw him start the campaign by winning the World Club Challenge as the Cherry and Whites beat NRL Premiers Penrith Panthers.\nField, who has made 89 appearances for Wigan and scored 57 tries, signs a contract for 2026 and 2027 with options for 2028 and 2029.", "url": "https://www.bbc.com/sport/rugby-league/articles/c62z2lv0j71o"}