{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:29:59", "date_modify": "2025-04-26 06:29:59", "date_publish": "2025-02-27 10:55:34", "description": "Burnley midfielder Jaidon Anthony says the squad are working hard to increase their goal output in the Championship.", "filename": "sport_football_articles_ce8mmg8j2zyo_1745648999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec9a/live/a808b2a0-f4f2-11ef-be5b-6577f7dded4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8mmg8j2zyo_1745648999.html", "title": "Jaidon Anthony: Burnley working hard on attacking side of the game", "title_page": "Jaidon Anthony: Burnley working hard on attacking side of the game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Burnley forward Jaidon Anthony said the team's hard work to improve their attacking game is beginning to pay off.\nThe Clarets thrashed Sheffield Wednesday 4-0 last Friday, which was only the fourth time they have scored more than twice in a league game this season.\nOf the current top six sides in the Championship, only Blackburn (39) have scored fewer than Burnley's 43 goals.\n\"We've been developing as a group on the training ground on the all-round game, but especially in the attacking phases and patterns of play and what we want to do in the final third,\" Anthony told BBC Radio Lancashire.\n\"I think we're getting to see that and hopefully the goals can keep going in.\"\nBurnley's relative struggles in front of goal are in stark contrast to their defensive record this season. They recorded a 12th successive clean sheet against Wednesday, and have conceded only nine goals in 34 league games.\n\"It's ridiculous - we've got an unbelievable unit, which starts with the back four and the goalkeeper, of course, and then the boys in front do a good job in helping them out,\" Anthony added.\n\"It's an unbelievable run, not something anyone can say they expected. We're definitely trying to keep it going, and if we do we've got a good chance this year.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8mmg8j2zyo"}