{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:21:00", "date_modify": "2025-04-26 04:21:00", "date_publish": "2025-03-03 15:14:33", "description": "Ireland say they are hopeful captain Caelan Doris will be available for their Six Nations meeting with France in the Aviva Stadium on Saturday afternoon (14.15 GMT).", "filename": "sport_rugby-union_articles_c5y0e82w8wgo_1745641260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22c7/live/5562d0c0-f831-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c5y0e82w8wgo_1745641260.html", "title": "Doris making 'positive strides' to face France", "title_page": "Six Nations: Ireland skipper Caelan Doris making 'positive strides' to face France at the Aviva Stadium this weekend - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland say they are hopeful captain Caelan Doris will be available for their Six Nations meeting with France at the Aviva Stadium on Saturday afternoon (14.15 GMT).\nThe 26-year-old back row missed out on the victory over Wales in Cardiff last month with a knee injury.\n\"Ireland captain Caelan Doris continues to make positive strides and it is hoped that he will be available for selection,\" said a statement from the Irish Rugby Football Union (IRFU) on Monday.\nIreland have won three from three in this year's championship and have already secured the Triple Crown.\nThey are aiming to become the first side to ever win three consecutive outright titles in the Six Nations.\nThe IRFU added that number eight Jack Conan and fly-half Ciaran Frawley are also in contention, but a decision will be made later in the week on the availability of hooker Ronan Kelleher and prop Tadhg Furlong, who continues to deal with a calf injury.\nThe 32-year-old Furlong missed Ireland's November games with a separate injury issue and has not played at all since Leinster's win over La Rochelle in the Champions Cup on 12 January.\nKelleher started Ireland's wins over England and Scotland to start the campaign but was absent against Wales with a neck problem.\nIreland, who name their team on Thursday afternoon, have also added Max Deegan, Darragh Murray, Tommy O'Brien and Tom O'Toole to their squad.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c5y0e82w8wgo"}