{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:54", "date_modify": "2025-05-20 11:41:54", "date_publish": "2023-08-06 16:54:56", "description": null, "filename": "sport_articles_c3gmy53kz11o_1747741314.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3gmy53kz11o_1747741314.html", "title": "BBC Sport", "title_page": " - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two of his current strikers pitched in with goals that secured victory over Hibernian on Sunday, but Stephen Robinson has revealed he has asked St Mirren's board to provide funds to sign another.\nToyosi Olusanya, who was on loan to Arbroath last season, was called into the starting line-up when Mikael Mandron was injured in the warm up.\nAnd, after the Englishman put St Mirren 2-0 ahead, New Zealand international came off the bench to secure a 3-2 win.\n\"Toyosi Olusanya has come back a different man,\" manager Robinson told BBC Scotland. \"If Toyosi Olusanya gets fitter and keeps doing what he's good at, which is running in behind, he's going to scare a lot of defenders this season.\n\"Alex Greive will have been upset not to get a chance from the start and he comes on to score the winner. It shows how together we are as a squad. That's the most pleasing thing for me.\"\nRobinson praised the role of goalkeeper Zach Hemming and attacking midfielder Greg Kiltie in the late winner.\n\"First half, we were excellent,\" he said. \"To come here and dominate like we did, to create the chances we did, the game could potentially have been over before half-time.\n\"We were always going to be under pressure for a while. Hibs went very direct to Christian Doidge and he's a big threat. They got back into the game, showed character.\n\"But the character from my players after that. Zach makes a great decision to play it out quickly and it's a super cross from Greg and a great finish.\"", "url": "https://www.bbc.com/sport/articles/c3gmy53kz11o"}