{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 07:45:31", "date_modify": "2025-05-21 07:45:31", "date_publish": "2025-05-20 12:00:47", "description": "Dundee: Familiar feeling to Docherty decision - but what do numbers say?", "filename": "sport_articles_c9vggk992m0o_1747813531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/729c/live/9e2c3c30-356a-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9vggk992m0o_1747813531.html", "title": "Dundee: Familiar feeling to Docherty decision", "title_page": "Dundee: Familiar feeling to Docherty decision - but what do numbers say? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the wake of the shock news of Tony Docherty's Dundee dismissal, it is important to remember that some ruthless decisions can turn out to be harsh but correct.\nOnly time will be the real measure of that for the Dens Park board, but there is evidence to suggest they could be proven right in their brutal call to sack Docherty and his staff on the morning after they secured the club's top-flight status.\nAnd there is a sense of familiarity about it all.\nTwo years ago, Gary Bowyer left Dundee just five days after guiding the club to promotion back to the Scottish Premiership.\nDocherty was ultimately the beneficiary, and nobody was thinking about Bowyer when the former Kilmarnock assistant led the team team to a top-six finish in his first year in management.\nDespite gaining just one point fewer than they did last term, this season has been a struggle, requiring a final-day win at St Johnstone to avoid the relegation play-off.\nIn the statement announcing Docherty's departure, the club said results \"have not met the standards expected\" by the board.\nBut what do the numbers say?\nThey show Dundee conceded a whopping 77 league goals, by far the most in this season's Premiership.\nIn fact, across both Docherty's campaigns in charge, the team shipped an eye-watering 145 goals.\nInjuries to his backline impacted the ex-Aberdeen coach at times, but he was simply unable to address glaring defensive issues across a two-year spell.\nThere was always a sense that if Docherty could plug those holes, he would have a serious team on his hands, particularly this season.\nHis dynamic attack were frequently a pleasure to watch, with the team scoring the fourth most goals - 57 - in the league this term and standout striker Simon Murray netting 16.\nIn back-to-back games at city rivals Dundee United and at home to Rangers in March, the Dark Blues scored seven. But they also conceded six.\nIn a chaotic draw with Celtic in January, they had the champions completely rattled for large spells and put three goals past them. But they also shipped three.\nDocherty's side were box office. But that was their undoing. Too often they were entertaining the neutral fan and not their own.\nAcross the 54-year-old's tenure, Dundee dropped a staggering 53 points from winning positions. There were also just four clean sheets this season and a total of 19 defeats, lower than only relegated St Johnstone.\nThe manager would lament inexperience and naivety, but at some stage those trends have to end.\nThe risk in dispensing with Docherty is that coaching a team to create and score is regarded as the hard part, and there is no guarantee the next guy will be as good at it.\nTherefore, sticking with Docherty and trusting him to eventually troubleshoot the defence might turn out to be a 'what if?' for the Dundee board.\nBut they have clearly seen enough to feel someone else can fulfil the squad's potential.", "url": "https://www.bbc.com/sport/articles/c9vggk992m0o"}