{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 11:37:54", "date_modify": "2025-05-20 11:37:54", "date_publish": "2023-08-06 21:35:17", "description": "England head coach Jess Thirlby says her side are \"gutted\" but \"grateful\" for a silver medal after their Netball World Cup final loss to Australia - but what next?", "filename": "sport_netball_66424472_1747741074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E2B5/production/_130673085_gettyimages-1581552605.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66424472_1747741074.html", "title": "Netball World Cup 2023 final: What next for 'gutted but grateful' England after Australia loss?", "title_page": "Netball World Cup 2023 final: What next for 'gutted but grateful' England after Australia loss? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the time wound down in England's first Netball World Cup final, the Roses looked dejected.\nIt was a disappointing end to a history-making week, with England's hopes of lifting a maiden global trophy ended by a 61-45 loss to perennial winners Australia.\nAfterwards, as the team came together, there was time to reflect on what they had achieved.\nThe Roses have made huge strides, first beating Australia in the pool phase and then knocking out defending champions New Zealand in the semi-finals.\nBut a final against Australia, now 12-time champions, proved a step too far as England looked over-awed by the occasion, while the Diamonds exuded class.\nEngland were disappointed when, four years after their iconic win at the 2018 Commonwealth Games, they failed to win a medal. But some of those demons have been put to bed over the eight days in South Africa.\nA silver medal shows the progress that has been made - but what next for England?\nIt is only the second time in England's history they have bettered third place at the World Cup, having won silver in 1975 when the tournament was a round-robin event.\nEngland leave South Africa having beaten the world's top two teams at a World Cup for the first time as they went where no Roses side had gone before.\nHead coach Jess Thirlby has contended with a string of significant retirements in the years before the World Cup, including captain Serena Kersten, Eboni Usoro-Brown and Jo Harten.\nGeva Mentor will add her name to that list, retiring from international duty after competing at her sixth World Cup, while it seems unlikely the 39-year-old Jade Clarke will appear in the Roses dress again.\nWhen the buzzer went at full-time, Mentor immediately threw her arm around rising star Funmi Fadoju, signalling the start of a new era for England.\nThirlby and her squad will take this experience and build on it. As Imogen Allison said afterwards: \"If this is the first time in a final, next time we are getting the gold.\"\n\"We wanted to inspire and show pride and passion,\" Thirlby told Sky Sports.\n\"Something special we will take away is that there are youngsters out there that know no different than watching a Roses team in a World Cup final.\n\"I hope the generations that are inspired to pull the red dress on can help us make more finals in the future.\"\nEngland will rue the mistakes they made against Australia, with Thirlby saying she was disappointed with how her side let the game run away from them.\n\"We are obviously gutted with a losing margin like that but such is the difference between seasoned finalists and a team in their first final,\" she said.\n\"We are really grateful for that silver medal and over time I'm sure it will sink in.\"\nQuestions will be asked of Thirlby over the timings and choices of her substitutions in the final with Chelsea Pitman, who had made an impact in the pool match against Australia, not introduced until the Diamonds had all but secured victory.\nUltimately, though, England were overwhelmed by the magnitude of the occasion and an infinitely more experienced opponent.\n\"Just to get to this point was a massive ask - but don't take that as complacency,\" Thirlby said.\n\"We weren't quite smart enough. We dug deep but I always felt we were more hesitant than we have been previously.\"\nEngland must now ensure their efforts in Cape Town have not been in vain.\nThe Roses' Commonwealth triumph in 2018 saw a spike in participation figures in the UK, with attendance at both international and domestic matches rising.\nBut there is debate about how much netball capitalised on that success, as the sport struggled to compete with the significant investment put into the national women's football and cricket teams.\nPlaying opportunities, at international level, are also limited. With the 2026 Commonwealth Games currently without a host, a fresh push to get into the Olympics has never felt more necessary.\nFor now, England know they have what it takes to take on the world's best - but they will hope they do not have to wait too long for another chance at glory.", "url": "https://www.bbc.com/sport/netball/66424472"}