{"authors": ["Alasdair Lamont", "www.facebook.com"], "date_download": "2025-05-19 15:20:10", "date_modify": "2025-05-19 15:20:10", "date_publish": "2015-02-25 12:25:16", "description": "Ten-man Celtic are knocked out of the Europa League by Inter Milan for whom Fredy Guarin scored a fabulous late goal.", "filename": "sport_football_31605267_1747668010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81273000/jpg/_81273892_vandijk_red_sns.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31605267_1747668010.html", "title": "Europa League: Inter Milan 1-0 Celtic (agg 4-3)", "title_page": "Europa League: Inter Milan 1-0 Celtic (agg 4-3) - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic battled stoically in the San Siro before succumbing to a stunning late strike from Inter's Fredy Guarin.\nAny chance the Scottish champions had of progressing looked to have been extinguished when Virgil van Dijk was shown a first-half red card.\nBut Celtic did not crumble and remained in the tie until Guarin's fine finish.\nDespite the disappointment of their exit, Ronny Deila can take comfort from his side's ability to compete with the Milanese over two legs.\nCeltic's Jason Denayer and Nir Bitton were defensively outstanding as Celtic spent most of the second half camped around their own box.\nBut neither they nor keeper Craig Gordon could resist Guarin's blistering drive from 22 yards.\nCeltic's most famous victory on foreign soil was against Inter Milan in the 1967 European Cup final and hopes of a first win on Italian soil were high before Van Dijk's sending off.\nHowever, there was a first-minute scare when the Dutchman allowed Mauro Icardi in behind him, only for the striker to scuff his shot at Gordon.\nIn an open, end-to-end first half Gary Mackay-Steven had Celtic's best opportunity but struck his shot straight at Inter keeper Juan Pablo Carrizo.\nTwo Celtic penalty claims went unheeded by Slovakian referee Ivan Kruzliak, who took a harder line as Van Dijk caught Rodrigo Palacio from behind and shortly afterwards picked up a second booking for a foul on Icardi.\nThat changed the balance of the match, with Celtic forced largely onto the defensive as centre-half Denayer blocked Xherdan Shaqiri's goalbound shot and Gordon kept out Danilo D'Ambrosio on the rebound.\nThe Celtic goalkeeper also made an absolutely stunning one-handed save to claw away Mauro Icardi's header from a free-kick moments after Van Dijk's dismissal.\nCeltic's organisation and stout defending meant the goalkeeper was largely unworked after the break until having to pick Guarin's shot out of the net, the moment the tie was sealed.", "url": "https://www.bbc.com/sport/football/31605267"}