{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-20 13:23:17", "date_modify": "2025-05-20 13:23:17", "date_publish": "2023-08-02 08:59:36", "description": "Former Wales scrum-half Mike Phillips say this year's World Cup is \"more important\" than ever for Welsh rugby following a tumultuous year.", "filename": "sport_rugby-union_66372613_1747747397.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0280/production/_130604600_cdf_140122_cardiff_v_harlequins38.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66372613_1747747397.html", "title": "Rugby World Cup: Wales desperate for tournament success, says Mike Phillips", "title_page": "Rugby World Cup: Wales desperate for tournament success, says Mike Phillips - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mike Phillips believes this year's World Cup can lift the gloom hanging over Welsh rugby.\nThe former scrum-half knows the game in Wales is in desperate need of a lift.\nA dismal run of form, resignations, sackings, sexism allegations, player strike threats and an exodus of talent have rocked Welsh rugby.\nBut Phillips knows the tonic of a World Cup success, having been part of the team that came within a point of reaching the 2011 final.\n\"There's no pressure on this team but Welsh rugby does needs a big World Cup more than ever,\" said the 40-year-old.\n\"It feels like there has been constant negativity about Welsh rugby over the last 18 months, so it's more important this time to get people excited about what's happening on the pitch.\n\"The game needs it and the Welsh public needs it. They want to be inspired and follow success which galvanises the game all the way down to the grassroots, as we've seen with [Wales] football.\"\nWales have lost 10 of their last 12 Tests, including defeats by World Cup pool rivals Australia and Georgia in the past year, while the four regions slumped in the United Rugby Championship.\nNow Phillips has raised the stakes before the summer Tests by demanding Wales rediscover a winning habit before heading to France next month.\nWales' World Cup warm-up begins in earnest on Saturday against England in the Principality Stadium, before the return at Twickenham the following week, and then returning to Cardiff to face South Africa on 19 August.\n\"This team could go under the radar but my one big concern is that these players are not winning, for either club or country,\" said Phillips.\n\"Winning in sport is tough, it doesn't just happen. During the [cricket] Ashes I was listening to [former Australia batter] Steve Waugh talk about the mindset needed and how winning at the top level comes from winning week in week out.\n\"A few years ago this [Wales] team was grinding out results but now they're not. So even though they will have trained really hard, it's important they get a couple of wins over the next month for confidence.\"\nPhillips sees parallels with the 2011 campaign following a changing of the guard within the squad.\nTwelve years ago it was Sam Warburton, George North, Taulupe Faletau and Jonathan Davies who emerged in those few months in New Zealand.\nSince naming his provisional squad in May, Wales head coach Warren Gatland has seen veterans Alun Wyn Jones, Justin Tipuric and Rhys Webb retire from international rugby, Cory Hill withdraw and Ken Owens ruled out injured.\n\"You can't keep picking the same guys forever so now, like in 2011, we have some fresh faces in the squad and it could be exciting,\" said Phillips.\n\"Sometimes you just have to throw young players into the deep end. Gats will have them in great shape after all the training, so hopefully they will be ready to hit the ground running.\n\"In 2011 those young players came back from the World Cup experience and won a Grand Slam, another title a year later and then all went with the [British and Irish] Lions to win a series.\n\"So we may not know a lot about these young lads now, but they can be household names by the time they return.\"\nDespite a lack of form, Wales are second favourites behind Australia to progress from Pool C, that also includes Fiji, Georgia and Portugal, and a potential quarter-final against either England or Argentina.\n\"It's exciting because this is the first World Cup where the northern hemisphere teams are favourites and the second-tier teams are closing the gap all the time,\" said Phillips.\n\"It would be massive for Wales to reach the semi-finals and there's every chance. We're on the better side of the draw, Australia are not in great shape with a lot of injuries and the boys know they can beat England in a quarter-final.\"", "url": "https://www.bbc.com/sport/rugby-union/66372613"}