{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 13:34:09", "date_modify": "2025-05-20 13:34:09", "date_publish": "2023-07-26 09:00:44", "description": "Midfielder Declan Rice says he wants to be judged on the trophies he wins after his £100m move to Arsenal.", "filename": "sport_football_66310210_1747748049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15DF7/production/_130519598_gettyimages-1559417422.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66310210_1747748049.html", "title": "Arsenal: Declan Rice wants to be judged on trophies he wins with Gunners", "title_page": "Arsenal: Declan Rice wants to be judged on trophies he wins with Gunners - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Declan Rice says he wants to be judged on the trophies he wins after his £100m move to Arsenal.\nHe captained West Ham to their first silverware in 43 years when they won the Europa Conference League last term.\nArsenal were second last season behind Manchester City, despite leading for most of the Premier League campaign.\nWhen asked what his aim was in joining the Gunners, the 24-year-old, whose deal could rise to £105m with add-ons, was clear: \"To win trophies.\"\nHe added: \"That is why the players we have are here.\"\nThis summer the Gunners have also signed forward Kai Havertz joined from Chelsea in a £65m deal and defender Jurrien Timber from Ajax for £34m.\nEngland international Rice, who signed earlier this month, added: \"You only get one career and at the end you want to be determined by how many trophies you have won.\n\"I know this squad is so hungry to win stuff. We are young and hungry and have a lot of energy.\n\"Off the back of last season, they will have learned a lot so this year, with all the competitions we are going into, there is one aim and that is to win, not just to take part.\"\nPremier League champions City withdrew from trying to buy Rice after they had a £90m offer turned down, while German champions Bayern Munich also expressed an interest.\nAnd Manchester United and Rice's former club Chelsea - he was released by the west Londoners from their academy at 14 - both cast admiring glances in his direction without coming up with a concrete offer.\nBut Rice's mind was already made up and the vision outlined by manager Mikel Arteta sold the club to him.\n\"It was a feeling I had, a real good feeling in my gut,\" he said. \"I have only been here 10 days but it feels like that choice has paid off already.\n\"Individually, there are things I want to add to my game. I want to improve, to get better and learn different things. I feel Mikel can bring the best out of me.\"\nArsenal will return to the Champions League for the first time since the 2016-17 season, a competition in which they have not progressed past the last 16 since 2010.\n\"It is going to be the best,\" said Rice. \"It is the pinnacle in football.\n\"Not many players get to play in the Champions League. Getting that chance this year to put on a shirt and to hear that anthem will be so special.\n\"In football, you only get one opportunity to do great things and join great clubs. That is what the case was with Arsenal.\n\"I feel like it is a club that deserves to be in the Champions League and deserves to have the big nights - I can't wait to experience it.\"", "url": "https://www.bbc.com/sport/football/66310210"}