{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:21:47", "date_modify": "2025-05-20 14:21:47", "date_publish": "2023-07-29 08:20:42", "description": "Manchester United reportedly reject verbal West Ham United offer for Scott McTominay as Jose Cifuentes edges closer to Rangers arrival.", "filename": "sport_football_66344626_1747750907.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0CF6/production/_130581330_mctominaygossip.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66344626_1747750907.html", "title": "Scottish Gossip: McTominay, Stewart, Cifuentes, Wright, Lowry, Dembele, Vargas, Rubezic, McClelland, Vente, Rieder, Van de Beek", "title_page": "Scottish Gossip: McTominay, Stewart, Cifuentes, Wright, Lowry, Dembele, Vargas, Rubezic, McClelland, Vente, Rieder, Van de Beek - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have rejected West Ham United's verbal offer for 26-year-old Scotland midfielder Scott McTominay, demanding £45m and saying their Premier League rivals' bid fell far short of that figure. (The Times), external\nWest Ham United want to explore loan deals for Scott McTominay and teammate Harry Maguire, but Manchester United are not entertaining them. (Sky Sports), external\nSunderland are facing a battle to hang on to Ross Stewart this summer, with the 29-year-old Scotland striker rejecting numerous offers to extend his contract. (TeamTalk), external\nRangers are expected to announce the signing of midfielder Jose Cifuentes from Los Angeles next week after 24-year-old secured the necessary visas for his arrival. (Football Insider), external\nLeague Two club Tranmere Rovers have registered their interest in signing Rangers midfielder Alex Lowry on loan for the season, the Ibrox club having turned down letting the 20-year-old exit in February after approaches from Twente and Kilmarnock. (Football Insider), external\nRangers winger Scott Wright has reportedly returned to Turkey for further talks over a move to Pendikspor, the club promoted to the Super Lig. (Daily Record), external\nHeart of Midlothian have verbally agreed a six-figure transfer fee with Costa Rican club Herediano for the transfer of 21-year-old Kenneth Vargas after contract terms were negotiated with the forward earlier this week. (Edinburgh Evening News), external\nAberdeen have agreed a six-figure fee for centre-half Slobodan Rubezic from Novi Pazar, with personal terms agreed with the 23-year-old and the deal subject to the player completing a medical and a work permit being issued. (Daily Record), external\nSt Johnstone are set to bolster their defensive options with the signing of 21-year-old Northern Ireland defender Sam McClelland, who has been released by Chelsea. (The Herald), external\nHibernian face competition for Roda striker Dylan Vente, with Palermo and Pisa now interested in the 24-year-old's signature, according to reports. (Football Scotland), external\nBorussia Monchengladbach managing director Roland Virkus has appeared to rule out a move for Fabian Rieder, the Young Boys and Switzerland midfielder who has been linked with Celtic, Brentford and Fulham but said he wishes to join the Bundesliga club this summer. (Sky Sports via Scottish Sun), external\nReal Sociedad are negotiating a loan deal with Manchester United for midfielder Donny van de Beek, the 26-year-old midfielder linked with Celtic, and the Netherlands international could be used as a makeweight in a deal to bring Mohammed Kudus to Old Trafford. (Daily Express, print edition)", "url": "https://www.bbc.com/sport/football/66344626"}