{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:36:08", "date_modify": "2025-05-21 06:36:08", "date_publish": "2025-01-05 00:00:00", "description": "Watch or listen to Open All Mics, listen to commentary from Celtic Park, and follow live text coverage of five Scottish Premiership matches.", "filename": "sport_football_live_cvgmy0lyrlzt_1747809368.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgmy0lyrlzt_1747809368.html", "title": "Scottish Premiership: Leaders Celtic among 10 teams in action", "title_page": "Scottish Premiership: Leaders Celtic among 10 teams in action - radio & text: BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kettlewell delighted with Motherwell 'reaction'\nFT: Motherwell 2-0 Aberdeen\nMotherwell manager Stuart Kettlewell tells BBC Scotland: \"Big thing for us today was to get a reaction from the players. I'm delighted with the reaction I got from some of the guys that came in that maybe haven't played as much recently. They added plenty.\nWe could play better in the second half. We can handle the ball better, we can pass it better, we can be far more creative and make the game easier. But, there's another team there.\n\"Today, we get the added bonus of the clean sheet.\n\"Really nice to see Ewan Wilson get his goal. The quality off the finish and composure's fantastic. [Tawanda] Maswanhise, he's that breath of fresh air out there - another you player that contributes for us today.\"\nOn the possibility of new signings this month, Kettlewell said: \"It's a possibility. I never envisaged wholesale changes but if you can pick off the correct one or two just to help the group...it's to give us more strength in depth. It's going to be gruelling, it's going to be tough. We have to ensure we have as much quality as we can get in that dressing room.\"\nKilmarnock 'didn't have any real control'\nFT: Kilmarnock 0-1 Ross County\nKilmarnock manager Derek McInnes tells BBC Scotland: \"We looked a bit blunt in terms of our attacking threat today.\n\"At the very least we should be getting a 0-0 and bemoaning the fact that we need to do better in attack. We didn't have any real control of the game at any point, Ross County looked a bit brighter than us early on.\n\"They were more alive and more alert to certain situations. That said, second half we played more in their half but we were a wee bit unconvincing. We huffed and puffed.\n\"We missed [Kyle] Vassell leading the line for us. There's reasons for why we weren't at our best but it was certainly a disappointing afternoon for us.\n\"We knew we had an opportunity to move into the top six with a win. Any opportunities to win a home game, you've got to try and do that but we weren't good enough.\"\nDundee United 'not at the races' - Goodwin\nFT: Dundee United 0-1 Hearts\nDundee United manager Jim Goodwin tells BBC Scotland: \"It was a scrappy game, which didn't surprise me really, it was difficult for both sets of players with the quick turnaround from Thursday evening.\n\"We just weren't at the races today, unfortunately. In possession we caused ourselves a lot of problems early on through sloppiness.\n\"In the second half we were better and had a bit more control without creating anything clear cut. We tried to make changes throughout the game and just before Hearts score but then we find ourselves behind.\n\"We've been very good at defending our box but we don't do well enough in a one-versus-one and it's a fantastic finish from [James] Penrice. It was the type of game when one goal was going to be enough but unfortunately Hearts were the ones who got it.\n\"Every squad is in the same boat but we struggle because of the size of the squad, we lack real strength in depth and some of the guys are running on fumes at the moment.\n\"We've got another difficult week next week with a trip to Parkhead midweek and only two days to recover before a massive game in Paisley on Saturday.\n\"I've got to take it on the chin that the changes I made didn't quite work. In recent games I've been positive with changes and we've got the results.\n\"But today is on me, not the players, the effort was there for everybody to see we just lacked quality.\"\nCowie 'really proud' after another away win\nFT: Kilmarnock 0-1 Ross County\nRoss County's Don Cowie tells BBC Scotland: \"Incredible, really. We were in a really poor run away from home, it's been well documented. It was about us as a team coming together, the staff and the players, to correct that.\n\"We've done it very well. Three away performances, three victories, the first time in the club's history in the Premiership. Really proud of the group.\n\"Going into the game, and at half-time as well, we told the group to do the difficult things, stand up to Kilmarnock. We did that throughout the game. We could have been tidier in the final third but we got one moment of quality.\n\"It gives us belief and confidence. We know what we've got in the group. We're at the bare bones today - we've got seven players out injured - but we've rallied together in an intense period of time.\"\n'It looks very, very bad' but St Johnstone 'must believe'\nFT: St Johnstone 1-3 Dundee\nSt Johnstone manager Simo Valakari tells BBC Scotland: \"Nightmare start to be 3-0 down. It was just too much to give away those three pretty soft goals. It cost us the whole match.\n\"Our level goes up and down too much. We can't put it all together for 90 minutes. That's why we are where we are now.\n\"We only have the players we have now. We don't know what the future holds. We just need to be better in key moments.\n\"We have known if we don't perform or get results, relegation is a big possibility. Yes, it looks very, very bad, but if we don't believe in ourselves, no-one will believe in us.\"\n'Celtic wear you down' - St Mirren boss on loss\nFT: Celtic 3-0 St Mirren\nSt Mirren manager Stephen Robinson tells BBC Scotland: \"We went 1-0 down to a very good finish, I never felt like we were under any threat.\n\"I've been to Celtic many times and it's like you're defending constantly, they're creating chances, your goalkeeper has to make 10-15 saves in the game and none of that really happened today. We got in behind a couple of times as well.\n\"The second goal, comes from a set play and the third goal was a bit of a mix-up.\n\"Zach [Hemming] didn't have loads to do today but ultimately Celtic wear you down and if you make those mistakes you don't win here.\"\n'Moment of quality' won it for Hearts - Critchley\nFT: Dundee United 0-1 Hearts\nHearts head coach Neil Critchley tells BBC Scotland: \"I thought we were excellent, we edged the game and deserved to win. I would have liked to have taken more control.\n\"In the first half we got into good areas without producing the final bit. In the second half I would've liked to see us pass the ball a bit better and control the game with possession. But it's a moment of quality from Penners (James Penrice) - a fantastic volley and great strike.\n\"We have to try to improve the quality all over the pitch. In the last little bit, the final third, in the last couple of games, with more composure and quality 1-0 becomes 2-0.\n\"It's the first time we've had back-to-back league wins, which gives us a lift and keeps us moving in the direction we want to. It's very tight in the league and we have to keep performing the way we did today.\"\nOn Kye Rowles potentially leaving this month, Critchley said: \"We've been approached by another club and negotiations are taking place. Nothing's agreed at this moment in time so he is still our player and will remain our player until the valuation is met.\"\nCritchley added he hope to have new forward signing Elton Kabangu available for the Aberdeen game at Pittodrie on 12 January.\nAberdeen 'having a difficult time'\nFT: Motherwell 2-0 Aberdeen\nAberdeen manager Jimmy Thelin tells BBC Scotland: \"It's not a good run, of course, and we have some problems we have to solve but I also have a strong belief that we're going to get out of it and be stronger again and win football games. Right now, we're having a difficult time.\n\"They score two goals a little bit too easy. Second half, the character of the team was there.\n\"I haven't seen [the Slobodan Rubezic red card] yet but it's always important to have this emotional control when you're out on the pitch.\n\"I know it's a good team spirit. They're trying but right now a lot of thing are going wrong in the wrong moments inside the games.\"", "url": "https://www.bbc.com/sport/football/live/cvgmy0lyrlzt"}