{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:56", "date_modify": "2025-05-21 03:41:56", "date_publish": "2025-04-06 18:22:57", "description": "Man Utd 0-0 Man City: What Pep Guardiola said", "filename": "sport_football_articles_cn8vydd0g12o_1747798916.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6b8/live/233e3810-1310-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn8vydd0g12o_1747798916.html", "title": "Man Utd 0-0 Man City: What Pep Guardiola said", "title_page": "Man Utd 0-0 Man City: What Pep Guardiola said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City manager Pep Guardiola speaking to Sky Sports: \"We have the control but not in the right spots to hurt them in the first half, a little better in the first minutes of the second half. United have been an incredible transitional team, defend against us deep, with Garnacho and the pace they have. They link inside, they know perfectly what they have to do. But we take the point, I'd prefer to win but we are there.\nWhat do the players need to do better?\n\"The players know it. There is a process when the ball is on one side the players need to be in the right position. Today that was not good enough.\n\"Against a 5-4-1 it's so narrow and congested. We should have been in some positions that we tried to get in but weren't good enough to punish them.\n\"The last games we much, much better, back four better, just our process was not [good] but we know that, when we lose the ball in certain positions they are a strong team and punish you, but we knew that.\nAbout getting back to City's usual level:\n\"It will take time, the players gave everything today.\n\"We will prepare for the upcoming games, there are a few things I'm happy with what I saw, but now we need to achieve the target of qualifying for Champions League then next season is next season.\"", "url": "https://www.bbc.com/sport/football/articles/cn8vydd0g12o"}