{"authors": ["Sandy Smith", "www.facebook.com"], "date_download": "2025-05-21 07:18:54", "date_modify": "2025-05-21 07:18:54", "date_publish": "2025-05-20 09:27:15", "description": "Edinburgh fan voice: 'Why we love Darcy Graham'", "filename": "sport_articles_czdyy41p0vmo_1747811934.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1ae/live/22383af0-3558-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czdyy41p0vmo_1747811934.html", "title": "Edinburgh fan voice: 'Why we love Darcy Graham'", "title_page": "Edinburgh fan voice: 'Why we love Darcy Graham' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A wee while back I welcomed you all to the inaugural meeting of the Wes Goosen Appreciation Society. If you didn't attend it might just have been because you were at the regular weekly meeting of the 'We love Darcy Graham' forum.\nThis week's gathering was at the Hive when Graham became only the second player in Edinburgh's professional history to score a trio of hat-tricks.\nHe has plenty of time to top the list as the player he is tied with is the retired Tim Visser. Graham is already the only player to have scored four tries in a match for Edinburgh.\nHe did something else for the first time too as he got his first yellow card in Edinburgh colours. This is a bit of a surprise as he literally and figuratively plays on the edge.\nGraham's first Edinburgh try came on his debut, against London Irish in December 2017 in the Challenge Cup. I was there and remember the try like it was yesterday as it still typifies his playing style.\nEdinburgh were attacking down the left and Phil Burleigh knocked through a grubber. It took a wicked bounce into the air just before the try line over the head of the Irish defender. Graham leapt like a salmon and caught the ball before diving over the defender to score in the corner.\nWe were winning 31-10 at the time. There was no requirement for him to put himself in such danger but I don't think it even crossed his mind. His focus was laser like.\nRichard Cockerill, prior to the match when asked about giving his debut to the former sevens man, said he \"doesn't back away from any contest\" and that \"I think there's a big future for him\".\nCockers got that spot on. He seemed to have an eye for a winger!\nGraham was my player of the match against Ulster last weekend although there were several candidates in what was an outstanding display by Edinburgh.\nOur biggest win against Ulster in terms of tries scored, margin and points total. More importantly the victory came at a moment when it was basically boom or bust for our top-eight hopes and when faced with that scenario last season against Benetton we folded like a cheap suit. That in itself is progress.\nA tougher test awaits away to Bulls in the play-offs but we have earned the right to take it.", "url": "https://www.bbc.com/sport/articles/czdyy41p0vmo"}