{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:45:22", "date_modify": "2025-04-26 07:45:22", "date_publish": "2025-03-02 00:00:00", "description": "Watch and follow live text commentary of Manchester United v Fulham in the FA Cup fifth round.", "filename": "sport_football_live_c3d85nrk9v9t_1745653522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dced/live/8f11ec10-f79c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c3d85nrk9v9t_1745653522.html", "title": "FA Cup LIVE: Manchester United v Fulham", "title_page": "FA Cup LIVE: Manchester United v Fulham - live stream and score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fulham goalkeeper Bernd Leno was the hero with two saves in the penalty shootout to knock Manchester United out of the FA Cup.\nAfter three precise spot-kicks from both sides, Leno denied Victor Lindelof, then, after skipper Antonee Robinson had extended Fulham's perfect record, the German also kept out Joshua Zirkzee's effort to send the Cottagers into the quarter-finals.\nFulham had taken the lead in first-half stoppage time when Calvin Bassey was left free at the far post to head in from close range after Rodrigo Muniz had flicked on a corner.\nBut, days after former United captain Roy Keane had condemned the influence of current skipper Bruno Fernandes, the Portuguese dragged his side level with a superb equaliser, driving home a low shot from the edge of the area after Diogo Dalot had found him with a pass from the touchline.\nBoth sides could have won it without the need for penalties. Emile Smith Rowe, denied superbly by Andre Onana before the home side levelled, was repelled by the Cameroon international again before the tie went to extra time.\nThen, 17-year-old United substitute Chido Obi flicked a shot towards goal that Leno kept out with an outstanding reaction save.\nIt added to a catalogue of saves from Leno that also included denying United substitute Alejandro Garnacho. The real heroics were saved for the shootout though as Fulham continue to dream of emulating their only FA Cup final appearance in 1975.\n\"From the first day we are really serious in the competition. It is a big competition for us,\" said Fulham boss Marco Silva, whose says his side are \"in a better place\" than when they were knocked out at Old Trafford two seasons ago.\n\"We are more mature but you can see the identity is the same. Everyone can see Fulham is a very good club in the Premier League.\"\nIt is an amazing statistic that since the Fulham side that contained England World Cup hero Bobby Moore lost to West Ham at Wembley half a century ago, only one final has not contained any of the two Manchester teams, the two from Liverpool, Arsenal, Tottenham or Chelsea.\nWith only Manchester City of that group left in this year's competition, there is a chance the unexpected nature of Portsmouth's victory over Cardiff in 2008 could be repeated.\nFulham will certainly fancy their chances.\nSilva has put together a talented and deep squad capable of giving anyone a game on their day.\nThat has tended not to be against United, who had already beaten them twice in the Premier League this season and had lost just one of their past 21 previous meetings.\nHowever, they carried the greater threat on his occasion and should have gone in front when Alex Iwobi picked out Sasa Lukic with an excellent cross that should have met wth a better ending than being sent over the bar.\nFor a long time, it appeared Bassey's effort would prove decisive. And after Fernandes' strike drew United level, Ryan Sessegnon brought an excellent save out of Onana in second-half stoppage time.\nBut, after Raul Jimenez, Sander Berge and Willian had kept Fulham level in the shootout, Leno twice guessed correctly as Fulham gained redemption for the self-inflicted pain of two years ago, when they were ahead and in command of a quarter-final tie against United at Old Trafford, only to implode after a controversial penalty was awarded against them, which led to three red cards, including one for Silva, and eventual defeat.\nThere was a moment after 11 minutes when supporters saw a glimmer of what Amorim is looking for from his team.\nUnited moved the ball left across the defensive line to Matthijs de Ligt. The Dutchman hit an excellent crossfield pass to Dalot, who in turn laid it off to Christian Eriksen, who had found space between the penalty area and the touchline. The Dane's cross was just too high for Zirkzee. However, Manuel Ugarte retrieved it, passed the ball to Fernandes and his low shot was saved by Leno.\nIt was an excellent passage of play and maybe a sign Amorim's messaging on preferred style is getting through.\nThe problem is there is plenty of alternate evidence to the contrary.\nNeither Rasmus Hojlund nor Zirkzee, who worked hard without threatening, convince as a goalscoring forward, Onana causes uncertainty at the back with some erratic decision-making and United's defenders are too easily caught ball-watching, as proved to be the case when Bassey put the visitors in front.\nThey do have Fernandes. Keane might not like it but his old club would be in an even more pitiful state without him.\nBut the FA Cup is another one of the avenues to a European spot next season that has been closed.\nUnited came into the match having lost nine of their 23 games since Amorim took over as head coach in November - and five at Old Trafford. By contrast, it took predecessor Erik ten Hag 55 games to lose 10 matches.\nAmorim has spoken of how hard his introduction to life at Old Trafford has been. He really needs to change the narrative.", "url": "https://www.bbc.co.uk/sport/football/live/c3d85nrk9v9t"}