{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 04:59:10", "date_modify": "2025-05-21 04:59:10", "date_publish": "2025-04-04 11:58:04", "description": "Glasgow Warriors have never been beyond the Champions Cup quarter-finals. Is this the year they break through that 'glass ceiling'?", "filename": "sport_rugby-union_articles_ckg2z2q2p6vo_1747803550.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4493/live/de79c670-0fe7-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ckg2z2q2p6vo_1747803550.html", "title": "Champions Cup: Glasgow Warriors out to break 'glass ceiling' against Leicester Tigers", "title_page": "Champions Cup: Glasgow Warriors out to break 'glass ceiling' against Leicester Tigers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glasgow Warriors will create a little bit of history at Scotstoun on Saturday when they face Leicester Tigers in the Investec Champions Cup - the Scottish side's first home knockout tie in the competition.\nAs special as that will be, they will be aiming for bigger landmark moments this season - namely going further in this competition than they ever have before.\nTwice Glasgow have reached the quarter-finals - in 2017 under Gregor Townsend and 2019 under Dave Rennie - but on both occasions were on the receiving end of a hiding at the hands of Saracens.\nHaving won the URC last season, there is a feeling Franco Smith's side may just be ready to go deeper into Europe's premier club competition than ever before.\nScotland's record points scorer, Chris Paterson, told the BBC's Scotland Rugby Podcast: \"I think it's a want, a goal and aim of the players as much as it is the fans.\n\"It's not just in your hands whether you break through that glass ceiling. At that level, you need an element of luck in terms of the opposition, of injuries, and Glasgow are still missing some key players.\n\"But they've got the components to win every game they play.\n\"Franco Smith was asked: 'Do you feel you're in a better place than you were last year?' And he said, 'definitely', which I would agree with.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/ckg2z2q2p6vo"}