{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:17", "date_modify": "2025-05-21 07:41:17", "date_publish": "2025-01-13 15:50:12", "description": "Ipswich news: Dominic Ball on chances of survival", "filename": "sport_football_articles_c7vd35pvz0qo_1747813277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b50d/live/fb828e50-d19e-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7vd35pvz0qo_1747813277.html", "title": "Ipswich news: Dominic Ball on chances of survival", "title_page": "Ipswich news: Dominic Ball on chances of survival - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Ipswich midfielder Dominic Ball thinks the progression at the club is \"incredible\" and believes the Tractor Boys have enough to avoid relegation this season.\nSpeaking on the latest episode of BBC Radio Suffolk's Final Whistle, Ball, who was part of the Ipswich side that achieved back-to-back promotions from League One to the Premier League said: \"I fully believed before the start of the season that Ipswich would stay up - I still believe that.\n\"You can see the progression since the manager came in. The fact the lads are now performing in the Premier League at the level they are, I think they've got a very good chance.\"\n\"The patterns and the style of play have had continuous progression. Even around the stadium, the club has continued to improve and progress.\n\"To do that in the space of two-and-a-half years since the manager has been here is incredible.\"\n\"To do what the club and players have done is rare, but knowing what goes on with manager, the staff and the players and what they put in - it doesn't surprise me.\"\nIpswich comfortably beat Bristol Rovers in the FA Cup on Sunday and Ball was keen to praise boss Kieran McKenna for his influence on the team.\n\"He has that calming, humble attitude which I think goes through every player,\" Ball said. \"I learned a lot from him - I think he's brilliant.\n\"You can see the respect that the players have shown and the way the manager and coaches prepare. Every game means everything and the FA Cup for Ipswich this year will be massive - he knows that.\"", "url": "https://www.bbc.com/sport/football/articles/c7vd35pvz0qo"}