{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:42:22", "date_modify": "2025-05-20 13:42:22", "date_publish": "2023-08-01 13:42:43", "description": "Johnson's been well-backed... but have Hibs learned their lessons?", "filename": "sport_articles_cjj1z4e3ll0o_1747748542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b12/live/bab7cbc0-306d-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cjj1z4e3ll0o_1747748542.html", "title": "Johnson's been well-backed... but have Hibs learned their lessons?", "title_page": "Johnson's been well-backed... but have Hibs learned their lessons? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matty Fairnie, Longbangers podcast, external\nIt’s unusual for a manager to start a season under pressure, but due to Hibernian’s abysmal showing in their 2-1 defeat to Inter Club d’Escalades in Andorra last Thursday, that is exactly the position that Lee Johnson finds himself in.\nOf course, a win good enough to take Hibs through the tie at Easter Road this week will make a huge difference, but the performance as much as the result last week has irked enough supporters to leave Johnson with little wiggle room in the opening weeks of the season.\nJohnson has been backed probably more than any Hibs manager since the big spending days of Alex McLeish’s Hibs side that boasted the likes of Franck Sauzee and Russell Latapy. That level of talent is out of Hibs’ reach these days, but it’s exciting to think of Elie Youan, Martin Boyle leading a front line with the reported capture of Dylan Vente seemingly imminent to further bolster that attack, with the ammunition supplied by fellow summer capture, Dylan Levitt.\nIn defence, the return of Manchester United centre-half, Will Fish, on-loan for the season is significant – Fish was seen as a stand out in the second half of the season and it’s surely a positive sign to see such a talent keen to commit to Hibernian for another year.\nThe goalkeeper position remains a concern, David Marshall was at fault for at least one goal in Andorra, and it would not be a surprise to see him lose the no.1 spot to Jojo Wallacott.\nThe fixtures have fallen kindly for Hibs, no ties against either of the Old Firm or Hearts until October gives Johnson the opportunity to build the sort of momentum that he’ll need to give fans cause to forget Thursday’s mis-step. However, we’ve seen Hibs be given these opportunities and squander them as recently as last season, so it remains to be seen whether lessons have truly been learned.\nThe squad does look much healthier and, being the eternal optimist, I fancy Hibs to hit their stride early doors and have a season to remember.\nPredicted Finish: 4th\nStandout player will be: Dylan Levitt", "url": "https://www.bbc.com/sport/articles/cjj1z4e3ll0o"}