{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 06:33:35", "date_modify": "2025-05-21 06:33:35", "date_publish": "2025-03-31 16:12:15", "description": "Headline", "filename": "sport_articles_ckgdg9e9n3go_1747809215.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/08d0/live/b6410a90-0e4a-11f0-8fda-f199207bcb26.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgdg9e9n3go_1747809215.html", "title": "Headline", "title_page": "Headline - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Edinburgh bounce back\nIt's what Edinburgh do, isn't it? Follow up a poor performance with a reaction to deliver a better display.\nFirst things first – Dragons are a poor outfit. Other than a couple of fleeting moments early in the game and Aaron Wainwright's try shortly after the break, the URC's bottom side offered little.\nStill, Edinburgh did a professional job on them, killing the contest with four unanswered first-half tries.\nThe frustration is they didn't keep the foot on the gas after the break, but maximum points is what they came for and that's what they delivered.\nDazzling Darcy back with a bang\nEverything looks rosier in the Edinburgh garden when Darcy Graham is on the field.\nThe little magician was at his electric best after his return to the team from Six Nations duties with Scotland.\nEvery time he got his hands on the ball he looked to make things happen, and the Dragons' defence could not contain him.\nGraham created Paddy Harrison's second try with one deft chip over the defence, gathered the ball then put through another inch perfect kick for the hooker to score.\nHis speed and anticipation saw him get on the end of Ben Vellacot's smart dink over the top to cross the whitewash himself.\nIt would be unfeasible to think Graham is not at the forefront of the thoughts of the Lions selectors, but this was just a timely little reminder of his class.\nHarrison stakes his claim\nPaddy Harrison stood up with a big performance and, in many respects, a timely one.\nThe hooker scored two tries, the first of which a routine score from a rolling maul, the second far more flamboyant, outpacing the cover defence to touch down a clever kick through from Darcy Graham.\nHarrison has had to make do with being third choice in the queue for the Edinburgh number two jersey, behind Scotland internationals Ewan Ashman and Dave Cherry.\nHowever, with Ashman struggling for form with club and country, and Cherry rumoured to be leaving for France at the end of the season, Harrison could find more opportunities coming his way.\nAnother Scotland international hooker, Dylan Richardson, could well be on his way to Edinburgh for next season, but Harrison can push himself into the conversation.\nHaving got a taste of Test action on last summer's tour of the Americas, Harrison could get some more exposure to international rugby this summer, depending on how strong a Scotland squad is selected.", "url": "https://www.bbc.com/sport/articles/ckgdg9e9n3go"}