{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:06", "date_modify": "2025-05-21 04:34:06", "date_publish": "2025-04-05 00:00:00", "description": "Burnley move to the top of the Championship following victory at Coventry as Leeds and Sheffield United drop points.", "filename": "sport_football_live_cx280zyg67dt_1747802046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/434d/live/a5bceab0-123a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx280zyg67dt_1747802046.html", "title": "EFL Championship LIVE: Reaction as Sheff Utd lose at Oxford and Burnley finish the day top", "title_page": "EFL Championship LIVE: Reaction as Sheff Utd lose at Oxford and Burnley finish the day top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye for now\nThat's as far as we go here today on a day that saw change at the top of the Championship table and renewed hope at the bottom.\nBurnley now lead the way with six games to go and Plymouth are just four points adrift of safety at the foot of the division.\nLooking forward to doing it all again on Tuesday and Wednesday? I suppose that depends how your team got on today...\nThanks for your company.\nCheers!\nWhat's next in the Championship?\nAll games kick-off at 19:45 BST unless stated\nEnjoyed your Saturday fix of Championship madness? The good news is you don't have to wait too long for the next exciting instalment from the world's most unpredictable division.\nWould you take a look at some of the fixtures we have in store during a full midweek programme coming up...\nOf course we'll be here every step of the way across both nights right here...\nTuesday\nBlackburn v Sheffield Wednesday\nBristol City v West Bromwich Albion\nDerby v Burnley\nNorwich v Sunderland\nPreston v Cardiff\nSheffield United v Millwall\nStoke v Luton\nWatford v Hull City\nMiddlesbrough v Leeds (20:00 BST)\nWednesday\nOxford United v QPR\nSwansea v Plymouth\nCoventry v Portsmouth (20:00 BST)\n'Not to be for Stoke'\nFT: Preston 1-1 Stoke\nStoke City\nStoke City goalscorer Lewis Baker told BBC Radio Stoke:\n\"On a different day I think some of those chances go in the back of the net. We created quite a few.\n\"I thought he [Stoke keeper Viktor Johansson] made a couple good saves this afternoon and even the one that didn't get bundled over the line.\n\"It just wasn't for us on the chances side today but if we keep creating opportunities like that in the coming games, I'm sure we'll have comfier deficits.\"\n'We'll take the point'\nFT: Preston 1-1 Stoke\nPreston North End\nPreston North End manager Paul Heckingbottom told BBC Radio Lancashire:\n\"You take the point in the end. I don't think it's a penalty, really soft so disappointed we haven't got three but I don't think the performance deserved three so we'll take the point and move on.\n\"Start of the second half they got on top. I felt they won all the duels and we're going to face teams that are fighting to stay in the league.\n\"Cardiff, Plymouth, Hull away that's what we're going to face so really disappointed with that spell of the game and we weren't good enough to take the sting out of it.\"\n'Today was a good feeling'\nFT: Sheff Wed 0-1 Hull\nHull City\nHull City head coach Ruben Selles told BBC Radio Humberside: \"We knew we would need to stay in the game if we wanted to get chances, and at the end the boys got that header and three points.\n\"We’ve been on the other side, where you lose the game in the final action, and today was a really good feeling.\n\"In a Championship game it’s really difficult to read the opponent, especially away from home, but you need to manage to stay in the game and when there are good moments to score and you don't get it, you have to manage not to concede.\n\"Every game since I have been here was decided by one action - a 1-0 or a 2-1 situation, and you have to fight for that citation to go to your side.\"\n'The lads were outstanding'\nFT: Bristol City 2-1 Watford\nBristol City\nBristol City manager Liam Manning told BBC Radio Bristol: “At this stage of the season the most important thing is winning matches. I love working with the lads, delighted for them, proud of them.\n“When you look at how they performed and just the fact they turn up and consistently give absolutely everything for the shirt, you can’t ever take that for granted, I thought the lads were outstanding so delighted to get the three points and so many positive aspects from the performance as well.\n“You look at the Watford side and the profile of them physically you know it’s going to be a really physical tough game and especially they’ve got some talented individuals that can change it in a really quick moment. As you saw first half you can go from complete control to defending your box extremely quickly.\n“You have to manage that by taking care of the ball and I think first half was excellent as to how we did that, we kept them penned in.\n\"Second half was one of those where they had a lot of the ball but didn’t carry as much threat as we did on the counter. Its that stage of the season where it’s about finding a way to win and we did it.”\n'I can't understand how we lose focus'\nFT: Millwall 2-1 Portsmouth\nPortsmouth\nPortsmouth boss John Mousinho told BBC Radio Solent:\n\"I’m incredibly frustrated. It feels like deja vu from three weeks ago at Preston and that’s the most frustrating thing.\n\"After going a goal down we clicked into gear and started to play really well, which is a frustration anyway. We were far too predictable in the first half.\n“I can accept us losing goals in a certain way but the way we conceded that second goal. We defended the set play well until the second phase and left four v one at the back post.\n“I can’t understand how we’re playing so well in certain moments and then really losing focus towards the back end of the game.\"\n'Owls not ready for the play-offs'\nFT: Sheff Wed 0-1 Hull City\nSheffield Wednesday\nSheffield Wednesday manager Danny Rohl told BBC Radio Sheffield:\n\"Big credit to my team, to take this tough week, to stay here and go again, to fight again for our club. It took time to come into it, but in the second half it was one direction.\n“It’s hard but the key message for me is that this team has big, big character and big, big belief. A lot of players take all the setbacks again and again and it makes me very proud.\n“The motivation comes from the inner circle, there’s no question mark. The emotional level was there - they want to fight, they want to go and do everything, but you can understand what it means for this group.\n“It makes no sense to speak about the play-offs. We should be honest, and we’re not ready for the play-offs. We did an outstanding job and felt we were always close, but in the second half of the season in all these tight games, we could have won maybe six home games, but we didn’t.”\nDefeat for the Owls came at the end of a week where it was revealed that the players and staff had not been paid their wages on time.\n'It's not job done, but gives us a fantastic chance'\nFT: Oxford United 1-0 Sheffield United\nOxford United\nOxford United boss Gary Rowett told BBC Radio Oxford:\n“From the word go, we looked on it today. We had to make it a little scruffy, we had to make it into a fight but we know how good a side they are.\n“One thing that did help, I thought the atmosphere was brilliant from the start and that made such a massive difference to me, the staff and the players.\n“It's no nowhere near job done but it gives us a fantastic opportunity to go again on Wednesday against QPR who are fighting for their own points but we’ve got to enjoy the performance and the desire of today.\n“You’ve got to dig in, do whatever it takes to get the three points, and then put your feet up and watch whatever it is you like on a Saturday night.”\n'It's not FIFA... we didn't do enough to win'\nFT: Oxford United 1-0 Sheffield United\nSheffield United\nSheffield United boss Chris Wilder told BBC Radio Sheffield:\n“We didn’t do enough so there’s no arguments about the result.\n“They started better than us - a team fighting for their lives, they stuck it on us with long throws. We had two or three opportunities before they scored which we should probably take.\n“There was an opportunity to gain three points but well done to Gary [Rowett], they deserve their win and obviously an amazing away record comes to an end.\n“It’s not an attitude problem, we just made some bad decisions. It was a slow pitch, a dry day, and we have to recognise we have to play a little bit quicker and more direct.”\n“We’ve got to make better decisions, to do something different - its not FIFA! We didn’t do the basics right.\n“The game’s not won on a coupon, the game's won on a pitch, and we didn’t do enough to win.”\n'Our mentality is getting better - you can see it'\nFT: West Brom 0-1 Sunderland\nSunderland\nSunderland head coach Regis Le Bris told BBC Radio Newcastle:\n\"We were really well connected and won many duels and our team spirit was impressive again.\n\"They put many bodies in the box and they tried different options to create situations but we defended well.\n\"Until the end we were on the edge but the mentality of the team is getting better – you can feel it now.\n\"Probably three or four months ago we would have lost that game and we've lost many points in these circumstances, so this was positive.\"\n'You have to put the ball into the net'\nFT: West Brom 0-1 Sunderland\nWest Bromwich Albion\nWest Brom head coach Tony Mowbray told BBC WM:\nJoe [Wildsmith] acknowledged he made a pretty bad mistake which cost us a goal, and ultimately the game.\n\"But that's the job as a goalkeeper. It's frustrating because that becomes the narrative. With the chances we had and the situations we got into, you have to put the ball in the net.\n\"We've been here before but I'll see what he's like in training and see how he reacts. It's very naive to think 'the goalie makes a mistake, so change the goalie'.\n\"If the goalie you put in makes a mistake in the next game, where do you go then? Change him again? I don't think so. I will rely on my experience to make the right decisions.\n\"But the responsibility of the team is to score some goals in a game we were on top of for most of it.\"\n'I thought we were superb'\nFT: Coventry 1-2 Burnley\nBurnley\nBurnley boss Scott Parker told BBC Radio Lancashire: \"[A] massive result for us. First and foremost we've come to a really tough place, the stadium was bouncing today, so we knew the challenge ahead of us and I thought we were superb today.\"\nOn the winning goal: \"Great goal in terms of the timing of it in the second-half but one goal in this league - nine times out of 10 - and the match turns out how it turned out. For 15[the last] minutes, any coach standing here suggesting there is a tactical element, there isn't, it's time to dig deep.\"\nOn Coventry's goal: \"It was puzzling really. I'm not level with the play, I'm standing in this box, you can instantly tell something didn't look right. That was very, very night and day - our reaction was superb but a little bit disappointed in that one.\n\"This division is highly competitive. To be 27 matches unbeaten is something to be really proud of, hopefully we continue that.\"\n'Lampard sent off after frustration boiled over'\nFT: Coventry 1-2 Burnley\nCoventry\nCoventry City assistant coach Joe Edwards told BBC Radio CWR: \"I'm here because Frank was sent off which I've just been informed of as we came off the pitch.\n\"Frank's received the red card, I'm not entirely sure what for to be honest with you. Obviously there was a bit of frustration from everyone in the stadium and it's boiled over and Frank's been punished.\n\"The last thing I want to do is get punished myself by speaking too much.\n\"When you concede a goal like that against a Burnley side who are capable of shutting up shop, the big marker is what's the reaction going to be like and that was the positive thing for us because for the remaining 30 minutes of the game, the game was played in Burnley's half.\"\n'It was the story of our season'\nFT: Plymouth 2-1 Norwich\nNorwich City\nNorwich City head coach Johannes Hoff Thorup told BBC Radio Norfolk:\n\"It sums up our weakness as a team and that's to defend all those situations where the ball is brought into the box from the opposition - second ball situations, third ball situations we really, really struggle as a team to defend that.\n\"It tells a bit of a story because up until the first goal we have the control of the game exactly as we want, we created an amount of situations in the box and had a couple of crosses where were very close to getting a foot or head to it.\n\"Then it's probably the first situation around our goal and they score a goal, and that's been the story of the season.\n\"I'm tired that our defensive line cannot keep troubles away.\"\nDefeat leaves Norwich 11th, eight points off the top six with six games to play.\n\"The lads are leaving it all out there at the minute'\nFT: Luton 1-1 Leeds\nLuton Town\nMatt Bloomfield speaking to BBC Radio Three Counties: \"A performance to be proud of, a point to be proud against an extremely good opposition, who we all expect will be in the Premier League next season.\n\"For us it is about concentrating on our performance and there is a lot to be proud of today. The resilience we showed out of possession, the structure and discipline and then also the chances we created shows the variety in our play.\n\"The lads are leaving it all out there at the minute and that is all we can ask for.\n\"We know they [Leeds] are top team and a possession based team and we have to adjust ourselves for that accordingly and make sure our game plan is right to win that game, because that is respecting your opposition.\"\n'Not the worst point to take'\nFT: Luton 1-1 Leeds\nLeeds United\nDaniel Farke speaking to BBC Radio Leeds: \"First of all, I have to say, we always knew it would be a difficult game today because let’s be honest, Luton played in the Premier League last season, [so it's] not the worst point to take. Many of the players have played in the Premier League last season.\n\"Of course, they are underperforming in terms of where they want to be in the Championship but you get the feeling that in the recent weeks, they have realised what they have to do. To stick together, to fight in this league.\n\"The first thing you have to do [against Luton] more or less is be ready for the physicality, for the battles and we were. What is annoying is we gave the ball away two times for their only counter attacks in the game more or less.\"", "url": "https://www.bbc.com/sport/football/live/cx280zyg67dt"}