{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:30", "date_modify": "2025-05-21 06:37:30", "date_publish": "2025-04-01 00:00:00", "description": "Chris Forino's stoppage-time goal gives Bolton their first victory over League One neighbours Wigan in more than a decade.", "filename": "sport_football_live_cx2e296v9x9t_1747809450.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx2e296v9x9t_1747809450.html", "title": "Bolton seal rare win at Wigan as Lowe sent off", "title_page": "Wigan Athletic 0-0 Bolton Wanderers: Bolton seal rare win at Wigan as Lowe sent off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Forino's stoppage-time goal gave Bolton their first victory over League One neighbours Wigan in more than a decade.\nForino bundled home a corner in the third added minute to secure Bolton's first win against the Latics since an FA Cup tie in January 2015.\nAnd the drama was not over, with angry scenes in the technical area resulting in Wigan boss Ryan Lowe being shown a red card and goalkeeping coach Andy Lonergan a yellow.\nVisitors Bolton had settled into the game quicker and Joel Randall saw a shot diverted just past the far post by ex-Wanderers defender Will Aimson.\nAt the other end, Maleace Asamoah had a free header off a Jonny Smith cross, but could not direct his effort on target.\nThe second half was a similar story, with the visitors enjoying the better of it, but finding the Wigan defence hard to breach.\nGeorge Thomason's long-range shot was tipped over by Wigan goalkeeper Sam Tickle, before Aaron Collins looked a certain scorer, only for his shot to flick a defender on its way behind for a corner.\nBut as the game looked set to end all square, Wigan could not clear a Bolton corner and Forrino scuffed the ball home from close range.", "url": "https://www.bbc.com/sport/football/live/cx2e296v9x9t"}