{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-05-21 06:26:56", "date_modify": "2025-05-21 06:26:56", "date_publish": "2025-04-01 09:24:24", "description": "Fabian Hurzeler press conference: Brighton vs Aston Villa preview", "filename": "sport_football_articles_c70zwjjzn4go_1747808816.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70zwjjzn4go_1747808816.html", "title": "Fabian Hurzeler press conference: Brighton vs Aston Villa preview", "title_page": "Fabian Hurzeler press conference: Brighton vs Aston Villa preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Georginio Rutter has picked up an ankle injury and Adam Webster is dealing with a muscle injury, which both \"don't look great\". It is \"possible\" that the duo could be out long term.\nHe added: \"It's another chance for Brajan Gruda, Matt O'Riley and Eiran Cashin, so I see it more as an opportunity. I will never complain about injuries. Georginio and Adam were in great shape, but that's football and we have to deal with it.\"\nHurzeler said there are no worries about other players having to step up: \"All of these players that haven't played that much this season have big motivation and big energy. It's these kind of characters that we need for the rest of the season.\"\nThe quick turnaround from Saturday's FA Cup quarter-final defeat by Nottingham Forest is a \"great opportunity for a comeback\". He explained: \"A setback and a disappointment doesn't feel great, but I always say the feeling of a comeback is always greater, so we have to work for that.\"\nHe believes the Seagulls have proven they are \"a team that can stick together\" and he thinks they have \"a big chance\" of getting back to winning ways against Aston Villa.\nOn Unai Emery's team: \"It's a duel that we know will be a big fight. They are a very mature and experienced team. We know that they want to go to Europe. They are still in three competitions and going for a title, so I think they have had a great season.\"\nVilla have \"quality individual players\", such as Marcus Rashford and Marco Asensio, who can \"help every team in the world and definitely make a big impact\".\nHe is expecting his side to play with \"big maturity and intensity\" and he is looking for his players to be \"more ruthless\" than they were against Forest.\nBrighton have the opportunity to record four consecutive home wins in the Premier League for the first time, but they will have to be \"consistent and good in every phase to break the statistic\".\nWhen asked whether Brighton having the opportunity to go fourth in the with a win surprises him, he responded: \"Why should that surprise me? We've always been a club that doesn't want to hide behind our ambitions or be seen as the small club. Although we don't have the financial budget of other teams, you can still play a good season and fight for Europe if you stick together as a team.\"", "url": "https://www.bbc.com/sport/football/articles/c70zwjjzn4go"}