{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-20 12:04:48", "date_modify": "2025-05-20 12:04:48", "date_publish": "2023-08-05 12:43:18", "description": "Wrexham's first game back in the EFL after a 15-year absence ends in disappointment as MK Dons secure an impressive away win.", "filename": "sport_football_66345968_1747742688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BBCC/production/_130667084_gettyimages-1594181908.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345968_1747742688.html", "title": "Wrexham 3-5 Milton Keynes Dons: Dragons' EFL return spoiled by Dons", "title_page": "Wrexham 3-5 Milton Keynes Dons: Dragons' EFL return spoiled by Dons - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham's first game back in the EFL after a 15-year absence ended in disappointment as MK Dons secured an impressive away win.\nEoghan O'Connell's own goal and Mo Eisa gave Dons a two-goal lead early on with Jacob Mendy replying.\nJonathan Leko's second-half brace put MK Dons firmly in control before Jordan Davies grabbed a late Wrexham second.\nDaniel Harvie scored a fifth for MK Dons in stoppage time before Anthony Forde got a third for the hosts.\nIt was a first win for Graham Alexander as MK Dons boss but for a packed Stok Racecourse, including co-owners Ryan Reynolds and Rob McElhenney and guest Hugh Jackman, it was a disappointing afternoon.\nThis was the first time since the 2007-08 League Two season that the sides had met, a campaign in which MK Dons had won the title and Wrexham suffered relegation.\nBut 15 years on, Wrexham secured the National League title to secure promotion while MK Dons were relegated from League One, which had resulted in the appointment of former Salford City and Motherwell boss Alexander in May.\nWrexham were making their return to the Racecourse for the first time since clinching the title and promotion on a memorable Saturday evening against Boreham Wood in April.\nPhil Parkinson's side spent the pre-season on a four-match tour of the United States which included games against Chelsea and Manchester United as well as embracing the club's ever growing support in north America.\nSuch is now the interest in Wrexham that the opening game of new season was sold out within an hour of going on sale and the packed Racecourse also included Australian actor Jackman along with Reynolds and McElhenney.\nIt was the travelling support who were celebrating inside the opening five minutes as Ethan Robson whipped in a free-kick into the area and O'Connell headed into his own net.\nHarvie struck a post for the visitors and although Ryan Barnett flashed an effort from the right flank wide of the post in response, a minute later Dons had gone further ahead as Eisa weaved his way through the Wrexham defence before slotting past Ben Foster.\nWrexham looked laboured in response and lacked the fluency which had brought them so many plaudits last season with Elliot Lee firing high over the crossbar having him found himself with time and space on the edge of the area.\nBut the hosts pulled a goal back four minutes before the interval with Billy Waters, on his home debut, having his shot parried by Craig MacGillivray before Mendy followed up to score from the rebound.\nWrexham made a purposeful start to the second half but they found themselves further behind with Leko's fine left-footed strike finding the bottom corner.\nThe 24-year-old striker capped off an impressive performance with his second goal, shrugging off the challenge of Wrexham's defenders before firing home.\nOllie Palmer had an effort saved by MacGillivray and fellow substitute Davies fired over the crossbar before finding the net with a fierce short during the final 10 minutes.\nWrexham rallied in the closing minutes chasing the game but they were stunned in stoppage time when Harvie found himself on the edge of the box to fire home his side's fifth.\nThere was time remaining for substitute Forde to scored a third for Wrexham but it was a disappointing return to the Football League for the Welsh side.\nWrexham manager Phil Parkinson said:\n\"We were frantic at the start and played it as if it was a World Cup final and wed didn't settle.\n\"I was disappointed in that because we've had a lot of big games here and it's important you get the arousal levels just right, where you're up for the game but you're in control and make good decisions.\n\"We gave a good team a two-goal start. The minute we started linking passes together we looked dangerous and got back in it.\n\"Butt if we're honest, in all departments of the game we were a long way off it today.\"", "url": "https://www.bbc.com/sport/football/66345968"}