{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:49:01", "date_modify": "2025-04-26 06:49:01", "date_publish": "2025-03-01 10:07:36", "description": "Bangor manager Lee Feeney says his players gave their all as they clinched a shock 3-1 win over Glentoran in their Irish Cup quarter-final at Clandeboye Park.", "filename": "sport_articles_cy87qp56nvyo_1745650141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e5da/live/3c8b8d60-f62b-11ef-9f67-d96cf217feb5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy87qp56nvyo_1745650141.html", "title": "Irish Cup: Bangor players 'emptied the tank' in cup win", "title_page": "Irish Cup: Bangor players 'emptied the tank' in cup win - Lee Feeney - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bangor manager Lee Feeney praised his players for \"emptying the tank\" in their shock 3-1 Irish Cup quarter-final win over Glentoran at Clandeboye Park on Friday night.\nBen Arthurs, Ben Cushnie and captain Lewis Harrison were on target as the Championship leaders established a 3-0 lead by the interval.\nDespite Charlie Lindsay's second-half consolation goal for the Glens, the north Down side went on to secure a memorable victory over their Premiership opponents.\n\"I'm delighted for the players. They emptied the tank and that had to happen for us to win that game,\" said Feeney after the match.\n\"Everyone on the pitch gave everything they had, you couldn't ask for much more. When you play those full-time teams, you have to be in and around the ball and not give them space.\n\"That's why we tried to crowd the midfield and not sit off them and let them knock the ball about. It took hard work for that to happen.\"\nFeeney was preparing to give his half-time team talk to reflect a two-goal half-time advantage when his side added their third goal one minute before the interval.\n\"We got a very important goal before half-time which changed things as we were thinking more defensively and instead of being on the front foot again, we said we'll try and hold onto our three-goal lead.\n\"But they started to get the upper hand we felt we had to sit off a bit and there was nothing wrong with that.\n\"It was a horrible goal to give away, but it says a lot for us that after a game like that we were disappointed to concede in the manner that we did.\"\nThe Bangor boss said his side were deserved winners.\n\"We were super and deserved it. Our aim was to come here and compete.\n\"There were people here who have maybe never been here to watch the team before and were maybe thinking, 'I'll give this a go', and then going 'you know what I enjoyed that'.\"\nThe Seasiders are eight points clear at the top of the Championship as they chase promotion to the top flight.\n\"Winning the league is my priority. It will be a far bigger achievement than this,\" Feeney emphasised.", "url": "https://www.bbc.co.uk/sport/articles/cy87qp56nvyo"}