{"authors": ["Paul Higham", "www.facebook.com"], "date_download": "2025-05-21 03:39:48", "date_modify": "2025-05-21 03:39:48", "date_publish": "2024-12-26 08:29:46", "description": "Patrick Mahomes steered the Kansas City Chiefs to the AFC top seed, Lamar Jackson enhanced his MVP claims and Beyonce wowed on Christmas Day in the NFL.", "filename": "sport_articles_c0473n61dw5o_1747798788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c79/live/9ea18da0-c337-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0473n61dw5o_1747798788.html", "title": "NFL results & Christmas Day reports: Chiefs' Mahomes, Ravens' Jackson & Beyonce all star", "title_page": "NFL results & Christmas Day reports: Chiefs' Mahomes, Ravens' Jackson & Beyonce all star - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Kansas City Chiefs locked up the AFC top seed and the Baltimore Ravens crushed the Houston Texans as two of the NFL's biggest names starred on Christmas Day.\nPatrick Mahomes threw three touchdown passes as the Chiefs beat the Pittsburgh Steelers 29-10 to ensure they have a first-round bye and home advantage in the play-offs as they look to win a historic third straight Super Bowl.\nLamar Jackson then further pressed his claims to win a second consecutive MVP award and third overall with another all-action display in Baltimore's emphatic 31-2 victory in Houston.\nJackson threw two touchdown passes and ran in one himself as he broke Michael Vick's NFL quarterback rushing record on a night of headline performances on and off the pitch.\nBeyonce performed a half-time show in Houston to rival those usually seen at the Super Bowl, featuring a Post Malone cameo and ending with her hit Texas Hold 'Em.\nIt was all part of the big show element, marking the NFL's first year of Christmas Day games being streamed globally on Netflix.\nHence why two of the best teams and two of the biggest NFL stars were chosen - and they responded in style.\nNo team has ever won three straight Super Bowls, but the Chiefs powered into pole position in Pittsburgh by going 15-1 and ensuring they get all the trappings of being top seed in the AFC for the fourth time in seven years.\nThe defending champions had plenty of doubters after scraping narrow wins for much of the season, but they emerged from a punishing three games in 11 days with three wins and looking stronger than they have all season.\nMahomes and Travis Kelce are finding top gear in a much improved passing attack and the impressive Chiefs defence, even without star man Chris Jones, sacked Steelers quarterback Russell Wilson five times in yet another stifling display.\nIt was the perfect Christmas for Chiefs head coach Andy Reid, who celebrated by dressing as Santa after the game. He can now rest his star players for their final game of the regular season, when they face the Denver Broncos, before also having a bye week to prepare for their latest play-off charge.\nAnd that is a big worry to the rest of the NFL.\n\"Getting the number one seed is important,\" said Mahomes. \"It's like winning a play-off game.\"\nPittsburgh's defeat opened the door for Baltimore to take charge of the AFC North, which they did emphatically thanks to Jackson's efforts and a large dose of running back Derrick Henry.\nJackson's 48-yard touchdown run was the highlight, where he reached a career-best speed of 21.25mph to leave the Houston defence for dead - despite joking \"I was jogging\" after the game.\nHis 87 yards gave Jackson 6,110 yards in his career, eclipsing Michael Vick's previous record of 6,109 set over 13 seasons. Jackson has been a starter for just seven years.\nThe quarterback's playmaking ability with his arm and his foot speed is complemented by the bruising running style of Henry - who had 147 yards and a team record 16th touchdown.\n\"It's just another phenomenal performance,\" said head coach John Harbaugh of Jackson. \"It's just kind of what he does every week.\"\nThe 11-5 Ravens have the top offence in the NFL and, like the Chiefs, are hitting stride at the right time, with their defence keeping the Texans at bay.\nUnlike the Chiefs, the Ravens will need to go full strength in their final game against the Cleveland Browns to make sure they win their division and get at least one home play-off game.", "url": "https://www.bbc.com/sport/articles/c0473n61dw5o"}