{"authors": ["Jamie Currie", "www.facebook.com"], "date_download": "2025-05-21 05:51:49", "date_modify": "2025-05-21 05:51:49", "date_publish": "2025-01-14 11:38:39", "description": "Rangers fan column: 'Patrick Stewart needs to wake sleeping club up'", "filename": "sport_articles_clyngwlglxyo_1747806709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a91c/live/ad955150-d252-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clyngwlglxyo_1747806709.html", "title": "Rangers fan column: 'Patrick Stewart needs to wake sleeping club up'", "title_page": "Rangers fan column: 'Patrick Stewart needs to wake sleeping club up' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After last week's draw at Hibs, it was important to bounce back against St Johnstone and with the board publicly backing the manager, it was even more important for him to get the three points.\nThe 3-1 victory was routine as it gets. The first 30 minutes were good. Fast, dynamic, attacking football and goals from Igamane, Cerny and Diomande. All three had very good matches and they are becoming three very important players for the team.\nThe second half was a complete non-event, and we go again and concede a completely avoidable goal. Our home league form is almost perfect this season so far, but it will be a tougher challenge on Wednesday coming up against an Aberdeen side who have already given us a bloody nose once this season.\nOn the 55th-minute walkout, I believe people should be able to protest or leave or stay or do whatever they wish. I didn't agree with the booing, and agree that the club have fallen asleep since 55 and Seville. We aren't getting value for money on the park and we lack leadership and vision off it too.\nIt's falls on Patrick Stewart to make sure he can turn both things around as quickly as he can.", "url": "https://www.bbc.com/sport/articles/clyngwlglxyo"}