{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:52:24", "date_modify": "2025-05-20 14:52:24", "date_publish": "2023-07-27 15:07:33", "description": "European champions England take on Denmark, Argentina play South Africa and China meet Haiti on day nine of the Fifa Women's World Cup.", "filename": "sport_football_66323205_1747752744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11AD/production/_130552540_england.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66323205_1747752744.html", "title": "Fifa Women's World Cup day nine: Argentina v South Africa, England v Denmark, China v Haiti", "title_page": "Fifa Women's World Cup day nine: Argentina v South Africa, England v Denmark, China v Haiti - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "European champions England take on Denmark - live on the BBC - in their second match at the 2023 Fifa World Cup in Australia and New Zealand.\nThe Lionesses can qualify for the knockout stages of the competition on Friday if they win and China fail to beat Haiti, who England defeated 1-0 last Saturday.\nEngland's match will be shown live on BBC One with commentary on BBC Radio 5 Live, with both available on the BBC Sport website. Build-up begins at 09:00 BST.\nArgentina play South Africa (01:00 BST) in the opening match of day nine in Dunedin, followed by England v Denmark (09:30 BST) in Sydney, with China v Haiti (12:00 BST) in Adelaide being the last game of the day.\nHere is what to look out for on day nine of the Women's World Cup.\nGroup G | Dunedin | 01:00 BST | ITV\nSouth Africa and Argentina's search for a first-ever Fifa Women's World Cup win continues on Friday.\nDesiree Ellis called her South Africa side \"brave\" and \"courageous\" as they lost 2-1 to Sweden after being a goal up in the opening Group G game, while Argentina were also denied a draw as Italy's Cristiana Girelli headed home with three minutes remaining for a 1-0 win.\n\"This team has really fought through adversity, through challenges, and against Sweden the same thing,\" Ellis said.\n\"Even though we lost, people saw the South African team, but I think there is more that people haven't seen and hopefully we can showcase that.\"\nSouth Africa or Argentina, if defeated in Dunedin, could be eliminated on Saturday, depending on the outcome of the other Group G game between Sweden and Italy.\n\"This is more than just historic, it is a game we must win,\" Ellis said.\n\"It is our final, we can't look any further ahead than that game because everything else doesn't matter.\"\nBBC Sport football expert Rachel Brown-Finnis' prediction: I was impressed by South Africa against Sweden, despite the end result.\nSouth Africa not only took the lead, they defended on the front foot and I liked how they anticipated danger. They dealt with Sweden really well until the very last part of the game.\nArgentina did OK in their defeat by Italy but I don't think South Africa will have seen anything to scare them, and I can see them getting a win this time. 1-2.\nKey stat: Argentina are the team who have played the most games at the Fifa Women's World Cup without ever winning, having lost eight of their 10 matches.\nGroup D | Sydney | 09:30 BST | BBC\nBy the end of tomorrow, Sarina Wiegman's side could have booked their place in the last 16 with a game to spare if they beat Denmark and China fail to win against Haiti in the other Group D match.\nDenmark boss Lars Sondergaard claimed his team would be \"underdogs\" in the match-up against one of football's \"superpowers\" as his fully-fit side also aim to secure a last-16 spot on Friday.\n\"Of course [Sondergaard] wants to put us in that position. We're always the team to beat. I've never experienced anything else,\" Wiegman said.\nAfter a nervy 1-0 win against Haiti in their opening game, England will be keen to add more goals, but they also face the tough task of keeping Danish forward Pernille Harder at bay.\n\"We don't prepare just for one player,\" Wiegman added.\n\"Denmark is a very well organised team. They have a very clear game plan in possession and out of possession and Harder is a big part of that too.\"\nBrown-Finnis' prediction: I am expecting England to get better and better as this World Cup goes on, so this performance should be much improved on their win against Haiti.\nEngland have come into this tournament in a totally different place in terms of momentum and confidence than they were before the Euros, and are also without some key personnel, so it is is going to take a bit longer for the team to gel.\nBut we do have plenty of experienced players at major finals, and lots of quality too - plus a real mastermind of a manager - so I still think we will get the job done. 1-0.\nKey stat: This will be the 18th meeting between England (eight wins) and Denmark (six wins) in all competitions, with the Lionesses winning each of the past three encounters.\nGroup D | Adelaide | 12:00 BST | ITV\nBoth sides go into this game looking to pick up their first win of the tournament after narrowly losing their opening fixtures.\nWhile Haiti impressed in the attacking third on their World Cup debut against England, China troubled to threaten Denmark's defence during a 1-0 defeat.\n\"We were very happy after the England game because we received a lot of compliments from other countries,\" said Haiti manager Nicolas Delepine.\n\"But the message I want to say is that it will only count if we face China in the same way.\"\nDefeat could eliminate the losers, depending on the result of the England-Denmark match. China are seeking to continue their record of making it to the knockout stage of every Women's World Cup they've played in, while Haiti are searching for their first goal at a World Cup.\n\"For us, everything is possible,\" Delepine added.\nBrown-Finnis' prediction: China looked well organised against Denmark, but they don't seem to have much in attack.\nIn contrast, we all saw how dangerous Haiti were against England.\nThey have offered far more going forward than any of the other World Cup debutants, and I would be very surprised if they don't get some goals to show for it this time. 1-2.\nKey stat: China have failed to score in their past three games at the Fifa Women's World Cup, their longest run without a goal in the competition.", "url": "https://www.bbc.com/sport/football/66323205"}