{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 05:49:25", "date_modify": "2025-05-21 05:49:25", "date_publish": "2025-02-08 19:15:38", "description": "Marcus Edwards' unconventional career path continues as he scores an FA Cup match-winner on his Burnley debut.", "filename": "sport_football_articles_c4g7y2n2j7go_1747806565.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e8b/live/0967a310-e64a-11ef-83f8-35f434c6ab1c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g7y2n2j7go_1747806565.html", "title": "Marcus Edwards: From Lionel Messi comparisons to Burnley's FA Cup hero", "title_page": "Marcus Edwards: From Lionel Messi comparisons to Burnley's FA Cup hero - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The career of Marcus Edwards has already taken plenty of twists and turns, but on Saturday he opened what could turn out to be his most rewarding chapter.\nSigned on loan from Portuguese giants Sporting on deadline day, the 26-year-old midfielder came off the bench to score the winner as Championship high-flyers Burnley dumped Premier League strugglers Southampton out of the FA Cup.\nA product of Tottenham's academy once compared to Lionel Messi, after six years in Portugal Edwards has returned to England with the goal of finally playing in the Premier League.\nEdwards joined Tottenham at eight years old, and before long his abilities drew comparisons to one of the greatest players of all time.\n\"The qualities, his body and the way that he plays, it is reminiscent a little bit from the beginning of Messi,\" then Spurs boss Mauricio Pochettino said in 2016.\nAs often seems to happen, the comparison to Messi proved a curse. After loan spells with Norwich and Excelsior in the Netherlands, Edwards was released just three years later. Coaches were unconvinced by his ability and concerned about his behaviour and timekeeping.\n\"He was a young boy in and around London and when you're a young boy sometimes there's a difference in the way you are, but he's matured and there's no denying he's a special talent,\" Burnley manager Scott Parker - who worked with Edwards at Spurs - told BBC Radio Lancashire.\nWithout a club at 20 years old, Edwards took the brave decision to move abroad, signing a four-year deal with Vitoria Guimaraes in Portugal's top flight.\nThere he spent two and a half seasons - during which he made his European bow in the Europa League - before Sporting signed him in January 2022.\nUnder the management of now Manchester United boss Ruben Amorim, Edwards' stock rose significantly - to the point where he was linked with a move to Liverpool.\nIn 120 appearances for Sporting he provided 26 assists and scored 24 goals, one of which came against former club Tottenham on his second career outing in the Champions League.\nYet this season didn't go according to plan. Amorim's departure for United, combined with a month on the sidelines with injury, led to Edwards falling out of favour.\nHis last appearance for Sporting came on 30 November, more than two months before he joined Burnley.\nSacrificing Champions League football to play in the Championship seems an odd decision, but perhaps it is one that suits both parties.\nEdwards has reunited with Parker 13 years after they first met, when Edwards was in the Spurs academy and Parker was doing his coaching badges.\n\"We had a good relationship back then so when I knew he [Parker] wanted me to come that was enough for me,\" Edwards said upon joining the Clarets.\n\"From knowing what he's like and how he is, and the fact that Burnley is such a big club in general. It made sense.\"\nBurnley are third in the Championship and have built their promotion push on what could prove to be a record-breaking defence.\nIn 31 league games this term Parker's side have kept 22 clean sheets and conceded just nine goals, five fewer than any team in the top two tiers of Spain, Italy, France and Germany.\nBurnley trail league leaders Leeds by five points though, and it's hard to see past a faltering attack as the main reason why.\nSupporters have seen their side score just 37 goals in 31 games, whereas Leeds have netted 62.\nThere have been grumbles at Turf Moor, so Parker will be hoping Edwards can spark life into his attack.\n\"He scores the winner, he has been brought in to give us those better habits in and around the box. It's a good start,\" Parker said after the match.\nWhile Edwards' close-range finish on Saturday will be among the easiest goals he will ever score, knocking out a Premier League club is not a bad way to endear supporters to you on your debut.\n\"It feels good being back in England, playing in the FA Cup,\" he said at full-time.\n\"I was well prepared. I knew I was going to play today, he [manager Scott Parker] told me yesterday, so I just had to come on and do what I do.\"\nAt full-time at St Mary's, Edwards' new team-mates pushed him towards the travelling fans to receive his own standing ovation.\nHe, and they, will be hoping there is more of the same come the final day of the season.", "url": "https://www.bbc.com/sport/football/articles/c4g7y2n2j7go"}