{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:50:18", "date_modify": "2025-04-26 07:50:18", "date_publish": "2025-02-26 22:11:45", "description": "Darwin Nunez among Atletico Madrid's summer targets, Joao Pedro on Liverpool's radar, and Vinicius Jr could make summer Saudi move.", "filename": "sport_football_articles_cy5nkzl5g60o_1745653818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5715/live/b0bf2e20-f48d-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy5nkzl5g60o_1745653818.html", "title": "Football gossip: Nunez, Pedro, Vinicius Jr, Eze, Hernandez, Ait-Nouri, Aghehowa", "title_page": "Football gossip: Nunez, Pedro, Vinicius Jr, Eze, Hernandez, Ait-Nouri, Aghehowa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Darwin Nunez among Atletico Madrid's summer targets, Joao Pedro is on Liverpool's radar and Vinicius Jr could make summer Saudi move.\nAtletico Madrid are on the hunt for a new striker in the summer and one of their transfer targets is Liverpool's Uruguay striker Darwin Nunez, 25. (Caught Offside), external\nLiverpool will only sell Nunez if they bring in a replacement, with Brighton's Brazil striker Joao Pedro, 23, one name on their radar. (Teamtalk), external\nBrazil forward Vinicius Jr will have the chance to make a £200m move to the Saudi Pro League in the summer when the 24-year-old will have two years left on his Real Madrid contract. (Telegraph - subscription required), external\nTottenham could make a move for Crystal Palace's Eberechi Eze in the summer after becoming a \"concrete option\" for the England winger, 26. (Give Me Sport), external\nManchester City are considering a summer move for France left-back Theo Hernandez, with the 27-year-old having hit a standstill in talks over a new contract with AC Milan. (Teamtalk), external", "url": "https://www.bbc.co.uk/sport/football/articles/cy5nkzl5g60o"}