{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:21:50", "date_modify": "2025-05-20 13:21:50", "date_publish": "2023-07-24 15:00:14", "description": "Liverpool end 'top-class' Germany trip with 4-4 draw", "filename": "sport_articles_cg3wyw675wno_1747747310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f25a/live/4da5ce20-2a31-11ee-bd87-2385eb7a2b46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cg3wyw675wno_1747747310.html", "title": "Liverpool end 'top-class' Germany trip with 4-4 draw", "title_page": "Liverpool end 'top-class' Germany trip with 4-4 draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool rounded off their pre-season training camp in Germany with a 4-4 draw against Greuther Furth on Monday.\nLuis Diaz scored and Darwin Nunez netted twice as the Reds went 3-1 up, but they then needed a late Mohamed Salah goal to avoid defeat.\nManager Jurgen Klopp told the club website: \"You could see now, last day of the camp - travel, play, travel is always a bit exhausting. But that’s it and you have to go through it, that’s what we did. Most important, nobody got injured.\n\"Of course, nobody wants to concede four goals, but you saw in the second half we tried to have a playing build-up and we were too late in mind, passed the balls too late, first touch not good, and that’s how we brought them back into the game. We scored, on the other hand, really nice goals, to be honest.\n\"So a lot of good individual performances and that’s most important, that we have 50-ish minutes for everybody and, again, nobody got injured. A good camp and I’m really happy.\"\nHe added: \"The camp was top, absolutely top-class - we cannot say differently. If we can, we will try to come back because the circumstances were perfect. We could do everything we wanted to do.\"", "url": "https://www.bbc.com/sport/articles/cg3wyw675wno"}