{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:30:17", "date_modify": "2025-05-21 05:30:17", "date_publish": "2025-01-23 06:26:41", "description": "Donegal boss Jim McGuinness is not predicting chaos when the new football rules come into effect this weekend as the Allianz League starts.", "filename": "sport_articles_cm21575zypdo_1747805417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/441c/live/2af27d20-d713-11ef-a7c6-03687bfc5dc1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cm21575zypdo_1747805417.html", "title": "Jim McGuinness: Donegal boss optimistic new football rules will bed in well", "title_page": "Jim McGuinness: Donegal boss optimistic new football rules will bed in well - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal boss Jim McGuinness is optimistic that the new football rules will bed in without major difficulty when the Allianz League begins this weekend.\nThe Ulster champions begin their campaign with an away tie against Kerry on Sunday but McGuinness is not anticipating chaos as the Football Review Committee's deliberations are put into practice.\n\"I think a lot of it is going to work to be honest. I don't think it's going to be that difficult to police either,\" the Donegal manager told BBC Sport NI.\nMcGuinness says that the only new rule that has been causing Donegal significant issue in training and challenge games is the change requiring three players to remain in the opposition half when a team loses possession.\n\"We've had a referee on the sideline trying to police that for us as they were dropping back in, to help the man in the middle. Apart from that they haven't been too difficult.\"\nMcGuinness predicted than an \"unintended consequence\" of the new rules could be lengthy periods of \"possession football\" by teams in the opposition half.\n\"You might have a situation where that could end up happening in the attacking half and slowing play. We'll have to wait and see. Will goalkeepers be as brave in reality as they are in the off-season or the pre-season tournaments.\"\nMcGuinness thinks the removal of the short kickout option because of the arrival of the new 40-metre arc is going to increase football's entertainment factor.\n\"You are going to see a different kind of role required for the goalkeeper, in terms of keeping the ball away from the opposition but also having a situation where there's length in the kick.\n\"That is going to make it more exciting, the ball is going to be in contest a lot more.\"\nMcGuinness didn't say it but his regular keeper Shaun Patton has one of the longest kicks in modern day inter-county football, which potentially could be of benefit to the Ulster champions\n\"It's going to mean that people have to go back to the drawing board in many respects in terms of trying to work out how they can keep the ball but go long.\n\"We're back maybe two decades ago because that's what teams were thinking about back then.\"\nMcGuinness added that \"teams will be learning off each other as the rules go on\".\n\"Getting the pen and paper out and trying to work out what might benefit them and other people might be picking that up.\n\"There'll be a lot of change, I would feel between games and as the National League goes on. Hopefully, at that stage things start to settle going into the championship and everybody will have a clear idea of what they want to do on the pitch.\"\nDonegal played a recent challenge game against Sligo and McGuinness added that he and his managerial counterpart Tony McEntee both remarked afterwards that the game \"had never really settled\".\n\"Will the game find a pattern or is this the new reality? That there won't be a pattern,\" continued McGuinness.\n\"There's going to be a relentless nature to it. That will bear out over the next couple of months.\"\nDonegal were the only team to beat All-Ireland winners Armagh in last year's championship - albeit in a penalty shootout in the Ulster Final - but McGuinness says that doesn't mean his side go into 2025 within touching distance of landing the Sam Maguire Cup.\n\"I wouldn't look at it like that. I would look at it like we didn't get over the line ourselves in the semi-final and Armagh did. Hats off to them, they took their opportunity when it presented itself.\n\"Armagh are All-Ireland champions, we got beat at the semi-final stage. We won't be making any correlation other than we were in the fight.\"\nMcGuinness added that as ever, all his team's initial championship focus will be on Ulster and the preliminary-round tie against Derry in Ballybofey on the opening weekend of April as Donegal aim to repeat their provincial victory over the Oak Leafers last year.\n\"Every single year for myself and for the team at this time of the year, there is only one championship and that's the Ulster Championship. When that's over the next championship starts.\n\"We won't be talking about anything other than Derry in Ballybofey and that's where our focus will go. We'll use the league to try and prepare for that.\"", "url": "https://www.bbc.com/sport/articles/cm21575zypdo"}