{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:39", "date_modify": "2025-05-21 03:42:39", "date_publish": "2025-02-09 18:04:08", "description": "Portadown manager Niall Currie praises his side's \"character\" as they twice fought back to draw 2-2 with Cliftonville at Solitude.", "filename": "sport_articles_cnvq9v7yg3lo_1747798959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/98b9/live/3157aa20-e70b-11ef-a5b2-6f302c2db239.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cnvq9v7yg3lo_1747798959.html", "title": "Irish Premiership: 'We come away a bit frustrated'", "title_page": "Irish Premiership: 'We come away a bit frustrated' - Niall Currie on Reds draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portadown manager Niall Currie praised his side's \"character\" as they twice fought back to draw 2-2 with Cliftonville at Solitude.\nAhu Obhakhan's superb flick cancelled out Ryan Curran's opener, with Josh Ukek pouncing on a David Odumosu mistake to rescue a point after Rory Hale had put the Reds back in front.\nAnd whilst pleased to come away with a positive result, Currie was slightly disappointed that they didn't take home all three points after a dominant end to the game.\n\"I haven't had too many good experiences down here, so when you come down here and you are taking a point away it is always a good result,\" he said.\n\"I thought the second half performance was outstanding; we gave away poor goals which is very frustrating but that save at the death from Odumosu [from a Ben Wylie shot] that is one of the best saves I have seen, we thought it was in.\n\"So, we come away a bit frustrated because the last 10-15 minutes we had Cliftonville on the ropes and we were creating chances, but if you had have said to me before the game would you have taken a point, I would have said yes.\"\nThe draw moves the Ports into fifth in the table, but Currie admits he is not focusing on securing a top six spot at this stage, but rather on building on their positive first campaign back in the top-flight.\n\"Whatever happens, happens, we are massively overachieving we came into the season wanting 10th place,\" he explained.\n\"We have had a big overhaul of players, but we are in our rightful place, we have been very competitive against everyone, if we can cut out the poor goals we are conceding, we carry a real threat offensively.\n\"It takes a bit of character to come back twice so I'm proud, because we were every bit a match for Cliftonville over the 90 minutes.\"", "url": "https://www.bbc.com/sport/articles/cnvq9v7yg3lo"}