{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:22:51", "date_modify": "2025-05-20 13:22:51", "date_publish": "2023-08-02 10:10:43", "description": "Sense of optimism around new-look Dundee", "filename": "sport_articles_c87m14zk600o_1747747371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b917/live/eb123fa0-3115-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c87m14zk600o_1747747371.html", "title": "Sense of optimism around new-look Dundee", "title_page": "Sense of optimism around new-look Dundee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tyrone Smith, BBC Sport Scotland\nAs the new kids on the Premiership block, Dundee will be hoping to start life back in the top division with a bang, when they open their league campaign at home to Motherwell on Saturday.\nAfter a campaign away from it, they secured their seat back at Scottish football’s top table by winning the Championship last term.\nHowever, it is a very different looking Dark Blues set up this time around.\nNot only is new boss Tony Docherty preparing for his first league campaign as a manager in his own right, the squad he has assembled looks very different to the one Gary Bowyer had at his disposal.\nSince his appointment at the end of May, Docherty has completely overhauled the playing staff, recruiting 11 new players – and there could be more new arrivals before the summer transfer window shuts.\nDundee failed to progress from their Viaplay Cup group. They won three of their four fixtures, but missed on the knockout stages on goals scored.\nDespite that set back, there is still a real sense of optimism and excitement about what lies ahead over the coming months.\nSo what would constitute success for Docherty’s side this season?\nWell, avoiding a quick-fire return to the second tier will be their top priority.\nHowever, there will undoubtedly be those among the Dens Park faithful who will be quietly confident that their new-look team can gel quickly and get themselves in the mix for what is sure to be another intriguing battle in the race to finish in the Scottish Premiership’s top six.", "url": "https://www.bbc.com/sport/articles/c87m14zk600o"}