{"authors": ["Mark Gleeson", "www.facebook.com"], "date_download": "2025-05-19 14:58:51", "date_modify": "2025-05-19 14:58:51", "date_publish": "2017-07-04 11:04:43", "description": "Zimbabwe are using three coaches for the different international tournaments that they are involved in this year.", "filename": "sport_football_40492547_1747666731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/165C5/production/_96798519_632510552.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40492547_1747666731.html", "title": "Zimbabwe employ three national coaches", "title_page": "Zimbabwe employ three national coaches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Instead of having a full-time national team coach Zimbabwe are using three different men in charge for three different competitions they are involved in.\nZimbabwe have not formally replaced Kalisto Pasuwa, who left the national team job after their exit from the Africa Cup of Nations finals in Gabon earlier this year.\nInstead Norman Mapeza is in charge of Nations Cup qualifying, Rahman Gumbo for the African Nations Championship (CHAN) campaign and veteran Sunday Marimo Chidzambwa is leading the squad at the Cosafa Cup.\nAll three men have had spells in overall charge of the Warriors in the past.\n\"My task is to look after the team in the Cosafa tournament and when the southern African championship is finished I'm done,\" Chidzambwa explained.\n\"I'm not looking at development or anything like that. As with any other coach, I want to get as far as I can … in fact I want to win the final.\"\nThe squad that Chidzambwa is in charge of take on Lesotho in the semi-finals of the Cosafa Cup in Moruleng, South Africa on Wednesday.\nChidzambwa has won the tournament twice before as coach and has an unbeaten record in the Cosafa Cup.\nThe country, whose cash-strapped football association has been the subject of frequent court sequestration bids and previously had property seized to pay outstanding debts.\nMapeza took over as caretaker coach for the start of the 2019 Nations Cup qualifiers, where the Warriors, with a team filled with foreign-based players, began their bid to qualify for the next tournament in Cameroon with an impressive 3-0 win over Liberia.\nThe next Nations Cup qualifier for Zimbabwe is in March next year against the Congo in Brazzaville.\nChidzambwa was in Zimbabwe's first post-independence team in 1980 and coached the national team first in 1995.\nHe had a permanent spell from in 2002 to 2004, after which Gumbo took over from him, and returned again in 2009 after Jose Valinhos left.\nGumbo's spells in charge came in 2005 and 2012 he is now preparing to play Namibia on 16 July in the CHAN qualifiers with the second leg set for the following weekend.\nShould they progress, they will meet either the Comoros Islands or Lesotho over two legs in August for a place in next January's finals in Kenya.", "url": "https://www.bbc.com/sport/football/40492547"}