{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-04-26 08:15:01", "date_modify": "2025-04-26 08:15:01", "date_publish": "2025-02-26 11:02:52", "description": "Exeter could unveil the signing of Australia centre Len Ikitau in the next week as Rob Baxter targets two other Wallabies.", "filename": "sport_rugby-union_articles_ce98npp588xo_1745655301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa19/live/31dc9810-f431-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ce98npp588xo_1745655301.html", "title": "Exeter Chiefs close in on Len Ikitau, Jake Gordon and Julian Heaven", "title_page": "Exeter Chiefs close in on Len Ikitau, Jake Gordon and Julian Heaven - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter could unveil the signing of Australia centre Len Ikitau in the next week.\nThe 26-year-old, alongside fellow Wallabies Jake Gordon and Julian Heaven, have been strongly linked with a move to Sandy Park.\nBrumbies back Ikitau, who has won 39 caps for Australia, would fill the gap left by Wales centre Joe Hawkins who is set to return to his homeland at the end of his deal this summer.\n\"He's a fantastic player and one we'd love to have here at Exeter,\" Baxter told BBC Sport, when asked about Ikitau.\nHooker Heaven would be a replacement for Bath-bound Dan Frost while Gordon would fill a role at scrum-half which has a times proved a difficult area at Sandy Park.\n\"They're positions that everyone knows we're looking at,\" he added.\n\"Obviously we've got hookers leaving and off contract so we're certainly looking at at the hooker position, that's going to be a very important slot for us to fill with some quality.\n\"At nine, people are aware we're looking to add a little bit of experience and quality there as well, so obviously Jake Gordon certainly fits that bill.\n\"He's a very good player and has very much come to prominence in the last three or four years both at his club and internationally.\"\nWhile Baxter would not confirm if the deals had been agreed, the anticipated additions would be the latest Australian internationals to agree to move to Exeter.\nThe club has a long history of signing Australia players with Dean Mumm, Nic White, Dave Dennis and Greg Holmes having played at Sandy Park in the past.\nWallabies back-row Tom Hooper has already committed to a deal to join in the summer while prop Scott Sio is still under contract at the club.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ce98npp588xo"}