{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-05-21 06:59:43", "date_modify": "2025-05-21 06:59:43", "date_publish": "2024-12-24 06:14:35", "description": "Sport takes a break around much of the world this Christmas, but not in the US where Netflix expects a record audience for its first festive NFL games and a half-time show by Beyonce.", "filename": "sport_articles_cvgpvpk7zx5o_1747810783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dddd/live/9ac179c0-c175-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgpvpk7zx5o_1747810783.html", "title": "NFL & Beyonce: Why do US sports have Christmas Day games?", "title_page": "NFL & Beyonce: Why do US sports have Christmas Day games? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sport will take a break around much of the world this Christmas, just as it does every year.\nBut not even Christmas Day can halt the fixture list in the United States.\nAmerican families are used to watching sport together on the Thanksgiving holiday, on the fourth Thursday in November.\nThen a month later they do it all again. It is as much a part of the holidays as turkey dinners.\nThis year, though, the NFL says that a \"new global holiday tradition\" will begin, featuring Beyonce and Mariah Carey.\nChristmas Day sport had initially been an English tradition, with Football League games attracting huge crowds from 1889 before dwindling interest led to the final game in 1965.\nAn increase in television sets was partly responsible, but TV helped basketball become a festive staple in the US.\nThe NBA first played at Christmas in 1947, during the league's second season, and right from the start games have been televised.\nChristmas Day has become the most-watched day of the NBA's regular season, with 2011 its best year, when the five games averaged 6.3 million viewers.\nMultiple Christmas games have been played each season so there have been 277 NBA games played on 25 December.\nTraditionally, basketball had Christmas all to itself, while Thanksgiving was American football's day. Not any more.\nThe NFL has played Thanksgiving games since its first season in 1920 but in 1971 it gave Christmas a go with two play-off games.\nThe latter went into double overtime. It ended up being the longest game in NFL history at 82 minutes and 40 seconds.\nReportedly, there were complaints as it caused havoc with dinner being served, so the NFL avoided scheduling another Christmas game until 1989.\nThis time they had a 9pm kick-off and it proved a big hit. With a TV audience of 33 million, it remains the most-watched Christmas game ever.\nChristmas no longer belonged to just the NBA. After 1989, if 25 December fell on a weekend, there would be at least one NFL game.\nSince 2020, there have been NFL games each Christmas, even when 25 December has fallen midweek.\nThe NFL has only played 30 games on Christmas Day, but all of them have attracted bigger TV audiences than the NBA - and the gap is getting bigger.\nOver the past four years, the average Christmas audience for an NBA game has dropped from 4.5 million to a record low of 2.9 million last year. For the NFL, it has increased from 20.9 million to 28.7 million.\nWith 25 December falling on a Wednesday this year, the NFL initially said it wasn't looking to have a Christmas game in 2024.\nIn March, the league announced it had a change of heart. Then in May the NFL agreed a three-year partnership with Netflix to stream Christmas games - and not just in the US.\n\"When we saw the viewership from this past year, really our fans spoke,\" said Hans Schroeder, the NFL's executive vice-president of media distribution.\n\"They are very much enjoying and wanting NFL football on Christmas. What we've seen the last couple of years is some unprecedented growth, and not just on Christmas, on Thanksgiving too.\"\nThe NFL's most-watched regular-season game ever was a Thanksgiving game in 2022, attracting 42.1 million viewers.\nOne of last year's Christmas games had 29 million - second only to the 1989 game.\n\"That opportunity, that belief we have that football brings people together - that's even truer on these big holidays,\" Schroeder added.\nThe league says they will be world sport's first \"truly globally distributed games\".\nInevitably, money is also a factor. ABC/ESPN pay $2.6bn (£2.1bn) to broadcast about 100 NBA games each season, including five Christmas games.\nThat equates to about $26m per game (£21m). To broadcast two NFL games this Christmas, Netflix has paid a reported $150m (£118m).\nThe NFL has experimented with alternative broadcasts (or 'altcasts') to appeal to younger audiences, and the NBA is following its lead.\nThis Christmas will feature the first animated presentation of an NBA game, but the NFL says its coverage will be \"a must-see cultural and global event\".\nMariah Carey used to record a performance of her festive hits for the NBA on Christmas Day. This year she has done so for the NFL.\nBeyonce will also perform a half-time show during the second game in Houston, at about 22:45 GMT. Taylor Swift could even attend the first as her partner Travis Kelce will be playing for the Kansas City Chiefs.\nIt is the latest step by Netflix following its strategic switch to \"tap into massive fandoms across comedy, reality TV, sports and more\".\n\"There are no live annual events - sports or otherwise - that compare with the audiences NFL football attracts,\" added Netflix chief content officer Bela Bajaria.\nNetflix made its first foray into live boxing with last month's Jake Paul-Mike Tyson fight, which was marred by technical issues.\nNetflix said the fight peaked at 65 million concurrent streams, from its 282.3 million subscribers.\nA surge is expected for Beyonce's half-time show, and the NFL is excited about how many switch on.\nIf the service holds up, maybe it will become a global tradition.", "url": "https://www.bbc.com/sport/articles/cvgpvpk7zx5o"}