{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:55", "date_modify": "2025-05-21 06:57:55", "date_publish": "2025-01-04 09:16:25", "description": "LeBron James passes Michael Jordan for the most 30-point games in NBA history as the LA Lakers beat the Atlanta Hawks.", "filename": "sport_basketball_articles_c5ywdrz663zo_1747810675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aee7/live/0494c020-ca70-11ef-955a-5313395be01c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_c5ywdrz663zo_1747810675.html", "title": "LeBron James: Los Angeles star sets new record in win over Atlanta Hawks", "title_page": "LeBron James: Los Angeles star sets new record in win over Atlanta Hawks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "LeBron James passed Michael Jordan for the most 30-point games in NBA history as he helped the Los Angeles Lakers to a 119-102 victory over the Atlanta Hawks.\nThe 40-year-old, the league's all-time leading scorer, scored 30 points to achieve the feat for the 563rd time and pass the mark set by Jordan in 2003.\nHe also moved into fourth in the most number of games played in the NBA on 1,523, one more than Dirk Nowitzki.\nHe now trails only Robert Parish (1,611), Kareem Abdul-Jabbar (1,560) and Vince Carter (1,541) for most career games.\nJordan won six NBA championships with the Chicago Bulls in the 1990s, becoming a global icon of the sport.\n\"Very humbling,\" said James after Friday night's win. \"Anytime I'm mentioned with any of the greats, and arguably the greatest ever to play the game, it's super-cool.\n\"It's someone I idolized in my childhood, and I wear 23 because of him. So to know that I can sit here and be in the room or in the conversation or whatever it is, you mention MJ, it's like super-duper dope for me.\"\nAnthony Davis returned from a one-game absence with an ankle problem to claim 18 points and 19 rebounds for LA, while Austin Reaves had 20 points as the Lakers won their seventh game out of their last nine.\nTrae Young had 33 points and nine assists and Jalen Johnson added 19 points for the Hawks, who led early before the Lakers took a 14-13 lead with seven minutes and 31 seconds left in the first quarter which they never lost.\nThe Oklahoma City Thunder stretched their winning run to a team record-equalling 14 games with a 117-107 victory over the New York Knicks.\nThe Thunder trailed 88-80 going into the final quarter but Aaron Wiggins went on to score 15 of his 19 points while Shai Gilgeous-Alexander, who top-scored on 33 and Jalen Williams, who added 20, also guided them to a victory which ended the nine-game winning run of the Knicks.\nVictor Wembanyama finished with 35 points, 18 rebounds and four assists and had a crucial steal in the final seconds as the San Antonio Spurs edged past the Denver Nuggets 113-110.", "url": "https://www.bbc.com/sport/basketball/articles/c5ywdrz663zo"}