{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:39:56", "date_modify": "2025-05-21 07:39:56", "date_publish": "2025-03-28 11:42:55", "description": "Burnley goalkeeper James Trafford says he enjoyed the welcome he got on his first call-up to the senior England squad.", "filename": "sport_football_articles_czrnrnxmek7o_1747813196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c6d/live/65028e80-0bc3-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czrnrnxmek7o_1747813196.html", "title": "James Trafford: Burnley goalkeeper enjoyed 'welcoming' England squad", "title_page": "James Trafford: Burnley goalkeeper enjoyed 'welcoming' England squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley goalkeeper James Trafford says his call-up into the England senior squad is great recognition for what the Clarets are doing as a club in the Championship.\nThe former Manchester City stopper has kept 26 clean sheets in 37 league matches this season and was selected in Thomas Tuchel's squad for the Fifa World Cup qualifiers against Albania and Latvia, although he did not play in either game.\n\"It's good to get recognised for what you're doing at your club - to get picked was and is a goal of mine, and to play [is a goal too],\" he told BBC Radio Lancashire.\n\"I knew it was extremely tough to get called up playing in the Championship but only I could get myself called up, so I tried to perform and it's good recognition for the club and for what we're doing together in the defence and the team.\"\nTrafford will return to league action with Burnley when they host Bristol City on Saturday (15:00 GMT), looking to maintain their challenge for automatic promotion, but added he was pleased with his first England senior experience.\n\"It's a very welcoming atmosphere because they're all really nice, normal people and they're very welcoming because they want to achieve the same goals, so it's positive,\" he added.", "url": "https://www.bbc.com/sport/football/articles/czrnrnxmek7o"}