{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 05:42:43", "date_modify": "2025-05-21 05:42:43", "date_publish": "2025-01-31 17:08:49", "description": "England slide to a 15-run defeat in a gripping fourth T20 against India as their hosts take an unassailable 3-1 lead in the series.", "filename": "sport_cricket_articles_cew5jzw4rgjo_1747806163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41fc/live/70c636a0-dff3-11ef-b989-9b0a61de45dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cew5jzw4rgjo_1747806163.html", "title": "India vs England: Hosts win tense fourth T20 to seal series in Pune", "title_page": "India vs England: Hosts win tense fourth T20 to seal series in Pune - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England slid to a 15-run defeat in a gripping fourth T20 as India took an unassailable 3-1 lead in the series.\nThe tourists made a rapid start in pursuit of 182 but faltered against spin again to fall from 62-0 to 67-3.\nBen Duckett was caught after miscuing Ravi Bishnoi on 39, Phil Salt was bowled for 23 by Axar Patel and leg-spinner Bishnoi returned to claim the crucial wicket of England captain Jos Buttler for two in the eighth over.\nHarry Brook made 51 but Liam Livingstone and Jacob Bethell were dismissed by Harshit Rana, who was controversially allowed to come in as a concussion substitute and took 3-33.\nEngland needed 25 from the last two overs but Harshit conceded six from the 19th and bowled Jamie Overton for 19 to all but seal the victory. England were bowled out for 166 in the final over.\nThey can have justified complaints that Harshit, who replaced Shivam Dube as a 'like-for-like' player, was able to play such a hand but they also squandered a dominant position with the ball.\nSaqib Mahmood, playing in the series for the first time in place of Mark Wood, took three wickets in his first over to reduce the hosts to 12-3.\nBut, having kept India to 79-5 after 11 overs, England lost control late on.\nIndia plundered 65 runs between the 16th and 19th overs with Hardik Pandya striking 53 from 30 balls and Dube the same score from 34 deliveries as India reached 181-9.\nThe win means India have clinched the series prior to the finale in Mumbai on Sunday. A three-match one-day international series follows next week.\nDefeat also means England have lost their first assignment with Brendon McCullum as their white-ball coach. As has been the case with his Test team, this was further evidence that his tenure will rarely be dull.\nStruggles against spin have been a constant throughout this series and returned again.\nDuckett had pulled, flicked and swept seven boundaries before he miscued the final ball of the powerplay to extra cover. Phil Salt played one risky cut off his stumps too many and Buttler got one that bounced to take an edge.\nThe story, though, was Harshit, who came in for his T20 debut.\nEngland had found worth in attacking a hard length and the fast bowling all-rounder replaced Dube, who was hit on the helmet by an Overton bouncer, and his pace was ideal for such a tactic. Livingstone nicked the seamer behind for nine and Bethell mis-timed a slower ball to long-on for six.\nOnly Brook seemed able to score freely against the seamer, who had only batted three times in professional T20s yet replaced India's number six who rarely bowls.\nRegardless, England should probably still have won but Brook, having hit Harshit for two sixes and a four, scooped leg-spinner Varun Chakravarthy to short fine leg.\nAdil Rashid hit the final ball of the 18th for six to give England hope but Harshit - bowling close to 90mph - expertly closed out the match while England curiously turned down singles in an attempt to give Overton the strike.", "url": "https://www.bbc.com/sport/cricket/articles/cew5jzw4rgjo"}