{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:19", "date_modify": "2025-05-21 07:56:19", "date_publish": "2025-01-22 09:01:40", "description": "Millwall head coach Alex Neil describes their defending as \"nearly criminal\" after surrendering a two-goal lead against Cardiff.", "filename": "sport_football_articles_clyeqd580g9o_1747814179.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac72/live/c7633480-d89c-11ef-9567-af1f21102465.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyeqd580g9o_1747814179.html", "title": "Millwall: Alex Neil - Conceding in last minute 'nearly criminal'", "title_page": "Millwall: Alex Neil - Conceding in last minute 'nearly criminal' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Millwall head coach Alex Neil described his side's defending as \"nearly criminal\" after they surrendered a two-goal lead to draw with Cardiff City at The Den on Tuesday.\nCalum Scanlon's first professional goal put the home side ahead little more than a minute into the game before Casper De Norre doubled the lead on 19 minutes.\nBut Chris Willock's strike in first-half added time gave the Bluebirds a lifeline before substitute Yousef Salech scored his first goal for the club in the seventh minute of time added on at the end to draw the Welsh side level.\nThe result means the Lions have now gone six Championship games without a win, with Neil still waiting for his first league victory since joining the club last month.\n\"We conceded a goal a minute before half-time and then in the last minute of the game so from our perspective that is nearly criminal,\" Neil told BBC Radio London.\n\"Both goals, we don't clear our lines properly, kick it straight to them and within one or two touches the ball ends up in the back of our net.\n\"In that respect we only have ourselves to blame.\n\"When you are tired that's when you need to dig in and be professional and see the game out. When we score two goals and are 2-0 up, we expected to win the game from there. It's so hard to accept.\"\nMillwall visit Luton Town in one of Saturday's early kick-offs.", "url": "https://www.bbc.com/sport/football/articles/clyeqd580g9o"}