{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:50", "date_modify": "2025-05-21 04:09:50", "date_publish": "2024-12-29 00:00:00", "description": "Leeds United will end the year top of the Championship table after Brenden Aaronson scores a well-worked winner at Derby County.", "filename": "sport_football_live_c4g3w4y9xzyt_1747800590.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g3w4y9xzyt_1747800590.html", "title": "Derby County 0-1 Leeds United: Brenden Aaronson winner puts Whites back on top", "title_page": "Derby County 0-1 Leeds United: Brenden Aaronson winner puts Whites back on top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United will end the year at the top of the Championship table after Brenden Aaronson scored a well-worked winner at Derby County.\nThe US international's cool finish at the end of a slick passing move was the decisive moment of an intensely-fought contest at Pride Park.\nLeeds had dictated proceedings in the first half but tireless work by a well-organised Rams defence limited them to few chances – the best of which fell to Mateo Joseph, who forced Jacob Widell Zetterstrom into the only save of the first 45 minutes.\nThe second half was more frenetic, with Derby's Swedish goalkeeper foiling Aaronson, Largie Ramazani and Dan James, while Illan Meslier was tested by Curtis Nelson at the other end.\nZetterstrom, however, could do nothing when Aaronson popped up in the box to slide home the 79th-minute winner that took Leeds two points clear at the summit.\nThe last time Leeds were top of the second tier at the end of a calendar year was in 2019 – a season that ended with their promotion to the Premier League as title winners.\nAnd in an exact repeat of five years ago, the Whites have 51 points going into January.\nIt was only three weeks ago that Derby were brushed aside by Leeds at Elland Road, prompting Paul Warne to describe his Rams as a \"League One team with a bit of sugar on top\" compared to opponents with Premier League capabilities.\nBut while they again came away with nothing, the manner in which Warne's mid-table side hounded the Whites when they were so thoroughly outplayed earlier in the month no doubt made it less bitter.\nWarne stuck with the same side that earned victory against promotion hopefuls West Brom on Boxing Day, while Daniel Farke made four changes following their triumph at Stoke.\nTwo of the four to come in for Leeds combined for the first big chance of the night, with Willy Gnonto fizzing a cut-back pass to Mateo Joseph, who could only direct his close-range attempt well wide.\nLeeds monopolised possession before the break but it was not until the 28th minute that Joseph forced the first save of the game, with Zetterstrom tipping a low effort around the post.\nDerby's best chance of the half followed soon after, with a sliced cross from Kayden Jackson forcing goalkeeper Meslier to hastily backtrack before it dropped just wide of the far post.\nAaronson went on to wastefully thump a shot over the bar on the counter attack before the break, and Joseph did the same after the American had forced Zetterstrom into the first of a string of second-half saves.\nAs the game wore on, Derby grew as an attacking threat.\nIt took a reflex save from Meslier to deny Nelson's header from a corner, while the most acrobatic stop of the night came at the other end moments later as Zetterstrom foiled Ramazani as he snatched at a chance from close range.\nWales international James almost made a immediate impact off the bench, but he could not beat Zetterstrom when through one-on-one, but the keeper was finally beaten when Derby's defence was unpicked by a stunning team move.\nAaronson was involved more than once in a passage of play that ended with Manor Solomon moving the ball across the top of the box for Joel Piroe to tee the American up as he burst unchecked into the area.\nLeeds will be at home to Blackburn Rovers on New Year's Day, while Derby will travel to Sheffield Wednesday.\nDerby County boss Paul Warne told BBC Radio Derby:\n\"In the first 10 minutes we showed them too much respect, really - even with throw-ins we weren't getting tight enough. But after that I thought we were really good – as good as we can be in the nicest possible sense.\n\"The lads gave everything they could. We made changes second half because you could see some fatigue because that is two massive efforts, with two big home games [against West Brom and Leeds] and I can't criticise the lads' efforts.\n\"I thought second half we were quite good, it felt like we were the team that might get a goal on a breakaway or a set-piece.\n\"They then obviously made changes and I hate to admit it, but their goal was a very well-worked goal. It probably took something magical to win this game, and unfortunately it wasn't our players that did that.\"\nLeeds boss Daniel Farke told BBC Radio Leeds:\n\"I think it was a fully deserved win. We were in total control because we expected them to be on it and to try press us. But we didn't allow them to press us because we had good solutions today.\n\"Perhaps in the first half we didn't have enough clear-cut chances to score, but we didn't allow them anything. In the second half my feeling was that at some point we missed too many clear-cut chances to win such a difficult away game.\n\"Normally you can't miss so many chances to win points in such a difficult place but then obviously we scored, for me, the goal of the season. It was an unbelievable team goal.\n\"I'll put it straight away into my poetry album, I loved this goal I have to say. It was a perfect team move and Brenden also came up with a perfect calm finish.\"", "url": "https://www.bbc.com/sport/football/live/c4g3w4y9xzyt"}