{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:43", "date_modify": "2025-05-21 05:34:43", "date_publish": "2025-01-23 07:52:19", "description": "PSG 4-2 Man City: Fan views", "filename": "sport_football_articles_cjr2g0ngrwro_1747805683.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjr2g0ngrwro_1747805683.html", "title": "PSG 4-2 Man City: Fan views", "title_page": "PSG 4-2 Man City: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Wednesday's Champions League game between Paris Saint-Germain and Manchester City.\nHere are some of your comments:\nStella: That was truly shocking yet many fans who have watched City in the last couple of seasons expected it - the demise has been coming. The majority are too old, positionally confused and lacking the hunger that drives great performances. Pep Guardiola is culpable for most of this slide. He refuses to see what is plainly there in a malfunctioning team. The new signings, presumably including the incoming Omar Marmoush, will help, but I am still wondering why no defensive midfielder has been signed?\nPhil: A major rebuild required. This will be the worst season since Pep's first with us... but how brilliant have they been in between? Start again afresh next season.\nBrian: While we're busy collecting centre-backs, has it occurred to anyone we haven't got any full-backs? Josko Gvardiol is a centre-back who is pretty decent at left-back. If Pep believes Rico Lewis, Matheus Nunes and Mateo Kovacic are Premier League-standard players, let alone Champions League quality, he needs to wake up and smell the coffee. A shocking defensive display and an inability to keep possession in our half is why we got exactly what we deserved in Paris.\nUsama: It will be a blessing in disguise to not make it through the group phase. We are absolutely abysmal - the easiest team to play against. Non-existent midfield again and won none of our duels. Slow on the ball and timid with a complete lack of urgency. This is on Pep for not adapting. These sort of games will keep on happening as we have already witnessed so far this season. Dreadful.\nYusuf: What a disappointing performance. PSG were able to get all over them and had double the amount of chances than City. Despite the two goals, they weren't able to hold that win defensively. To be honest, I think this is the worst season that City have had with Pep Guardiola.", "url": "https://www.bbc.com/sport/football/articles/cjr2g0ngrwro"}