{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:24", "date_modify": "2025-05-20 14:07:24", "date_publish": "2023-07-30 16:11:35", "description": "Celtic will launch their Viaplay Cup defence at Kilmarnock in one of two all-Premiership ties in the last 16.", "filename": "sport_football_66355462_1747750044.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/156EC/production/_130588778_20690182.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66355462_1747750044.html", "title": "Viaplay Cup: Holders Celtic away to Kilmarnock in last 16, Rangers host Morton", "title_page": "Viaplay Cup: Holders Celtic away to Kilmarnock in last 16, Rangers host Morton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic will begin their Viaplay Cup defence at Kilmarnock in one of two all-Premiership ties in the last 16.\nSt Mirren face Motherwell in Paisley, while last season's runners-up Rangers entertain Greenock Morton.\nAberdeen visit third-tier Stirling Albion, Hearts host Partick Thistle, and Hibernian welcome Raith Rovers.\nRoss County are away to Airdrieonians and Livingston are at home to Ayr United. The ties will be played on the weekend of August 19-20.\nRaith claimed the final place in the last 16, qualifying as third-best runners-up from the group stage on goals scored after Dundee - needing to win by two or more - could only beat Inverness Caledonian Thistle 1-0 on Sunday.\nEuropean representatives Celtic, Rangers, Aberdeen, Hearts and Hibs all enter at the last 16 and were seeded in the draw along with the three group winners with the best records - Airdrie, Ayr and Motherwell.\nHaving stunned top-flight St Johnstone with a 4-0 away win to advance, Stirling Albion are rewarded with a trip to last season's third-place Premiership side Aberdeen.\nFellow surprise package Airdrie - the only team to emerge from the groups with a 100% record - will aim to upset 2016 winners County at home.\nCeltic, who beat Rangers 2-1 in last season's final before going on to complete the domestic treble, are seeking a third consecutive triumph and have won the trophy in seven of the past nine seasons.", "url": "https://www.bbc.com/sport/football/66355462"}