{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:19:12", "date_modify": "2025-05-21 04:19:12", "date_publish": "2025-01-23 18:42:25", "description": "A joker, an insatiable winner, a 1990s throwback. The highs and lows of Kyle Walker under Pep Guardiola.", "filename": "sport_football_articles_c5yd7pyvgq1o_1747801152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3391/live/706d91d0-d9bd-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yd7pyvgq1o_1747801152.html", "title": "Kyle Walker leaves Man City: The 1990s throwback who became best right-back of a generation", "title_page": "Kyle Walker leaves Man City: The 1990s throwback who became best right-back of a generation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "To get to the bottom of what Pep Guardiola loves about AC Milan-bound Kyle Walker, you need to go back to 10 June, 2023.\nGuardiola had delivered the worst news Walker could imagine.\nThe full-back was riding high on the back of the performance of his career, going head-to-head in a duel for the ages with Vinicius Jr in the Champions League semi-final first leg with Real Madrid.\nTime and again the dazzling Brazilian tried to take Walker on, only to be repelled.\nVinicius Jr even produced an audacious rainbow flick by the touchline, only to find his route to the ball - and the Manchester City goal - blocked off by the England international.\nWalker said after the match: \"I just thought, he is not getting that ball.\"\nFour weeks later, Guardiola dropped him for the Champions League final in Istanbul.\nWalker only played the last eight minutes as City made their own history by clinching the Treble.\nWalker was understandably devastated. This was a player who had lost to Chelsea in the 2021 Champions League final. And six weeks later, he lost the Euros final with England against Italy at Wembley.\nHe did not agree with Guardiola's reasoning - that while he remained one of the world's quickest, most reliable full-backs in a one-to-one battle, something different was needed against Inter Milan.\nMany individuals would have hurled their toys out of the pram after hearing such news and flounced off at the first available opportunity.\nBut Walker is not that man. The Yorkshireman swallowed his pride to deliver an emotional address to his team-mates.\n\"I said 'My dream is in your hands, it's as simple as that. No pressure,'\" revealed Walker after City's historic 1-0 win.\nCity - and Walker - might be in a different 'moment' right now. But that is the leadership Guardiola will miss now Walker is bound for AC Milan.\nThose who know him say he is not a captain in the Vincent Kompany mould, someone who would roll up their sleeves and head to the trenches.\nWalker, 34, is a people person, a joker, a wind-up merchant. Not too intense, a 1990s-style player still cutting it in the 2020s. He looks out for his team-mates and makes the dressing room atmosphere a positive one. When youngsters perform their media duties, he wants to know how they have done.\nIn delivering his pre-final message in Turkey, Walker was effectively saying 'winning this competition has been my dream, I have looked after you guys, now you owe me a favour in return'.\nIt is the reality for most right-backs that their abilities tend to get overlooked.\nGary Neville was an outstanding player in his own right. But what carried him to eight league titles and 85 England caps was the unselfish way he overlapped first David Beckham, then Cristiano Ronaldo, over and over, without getting the ball.\nWalker is not Trent Alexander-Arnold. He cannot spray pinpoint passes around the pitch. Ultimately, he is not the player Guardiola felt could be the inverted full-back the former Barcelona and Bayern Munich coach wanted.\nWhat Walker had was blinding pace and an insatiable competitive streak.\nThese attributes were presumably overlooked when a Tottenham official, reflecting on the player's £50m move north in 2017, said his club felt they had struck a good deal because Walker was not an \"absolute top player\" and they still had Kieran Trippier.\nSix league titles and 93 England caps suggests Tottenham got their assessment wrong.\nAfter that Champions League final, with strong interest from Bayern Munich, Walker was tempted by a fresh start, with British media interest in his private life a compelling factor.\nHowever, Walker ended up committing himself to another two-year contract at City.\nHe was first to front up for City's opening Champions League news conference the following season, knowing the tricky questions that would come.\n\"It wasn't my decision,\" he recounted when asked the inevitable about his final axing. \"It is not a solo sport. He could have picked 16 of us. He had to pick 11.\"\nThose who know Walker feel there is an element of the old school about him.\nHe may be one of the most recognised and decorated players of his generation, earning wages beyond most people's imagination.\nBut at the same time, he is still the lad who grew up on a council estate in Sheffield. \"I remember when mum didn't have £1 to get me an ice cream,\" he said in the wake of the Champions League final success.\nIt is claimed Walker's form has collapsed. But there are some who know him, who wonder if that assessment is accurate. After all, Gareth Southgate thought he was good enough to start the European Championship final in July.\nAmid a huge number of injuries, Guardiola has found it tough to come up with the required answers. Sometimes Walker has started, sometimes he has been on the bench. Sometimes he has felt he was important, on other occasions much less so.\nAs City headed in a new direction, and with the break-up of Guardiola's squad looming, Walker decided on another challenge.\nHe has not abandoned the aim of reaching 100 England caps and feels impressing Thomas Tuchel enough to gain the final seven - and maybe more beyond that - is achievable at AC Milan, whereas that option would not be available if he had gone to Saudi Arabia.\nWalker still feels he has plenty to offer and that Guardiola was right in his recent belief the veteran has another two or three years left in him.\nSo, Walker is bowing out early. Eventually he will get to say the proper farewell he wanted to City's supporters and, doubtless, when his career is over, he will return to the club in some capacity, his legendary status assured.\nBut for now he has a new challenge ahead. And who knows how this season's Champions League will work out - that might involve playing against Guardiola rather than for him.", "url": "https://www.bbc.com/sport/football/articles/c5yd7pyvgq1o"}