{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:12:27", "date_modify": "2025-05-21 07:12:27", "date_publish": "2025-02-08 09:01:41", "description": "Wigan vs Fulham predictions: Chris Sutton on FA Cup game", "filename": "sport_football_articles_c33428yvmy4o_1747811547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c33428yvmy4o_1747811547.html", "title": "Wigan vs Fulham predictions: Chris Sutton on FA Cup game", "title_page": "Wigan vs Fulham predictions: Chris Sutton on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wigan Athletic boss Shaun Maloney says he learned a lot about management from Fulham boss Marco Silva when he played under him at Hull City, but I am surprised he has not said the same about me.\nShaun had an outstanding playing career, and he has a lot to thank me for about that - I helped him a lot when he was a youngster at Celtic, both technically and psychologically.\nBeing serious, fair play to him for the job he has done at Wigan because he has had a lot to contend with there. He also had a tough time in charge of Hibs, where he was wrongly sacked and was not given long enough.\nSo, I have a lot of admiration for what Shaun has done as a manager and Wigan are doing all right under him, but this is a tough game for them.\nFulham are like Bournemouth in that they are in the top half of the Premier League and I want to see them give the FA Cup a real go.\nWe talked about Silva's side on BBC Radio 5 Live's Monday Night Club this week actually, as having a brilliant bench that can make a contribution most weeks.\nAt the start of the season I thought Fulham's home form was impressive but it has dropped off recently, and it is their away form that is exceptional at the moment.\nI think they will carry that on in the FA Cup, and they will be too strong for Wigan.\nThis game could see twin brothers Ryan and Steven Sessegnon play against each other for the first time in their careers - Ryan for Fulham and Steven for Wigan.\nI played against my younger brother, John, when we were both up in Scotland and he tried to kick me but did not get near me - it was a bit like when we played each other in the garden when we were kids, although I was 10 years older than him.\nSutton's prediction: 3-1", "url": "https://www.bbc.com/sport/football/articles/c33428yvmy4o"}