{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:52:43", "date_modify": "2025-05-20 12:52:43", "date_publish": "2023-08-03 10:10:08", "description": "Climate change threatens the future of cycling as extreme weather impacts the safety of events, say campaigners.", "filename": "sport_cycling_66392851_1747745563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C690/production/_130623805_gettyimages-454849780.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66392851_1747745563.html", "title": "UCI Cycling World Championships 2023: Climate change threatens sport - Protect Our Winters UK", "title_page": "UCI Cycling World Championships 2023: Climate change threatens sport - Protect Our Winters UK - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Climate change threatens the future of cycling as extreme weather impacts the safety of events, say campaigners.\nProtect Our Winters UK, external warned that changes in weather will reduce access to trails and put events at risk.\nThe organisation released a report to coincide with the start of the UCI Cycling World Championships.\n\"Drought, high temperatures and forest fires are affecting trails or riders directly,\" said former downhill world champion Manon Carpenter.\n\"These are events happening now, let alone into the future where we can expect increasing severity and unpredictability of these events.\"\nThe report says reduced access may impact people's mental health and wellbeing.\nExtreme weather, wetter winters, melting roads, wildfires, flooding, and erosion threaten bikers' access to the trails, the report says.\nIn July the Red Bull Hardline in Wales was cancelled because of intense rain and heavy winds - something that is becoming increasingly common in cycling, according to Protect Our Winters UK, a climate change campaign charity made up of outdoor sport enthusiasts.\nCycling's world governing body, the UCI, says it is committed to sustainability and can help to tackle climate change by encouraging people to cycle as a form of transport.", "url": "https://www.bbc.com/sport/cycling/66392851"}