{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 03:53:47", "date_modify": "2025-04-26 03:53:47", "date_publish": "2025-03-03 07:47:45", "description": "Man Utd news: Analysis - Another blow for Ruben Amorim", "filename": "sport_football_articles_cqjd720pje2o_1745639627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c6c3/live/f842cab0-f800-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cqjd720pje2o_1745639627.html", "title": "Man Utd news: Analysis", "title_page": "Man Utd news: Analysis - Another blow for Ruben Amorim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There was a moment after 11 minutes at Old trafford on Sunday when supporters saw a glimmer of what Ruben Amorim is looking for from his team.\nManchester United moved the ball left across the defensive line to Matthijs de Ligt. The Dutchman hit an excellent crossfield pass to Diogo Dalot, who in turn laid it off to Christian Eriksen, who had found space between the penalty area and the touchline. The Dane's cross was just too high for Joshua Zirkzee. However, Manuel Ugarte retrieved it, passed the ball to Bruno Fernandes and his low shot was saved by Bernd Leno.\nIt was an excellent passage of play and maybe a sign Amorim's messaging on preferred style is getting through.\nThe problem is there is plenty of evidence to the contrary.\nNeither Rasmus Hojlund nor Zirkzee, who worked hard without threatening, convince as a goalscoring forward, Andre Onana causes uncertainty at the back with some erratic decision-making and United's defenders are too easily caught ball-watching, as proved to be the case when Calvin Bassey put Fulham in front.\nThey do have Fernandes. Roy Keane might not like it but his old club would be in an even more pitiful state without him.\nBut the FA Cup is another one of the avenues to a European spot next season that has been closed.\nIt is a 10th defeat in 24 games for United since Amorim took over as head coach in November, and the sixth at Old Trafford. By contrast, it took predecessor Erik ten Hag 55 games to lose 10 matches.\nAmorim has spoken of how hard his introduction to life at Old Trafford has been. He really needs to change the narrative.", "url": "https://www.bbc.co.uk/sport/football/articles/cqjd720pje2o"}