{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 07:16:21", "date_modify": "2025-05-21 07:16:21", "date_publish": "2025-01-13 19:29:12", "description": "Third-tier side Wolverhampton Wanderers have been drawn at home to Women's FA Cup holders Manchester United in the fifth round of the 2024-25 competition.", "filename": "sport_football_articles_c0lzpgjn62do_1747811781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cdcf/live/80c5e5e0-d1df-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0lzpgjn62do_1747811781.html", "title": "Women's FA Cup holders Man Utd to visit third-tier Wolves in fifth round", "title_page": "Women's FA Cup holders Man Utd to visit third-tier Wolves in fifth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Third-tier side Wolverhampton Wanderers have been drawn at home to Women's FA Cup holders Manchester United in the fifth round of the 2024-25 competition.\nWolves, who are second in the Women's National League Northern Premier, have a full-time coach and staff, but primarily part-time squad of players.\nUnited, who defeated Tottenham to win the cup for the first time last season, beat amateur side West Brom, who are eighth in that division, 7-0 in round four on Saturday.\nRugby Borough, the lowest ranked side guaranteed a place in round five, will also be at home to a Women's Super League team after they thrashed London Bees 6-0.\nBorough, currently fourth in the WNL Northern Premier, will be at home to either West Ham United or Liverpool, whose fixture was one of seven postponed at the weekend because of poor weather.\nWest Ham and Liverpool will instead play on 29 January at 19.45 GMT.\nThe fifth-round ties are due to take place across the weekend of 8-9 February.\nWSL champions and current leaders Chelsea will be at home to either Everton or Spurs in the only tie guaranteed to be an all-top division fixture.\nManchester City, currently second in the WSL, will be at home to first division Leicester City or third-tier Stoke City.\nArsenal, the most successful team in Women's FA Cup history with 14 wins, will be at home to Championship side London City Lionesses if they beat another second tier side, Bristol City, in their rearranged meeting at Meadow Park.", "url": "https://www.bbc.com/sport/football/articles/c0lzpgjn62do"}