{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:57", "date_modify": "2025-05-20 12:20:57", "date_publish": "2023-08-04 22:52:09", "description": "Lowry 'buzzing' at stepping out of Ibrox 'comfort zone'", "filename": "sport_articles_crg7p3dvy4zo_1747743657.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edb0/live/3630f080-3319-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crg7p3dvy4zo_1747743657.html", "title": "Lowry 'buzzing' at stepping out of Ibrox 'comfort zone'", "title_page": "Lowry 'buzzing' at stepping out of Ibrox 'comfort zone' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Lowry is \"absolutely buzzing to step out my comfort zone\" on loan to Heart of Midlothian as \"I've only known Rangers all my life\".\nThe 20-year-old midfielder has played just 13 more times for the Ibrox side's first team since making his debut in 2019 after coming through their youth academy - and he now thinks Hearts will provide \"the next step in my career\" with more game time.\n\"It is up to me now to prove I am good enough to play at this level,\" Lowry told Hearts TV, saying he hopes to \"repay\" technical director Steven Naismith and head coach Frankie McAvoy for taking him to Tynecastle.\n\"I spoke to them a few days ago and there just seemed to be a buzz around the club. The style of play suits me.\"\nAsked what kind of player Hearts fans can expect, Lowry replied: \"Very creative. First thought is always forward. I like to play passes that maybe not many people see.\n\"But I'll work hard for the team and do my bit off the ball so that hopefully, when I get the ball, I can create better chances in better positions.\"\nLowry could not say whether he would be thrown straight into action in Saturday's Scottish Premiership season opener away to St Johnstone but hopes \"to play in front of the fans at Tyencastle as soon as possible\".\n\"It's so tight, there's so much energy around the stadium - it is a wonderful stadium to play in,\" he said, adding that it would \"be brilliant\" to play in the pressurised atmosphere of a derby against Hibernian.", "url": "https://www.bbc.com/sport/articles/crg7p3dvy4zo"}