{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:31:17", "date_modify": "2025-05-21 04:31:17", "date_publish": "2025-01-18 00:00:00", "description": "Justin Kluivert scores a hat-trick as Bournemouth claimed a thoroughly deserved victory at St James' Park to stretch their unbeaten Premier League run to 10 matches and wreck Newcastle's own nine-match winning streak.", "filename": "sport_football_live_clyev7z2nyvt_1747801877.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_clyev7z2nyvt_1747801877.html", "title": "Newcastle United 1-4 AFC Bournemouth: Justin Kluivert scores hat-trick in thumping win", "title_page": "Newcastle United 1-4 AFC Bournemouth: Justin Kluivert scores hat-trick in thumping win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Justin Kluivert scored a hat-trick as Bournemouth claimed a thoroughly deserved victory at St James' Park to stretch their unbeaten Premier League run to 10 matches and wreck Newcastle's own nine-match winning streak.\nThe Magpies were hoping to set a new club record of 10 straight victories in all competitions, but struggled to replicate the form that had them tipped as title challengers.\nBournemouth made the much brighter start and took a deserved sixth-minute lead when Kluivert coolly steered Antoine Semenyo's cutback into the far corner.\nNewcastle equalised with their first real opportunity as Bruno Guimaraes rose highest to nod Lewis Hall's 25th-minute corner past Kepa Arrizabalaga, who failed to keep the header out despite getting a hand to the ball.\nBut the Cherries remained on top and led again a minute before the break, courtesy of another composed Kluivert finish, which came after Guimaraes had lost possession just outside his own box.\nThe visitors thought they had made it 3-1 when Dango Ouattara prodded home from close range shortly after the hour mark, but the video assistant referee (VAR) spotted that Guimaraes' clearance had gone out of play moments earlier and a corner was awarded instead.\nDavid Brooks was also denied by a sprawling Martin Dubravka save, but Kluivert completed his treble - his second of the season after a hat-trick of penalties against Wolves in November - with a spectacular drive into the far corner following a poor Anthony Gordon pass.\nMilos Kerkez rubbed more salt into Newcastle's wounds in added time, sending a fierce left-footed drive into the far corner to the delight of the Cherries' 1,700 travelling fans.\nBournemouth are now just one point behind the fourth-placed Magpies in the table and will end the weekend in sixth if Manchester City fail to beat Ipswich Town on Sunday.\nReaction to Bournemouth's win at St James' Park\nGiven Bournemouth's lengthy list of absentees, extending their record top-flight unbeaten league run into double figures was a magnificent achievement – as was the manner of victory at St. James' Park, inflicting Newcastle's biggest home defeat since Manchester City thumped them 4-0 in December 2021.\nDefender James Hill was the latest player to be ruled out due to injury on Saturday after pulling a hamstring in Tuesday's 2-2 draw at Chelsea, with Kluivert, ironically, his replacement in the starting XI.\nThe Dutchman, whose father Patrick scored only once at home for Newcastle during a short spell in the 2004-05 season, marked his return with a wonderfully crafted opener involving Ryan Christie and Semenyo.\nKluivert's first came not long after Ouattara had shot straight at Dubravka from Brooks' cross, with Semenyo lashing over the rebound from a good position inside the area.\nThe 25-year-old's second was no less than Bournemouth deserved against a rattled Magpies side, whose growing frustration was summed up by Joelinton's rash tackle on the Cherries forward in first-half stoppage time, which earned the Brazilian a deserved yellow card.\nNewcastle's expected second-half onslaught never materialised as Andoni Iraola's team continued to create the better opportunities. Ouattara was unfortunate to see his close-range effort disallowed, and Dubravka produced a magnificent save to prevent Brooks' shot from creeping inside the far post.\nIn many ways, Bournemouth's third of the afternoon summed up the game as Gordon's sloppy pass was cut out by Tyler Adams, with Kluivert then lashing an unstoppable shot past Dubravka to complete his second treble of the season and lift his 2024-25 league tally to 10.\nKerkez's fine finish compounded the woes of Newcastle's former Bournemouth boss Eddie Howe and lifted the Cherries into the top six.\nWednesday's victory over Wolves had lifted Newcastle into the top four for the first time in four months, but they were well below par against a Bournemouth side brimming with confidence themselves.\nIn-form striker Alexander Isak, who had scored in his previous nine club appearances, failed to register a shot from open play, with his only strike a disappointing second-half free-kick which flew straight into the Bournemouth wall.\nIt took the Magpies 20 minutes to register any kind of attempt - a Joelinton effort from the edge of the box which sailed high over the crossbar.\nGuimaraes cancelled out Kluivert's opener, but Newcastle never stepped up after that and were punished for their profligacy in possession.\nKluivert's third was also self-inflicted as Gordon – who lost the ball more than any other player on the pitch on Saturday – sent another wayward pass into the path of Adams before the Dutchman's emphatic finish.\nIt was a chastening defeat for Newcastle and their boss Howe, who was revered as a player and manager during his time on the south coast.", "url": "https://www.bbc.com/sport/football/live/clyev7z2nyvt"}