{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:07", "date_modify": "2025-05-21 03:42:07", "date_publish": "2025-04-06 18:06:22", "description": "Man Utd 0-0 Man City: What Ruben Amorim said", "filename": "sport_football_articles_cn4wmv3pgkro_1747798927.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d5b8/live/34ba8990-1310-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4wmv3pgkro_1747798927.html", "title": "Man Utd 0-0 Man City: What Ruben Amorim said", "title_page": "Man Utd 0-0 Man City: What Ruben Amorim said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Ruben Amorim has been speaking to Sky Sports following the game: \"I think we had some chances to win the game. We tried to use the space in transitions, defending in a low block, but we had our chances.\n\"We had some moments with the ball and we pushed City into their half. So we were closer to a goal, but we can accept a draw. They had more possession but that is normal.\"\nOn what Manchester United still need to improve: \"We have so many aspects to improve. Everywhere we need to improve in every aspect - our build up, transition and decisions in the final third.\n\"Every player can improve. They are here because they showed something at their other clubs, so they have the quality. We are still a team that plays on the transition, so we need to spend more time in final third to have more opportunities.\"\nOn what he needs to do to return the club to the top level: \"I'm not naive or crazy, I can see the moment that we are in. I can look at the opponents and understand that there is a big gap. But, as a leader, I cannot say we are going to take all of the time to close the gap.\n\"Even if we bring in more players, we have to hurry and show urgency to do better because we don't have much time at a club like this. We are in a rush.\"\nOn whether the struggles of both teams affected the intensity of the game: \"If you look at the moment of both teams, we are not fighting for titles and that changes the game completely.\n\"The feeling of winning and not being able to lose one point - that feeling is not here. As the coach, it is hard to say that. We need to fight for big things. If we do, then the feeling will be completely different.\"", "url": "https://www.bbc.com/sport/football/articles/cn4wmv3pgkro"}