{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:35", "date_modify": "2025-05-19 15:05:35", "date_publish": "2015-02-08 19:39:17", "description": "Rangers caretaker manager Kenny McDowall apologises to fans following a 2-1 Scottish Cup defeat at home to Raith Rovers.", "filename": "sport_football_31254647_1747667135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80870000/jpg/_80870919_conroy_ft.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31254647_1747667135.html", "title": "Rangers 1-2 Raith Rovers: McDowall sorry for Cup exit", "title_page": "Rangers 1-2 Raith Rovers: McDowall sorry for Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers caretaker manager Kenny McDowall apologised to supporters following a 2-1 Scottish Cup defeat at home to Raith Rovers.\nWhen asked if he had a message for the fans, he said: \"Just to apologise that we have been knocked out another cup.\n\"They come to watch their team and they pay good money and it's our job to get a win on the day and we have failed. So we apologise for that.\"\nRovers had not beaten Rangers at Ibrox since 1959.\nChristian Nade bundled home a 75th-minute winner after goalkeeper Steve Simonsen and defender Richard Foster failed to deal with Jason Thomson's driven cross under pressure from Mark Stewart.\nRovers, who hit the post through Paul Watson in the first half, took the lead when Ryan Conroy curled home a 54th-minute free-kick.\nHaris Vuckic briefly levelled for Rangers on his debut, while substitute Kris Boyd wasted a glorious chance to equalise again, heading wide from six yards in the last minute.\nThe defeat ended a week in which McDowall said he had been told to start all five loan signings from Newcastle when fit and anger from fans over the board's decision to host a crucial general meeting in London next month.\nThe unrest saw hundreds gather outside Ibrox before kick off to protest and an attendance of just 11,422.\nMcDowall, who has suffered three defeats in five games in caretaker charge, blamed \"cheap goals\" for the defeat.\nHe said: \"I don't think there was a whole lot in the game and I said to them at half-time if we could get the first goal I thought we could go on and win the game well.\n\"I'm just bitterly disappointed, I felt that game was there for us to win today and we've conceded two goals again like last week too easily.\n\"The players have got to stand up. That's what they're paid for. They're professionals. They've got to turn up and go and win games.\n\"That's what you do here, they sign up for it. We're out of the cup, we've got the league campaign and we've got to pick ourselves up and go again.\n\"There's a lot of pressure at the moment and everyone is aware of what's been happening, but they've still got to turn up and play football, that's what they get paid for and that's the bottom line.\"\nThe thousands of stay-away Rangers fans were not the only ones to miss the defeat with the club confirming that all board members were absent too.\nDerek Llambias, James Easdale, Barry Leach and David Somers, who all face removal from the plc board at a 4 March general meeting, were not at Ibrox and neither was club board chairman Sandy Easdale.\nA club statement read: \"It is regrettable that the board of Rangers Football Club were not in attendance at today's important Scottish Cup tie against Raith Rovers.\n\"Given the events over the past few days and after advice from the club, the decision was made not to attend the game.\n\"The board has a duty of care to the fans, staff and stewards to ensure safety at the ground at all times and they believe this was the correct decision.\"", "url": "https://www.bbc.com/sport/football/31254647"}