{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-21 06:25:46", "date_modify": "2025-05-21 06:25:46", "date_publish": "2025-01-04 15:22:14", "description": "Dundee's Tony Docherty - Manager in spotlight on Sunday", "filename": "sport_articles_c4gwlnd7z8do_1747808746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7f10/live/95618ae0-caaf-11ef-8fb8-75874e244aea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4gwlnd7z8do_1747808746.html", "title": "Dundee's Tony Docherty - Manager in spotlight on Sunday", "title_page": "Dundee's Tony Docherty - Manager in spotlight on Sunday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Week after week, the burden of pressure seems to be passed from manager to manager in the cut throat Scottish Premiership.\nThis week, you could have your choice of three, with Aberdeen's form having fallen off a cliff since their opening 13-game winning streak, and 16 unbeaten, under Jimmy Thelin - they are now without a win in nine, losing their past four, as they visit Motherwell.\nFellow newcomer Simo Valakari has watched his St Johnstone side drop to the bottom of the table after seven games of their own without a win.\nMeanwhile, Sunday's hosts, Dundee, looked to have turned their corner with last Sunday's 2-1 win away to St Mirren only to be brought back down to earth with their fourth defeat in five outings.\nThat it came in a home Dundee derby after which United moved up to third place was all the more painful for some of the Dark Blues' support to stomach and manager Tony Docherty has been facing a fair amount of fan flak over his tactics.\nFrom being top-six contenders, Dundee are now five points behind Motherwell, only two above Hearts in the relegation play-off place and a defeat in Perth would leave only four points between themselves and Saints.\nThe result against hosts who can little afford to allow another potential relegation candidate increase that gap could decide which end of the table Dundee will be battling for the rest of the season.", "url": "https://www.bbc.com/sport/articles/c4gwlnd7z8do"}