{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:36:13", "date_modify": "2025-05-21 04:36:13", "date_publish": "2025-01-18 00:00:00", "description": "Imran Louza's first Watford goal for 18 months helps the Hornets overcome Championship strugglers Derby County.", "filename": "sport_football_live_c1jgrnp0g3pt_1747802173.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1jgrnp0g3pt_1747802173.html", "title": "Derby County 0-2 Watford: Imran Louza scores in Hornets win", "title_page": "Derby County 0-2 Watford: Imran Louza scores in Hornets win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Imran Louza's first Watford goal for 18 months helped the Hornets overcome Championship strugglers Derby County to move equal on points with West Brom in the play-off places.\nThe Morocco international gave Tom Cleverley's side the ideal start with a scrambled finish after the Rams defence failed to clear a cut-back pass from Kwadwo Baah.\nDerby hit the woodwork three times before Watford doubled their advantage through Edo Kayembe at the end of a clinical fast break.\nThe boos of Derby fans rang around Pride Park at full-time after their fifth successive defeat, which includes their FA Cup loss to League One Leyton Orient on penalties, dropped the Rams to 19th spot and just one point above the relegation zone.\nWith Derby next facing promotion-chasing Sunderland on Tuesday, the pressure is on boss Paul Warne to stop them from sliding into further trouble as they look to avoid an immediate return to League One.\nWarne arrived at Derby in September 2022 with instructions to get the then rebuilding Rams – a club that had been brought out of administration just months earlier - promoted from the third tier.\nGetting them up last term added to his reputation as the 'King of League One' – which Derby's owner David Clowes had called Warne, who had guided Rotherham to promotion three times in five years before he took the Rams job.\nThis season, Warne's primary target is to do what he failed to in three attempts with Rotherham, which is to survive in the Championship.\nIn a hectic start to the game, James Abankwah was shown a yellow card inside the first 60 seconds of his Watford debut for a reckless tackle on Nathaniel Mendez-Laing, and Jerry Yates hit the side netting for the hosts before Louza gave the visitors a scruffy lead after just four minutes.\nBaah burst down the right and into the box to create the chance. His drilled pass was cleared by a defender and then pin-balled off a team-mate into the path of Louza to stroke home his first goal for Watford since August 2023.\nDerby hit the crossbar twice in quick succession as they searched for a first-half equaliser – Mendez-Laing being the first before Kayden Jackson sent an overhead kick the same way with his follow-up attempt.\nWatford goalkeeper Jonathan Bond denied Eiran Cashin and Mendez-Laing either side the break, before Ebou Adams struck the post for the hosts.\nMoussa Sissoko went on to hit the bar at the other end before helping create Watford's second, linking up with Vakoun Bayo and finding Kayembe, who coolly slid the ball home.\nMattie Pollock went on to have a third ruled out for offside soon after, while Jacob Widell Zetterstrom prevented Baah from making it an even more convincing end to Watford's four-match winless league run.\nDerby County head coach Paul Warne told BBC Radio Derby:\n\"I could hear the frustration at the final whistle [with fans booing]. I understand that. I'm a big boy.\n\"I didn't think we played that bad, to be fair. It's always about chances. You have to take your opportunities and I thought we had a really good opportunity in the first couple of minutes with Jerry - he hit the side netting and I'd normally expect him to score that.\n\"They then score up at our end and the game was then edgy for 10-15 minutes. We didn't look that good and looked a little nervous.\n\"I thought we had ascendancy in our play at the end of the first half. We created chances and didn't take them and hit the crossbar twice.\n\"At half-time we told the lads to be a little more aggressive. I just think we looked softer than normal and they had real threat.\n\"And the more you try push that goal, the more you are open to the counter-attack. They are a really athletic side that caused us no end of problems on the counter-attack and could have scored another couple.\"\nWatford boss Tom Cleverley told BBC Three Counties Radio:\n\"It was a fantastic away performance and it's the clean sheet element that really pleases me the most.\n\"I thought James Abankwah came in for his debut after training for two days and was fantastic. And the whole defensive unit really deserve that today, and especially Jonathan Bond.\n\"I saw a team that was really willing to sacrifice for the club and for each other. It was a real top performance.\n\"Everyone's together, through thick and thin, through the setbacks that we have had recently. That's in the past and everyone is fighting and sacrificing together – players, staff and fans.\n\"We are now only one point off fifth and it's starting to look up again.\"", "url": "https://www.bbc.com/sport/football/live/c1jgrnp0g3pt"}