{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:05", "date_modify": "2025-05-21 03:38:05", "date_publish": "2025-02-12 20:39:28", "description": "Olympic boxing champion Imane Khelif says she's \"not going anywhere\" after legal action was taken against the International Olympic Committee for allowing her to compete.", "filename": "sport_boxing_articles_cwypzj4x0e6o_1747798685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a6c7/live/0e260050-e97d-11ef-a2c1-a9d811cfe1cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cwypzj4x0e6o_1747798685.html", "title": "Imane Khelif: Boxer says she is 'not going anywhere' following legal action announcement", "title_page": "Imane Khelif: Boxer says she is 'not going anywhere' following legal action announcement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Olympic boxing champion Imane Khelif says she's \"not going anywhere\" after legal action was launched against the International Olympic Committee (IOC) for allowing her to compete.\nOn Monday, the International Boxing Association (IBA) said it had filed a complaint with the Swiss Attorney General citing safety concerns over gender eligibility.\nKhelif, who competed at the Tokyo 2020 Olympics and who is also a World Championship silver medallist, has always insisted she is eligible for the women's competition.\nIn a rare statement on social media, Khelif said the IBA had \"again made baseless accusations that are false and offensive\".\n\"For two years, I have taken the high road while my name and image have been used, unauthorised, to further personal and political agendas through the spreading and dissemination of baseless lies and misinformation,\" she added.\n\"But silence is no longer an option.\n\"I am not going anywhere. I will fight in the ring, I will fight in the courts and I will fight in the public eye until the truth is undeniable.\"", "url": "https://www.bbc.com/sport/boxing/articles/cwypzj4x0e6o"}