{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:59", "date_modify": "2025-05-20 14:06:59", "date_publish": "2023-07-30 15:30:31", "description": "French forward Allan Saint-Maximin leaves Newcastle United and joins Saudi Arabian side Al-Ahli on a four-year deal.", "filename": "sport_football_66355927_1747750019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C2E3/production/_130419894_gettyimages-1536264351.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66355927_1747750019.html", "title": "Allan Saint-Maximin: Winger leaves Newcastle for Saudi Arabian side Al-Ahli", "title_page": "Allan Saint-Maximin: Winger leaves Newcastle for Saudi Arabian side Al-Ahli - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Allan Saint-Maximin has left Newcastle United, joining Saudi Arabian side Al-Ahli for an undisclosed fee.\nThe French forward, 26, becomes the fourth high profile player to join the Saudi Arabian champions this summer.\nThey have also signed Riyad Mahrez, Roberto Firmino and Edouard Mendy from Premier League clubs.\nSaint-Maximin, who joined the Magpies from Nice in 2019 and scored 12 Premier League goals in 111 games, has signed a four-year deal.\nOn Saturday, Saint-Maximin confirmed he was leaving Newcastle with an emotional social media post, saying his \"greatest trophy\" was playing for the club.\n\"We pick the best, and he's one of them,\" Al-Ahli posted on messaging platform X, previously known as Twitter.\nAl-Ahli are run by Saudi Arabia's Public Investment Fund (PIF), which also owns Newcastle.\nReports have claimed rival Premier League clubs are concerned that Saint-Maximin's transfer fee, which has not been disclosed, could be inflated in order to help Newcastle comply with Financial Fair Play regulations.\nBut manager Howe has said the transfer to Saudi \"will satisfy the Premier League\", while the league's chief executive Richard Masters insists its rules are \"robust\".", "url": "https://www.bbc.com/sport/football/66355927"}