{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:48:43", "date_modify": "2025-05-20 12:48:43", "date_publish": "2023-08-03 06:08:14", "description": "With the 2023 series over, BBC Sport looks at the young players England and Australia could field in the upcoming Ashes series.", "filename": "sport_cricket_66337176_1747745323.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6CFE/production/_130620972_gettyimages-1489139068.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66337176_1747745323.html", "title": "The Ashes: England v Australia - youngsters who could play in upcoming series", "title_page": "The Ashes: England v Australia - youngsters who could play in upcoming series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With a thrilling Ashes contest over, the eyes of fans suddenly deprived of their fix of England-Australia action are already drifting to the next series when Ben Stokes' side will try to win back the urn.\nIn two-and-a-half years' time both sides could be very different, with England's bowling attack this summer - nicknamed Dad's Army - their oldest in 95 years.\nBBC Sport has picked out some young players that could feature in the 2025-26 series down under and, if not then, the next time Australia are in England in 2027.\nAge: 19 Role: Wicketkeeper-batter\nJames Rew is the name on everyone's lips.\nThe left-hander has already scored six County Championship centuries, equalling the record for most tons by a teenager in the competition.\nHe has scored five this year, including a brilliant 221 having come in at 41-4, and is the leading run-scorer in Division One so far in 2023 - as well as being Somerset's regular wicketkeeper.\nRew scored 95 in England's defeat by India in the 2022 Under-19 World Cup final, when he played alongside Rehan Ahmed.\nFormer England captain Alastair Cook: \"Rew is a phenomenal player with the statistics he's delivered.\n\"He doesn't fit the Ben Stokes mould of taking the game on. He is what you'd call a classical batsman. But he probably has more shots than he's shown.\"\nAge: 22 Role: Off-spinner\nSussex's Jack Carson is a bowler fancied by many in the know.\nThe tall off-spinner spent time around the England camp bowling under the eye of the coaches during the Ashes series.\nHe has taken 87 wickets in 32 first-class matches and impressed with the England Lions in Sri Lanka last winter - returning four-wicket hauls in both unofficial Tests.\nLeft-armer Jack Leach will only be 34 by the time of the next Ashes and 36 by the time the series returns to England in 2027, so he should be in contention with the younger generation for a while yet.\nDid you know? Carson took a wicket with his second ball in a first-class match and has dismissed Joe Root in county cricket.\nAge: 25 Role: Pace bowler\nGus Atkinson is another starting to be tipped for the top.\nThe seamer bowls at a lively pace across all formats for Surrey but has especially caught the eye with 20 wickets in five matches in the Championship.\nHe can count former England captain Cook as a fan, having dismissed the Essex opener this season.\nJosh Tongue, who took five wickets in the second Ashes Test, Durham pair Matthew Potts and Brydon Carse, plus Lancashire's Saqib Mahmood - if he can enjoy a consistent spell of fitness - are also likely to be in contention come the winter of 2025.\nJofra Archer will be 30 by the start of the next Ashes while Ollie Robinson will turn 32 during that series down under.\nCook: \"What surprised me about him is that you look at him bowl and feel there is a lot more in the tank.\n\"He doesn't look like he uses that much effort to get the ball down at a decent lick. Speaking to him, it looks easy but he is striving for as much pace as he can get. It looks like there is a bit more untapped pace.\"\nAge: 23 Role: Wicketkeeper-batter\nJamie Smith has been highly rated for a while yet is still only 23.\nEarlier this year he scored a 71-ball hundred for the Lions in Sri Lanka - the fastest century in the history of England's development side.\nAble to score quickly but with a solid technique, he looks made for 'Bazball'.\nThe right-hander is a regular for reigning champions Surrey and has scored eight centuries in 48 matches, including 234 against Gloucestershire last year.\nTMS commentator Daniel Norcross: \"Jamie Smith is a nailed-on certainty to be playing cricket for England in four years.\"\nAustralia are known for their production line of fast bowlers and the next could be Western Australia's Lance Morris.\nThe 25-year-old is regarded as the quickest bowler down under and could have featured in this year's Ashes but for a back injury.\nThere is also hope 26-year-old Jhye Richardson, who took five wickets against England in Adelaide during the 2021-22 Ashes, can overcome his injury issues and, although not as quick as Morris, Jordan Buckingham, 23, took a six-wicket haul for Australia A in New Zealand this year.\nThere are big hopes for 19-year-old top-order batter Teague Wyllie, who was named in the team of the tournament at the 2022 Under-19 World Cup and is already part of WA's Sheffield Shield-winning side.\nAnother Western Australian, Aaron Hardie, 24, is a seam-bowling all-rounder averaging 43 with the bat and 29 with the ball.\nFinally, keep an eye out for left-armer Spencer Johnson. He is 27 but has been making an impression of late, leading to comparisons with his namesake Mitchell. Johnson is playing in The Hundred this year for Oval Invincibles.", "url": "https://www.bbc.com/sport/cricket/66337176"}