{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:36:01", "date_modify": "2025-05-20 14:36:01", "date_publish": "2023-07-28 15:23:40", "description": "Zharnel Hughes, Keely Hodgkinson and Dina Asher-Smith are named in Great Britain's team for the World Athletics Championships in Budapest.", "filename": "sport_athletics_66341025_1747751761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7CDF/production/_130576913_gettyimages-1018083690.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66341025_1747751761.html", "title": "World Athletics Championships: Zharnel Hughes and Dina Asher-Smith named in GB team for Budapest", "title_page": "World Athletics Championships: Zharnel Hughes and Dina Asher-Smith named in GB team for Budapest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Zharnel Hughes, Keely Hodgkinson and Dina Asher-Smith have been named in Great Britain's team for the World Athletics Championships in Budapest.\nHughes is the fastest man in the world over 100m this year and is the new British record holder over that distance and 200m.\nThe 28-year-old ran 9.83 seconds in New York last month to break Linford Christie's 30-year 100m record.\nHe then ran the 200m in 19.73 in London on Sunday to surpass John Regis.\nHodgkinson will hope to go one better than her world silver in last year's 800m, while Asher-Smith is included for the women's 100m and 200m at the championships in Hungary, which begin on 19 August.\nFormer world champion Katarina Johnson-Thompson will continue her comeback in the heptathlon and Matthew Hudson-Smith will want to improve on last year's world 400m bronze in Eugene.\nJemma Reekie (800m), Laura Muir (1500m), Eilish McColgan (10,000m), Jazmin Sawyers (long jump), Morgan Lake (high jump), Max Burgin (800m) and Reece Prescod (100m) have also been included.\nWith 50 athletes already named, the full British team will be finalised when UK Athletics (UKA) receive world rankings invitations from World Athletics.\nHowever, some of those invitations will be rejected where athletes have not met UKA's qualification criteria.\nSome of the athletes who have not been selected are reportedly, external considering taking legal action against UKA.\nHurdlers Lina Nielsen and Josh Zeller, and shot putter Amelia Strickler have hit out at UKA's selection policy, with the latter telling the Mail newspaper she is \"disgusted\".\n\"By preventing us from going to a championships you are essentially denying us work, and that should be illegal,\" Strickler, who was also not selected for the 2019 World Championships and the 2020 Tokyo Olympics, told the Mail.\n\"It could fall under blockage of trade. This could cost people sponsorships. It's really disgusting.\n\"Something does need to be done to change this system because it is just hurting so many athletes.\"\nUK Athletics technical director Stephen Maguire defended the selection policy, saying it was \"very much based on a philosophy of challenging and ultimately winning medals\".\n\"The policy has been out for a while and, absolutely, when people don't make standards or whatever, there's probably a bit of emotion,\" he added.", "url": "https://www.bbc.com/sport/athletics/66341025"}