{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:34:35", "date_modify": "2025-05-20 11:34:35", "date_publish": "2023-08-07 12:10:43", "description": "Turnbull the star man in TOTW", "filename": "sport_articles_ceqw4eglpxyo_1747740875.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c21/live/359b9520-3518-11ee-bde6-7ffba94c56ae.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ceqw4eglpxyo_1747740875.html", "title": "Turnbull the star man in TOTW", "title_page": "Turnbull the star man in TOTW - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonathan Sutherland, BBC Sport Scotland\nDavid Turnbull \"has the crown\" - that was the line uttered by Celtic manager Brendan Rodgers when asked about what next for his star man on the opening day of the season.\nDid he simply mean he has ‘the crown’ ahead of Reo Hatete, who started the match on the bench? Or was it more a gentle reminder to Turnbull that he must keep producing consistently to fulfil his undoubted potential generally?\nTurnbull has always looked like a Rolls Royce of a player in the making. So why so few opportunities under Ange Postecoglou? Whatever the reason, the stage is set for him to play his part in the Celtic limelight this season.\nRodgers is clearly impressed by what he has seen so far from Turnbull in training and Saturday at Celtic Park will have heartened both manager and player. The challenge now is to see Turnbull perform at that level in every game he gets the opportunity. And the simple fact is the likes of Hatate will be waiting in the wings. There will undoubtedly be rotation and competition for places is clearly good for Celtic.\nCompetition in midfield for Scotland is also fierce - but imagine David Turnbull becomes a regular, serious contender in the mix? With the likes of Lewis Ferguson also waiting for his chance, suddenly the national team is bristling with an embarrassment of riches in the middle of the park.\nCould this be the season when David Turnbull’s star at Celtic truly shines?", "url": "https://www.bbc.com/sport/articles/ceqw4eglpxyo"}