{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:12", "date_modify": "2025-05-21 05:57:12", "date_publish": "2025-01-31 14:55:19", "description": "The opportunity to take up a new sport has been a \"breath of fresh air\" for a group of Dublin school children who will represent Ireland at the International NFL Flag Championships in Florida this weekend.", "filename": "sport_american-football_articles_c0jneed2p8eo_1747807032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a4b6/live/ee8e6d30-dfb9-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_c0jneed2p8eo_1747807032.html", "title": "NFL Pro Bowl: Ireland's first flag football team relishing Orlando experience", "title_page": "NFL Pro Bowl: Ireland's first flag football team relishing Orlando experience - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The opportunity to take up a new sport has been a \"breath of fresh air\" for a group of Dublin school children who will represent Ireland at the International NFL Flag Championships in Florida this weekend.\nThe pupils from Greenlanes National School secured their trip to Orlando courtesy of victory in a qualifying tournament in December and are one of 13 flag football teams who will spend this weekend rubbing shoulders with the elite of the National Football League at the annual Pro Bowl festivities.\nThe sport, which will be included in the Olympics at LA 2028, is played in more than 100 countries across the globe and is a non-contact version of American football which, instead of tackling, sees defenders pull a 'flag' from the waist of the attacking player in possession of the ball.\nAt Greenlanes, the sport has grown quickly from a few children tossing a ball back an forth in the schoolyard to representing Ireland in international competition.\n\"It all started with these guys who were throwing an American football in the yard. I was just thinking to myself that I'd never seen an American football thrown here before,\" explains their teacher and coach Ciaran Donnelly.\n\"I had the good fortune that they were coming into the class that I teach this year and the opportunity came about to get involved.\n\"The guys who were playing already really encouraged everyone to participate, a few others joined, and now it's become really popular. It's fantastic to see different sports being added to the yard.\"\nWhile some of the children involved were already playing the likes of soccer, rugby and Gaelic games, the NFL has really caught the imagination in the playground.\n\"Before we had American football, the only thing we really played at break was soccer,\" says Andrew Drummond, one of the team's wide receivers.\n\"So it's been like a breath of fresh air to play a new sport, or [one that is] new to us.\"\nCaitlyn Avery, a running back and wide receiver, admits her parents could not believe the trip to Orlando \"was actually going to happen\" and, indeed, that feeling was shared among some of the players.\n\"I really liked it when we started playing at break and then Mr Donnelly told us he was trying to get a team,\" says Arnie Copeland, the starting quarterback.\n\"I never thought I'd be playing for Ireland.\"\nAlthough most of the squad will move to secondary school later this year, many are keen to keep playing and there are plenty of younger children keen to emulate their success in the coming years.\n\"These guys are really interested in expanding the game. Some of the parents have been asking already when they go into secondary school will there be opportunities to engage in that,\" added Donnelly.\n\"These guys are really inspiring to the younger kids. When they won, we had a nice celebration with them walking through the hallways and even the younger kids who will be coming through Greenlanes, they'll all want to experience something like this.\n\"It's really great that these guys have shown them what's possible.\"", "url": "https://www.bbc.com/sport/american-football/articles/c0jneed2p8eo"}