{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 07:10:33", "date_modify": "2025-05-21 07:10:33", "date_publish": "2025-01-22 14:45:37", "description": "How tough is it to play against a close friend? 'Soulmates' Aryna Sabalenka and Paula Badosa will find out in their Australian Open semi-final on Thursday.", "filename": "sport_tennis_articles_cjw4q2d1ww1o_1747811433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7476/live/86768820-d890-11ef-a247-89fa5d4657be.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cjw4q2d1ww1o_1747811433.html", "title": "Australian Open 2025: Aryna Sabalenka and Paula Badosa to put friendship aside in semi-final showdown", "title_page": "Australian Open 2025: Aryna Sabalenka and Paula Badosa to put friendship aside in semi-final showdown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Seeing a friendly face is supposed to be a good thing.\nYet when Aryna Sabalenka and Paula Badosa take to the court for their Australian Open semi-final on Thursday, it may only add to the pressure.\nThe pair are close friends with Sabalenka going so far as to call Badosa her \"soulmate\" in Stuttgart last year.\n\"I love Paula very much,\" the 26-year-old Belarusian said.\n\"She is an incredible person. It is very important to have friends on the circuit, so when you find someone who you feel is your soulmate, it is the best thing that can happen to you.\"\nTheir friendship has grown over the past few years with the pair practising together and wearing matching outfits during the 2024 US Open, as well as posting about each other on social media.\n\"We realised that we had very similar personalities and we get along very well, and that we're both very, very competitive,\" Badosa told the Tennis Channel's Inside-In podcast, external in March.\n\"It's very nice for me having a friend on tour because it's very tough to find.\"\nBut with a place in the final at stake, that friendship will have to be put on hold in Melbourne.\nThis is not the first meeting between the two - they have played eight times before, with Sabalenka winning the past six - but it is comfortably the most high-profile.\nWorld number one Sabalenka is bidding to win a third straight Australian Open title, while it is 27-year-old Badosa's first time in the last four of a Grand Slam.\nThe Spaniard shocked sixth seed Coco Gauff in the quarter-finals as her remarkable recovery from a back injury, that she feared would force her to retire only a year ago, continues.\n\"It's tough to play your best friend,\" Sabalenka said after beating Badosa in Stuttgart.\nHowever, difficult as it may be, once they walk out on Rod Laver Arena, all sentiment will be put to one side.\n\"We know how to separate things,\" Badosa added.\n\"We decided a long time ago that off the court we are friends, while on the court she really wants to win, I really want to win,\" said Sabalenka, who beat Anastasia Pavlyuchenkova in the quarter-finals.\n\"So on the court we are competitors and there is no place for friendship.\"\nFive-time Grand Slam champion Iga Swiatek will take on American Madison Keys in Thursday's second semi-final.\nFor Polish second seed Swiatek, it is a chance to improve on a disappointing record at Melbourne Park with this just the second time she has progressed beyond the fourth round.\n\"This is something that I always wanted to improve,\" she said.\n\"It's not like I need to prove it to other people. It's more that I need to kind of believe. I feel I believe more now.\"\nBig-hitting Keys, seeded 19th, will provide a stern test for Swiatek, who has had issues against such players in the past.\nThe former world number one has won four of her five matches against Keys but three of those victories came on her favoured clay surface. On hard courts, they have won one match apiece.\nKeys, who has won her past 10 matches and triumphed at the Adelaide Open earlier this month, has a point to prove after coming up short at majors over the years.\nVictory over Swiatek would put the 29-year-old through to a second final - and her first since 2017 at the US Open.\n\"There have been periods of my career where it felt like if I didn't win [a Grand Slam], then I hadn't done enough, and I didn't live up to my potential in all of that,\" Keys said.\n\"That took a lot of the fun out of the game, and there were times where it felt paralysing out on the court because it felt as if I needed it to happen instead of giving myself the opportunity to go out and potentially do it.\"", "url": "https://www.bbc.com/sport/tennis/articles/cjw4q2d1ww1o"}