{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:40", "date_modify": "2025-05-19 15:13:40", "date_publish": "2015-03-08 19:39:34", "description": "The Willie Mullins-trained Faugheen spearheads eight declarations for Tuesday's Champion Hurdle.", "filename": "sport_horse-racing_31790424_1747667620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81493000/jpg/_81493641_rubywalsh_hurricane.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_horse-racing_31790424_1747667620.html", "title": "Cheltenham Festival: Faugheen leads Champion Hurdle field", "title_page": "Cheltenham Festival: Faugheen leads Champion Hurdle field - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Faugheen spearheads eight declarations for Tuesday's Champion Hurdle, the highlight on the first day of the Cheltenham Festival.\nRuby Walsh will ride the Willie Mullins-trained Faugheen, who has shone since moving from France to Ireland.\nWalsh also had the option of riding Mullins' record-breaking Hurricane Fly but Paul Townend gets that chance.\nWalsh guided Hurricane Fly to victory in 2011, external and 2013 but he was a disappointing fourth 12 months ago.\nTownend will ride the 11-year-old for the first time competitively since his 2011 Irish Champion Hurdle success.\nDespite beating last year's champion Jezki three times this season, there are questions about Hurricane Fly's ability, especially in the face of the unbeaten Faugheen who looked impressive in winning the Christmas Hurdle at Kempton on Boxing Day.\nBut Townend knows his mount faces a tough task at Prestbury Park on the opening afternoon of the four-day meeting.\n\"I suppose being realistic he's up against it. He's an 8-1 shot for a reason, but saying that he's been there, he's done it and he's in the form of his life at home,\" he said.\n\"I'm just hoping for a big run, he'll try his best and it would be nice to win a third Champion Hurdle.\n\"A lot of it is just natural ability, but it's his will to win as well. He has the heart of a lion and he can just run faster than the rest of them. If you see him in the morning you wouldn't think he was an 11-year-old.\"\nIreland has five of the eight runners with Mullins also sending Arctic Fire, who has twice been defeated by Hurricane Fly this term, while in addition to Jezki, owner JP McManus also has a second runner with the Edward O'Grady-trained Kitten Rock.\nThe New One, considered by many to have been unlucky not to have won the race last year when suffering severe interference in the fatal fall of Our Conor, is Britain's big hope and went unbeaten this winter.", "url": "https://www.bbc.com/sport/horse-racing/31790424"}