{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:49:26", "date_modify": "2025-05-20 13:49:26", "date_publish": "2023-07-31 12:11:48", "description": "Coaches at a youth sailing competition in Greece helped rescue more than 130 people from wildfires.", "filename": "sport_sailing_66361714_1747748966.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/466D/production/_130592081_tv086507687.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_sailing_66361714_1747748966.html", "title": "Mediterranean wildfires: Sailing coaches in Greece join rescue operation", "title_page": "Mediterranean wildfires: Sailing coaches in Greece join rescue operation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coaches at a youth sailing competition in Greece helped rescue more than 130 people from wildfires.\nThe coaches were part of the International Laser Class Association 4 Youth World Championships in Volos.\nAs racing concluded they joined a beach rescue operation across the bay in Nea Anchialos to evacuate residents and wildlife.\nAbout 60 boats helped to take people back to Volos. No sailors and coaches were injured.\n\"The selfless and quick reaction of the coaches was inspiring to see,\" said ILCA field operations officer Andrus Poksi.\nLabis Tsoukalas, president of the nautical club of Volos and Argonauts, said: \"We're very proud to have been able to contribute to the life-saving operation in the way we know best as sailors.\"\nMore than 40 people have died in Greece from wildfires, which continue on the islands of Rhodes, Corfu and Evia.\nExtreme heat has caused wildfires across Mediterranean coastlines and the sailing championships were paused until the heatwave subsided.\nAreas in central Greece have come under threat in the past week, with evacuation orders issued around Volos and Lamia.", "url": "https://www.bbc.com/sport/sailing/66361714"}