{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:36:58", "date_modify": "2025-05-20 14:36:58", "date_publish": "2023-07-28 14:30:43", "description": "Luton Town sign Ryan Giles from Wolves", "filename": "sport_articles_cne0j9dzn83o_1747751818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbce/live/69d44030-2d52-11ee-996c-d7735a7491c5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cne0j9dzn83o_1747751818.html", "title": "Luton Town sign Ryan Giles from Wolves", "title_page": "Luton Town sign Ryan Giles from Wolves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town have signed full-back Ryan Giles from Wolves for an undisclosed fee.\nThe 23-year-old, who had been with the West Midlands side since the age of eight, has represented seven clubs on loan, most recently at Championship side Middlesbrough last season.\nHaving played under Rob Edwards for the under-23s at Molineux and during a loan spell with Telford, Giles will be reunited with the manager who gave him his senior debut.\nThe deal includes a buy-back clause for Wolves.\nSpeaking to the Hatters' club website, Giles said: \"I've had a lot of loans and I feel those experiences have made me the player and the person I am today.\n\"Now this is a different direction, a new beginning, a new chapter.\n\"I'm grateful to Rob for giving me my first taste of men's football. The chance to work with him again, especially in the Premier League, is a fantastic opportunity.\n\"I thrive off creating chances and I can't wait to get to know my team-mates and get the fans off their seats.\n\"I'm really excited and want to hit the ground running.\"\nWolves sporting director Matt Hobbs said: \"He got the most of out of himself - and now he’s older, he understands the game more and has kicked on.\n“It’s a nice move for Gilo to go back to Rob, who knows him well, and knows how to get the best out of him.\n\"When he wasn’t going to be part of Julen's [Lopetegui] plans, it didn’t feel right to loan him again. It’s a good move for all parties.\"", "url": "https://www.bbc.com/sport/articles/cne0j9dzn83o"}