{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:35:17", "date_modify": "2025-05-20 12:35:17", "date_publish": "2023-08-04 09:00:01", "description": "'Rangers need smooth start after seismic change'", "filename": "sport_articles_cql4w7llykwo_1747744517.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88d2/live/373e3380-32a5-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cql4w7llykwo_1747744517.html", "title": "'Rangers need smooth start after seismic change'", "title_page": "'Rangers need smooth start after seismic change' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers can’t afford a slow start to the season despite their new-look team playing together for the first time after a “seismic” summer of change.\nThat’s the view of Rangers Review writer Joshua Barrie, who says there is a lot of “anticipation” about Michael Beale’s squad rebuild.\n“The amount of change that’s happened on the park this summer has been seismic,” Barrie told the Rangers season preview episode of BBC’s Scottish football podcast.\n“How many clubs have signed nine players, most of which are designated to be starters?\n“There’s a lot of unknown and the team that lines up against Kilmarnock, that starting XI probably wouldn’t have played together and I don’t think you will see the best of this Rangers team early on because they’ll still be getting to know one another. That’s exciting in a sense.\n“The task for Beale is to start well and get the results while still getting up to peak performance, this first month is so significant in the course of the season.”\nRangers’ defence has been largely untouched amid the rebuild, with Leon Balogun’s return making him the only new addition in that area so far.\n“You’d struggle to find anyone in the Rangers support who doesn’t think they need to strengthen at the back,” added Barrie.\n“The defence is the only area that doesn’t scream evolution yet. If you look at the profile of defenders Beale has there, he probably needs someone on the left side who will give something a bit different, be able to step in and be aggressive in the midfield.”", "url": "https://www.bbc.com/sport/articles/cql4w7llykwo"}