{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:53:07", "date_modify": "2025-05-21 07:53:07", "date_publish": "2025-05-18 07:40:12", "description": "Celtic manager set for talks about future with major shareholder as Hearts forward seeks quick resolution.", "filename": "sport_football_articles_cnv1z4m7j07o_1747813987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5cfe/live/d0a38be0-33bd-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cnv1z4m7j07o_1747813987.html", "title": "Celtic's Rodgers plans Desmond talks - gossip", "title_page": "Celtic's Rodgers plans Desmond talks - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic manager Brendan Rodgers is to hold talks over his future with major shareholder Dermot Desmond. (Sun), external\nRodgers indicates Celtic are ready to strengthen when the summer transfer window opens. (Glasgow Times), external\nMeanwhile, the Celtic manager expects winger James Forrest, 33, to play a big role next term. (Scotsman - subscription required), external\nBrian Irvine, who scored Aberdeen's winning penalty in their 1990 Scottish Cup final over Celtic, will turn 60 on Saturday when the sides meet again in this season's final - and is unsure whether he will attend the game or watch at home. (Record), external\nIrvine reveals he was \"never confident\" with penalties prior to his famous spot-kick. (Herald - subscription required), external\nMotherwell midfielder Andy Halliday's wife is due to give birth to their first child as the Scottish Premiership club prepare for their final game of the season at Ross County. (Sun), external\nScotland forward Lawrence Shankland, 29, wants his future decided quickly as he plans discussions with expected new Hearts manager Derek McInnes. (Record), external\nMcInnes' input will be a key factor in Shankland's decision. (Edinburgh Evening News - subscription required), external\nScotland internationals Oli McBurnie and Scott McKenna could leave Las Palmas following their relegation from La Liga. (Scotsman - subscription required), external\nCopyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "url": "https://www.bbc.com/sport/football/articles/cnv1z4m7j07o"}