{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:59", "date_modify": "2025-05-21 07:45:59", "date_publish": "2025-03-28 08:21:28", "description": "Rory McIlroy is five shots off the lead after what he describes as a 'pedestrian' first round at the Houston Open.", "filename": "sport_golf_articles_c20405e4p6lo_1747813559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2b1/live/978fdd70-0ba6-11f0-9344-957e0d9fa61c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c20405e4p6lo_1747813559.html", "title": "Houston Open: Rory McIlroy five shots off lead after 'pedestrian' start", "title_page": "Houston Open: Rory McIlroy five shots off lead after 'pedestrian' start - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Houston Open first round leaderboard\n-5 A Tosti (Arg), R Gerard (US), K Mitchell (US), T Pendrith (Can); -4 T Mullinax (US), M Meissner (US), MW Lee (Aus), S Ryder (US), V Perez (Fra), R Hojgaard (Den), E Cole (US), J Suber (US)\nSelected others: -3 S Scheffler (US), -2 H Hall (Eng), -1 D Willett (Eng), R Fowler (US), E R McIlroy (NI)\nNorthern Ireland's Rory McIlroy blamed a \"pedestrian\" start as he finished five shots off the lead after the first round of the Houston Open in Texas.\nThe world number two carded an opening-round 70, hitting two birdies and two bogeys at the Memorial Park course to leave him five strokes off early joint-leaders Keith Mitchell, Taylor Pendrith, Alejandro Tosti and Ryan Gerard.\nMcIlroy, who is hoping to complete a career Grand Slam by winning the Masters next month, opted to play in Houston for the first time since 2014 in preparation for Augusta.\n\"A little pedestrian I guess is a good way to describe it,\" McIlroy said.\n\"Made a few par saves early on that I needed to and then had quite a few chances on the second nine there that I didn't convert.\n\"Yeah, sort of tale of two halves. I felt like I was scrambling for the most part on the first nine and then I feel like I left a couple out there on the last nine.\"\nRain and wind made conditions difficult on the course while darkness forced play to be suspended at 7.28pm local time with a number of players unable to finish their round.", "url": "https://www.bbc.com/sport/golf/articles/c20405e4p6lo"}