{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:06:03", "date_modify": "2025-04-26 08:06:03", "date_publish": "2025-02-26 15:14:04", "description": "Boss Nigel Clough likens attempts to halt Mansfield Town's poor form to trying to stop \"a runaway train\".", "filename": "sport_football_articles_c234n51j7k8o_1745654763.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/281f/live/433c0200-f44d-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c234n51j7k8o_1745654763.html", "title": "Mansfield Town: Nigel Clough", "title_page": "Mansfield Town: Nigel Clough - halting poor form is like stopping 'runaway train' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Boss Nigel Clough has likened attempts to halt Mansfield Town's poor form to trying to stop \"a runaway train\".\nThe League One side have lost nine of their past 10 matches across all competitions, with only a solitary point picked up in the past six weeks.\nIt is a wretched run that has dropped them to 16th in the table and to within six points of the relegation places with 14 matches remaining.\n\"It's difficult to stop once you get into this,\" Clough told BBC Radio Nottingham. \"It's like a runaway train.\"\nThe Stags travel to Burton Albion on Saturday for a game of considerable significance down the bottom of League One, with Clough having spent 16 years as player and then manager, over two spells at Pirelli Stadium.\nHe has previously said Mansfield find themselves in the relegation battle he always expected them to face on their return to the third tier after a 21-year absence.\nThe pattern of results his side has produced, however, has been more of a surprise.\nFive successive wins - their best run of results in the third tier since 1976 - had them flying high in third spot in October.\nA seven-match winless run that included five defeats followed, only for the Stags to return to form with four wins in five across December and January before hitting the slump they find themselves in now.\nClough, a former England forward who played for Nottingham Forest, Liverpool and Manchester City, said it all shows how \"fragile\" form can be.\nAnd he points at the struggles of his former club Manchester City under Pep Guardiola as a prime example.\nCity, the defending Premier League champions, are fifth in the top flight and 20 points adrift of leaders Liverpool.\n\"Man City are fragile at the moment and have been all season,\" Clough said. \"The best manager in the world, with some of the best players in the world, is struggling to stop that fragility.\n\"It's very difficult to reverse it.\"\nClough simply says his side \"have to keep working\" towards a change of fortunes and adds that keeping a clean sheet - something Mansfield have failed to do for two months - is something they are \"absolutely desperate for\".\n\"We will keep going with the same principles, because everything we were doing early in the season we are still doing,\" he said.\n\"Its wasn't wrong what we were doing then, and it's not wrong now. Everyone has just got to give a little bit more and try get a break more than anything.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c234n51j7k8o"}