{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-19 15:20:36", "date_modify": "2025-05-19 15:20:36", "date_publish": "2015-02-06 12:57:11", "description": "Daley Blind rescues a point for Manchester United with a 93rd-minute equaliser against West Ham at Upton Park.", "filename": "sport_football_31079343_1747668036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80871000/jpg/_80871042_blind_index_afp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31079343_1747668036.html", "title": "West Ham United 1-1 Manchester United", "title_page": "West Ham United 1-1 Manchester United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daley Blind rescued a point for Manchester United with a 93rd-minute equaliser after Cheikhou Kouyate's sublime volley put West Ham ahead.\nKouyate juggled the ball twice, swivelled, and volleyed in, after Mark Noble's free-kick dropped in his path.\nUnited looked to be running out of time when Blind volleyed home from 16 yards after Angel Di Maria's cross.\nThe visitors finished with 10 men, defender Luke Shaw sent off for a second yellow card.\nWest Ham, who remain eighth in the table, have not beaten United since 2007, external and they will feel they allowed a great opportunity to end that run slip.\nThe Hammers were on top from the early stages - hustling in defence and attacking with pace.\nIn contrast, United lacked creativity and were too easily dispossessed at Upton Park before Blind's dramatic late comeback stretched their unbeaten Premier League away record to seven games.\nDavid De Gea rescued the visitors three times in the opening half an hour, twice keeping out Enner Valencia - one a 25-yard drive and the other an acrobatic close range volley - before James Tomkins was denied by the Spaniard's right foot.\nUnited omitted Juan Mata yet their midfield struggled to carve out chances.\nNoble went close to doubling the Hammers' lead before United came strong in the closing stages.\nFalcao looked certain to equalise in the 77th minute after combining with van Persie, but the Colombia forward stabbed wide from close range.\nVan Persie was then denied by Adrian's right leg before the Hammers keeper scrambled across his line to keep out Marouane Fellaini in a frantic finish.\nIt looked to be enough for the hosts - but there was still time for Blind to volley home after West Ham had failed to clear a ball into the area.\nA dramatic finish was concluded when United were reduced to 10 men following a second bookable offence for Shaw.\nWest Ham manager Sam Allardyce: \"We have to give the players credit for how well they defended as well as how well they played in possession, which was almost the perfect performance.\n\"It's not a result we deserved or wanted, but we're back to a level that we know we can play at.\n\"It was just a great shame we conceded a goal as late as we did, which wasn't the normal goal you concede against Manchester United.\"", "url": "https://www.bbc.com/sport/football/31079343"}