{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:33:39", "date_modify": "2025-05-20 14:33:39", "date_publish": "2023-07-28 19:09:09", "description": "Manchester United reject a £20m bid from West Ham for their England defender Harry Maguire.", "filename": "sport_football_66343671_1747751619.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3775/production/_130579141_gettyimages-1573177271.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66343671_1747751619.html", "title": "Harry Maguire: Manchester United reject £20m West Ham bid for England defender", "title_page": "Harry Maguire: Manchester United reject £20m West Ham bid for England defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have rejected a £20m bid from West Ham for England defender Harry Maguire.\nHammers boss David Moyes is keen on Maguire and has funds to spend following the £100m sale of England midfielder Declan Rice.\nMaguire's Old Trafford future is uncertain after he was stripped of the captaincy by Erik ten Hag earlier this month.\nThe Dutchman has said the move could help the 30-year-old regain his form.\nUnited would be prepared to listen to offers that matched their valuation - if Maguire indicated a willingness to leave.\nHowever, the centre-back is believed to currently be earning £200,000-a-week at Old Trafford, which is significantly more than the highest earner at West Ham.\nMaguire was appointed skipper by Ten Hag's predecessor Ole Gunnar Solskjaer in January 2020 - five months after signing for £80m from Leicester City.\nThe England international, who has 57 international caps, said he was \"extremely disappointed\" to lose the armband but would \"continue to give my all\" in the shirt.\nMaguire played in 31 of the club's 62 matches in all competitions during the 2022-23 season, including eight Premier League starts, with Portuguese midfielder Bruno Fernandes captain in his absence.\nMaguire's contract at Old Trafford ends in 2025.\nRaphael Varane and Lisandro Martinez were favoured over him at the heart of United's defence last season, and when the latter was injured, Victor Lindelof deputised.\nEngland left-back Luke Shaw was also deployed at centre-back on several occasions by Ten Hag.\nManchester United are interested in Fiorentina's Morocco midfielder Sofyan Amrabat but a deal almost certainly hinges on the revenue they can generate through player sales.\nDespite talk in Italy that a deal is close, BBC Sport understands that is not the case.\nThere has been communication, as there has around a number of midfielders.\nBut the current priority is Atalanta's Danish striker Rasmus Hojlund, 21, and Financial Fair Play restrictions make further signings difficult without raising the funds.\nSo far this summer, United have sold striker Anthony Elanga to Nottingham Forest in a deal that could be worth £20m and Alex Telles, who has joined Saudi Pro League side Al Nassr.\nIn addition, youngsters Zidane Iqbal and Charlie Savage have gone to Belgian side Royal Antwerp and Reading respectively, although the true value of those transfers comes through the sell-on clauses, as is the case with Ethan Laird, who has joined Birmingham.\nIt is understood United received almost £1m from Birmingham as part of the deal that saw winger Tahith Chong join Luton this summer.\nAmrabat impressed for club and country last season.\nThe 26-year-old played every minute in Morocco's surprising run to the World Cup semi-finals in Qatar.\nThen he was an influential figure in Fiorentina's charge to the Europa Conference League final, where they were beaten by West Ham.\nMeanwhile, 18-year-old midfielder Kobbie Mainoo has been ruled out of the first part of the new season after picking up an ankle injury in Thursday's 2-0 defeat against Real Madrid in Houston.\nThe academy graduate, who made his senior debut in January and was named the club's Young Player of the Year, has impressed during United's pre-season campaign.", "url": "https://www.bbc.com/sport/football/66343671"}