{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:13", "date_modify": "2025-05-19 14:40:13", "date_publish": "2017-08-04 12:06:56", "description": "The BBC will continue to broadcast live radio coverage of the Ashes after renewing its partnership with Cricket Australia.", "filename": "sport_cricket_40826613_1747665613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7E68/production/_97206323_englandashes.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40826613_1747665613.html", "title": "The Ashes: BBC extends radio rights deal for cricket in Australia", "title_page": "The Ashes: BBC extends radio rights deal for cricket in Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The BBC will continue to broadcast live radio coverage of the Ashes, including the Women's Ashes, after renewing its partnership with Cricket Australia.\nThe new five-year agreement includes Test Match Special coverage of this winter's five-Test men's tour down under, which starts in November.\nThe women's teams will meet in a multi-format series, including the first women's day-night Test in October.\nTMS will also broadcast England's home Ashes series in the summer of 2019.\nThe deal between the BBC and Cricket Australia grants exclusive UK radio rights for all international women's and men's cricket in Australia, and non-exclusive rights for the Big Bash League and Women's Big Bash League Twenty20 competitions, up to the 2021-22 season.\nBen Gallop, head of BBC Radio Sport and Digital, said: \"We're thrilled BBC radio will once again be the home of the Ashes in Australia for the next five years, and that we'll also be covering some of the other great cricket competitions taking place in Australia over this period.\n\"This deal is a brilliant way to mark the 60th anniversary of Test Match Special, which remains one of the most-treasured programmes on the BBC.\"\nCricket Australia's Ben Amarfio added: \"The BBC's cricket coverage has long been an integral part of the sport in the UK, and this agreement will mean more people will be able to enjoy the scintillating cricket action this Australian summer and for the next five years.\"\nThis winter's series will go ahead after the ongoing pay dispute between Australia's players and Cricket Australia was resolved.\nFormer captain Alastair Cook led England's men to a 3-2 victory in the 2015 home series, regaining the Ashes after 5-0 whitewash during the 2013-14 tour to Australia.\nEngland and Australia have won 32 series apiece, with five drawn.", "url": "https://www.bbc.com/sport/cricket/40826613"}