{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 11:42:20", "date_modify": "2025-05-20 11:42:20", "date_publish": "2023-08-06 16:19:15", "description": "England face Nigeria in the last 16 of the Women's World Cup with momentum on their side but must avoid complacency, says manager Sarina Wiegman.", "filename": "sport_football_66416443_1747741340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B637/production/_130674664_wwc-index-reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66416443_1747741340.html", "title": "Women's World Cup: England wary of complacency in last-16 tie with Nigeria", "title_page": "Women's World Cup: England wary of complacency in last-16 tie with Nigeria - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England put in a strong performance to finish off the Women's World Cup group stage and have good momentum going into their last-16 tie with Nigeria - but they cannot be complacent.\nThat was the message from manager Sarina Wiegman, who does not want her side to suffer an early exit and follow in the footsteps of top-ranked nations the USA, Germany, Canada and Brazil.\nNigeria, 11-time African champions, are ranked 36 places lower than England and have never gone further than the quarter-final stage at the Women's World Cup.\nMeanwhile England won Euro 2022 last summer and are favourites to win the tournament in Australia and New Zealand, but first must negotiate Monday's game in Brisbane (08:30 BST kick-off).\n\"What we have seen in this tournament is that nothing is easy,\" said Wiegman. \"The growth of the game has shown in this tournament.\n\"We've not had an easy game at all and that's what we expect [on Monday], that it will be very competitive and we need to be at our best.\"\nWiegman said it was \"inappropriate\" for her side to be complacent but hopes they can cause Nigeria problems after showing their attacking prowess in a brilliant 6-1 thrashing of China last week.\nEngland have reached the semi-finals in back-to-back Women's World Cups and last failed to reach the quarter-finals in 2003 when they did not qualify for the tournament.\nThe Lionesses could also be boosted by the return of instrumental midfielder Keira Walsh, who was in team training on Sunday at Central Coast Stadium.\n\"Everyone who plays us wants to beat us. That's nothing new,\" added Wiegman. \"The games have been very competitive. Nobody can be complacent because that's inappropriate.\n\"I think Nigeria have done really well in this tournament and were in a very hard group. We all saw they did very well.\n\"They are an athletic team, quick in the transition and also want to play. We are aware of their strengths. What we will try to do is exploit their weaknesses.\"\nWiegman said England now have two formation options they could use against Nigeria after the selection of a back three against China was so effective.\nChelsea's Lauren James was a standout performer in that 6-1 win, scoring two goals and assisting three, and is now England's top scorer at the tournament having also netted in their 1-0 victory over Denmark.\nNigeria, ranked 40th in the world, finished second in their group and are unbeaten in the tournament having kept two clean sheets.\nBarcelona forward Asisat Oshoala is yet to play 90 minutes as she returns to full fitness following injury, but she came off the bench to score Nigeria's winner against Australia and is available.\nShe could play a key role for Randy Waldrum's side, who came through a group with Olympic champions Canada, co-hosts Australia and debutants the Republic of Ireland.\n\"Already with what we've accomplished, Nigeria is buzzing,\" said Waldrum. \"I don't think people expected us to get out of the group with the results we got.\n\"We [knocked out] the Olympic gold medallists and if we beat the European champions it would be something extremely special back home. It could be transformational in a lot of different ways.\"\nWaldrum said Wiegman had done \"great things\" since taking over the Lionesses but insisted there was \"a lot of talent\" in African football so England must be wary.\nNigeria, who are the third-lowest ranked nation left in the competition, are seeking to become the first African team to win a knockout match at the Women's World Cup.\nFormer England goalkeeper Rachel Brown-Finnis is predicting the outcome of all 64 games in Australia and New Zealand:\nThe way this World Cup has gone appears to have opened up an easier path to the semi-finals than England probably expected. Germany and Brazil are out, so the winner of this tie will play Colombia or Jamaica next.\nIt would be foolish to think that far ahead, though, because they have to get past Nigeria first and they are going to be very hard to score against. They can't take anything for granted.\nNigeria will concede possession, so England will see a lot of the ball like they did against China, but Nigeria are stronger at the back and the Lionesses will have to be careful of their threat on the break.\nEngland have played against plenty of teams like this before, though, and they will be ready.\nThe Lionesses have got so many attacking options now, and I feel like they will have the tools and the tactics to break Nigeria down.\nBrown-Finnis' prediction: 2-0", "url": "https://www.bbc.com/sport/football/66416443"}