{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:58", "date_modify": "2025-05-21 04:53:58", "date_publish": "2025-01-23 11:58:18", "description": "Fans' views on what Millwall need to do in the remaining days in the January transfer window.", "filename": "sport_football_articles_cy8xnz5r2mgo_1747803238.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80c4/live/8cb90b00-d96b-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8xnz5r2mgo_1747803238.html", "title": "What do Millwall need in the January transfer window? Fans have their say", "title_page": "What do Millwall need in the January transfer window? Fans have their say - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As well as talking all things Ra'ees Bangura-Williams and if he is up to the task of replacing Romain Esse, some of you were also keen to share your views on the areas Millwall might need to address in the transfer window.\nHere are some of the responses:\nBill: The Lions are badly in need of a number 10 playmaker and another midfielder to help hold the ball and retain possession. The current midfield set-up worryingly looks too much like League One.\nBernie: New left-back, central midfielder and striker who can score 15+ goals a season.\nA clear-out of some of the players - [Joe] Bryan, [Billy] Mitchell, [George] Saville, [George] Honeyman and Murray Wallace.\nDamian: Our two right-backs both went off injured in the space of five minutes during the match against Cardiff, so I would like to see us sign another right-back.\nTony: I think we've got enough strikers at the club but we're not giving them the service to score.\nWhat we really need is a goalscoring creative number 10. We have missed Zian Flemming.\nI understand the rationale behind selling players at a profit, but it's counterproductive if it means we struggle and end up in a relegation fight.\nGet rid of some of the older players and use more of the youth team players who are the future.", "url": "https://www.bbc.com/sport/football/articles/cy8xnz5r2mgo"}