{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:45:23", "date_modify": "2025-05-19 14:45:23", "date_publish": "2017-07-05 08:57:54", "description": "Welsh walker Bethan Davies is celebrating qualifying for the World Championships in London and setting three personal bests.", "filename": "sport_wales_40496592_1747665923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/549C/production/_96806612_gettyimages-806760916.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_wales_40496592_1747665923.html", "title": "Athletics: Welsh walker Bethan Davies set for world stage", "title_page": "Athletics: Welsh walker Bethan Davies set for world stage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh walker Bethan Davies says the hard work has paid off after qualifying for the World Championships in London and setting new three personal bests in a week.\nDavies, 26, followed up sealing her World Championship place in the 20km by setting two new British bests in the mile and 5km event.\nThe Cardiff walker won the 5km at the British Championships in Birmingham.\n\"It's been a very good week, all the hard work has paid off,\" said Davies.\nDavies competed in three events in seven days which began with achieving the London 2017 qualification time when she finished in a Welsh record 93:04 behind Gemma Bridge.\nDavies will be joined by Bridge and Tom Bosworth and Callum Wilkinson at the World Championships next month in London (August 4-13).\n\"It is unbelievable,\" said Davies.\n\"I probably when I was younger never expected to get to this level of sport.\n\"It hasn't sunk in yet and when I get there I will probably have to take a few moments.\n\"It's absolutely fantastic to be on the same stage as such big names.\n\"This will be the biggest competition I have ever been to and it will be a big step up.\"", "url": "https://www.bbc.com/sport/wales/40496592"}