{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:24:43", "date_modify": "2025-04-26 04:24:43", "date_publish": "2025-03-03 12:34:01", "description": "Rangers fans share verdicts on Barry Ferguson's start as Rangers interim manager - plus fallout from the Edinburgh derby.", "filename": "sport_football_articles_c4g9272wvjeo_1745641483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c24d/live/bc3bdc20-f826-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g9272wvjeo_1745641483.html", "title": "Barry Ferguson at Rangers and Hibs v Hearts derby analysis", "title_page": "Barry Ferguson at Rangers and Hibs v Hearts derby analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Was this the shortest honeymoon on record?\nFormer captain Barry Ferguson returned to Ibrox to fill the seat vacated by Philippe Clement and began with a stirring victory against Kilmarnock.\nThree days later, a home defeat against Motherwell already has the Rangers support split over Ferguson the manager.\nThat was one of the hot topics on our club pages after the weekend's action - but of course Hibernian and Heart of Midlothian fans were vocal too after the derby.\nHere is a taste of fan reaction after the Scottish Premiership action...\nTwo games in, the case for Ferguson...\nPaul: The end of the season can't come quick enough to clear out this underperforming Rangers team and start afresh. Give the managerial position to Barry Ferguson full-time, then we will see a team of proven fighters, diehards and winners, with the manager setting the standards from his own successful playing career at the club.\nJim: We just are not good enough... the players look frightened out there. They don't like it when the crowd gets to them. Confidence is shot. The list goes on and on. Break this team up.\nIan: Pep Guardiola or Alex Ferguson couldn't get a tune out of these players. Spineless and lack physicality all over the park. Players are not interested and show no intensity. Poor recruitment to blame. The squad has only three or four players worth keeping. God knows what Barry does with this lot.\nRuaridh: I had hoped the fight shown at Kilmarnock would still be in evidence. Sadly not though. Still toothless in attack and rocky in defence. In fairness to Barry Ferguson though, I'm sure that even a top manager would struggle to get any consistency from the current squad. We're just limping to the close season for yet more upheaval.\nLennie: Absolutely disgraceful performance again. If we play Tavernier and Propper on Thursday night against Fenerbahce, we will get hammered. Hagi was awful. We send out young Leon King on loan - he is a better player than those that played in the defence. Barry Ferguson is not a magician. Give youth a chance now, our season is over anyway.\nAnd the early case against the interim manager...\nAlistair: How did the decision to appoint an unproven stand-in manager get made? No track record of success. No stand-up good example for the players either. Barry and [Allan] McGregor blotted their copybooks on Scotland duty. Is this what we want the fans and team to look up to and respect? So wrong.\nAnonymous: Ferguson joins on Monday, interviews and press conferences every day, parading around Ibrox taking selfies, appoints his pals as coaches, but every interview he keeps on telling us, 'it's not about me, it's the team'. Gurns on the sidelines for 90 minutes then tells us they're good players. Never a manager, taking us backwards, get him binned now!\nWilliam: We're in utter limbo, the idea the so-called management team will still be here in August is laughable...\nAnonymous: No matter how good a player Barry was, he is not managerial material. Get rid of the old guard who do not have a clue.\nRab: Dreadful performance, no visible change of tactics or approach from the previous managerial regime. The team lacked the ability to deal with a simple high press employed by Motherwell. Nothing came from the coaching team, some of whom were critical of the previous manager, to counter this.\nFor Hearts fans, the derby defeat was a setback in an otherwise solid run of form and they are generally not panicking...\nPaul: All that textbook football, making three or four passes to go nowhere. That counts for nothing in the white-hot heat of a derby match. More grit, determination, passion is what's required.\nJim: As a lifelong Hearts fan I have to say Hibs deserved their win. We did not show the hunger and commitment Hibs had in abundance. We still have a 'back four' problem and are missing [Cammy] Devlin in midfield. I am not overly concerned about the team overall, taking into account our start to the season though. Inconsistency is our biggest concern - and players' passion.\nChris: Hibs just showed how frail we are at the back, something we all knew. No leaders and zero composure, we played the occasion not the game. Rookie stuff. Par for what has been a mediocre season. Got what we deserved playing like that - nothing.\nStewart: Disappointing but not a surprise. Decent first half but poor in the second. Kabangu was outmuscled and offside all day. Very poor. Priority in the summer is a dependable right-back in the mould of Michael Smith. Critchley has not won a big game yet. That's a concerning stat he needs to address. The late subs were desperate. Lost all shape.", "url": "https://www.bbc.co.uk/sport/football/articles/c4g9272wvjeo"}