{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:07:30", "date_modify": "2025-04-26 08:07:30", "date_publish": "2025-02-26 14:14:03", "description": "'We live and breathe this club' - Gordons committed to Hibs long term", "filename": "sport_articles_cx2gjd4r8ylo_1745654850.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/991b/live/9c3195e0-f449-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx2gjd4r8ylo_1745654850.html", "title": "'We live and breathe this club' - Gordons committed to Hibs long term", "title_page": "'We live and breathe this club' - Gordons committed to Hibs long term - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hibernian executive director Ian Gordon says his family's emotional connection to the club means they are financially committed for the long haul.\nAt the club's agm on Tuesday, Gordon told around 200 shareholders his family will absorb Hibs' £7.2m losses this year.\nIan's father Ron became Hibs' majority shareholder in 2019 and although he died in 2023, the Gordon family remain owners with Ian and mother Kit on the board.\n\"I think there's such an emotional side to it now,\" Ian said. \"Our family, we love this club. We live and breathe this club and my father felt that same way.\n\"And obviously through the passing of my dad, we felt that it was the right thing to do to continue this.\n\"I'm still a young guy, and my brother and I are wanting to carry the torch for my father. We love everything about this club and my mom, so it's something we're fully committed to.\"\nIan says the Gordon family's experience along with advice from Bournemouth owner Bill Foley and his Black Knight consortium - who invested in the club in March 2024 - will help them better manage finances moving forward.\nBlack Knight director Tim Bezbatchenko was alongside Gordon at the AGM.\n\"We know mistakes have been made,\" Gordon said.\n\"But we've learned so many lessons along that way, with the guidance of someone like Tim (from Black Knight) to help mentor me, but also help us make better decisions moving forward. I think we're in a really good spot.\"", "url": "https://www.bbc.co.uk/sport/articles/cx2gjd4r8ylo"}