{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:43:42", "date_modify": "2025-05-20 12:43:42", "date_publish": "2023-08-03 15:04:34", "description": "British Triathlon are looking into reports triathletes have fallen ill following the World Triathlon Championship Series in Sunderland.", "filename": "sport_triathlon_66393967_1747745022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9CF7/production/_130638104_564b578147047d8dfb66c0ba11c3d3efc87e5a91.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_triathlon_66393967_1747745022.html", "title": "World Triathlon Championship Series: Triathletes report illness following event in Sunderland", "title_page": "World Triathlon Championship Series: Triathletes report illness following event in Sunderland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Health chiefs are investigating after triathletes reported falling ill following the World Triathlon Championship Series in Sunderland.\nConcerns were raised around water quality results for a test taken on 26 July by the Environment Agency, which showed high levels of E.coli.\nBritish Triathlon said the water tested was outside the event's swim area.\nAustralian Jake Birtwhistle wrote on Instagram, external he was \"feeling pretty rubbish since the race\".\nThe 28-year-old posted a picture of a graph showing the E.coli level for Roker Beach in Sunderland for the end of July and added: \"The swim should have been cancelled.\"\nBritish Triathlon says it is working with Sunderland City Council and the UK Health Security Agency (UKHSA) North East to gather more information.\nAs well as staging the World Triathlon Series elite races, some 2,000 competitors took part in a series of combined swimming, cycling and running events across the weekend.\n\"We are aware there are concerns around water quality results for a test taken on 26 July by the Environment Agency as part of their regular testing in the local area,\" British Triathlon said.\n\"These tests were taken outside of the Roker Pier arms and not in the body of water used for the swim and published on Monday 31 July following the event.\n\"Whilst the cause of this illness is being investigated by the relevant authorities, anyone who is or who has been feeling unwell is encouraged to view the online resources.\"\nBritish Triathlon said it conducted its own tests in accordance with World Triathlon guidelines before and after the event, both of which were taken within the Roker Pier arms where the swim leg was held, and the results were deemed acceptable.\nIt is the first time Sunderland has hosted the UK leg of the World Triathlon Championship Series, which drew huge crowds to the north-east of England.\nAccording to government guidelines, external, open water swimming can increase the risk of stomach bugs and more severe infections caused by micro-organisms such as E.coli.\n\"Participants who have already reported illness to British Triathlon are being contacted by UKHSA North East to support their investigations,\" British Triathlon added.\nThe UKHSA said they did not know how many athletes had been affected but urged anyone who had felt ill since the event to come forward.\n\"Organisers of the event have written to all participants to ensure they are aware and to advise anyone with symptoms to seek medical advice. The risk to the wider public is very low,\" a UKHSA statement said.", "url": "https://www.bbc.com/sport/triathlon/66393967"}