{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:33:10", "date_modify": "2025-05-20 14:33:10", "date_publish": "2023-07-28 18:39:50", "description": "Michael Dunlop wins the opening Supersport race at the Armoy road races, smashing the lap record for the class in the process.", "filename": "sport_northern-ireland_66343633_1747751590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14A26/production/_130581548_michaeldunlop3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_northern-ireland_66343633_1747751590.html", "title": "Armoy road races: Michael Dunlop smashes lap record on way to Supersport win", "title_page": "Armoy road races: Michael Dunlop smashes lap record on way to Supersport win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Dunlop won the opening Supersport event at the Armoy road races, setting a new lap record for the class of 105.179mph in the process.\nDunlop assumed the lead on the opening lap and extended his advantage to finish 2.65 seconds ahead of runner-up Davey Todd, with Dean Harrison third.\nIt was a 25th race win at the meeting for the 34-year-old Ballymoney rider.\nDunlop only confirmed his intention to race at the meeting on Thursday after sitting out last year's event.\nThe 25-time TT winner did not compete at Armoy 12 months ago as a result of a dispute with the organisers.\nMichael had set the fastest time in qualifying for the 600cc class and looked in irresistible form as he romped home to take the chequered flag on his MD Racing Yamaha, ahead of last year's four-time race winner Todd on the Milenco by Padgett's Honda.\nHarrison completed the podium on a BPE by Russell Racing Yamaha, four seconds behind Todd, as he made his first appearance at Armoy since 2015.\nCork rider Mike Browne was fourth for Burrows Engineering/RK Racing, followed by Tobermore's Adam McLean and Dominic Herbertson, who rounded out the top six.\nThe other race to be held on Friday night saw Darryl Tweed win the Lightweight Supersport class and Herbertson the Post Classic Twin Shock.", "url": "https://www.bbc.com/sport/northern-ireland/66343633"}