{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:30:55", "date_modify": "2025-05-19 14:30:55", "date_publish": "2017-08-04 12:03:04", "description": "Brazil forward Neymar says it is \"sad\" people think his world record move to Paris St-Germain was motivated by money.", "filename": "sport_football_40827104_1747665055.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12C50/production/_97208867_neymar1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40827104_1747665055.html", "title": "Neymar: It's sad people think Paris St-Germain move was motivated by money", "title_page": "Neymar: It's sad people think Paris St-Germain move was motivated by money - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brazil forward Neymar says it is \"sad\" that people think his world record move from Barcelona to Paris St-Germain was motivated by money.\nThe 25-year-old joined the French club for a fee of 222m euros (£200m) and he will earn 45m euros (£40.7m) a year.\nNeymar, who could play in PSG's first league match of the season on Saturday, said his price was \"not a burden\".\nPSG chairman Nasser Al-Khelaifi added that Neymar could have earned more money at another club.\nThe Ligue 1 club's total outlay on the Brazilian is expected to be £400m.\nAsked at his official unveiling at the Parc des Princes if he was motivated by money, Neymar replied: \"What I say to these people is they don't know anything about my personal life. I was never motivated by money.\n\"If I was following the money, I would be somewhere else, with other clubs in other countries. I'm really sad that people still think that way and I'm glad that PSG believe in me.\"\nAl-Khelaifi added: \"Neymar came here for motivation, a project that he believed in. He can get much more money than we give him, that's for sure.\"\nFormer Portugal winger Luis Figo left Barcelona for Real Madrid in 2000, for a then world record fee of £37.4m, after Madrid paid his buyout clause. The move was greeted with anger by Barcelona fans.\nWhen asked how he felt about being compared to Figo, Neymar said: \"I have done nothing bad. I am sad about the fact that the fans think that.\n\"You are not obligated to remain at a club, if you wish to leave then the player has that right.\"\nAl-Khelaifi added: \"He left as a gentleman. It's not fair to compare him with other players. He was trying to delay the process out of respect for Barcelona's players and fans.\n\"I'm shocked by the question.\"\nAl-Khelaifi said Neymar has had an instant financial impact, adding: \"Before Neymar the value of the club was $1bn, now it is $1.5bn.\"\nDefending the cost of the transfer, he said: \"Today is expensive but in two or three years? I do not think it is expensive, we will definitely make more money. This is the power of PSG. It is an amazing transfer.\"\nNeymar, who denied he left Barcelona to step out of Lionel Messi's shadow, added: \"It is not a burden. I am 69kg and do not have a burden on my back.\"\nNeymar arrived in Paris by private jet on Friday and was greeted by PSG officials, including the recently retired former left-back and Brazil international Maxwell.\nThe club's shop on the Champs-Elysees was adorned with images of Neymar and hundreds of fans queued to get their hands on a replica shirt of their new number 10, which set them back over £100., external", "url": "https://www.bbc.com/sport/football/40827104"}