{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 03:42:12", "date_modify": "2025-05-21 03:42:12", "date_publish": "2025-04-06 17:52:10", "description": "Fulham 3-2 Liverpool: Marco Silva's side set up exciting end to the season", "filename": "sport_football_articles_ckg10m38352o_1747798932.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0777/live/537d6460-130b-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg10m38352o_1747798932.html", "title": "Fulham 3-2 Liverpool: Marco Silva's side set up exciting end to the season", "title_page": "Fulham 3-2 Liverpool: Marco Silva's side set up exciting end to the season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A memorable Fulham win secured on the back of a superb first-half performance.\nWhen Alexis Mac Allister put Liverpool in front, many would have expected Arne Slot's side to push on and take another step towards the Premier League title.\nInstead, Fulham rallied and three goals in 13 minutes go them a thoroughly-deserved two-goal lead at the break.\nEven at 0-0 the were the better side and had a big chance to go in front when Andreas Pereira robbed Ibrahima Konate of possession inside the Liverpool penalty area.\nThat chance went begging but it was a prime example of the intensity of Fulham's pressing causing the visitors problems.\nThey won the ball back in Liverpool territory on numerous occasions and used it smartly once they had it.\nSlot highlighted Liverpool errors for all three goals but Fulham were there to capitalise before standing firm in the second half.\nWith seven games remaining, Marco Silva's side are just four points off fifth, which is highly likely to be good enough for Champions League qualification.\nIt remains an long shot but, on the back of such an impressive win over the likely champions, why not aim high?", "url": "https://www.bbc.com/sport/football/articles/ckg10m38352o"}