{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:55", "date_modify": "2025-05-21 05:59:55", "date_publish": "2025-01-14 08:24:24", "description": "Daniil Medvedev destroys a net camera in a five-set thriller against world number 418 Kasidit Samrej in the Australian Open.", "filename": "sport_tennis_articles_cwy7xwqqe0vo_1747807195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/279f/live/eba30fc0-d255-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cwy7xwqqe0vo_1747807195.html", "title": "Australian Open 2025 results: Daniil Medvedev destroys camera in five-set thriller against world number 418 Kasidit Samrej", "title_page": "Australian Open 2025 results: Daniil Medvedev destroys camera in five-set thriller against world number 418 Kasidit Samrej - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniil Medvedev destroyed a net camera as he battled to control his emotions in a five-set thriller against world number 418 Kasidit Samrej in the first round of the Australian Open.\nMedvedev, a three-time finalist in Melbourne, furiously smashed his racquet against the camera in the middle of the net after falling behind in the third set.\nThe Thai wildcard was in sight of the biggest win of his career - as well as handing Medvedev the most surprising defeat of his - on his Grand Slam debut.\nBut Samrej, who has never previously competed at an ATP Tour event, started to struggle physically and the Russian regained his composure to win 6-2 4-6 3-6 6-1 6-2.\nThe fifth seed has made five-set matches a habit in Melbourne, with this his fourth in a row after blowing a two-set lead against Jannik Sinner in last year's final.\n\"I know that I play better when I play more tennis, so why play one hour 30 [minutes]?\" Medvedev joked during his on-court interview.\n\"It's minimum three hours to feel my shots better and to have a good sensation.\"\nMedvedev began shouting at his coach as early as the second set before his emotions really came to the fore in the third when he went a break down.\nAfter an unfortunate net cord went against him, Medvedev repeatedly whacked the middle of the net, destroying his racquet and the camera.\nThe visual feed from the camera immediately cut out and a ball kid had to sweep up the pieces that had broken off.\nMedvedev was given a warning by the umpire and will be fined by the tournament.\n\"What I have to say is the camera was very, very strong,\" Medvedev, 28, said afterwards.\n\"My racquet didn't handle the damage but the camera did.\n\"When I saw the racquet I was like, time to get a new one. I hope the fine is not too big - I don't think GoPros are that expensive.\"\nJust as Medvedev looked on course for his earliest exit in Melbourne since his Grand Slam debut in 2017, Samrej faltered physically.\n\"Second and third set, I couldn't touch the ball. Full power, everything in, I didn't know what to do,\" Medvedev added.\n\"I watched his matches and I didn't see his level, so I was surprised. If he plays like this every match, life will be good - money, girls, casino, whatever.\"", "url": "https://www.bbc.com/sport/tennis/articles/cwy7xwqqe0vo"}