{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:33:29", "date_modify": "2025-05-21 04:33:29", "date_publish": "2025-04-04 21:01:49", "description": "Second-half tries from Fanitesi Niu and Bailey Hodgson help Leigh Leopards through to the semi-finals of the Challenge Cup.", "filename": "sport_rugby-league_articles_c8jey9p3jp0o_1747802009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb71/live/c8a202c0-1197-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c8jey9p3jp0o_1747802009.html", "title": "Visitors claim comeback win - BBC Sport", "title_page": "Challenge Cup - Wakefield Trinity 12-20 Leigh Leopards: Visitors claim comeback win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Second-half tries from Fanitesi Niu and Bailey Hodgson helped Leigh Leopards through to the semi-finals of the Challenge Cup after a comeback victory at Wakefield Trinity.\nLachlan Lam's try put the visitors 6-0 up at the break before two quick tries after the interval from Matty Russell and Josh Rourke turned the game around to put Trinity 12-6 ahead.\nBut Rourke's knock-on led to a superb try from Niu to bring Leigh level, before Gareth O'Brien kicked a penalty to put them ahead.\nWakefield again lost possession cheaply and Hodgson pounced to score the decisive try and send Leigh through.\nLeigh are back in the last four of the competition they won back in 2023, and they avenged last weekend's 40-14 Super League humbling by Wakefield.\nThey took an early lead as the ball was worked wide on the last tackle before a grubber in behind the defence was collected by Lam to score.\nIt proved the only score of the half as despite a greater share of territory, the visitors were kept in check and took a narrow lead into the break.\nThe game quickly changed after half-time as Mason Lino's cross-field kick bounced kindly for Russell to touch down.\nOli Pratt then broke the Leigh defence and sent Rourke in to put Wakefield in front.\nBut two errors by Rourke led to the home side surrendering their ascendency.\nFirst, he spilled a high kick to hand Leigh possession, and Niu danced his way left and right before seeing off four tacklers to power to the line and level the tie at 12-12.\nRourke then took O'Brien's high kick only to release a loose pass which Hodgson picked off to run in.\nIt knocked the life out of Wakefield, who never threatened to reignite the game in the closing stages.", "url": "https://www.bbc.com/sport/rugby-league/articles/c8jey9p3jp0o"}