{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-04-26 06:55:17", "date_modify": "2025-04-26 06:55:17", "date_publish": "2025-02-28 15:35:00", "description": "Man City manager Gareth Taylor says it is going to be \"really\" tough for his side to get they want during a very busy March.", "filename": "sport_football_articles_cdel2y356kpo_1745650517.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8e1/live/20258690-f5e9-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdel2y356kpo_1745650517.html", "title": "Gareth Taylor press conference: Tottenham vs Manchester City preview", "title_page": "Gareth Taylor press conference: Tottenham vs Manchester City preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester City manager Gareth Taylor says it is going to be \"really\" tough for his side to get the results they want during a very busy March.\nCity have reached the League Cup final, FA Cup quarter-finals and Champions League quarter-finals and now have eight games in the month.\nThey have a calmer April, but Taylor said he wants that to be busier and that happens by \"being successful in this period\" - a task which will not be easy.\nCity's cramped month begins on Sunday, when they travel to take on Tottenham in the Women's Super League at 14:00 GMT.\nSpeaking in his pre-match news conference, Taylor said: \"There's a lot going on in this month and I think the conversation will certainly be 'attack the next game, don't try and give too much thought to what's further down the road'.\n\"We've worked really hard to get to that final, that's great and it's difficult not to have one eye on that.\n\"But, we have priorities with two tough fixtures against Spurs and West Ham both away and back after an international break so everything's thrown into the mix a little bit in terms of a challenge.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cdel2y356kpo"}