{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:56:17", "date_modify": "2025-05-20 11:56:17", "date_publish": "2023-07-24 11:44:19", "description": "Fulham: Marco Silva ' massive loss' if leaves for Saudi Arabia", "filename": "sport_articles_c51233vjqyeo_1747742177.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6667/live/df7f9fb0-29fa-11ee-8654-b5548db6bb63.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c51233vjqyeo_1747742177.html", "title": "Fulham: Marco Silva ' massive loss' if leaves for Saudi Arabia", "title_page": "Fulham: Marco Silva ' massive loss' if leaves for Saudi Arabia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham boss Marco Silva confirmed to reporters at the weekend that he has received an offer to manage in Saudi Arabia - but refused to say whether he has turned it down.\nRumours were circulating the Portuguese coach had been approached with a £40m deal to take charge of Al-Ahli and he told reporters an offer had been made.\nWhen pressed on what his answer had been, the 46-year-old would not say and added that his commitment to Fulham \"is clear and will continue\".\nFormer England striker Tash Dowie told BBC Radio 5 Live's Football Daily podcast: \"I think he's going to show loyalty to the club, which I think is really promising. He's got one year left on his Fulham contract so it would be nice if he could see that out. He's really important to them.\n\"It's a similar situation at Liverpool. I saw Jordan Henderson training last week, we're all saying 'is he going, is he not?' As the weeks go on, you hear all of the rumours and it's hard because you don't know what's going on in a player's head.\n\"For me it's always been about winning and improving and wanting to win trophies.\n\"You don't know the ins and outs of what these players and coaches want to achieve in their career, but I'd love to see Marco Silva stay, see out his contract and show that loyalty, and then if it's an ambition of his after that, then fine.\n\"But it would be a massive loss if he was to leave the club.\"", "url": "https://www.bbc.com/sport/articles/c51233vjqyeo"}