{"authors": ["Marc Higginson & Chris Bevan", "www.facebook.com"], "date_download": "2025-05-19 15:16:28", "date_modify": "2025-05-19 15:16:28", "date_publish": "2015-02-13 06:41:12", "description": "Embrace the attention, use the conditions, cramp the favourites' style: what are the ingredients for a classic FA Cup giant-killing?", "filename": "sport_football_31296159_1747667788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80963000/jpg/_80963376_shrewswrexham.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31296159_1747667788.html", "title": "FA Cup: Beating the big boys - how to cause an upset", "title_page": "FA Cup: Beating the big boys - how to cause an upset - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This year's FA Cup has been a vintage one for the underdog, with fresh deeds of giant-killing infusing football's oldest knockout competition with plenty of drama.\nLeague One Bradford stunned Premier League leaders Chelsea, Championship side Middlesbrough won at champions Manchester City and League Two Cambridge United held Manchester United to a draw.\nAnd that was just in round four.\nThis weekend's fifth round sees Bradford attempt to eliminate Sunderland and Championship side Blackburn host Stoke, before League One Preston tackle 11-time winners Manchester United on Monday,\nSo how should a team of aspiring giant-killers approach a game against a higher-placed opponent? What are the ingredients that go into creating a great Cup upset?\nWe asked six giant-killers - Shrewsbury's Nigel Jemson and Kevin Ratcliffe, Wrexham's Mickey Thomas, Hereford's Ronnie Radford, Sutton's Tony Rains and Millwall's Mark Beard - exactly what it takes. We also spoke to two men - Mark Lawrenson (Liverpool) and Robbie Savage (Leicester) - who know what's like to be on the receiving end.\nRonnie Radford, whose goal helped Hereford beat Newcastle 2-1 after extra time in a third-round replay in 1972: \"There was such a frenzy surrounding the tie. The original match was postponed twice because of the weather. After the 2-2 draw in that game all of our players went back to work. There was no pressure on us - we were part-time - and then the replay was called off three times, and Newcastle had stayed in Worcester the whole time. They had to deal with the boredom of it all.\"\nNigel Jemson, scorer of both Shrewsbury goals as the Third Division side knocked out top-flight Everton 2-1 in 2003: \"I got a text from Mark Bright before the game - I used to play with him at Sheffield Wednesday - and he said that somebody was going to be a hero, and why shouldn't it be me? That always sticks in my mind.\n\"The gaffer, Kevin Ratcliffe, got us revved up for the game, we prepared properly and it was like our cup final. We went into it with confidence we could pull off a draw but as the game continued, we deserved it 100%.\"\nMickey Thomas, who scored as Fourth Division strugglers Wrexham stunned Arsenal 2-1 in 1992: \"It was number one in the football pyramid against number 92. It brought people from everywhere in the town together and the atmosphere was electric.\"\n\"Then they come to a little old stadium like Gay Meadow and the changing room is tiny, and the pitch is a bit bobbly as well. That does not sway the game your way, but every bit of advantage helps when you are playing against players who are better than yours.\"\nRadford: \"When the Newcastle game went to a replay, their striker Malcolm Macdonald said the next game would be different. Well, it was different in every way. The atmosphere was amazing and the noise of the crowd was relentless for the whole 90 minutes. It must have been a daunting thing for Newcastle.\"\nMark Beard, scorer as First Division Millwall won 2-0 at Premier League Arsenal in a third-round tie in 1995, then beat Chelsea on penalties after a replay in round four: \"We took a massive crowd of about 7,000 to Arsenal, so it created quite an intimidating atmosphere.\n\"That was fantastic, but when we played Chelsea at The Den… I've never experienced an atmosphere like that. It was crazy.\n\"They talk about the big derbies abroad like in Italy and Turkey, where the fans are so passionate, but this game was exactly the same. It was unbelievable - for the 120 minutes, everywhere you looked there were fans screaming at you.\"\nMark Lawrenson, whose Liverpool side were held to a 1-1 draw by Third Division York in 1986 before winning the replay after extra time: \"We should not have played the first game at York when we did because it had snowed and the pitch was frozen. I knew the groundsman, the late Brian Foster, who had worked at my first club Preston. I remember talking to him before the game - I said 'you've been in the referee's ear to get this on' and he just started laughing.\n\"The pitch was dodgy, which made a big difference because we tried to play football and play our usual game. We should have just lumped it but, with Kenny Dalglish and Ian Rush up front, we didn't really have anyone to lump it to.\"\nRatcliffe: \"Wayne Rooney played for Everton but we were not worried about him - we were more worried about Tomasz Radzinski's pace up front for balls over the top. We were not bothered about Rooney turning and running at us because the pitch would not allow him to have the touch that he wanted to - it meant their players had to take one or two extra touches and slowed them down.\"\nRobbie Savage, whose Leicester team were sixth in the Premier League when they were beaten in the quarter-finals by Second Division Wycombe in 2001: \"What happened in that game is why people should take nothing for granted in football.\n\"When we drew Wycombe at home, a lot of us at the club thought we were through to the semi-finals already. We expected to turn up and win and that was part of the problem. There is no excuse for what happened.\"\nLawrenson: \"There were ways of making us uncomfortable. A lot of the time lower teams would try to bypass our midfield by playing the long ball and if they had a couple of big and strong strikers up front, you could sometimes feel as if we did not have enough of the ball, and then we struggled because we could not get Dalglish, Rush and those sorts of players into the game.\n\"Then the tackles would be flying in too because the lesser team would be well up for it, and the referee would let things go. Your aim, especially if you were playing away, would be to get an early goal because it would silence the crowd. If we scored first then the smaller sides very rarely came back at us.\n\"The longer they are in the game, the more confidence their players get and you only needed one or two of your team-mates to suddenly think that you are in a bit of trouble, and then you are struggling.\"\nBeard: \"We scored an early goal after about 10 minutes and it settled us down a bit. It especially settled me down because I was only 20 at the time, and it gave us lots of confidence.\"\nRains: \"Once the match started we tried to stick to a game-plan, which wasn't to go gung-ho. We needed to come through the first 15 minutes without conceding and that's what we did. As the half developed we came more into the game.\"\nThomas: \"Wrexham beating Arsenal caused a bit of an earthquake in the football world - I'm told that Chelsea fans were singing my name at Hull and Spurs fans, who hated me from my Manchester United days, even chanted because they enjoyed the fact I had knocked Arsenal out.\n\"All of the Arsenal lads were really respectful after the game. I'd asked for David Seaman's gloves before the game, and he was true to his word. He even waited outside the dressing room for me. Fair dos to him.\"\nBeard: \"After the game, as normal, Arsenal striker Ian Wright was a bit agitated. He wanted to fight the world - I think he had a little argument with Alex Rae and Andy Roberts and then he carried on into the tunnel and then into the bar. He didn't like losing.\n\"After that, the next day was surreal. I was on the train going somewhere and I was on the back page of every newspaper and I was getting spotted by people who weren't Millwall fans.\"\nRains: \"After we had beaten Coventry and I had scored, myself and the other scorer, Matt Hanlan, got plucked out to do different things in the media. The weirdest one was going on Wogan. It was completely non-football orientated. He was not poking fun, but he was asking questions about if we had made the changing rooms cold, and did we pick up our money in our boots? It was a fantastic experience but it was a bit weird.\"\nRatcliffe: \"I took a phone call on the Monday morning from Everton boss David Moyes to apologise because he never stayed behind for a drink after the game as he was fuming about his team. He said he had watched a video of the game and he was sorry because he did not realise how well we had played and that we had deserved it. It was a nice touch for him to say that.\n\"We only won one of our remaining 22 league games after the Cup tie and ended up being relegated out of the Football League.\n\"It is amazing what a cup run can do - sometimes it can spur players on to bigger and better things, or it can make them think they are better than they are. I think one or two of them thought they were better than Shrewsbury and should have been playing at a higher level.\"\nSavage: \"Things were never the same again. Losing to Wycombe left a massive hangover for the rest of the season and it was the beginning of the end for Peter Taylor as Leicester manager.\n\"Before that Cup defeat we were in the top six of the Premier League and had beaten Liverpool 2-0 the previous week. Afterwards, we lost eight games in a row.\"", "url": "https://www.bbc.com/sport/football/31296159"}