{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-21 07:58:13", "date_modify": "2025-05-21 07:58:13", "date_publish": "2025-03-27 18:04:52", "description": "England centre Megan Jones says the loss of both her parents means they will be at Principality Stadium \"in a different light\" for the Women's Six Nations match against Wales on Saturday.", "filename": "sport_rugby-union_articles_cj92md29w1no_1747814293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d57/live/d77e1190-0b2e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cj92md29w1no_1747814293.html", "title": "Women's Six Nations 2025: Megan Jones on first England game without parents", "title_page": "Women's Six Nations 2025: Megan Jones on first England game without parents - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England centre Meg Jones says the loss of both her parents means they will be at Principality Stadium \"in a different light\" for the Women's Six Nations match against Wales on Saturday.\nThe 28-year-old lost her parents in quick succession, with her father passing away from lung cancer last summer before her mother died four months later.\nCardiff-born Jones, who starts at outside centre against Wales, will be playing her first Red Roses game since their deaths.\n\"I am aware you get a lot of firsts, this week [on Sunday] is the first Mother's Day and the first time I am in an England shirt without both of them,\" Jones told BBC Sport's Rugby Union Weekly.\n\"It is just about seeing them in a different light and I will always think they are in the crowd. I would never have seen them anyway.\n\"I'll have moments now where I think they are just at home and I will see them in a couple of weeks.\n\"They will just be in the crowd cheering me on like they always do.\"\nJones' mother struggled with alcoholism, which the England back says \"spiralled\" following her father's death.\nThe Leicester Tigers centre, who has been capped 21 times, now volunteers as a patron at charity The Living Room to help people tackle the problems her mother faced.\n\"The idea is to help people with drug and alcohol abuse to navigate through it because it is a really hard journey to do on your own, but you need the guidance to push you through that,\" she added.\n\"I am proud and honoured to say that I am affiliated with them.\"\nFollowing a 38-5 opening-round victory over Italy in York, England head coach John Mitchell has made 13 changes to his starting XV for the trip to Cardiff.\nMitchell has reverted back to the majority of faces that helped secure Six Nations and WXV1 success last year.\nWorld player of the year Ellie Kildunne, who scored nine tries and gained over 300 metres more than any player in last year's tournament from full-back, like Jones, returns to the team.\n\"Ellie's the 1% in terms of how she thinks and sees the game, it is the 1% we all would never think to come across,\" Jones said.\n\"With that comes responsibility and accountability and she is very aware of that. I don't think she realises how much she has achieved in such a short period of time.\n\"She is a unique character and a deep human. The way she thinks is beyond what I can describe with her attention to detail.\n\"She is one in a million and will do crazy things in this game whether it is on or off the field.\n\"[On-field] Ellie sometimes carries too much on her shoulders and I always remind her that we can help her out in that respect and look after her like the rest of the team.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cj92md29w1no"}