{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:52", "date_modify": "2025-05-19 15:10:52", "date_publish": "2015-02-27 22:25:57", "description": "World number one Rory McIlroy misses his first cut since June as Padraig Harrington takes the Honda Classic lead in Florida.", "filename": "sport_golf_31669512_1747667452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81303000/jpg/_81303558_hi026094962.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_31669512_1747667452.html", "title": "Rory McIlroy misses cut, Padraig Harrington leads Honda Classic", "title_page": "Rory McIlroy misses cut, Padraig Harrington leads Honda Classic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Rory McIlroy missed his first cut since last June after carding a four-over 74 at the Honda Classic in Palm Beach Gardens, Florida.\nIn a round interrupted twice by bad weather, McIlroy had five bogeys and just one birdie to slip to seven over.\nIreland's Padraig Harrington (66) leads on seven under, with Patrick Reed (67) a shot back and England's Ian Poulter (64) tied for third on five under.\n\"I don't like missing cuts. You want to play on the weekend,\" McIlroy said.\n\"I felt like I was trying to get something going and couldn't.\n\"Coming off three weeks off and playing in conditions like these, it sort of shows you where your game's at.\"\nMcIlroy, who won the Dubai Desert Classic in his last outing, had to birdie his last two holes on Thursday to shoot a 73 but was soon going in the wrong direction on Friday.\nStarting on the back nine, the four-times major winner bogeyed his opening hole after a wild drive and then recorded seven successive pars before another bogey on the par-five 18th.\nThe 25-year-old, who lost out in a play-off to Russell Henley last year, birdied the par-three fifth, only to bogey three of the last four holes to seemingly seal his fate.\nMcIlroy won this event in 2012 to become world number one for the first time, but walked off the course during the defence of his title the following year, initially telling reporters he was in \"a bad place mentally\" and then issuing a statement citing severe toothache as the reason for withdrawing.\nSixty-eight players had to complete their second rounds on Saturday after bad weather forced an early end to Friday's play.\nEngland's Luke Donald hit a three-under-par 67 and is fifth on four under, while Scotland's Russell Knox is also in contention, a shot further back after a two-under 68.", "url": "https://www.bbc.com/sport/golf/31669512"}