{"authors": ["Jonathan Jurejko", "Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 04:08:58", "date_modify": "2025-05-21 04:08:58", "date_publish": "2025-01-15 10:13:51", "description": "Harriet Dart wants to see greater respect from crowds after experiencing a boisterous atmosphere during her Australian Open second-round defeat.", "filename": "sport_tennis_articles_c0k5v5nj5zvo_1747800538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d082/live/a89ec8f0-d344-11ef-a669-f140c338bce3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c0k5v5nj5zvo_1747800538.html", "title": "Australian Open 2025 results: Harriet Dart calls for more crowd respect as she and Jodie Burrage exit in second round", "title_page": "Australian Open 2025 results: Harriet Dart calls for more crowd respect as she and Jodie Burrage exit in second round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Harriet Dart said the atmosphere during her Australian Open second-round defeat was \"like a football match\" and called for greater \"respect\" from fans.\nLucky loser Dart, who only discovered she had a place in this year's main draw one hour before her opening match on Monday, took the first set against Croatia's 18th seed Donna Vekic but was beaten 4-6 6-0 6-2.\nDart's issue with the court 14 crowd came on a day when rowdy supporter behaviour fell under the spotlight amid other incidents at Melbourne Park.\n\"I felt like I was at a football match. Obviously it's great to have lots of people there watching and everything but I also think there has to be respect towards both players,\" said Dart, 28.\n\"I think a few people were about to be kicked out. I can only really compare it to the Billie Jean King Cup and I don't even think I've had it be like that before.\n\"I think [the umpire] did as best as she could - maybe there should be a stricter policy in terms of if people are doing something, if they do it more than once they are out, but I don't make those rules.\"\nDart had struck the first blow in the deciding set before world number 19 Vekic won five straight games to complete her victory.\nElsewhere, the chair umpire had to make several appeals for respect towards the players during Jack Draper's match against Australian Thanasi Kokkinakis on John Cain Arena.\nThe home crowd attempted to unsettle Draper throughout the four-and-a-half hour contest, but the British number one said the \"electric atmosphere\" gave him energy and he responded by cupping his ear to the crowd on several occasions.\nCanadian Felix Auger-Aliassime's match against Spaniard Alejandro Davidovich Fokina was moved from court eight because the players complained about the noise coming from neighbouring courts.\nBoisterous French crowds gathered to watch Arthur Cazaux against Britain's Jacob Fearnley on court six, which has a bar, and on court three, where Ugo Humbert was facing Lebanon's Hady Habib.\n\"I actually didn't really look at the court before I went on, so when I saw the bar I was thinking it's going to be a pretty rowdy atmosphere,\" said Fearnley.\n\"I blocked it out as much as I could. Obviously there was some supporters who were extremely drunk, but it was a great atmosphere, amazing atmosphere.\"", "url": "https://www.bbc.com/sport/tennis/articles/c0k5v5nj5zvo"}