{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:15", "date_modify": "2025-05-21 07:51:15", "date_publish": "2025-03-28 06:14:23", "description": "Newport star Kamwa 'flying' after rest as trio return to training", "filename": "sport_football_articles_czxnvqeqn81o_1747813875.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd3d/live/e1272200-0b9b-11f0-87fc-293fd4157f6e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czxnvqeqn81o_1747813875.html", "title": "Newport star Kamwa 'flying' after rest as trio return to training", "title_page": "Newport star Kamwa 'flying' after rest as trio return to training - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newport County will welcome back \"flying\" Bobby Kamwa against Notts County – having already welcomed back another trio to training.\nStriker Kyle Hudlin, defender Kyle Jameson and former Cardiff City full-back Tom Davies have all returned to the grass after recent injury spells.\nNone will be in consideration for the visit of the Magpies (Saturday 15:00 GMT), but Kamwa is set to head straight back into the starting XI having missed last weekend's defeat at Grimsby.\nKamwa, 25, was rested for the 1-0 loss with Jardim admitting: \"Bobby's flying again - we just had to give him a few days rest because he's already played more games than he's ever played in a single season.\n\"And don't forget in November he was out for a few weeks with injuries - so he's exceeded what we thought he could do and a rest was something he was needing.\"\nThe Leeds United youth graduate signed from Burton Albion in the summer, scoring eight goals in 40 appearances across all competitions. His previous highest appearance tally was 26 games in League One last term.\nKeenan Patten is also fit again, with Jardim saying it feels the squad are approaching \"full power\" with the return of the three injury lay-offs.\nStriker Hudlin is back from the calf injury suffered against Carlisle in February, Jameson is training after a quad tear at the start of the month while 21-year-old Davies returns having been ruled out for the season with a hamstring injury in January.\n\"They gave a big effort and it was good to see them running about and nice to see them back,\" added Jardim. \"There was a good energy in the session because they brought that back to the squad.\"\nAfter defeat on the road, Newport are hoping to make it three home wins in a row when the sixth-placed Magpies arrive at Rodney Parade.", "url": "https://www.bbc.com/sport/football/articles/czxnvqeqn81o"}