{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:11", "date_modify": "2025-05-21 06:17:11", "date_publish": "2025-03-31 08:45:04", "description": "Cornwall concede 14 tries as they are thrashed 78-6 at home by League One high-fliers Whitehaven.", "filename": "sport_rugby-league_articles_cn5xr0ge7l7o_1747808231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d85/live/76cca3f0-0e0a-11f0-90cb-6de76cd8d1c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cn5xr0ge7l7o_1747808231.html", "title": "Cornwall suffer record home loss in 78-6 game against Whitehaven", "title_page": "Cornwall suffer record home loss in 78-6 game against Whitehaven - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornwall conceded 14 tries as they were thrashed 78-6 at home by League One high-fliers Whitehaven.\nThe 72-point loss equals the club record for their worst-ever defeat - matching a 72-0 mauling at Oldham last August.\nThe club were 42-0 down at half-time as Jordan Burns took 19 minutes to score a hat-trick, with Cornwall conceding eight tries before the interval.\nAnother six tries came after the break as Whitehaven, who are second in League One, bettered Midlands Hurricanes' 72-6 win at Penryn in April last year to inflict a record home loss on the Choughs.\nMason Lewthwaite - who had scored in the dying seconds of the first half - completed his hat-trick within five minutes of the restart thanks to two quickfire tries.\nHaving conceded three more tries, Adam Rusling finally gave the home fans something to cheer as he went over with 15 minutes to go to make the score 72-6 before Burns got his fourth try three minutes later to complete the rout.\nDespite the loss, Cornwall remain in seventh place in League One thanks to last week's win over bottom side Newcastle Thunder, although their points difference of -130 is the worst in the division.\nMike Abbott's side travel to third-placed North Wales Crusaders on Sunday in another tough-looking fixture.", "url": "https://www.bbc.com/sport/rugby-league/articles/cn5xr0ge7l7o"}