{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:52", "date_modify": "2025-05-21 05:59:52", "date_publish": "2025-01-31 13:42:30", "description": "Lincoln City sign versatile teenage forward Joe Gardner from Nottingham Forest on loan for the remainder of the season.", "filename": "sport_football_articles_cgmyn4mwxmvo_1747807192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff1d/live/670dc070-dfd4-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgmyn4mwxmvo_1747807192.html", "title": "Joe Gardner: Nottingham Forest forward joins Lincoln City on loan", "title_page": "Joe Gardner: Nottingham Forest forward joins Lincoln City on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lincoln City have signed versatile teenage forward Joe Gardner from Nottingham Forest on loan for the remainder of the season.\nThe 19-year-old has made just one first-team appearance for Forest, which was as a substitute in their FA Cup fourth-round win against Bristol City that went to a penalty shooutout last season.\nGardner - whose loan move comes on the same day that he has agreed a new Forest contract - featured for the Reds' Under-21 side in the EFL Trophy this season, and has scored six goals in 12 appearances for their Premier League 2 side.\nLincoln boss Michael Skubala says Gardner is a player they have been \"watching closely for quite some time\" and who has been brought in after Jack Moylan suffered a potentially season-ending injury.\n\"It has been sped along quicker because of the Jack Moylan situation,\" Skubala told BBC Radio Lincolnshire.\n\"We see him as that player with a little bit more of a Jack Moylan-profile that can do special things and open the game up.\n\"He is a real exciting prospect. We would definitely have looked to do this in the summer, but it has probably been sped along into January with the view to even keep him if he does well.\"", "url": "https://www.bbc.com/sport/football/articles/cgmyn4mwxmvo"}