{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-04-26 07:59:53", "date_modify": "2025-04-26 07:59:53", "date_publish": "2025-02-25 11:12:39", "description": "Victor Pereira admits Wolves do not have enough of an advantage in the fight for survival to relax.", "filename": "sport_football_articles_ckgdy3lg67vo_1745654393.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3484/live/6d173a60-f365-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgdy3lg67vo_1745654393.html", "title": "Wolves news: Vitor Pereira on survival fight", "title_page": "Wolves news: Vitor Pereira on survival fight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Victor Pereira admits Wolves do not have enough of an advantage in the fight for survival to relax.\nSaturday's win at Bournemouth lifted Wolves five points clear of the bottom three ahead of Tuesday's visit of Fulham.\nVictory would move Wolves eight points clear of the Premier League's drop zone with Ipswich and Leicester not playing until later in the week.\nWest Ham, in 16th, are eight points above Pereira's side and seemingly out of reach and the former Porto boss knows Wolves need to extend the gap to those below them.\nHe said: \"They are far away [the teams above]! When I look at the bottom, they are very close to me!\n\"It's not, it's not [a big enough gap to the relegation zone]. It's why I'm not speaking about the last game, it was good but now I don't care. Fulham we must analyse individually, collectively, and to understand what we must do with our game.\n\"We must feel our confidence as a team, we must be compact and consistent. We must score more goals - it's something we can improve on.\"\nWith the bottom four adrift it appears to be a four-way shootout for survival, although Southampton are 13 points from safety and looking set for a return to the Championship.\nPereira feels there is more to come from his side but they need to lose any tension before it becomes clear.\nHe said: \"I want to correct some behaviours and I want to see my team playing in my way. To be better with the ball we need tranquillity and we need to get points. After we get points we will play at a better level.\n\"It is missing this step, to control the pace. Usually my teams can have moments where they go fast and others where we enjoy having the ball. It's difficult to create in this moment in this situation.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckgdy3lg67vo"}