{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:44:23", "date_modify": "2025-05-20 12:44:23", "date_publish": "2023-08-03 14:24:46", "description": "Bristol Rovers owner Wael al Qadi sells his majority stake in the club to Kuwaiti businessman Hussain AlSaeed.", "filename": "sport_football_66397490_1747745063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/83ED/production/_130637733_shutterstock_editorial_11861313e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66397490_1747745063.html", "title": "Bristol Rovers: Owner Al Qadi sells majority stake to Kuwaiti businessman", "title_page": "Bristol Rovers: Owner Al Qadi sells majority stake to Kuwaiti businessman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Rovers owner Wael al Qadi has sold his majority stake in the club to Kuwaiti businessman Hussain AlSaeed.\nAlSaeed has purchased a 55% share of Dwane Sports, the holding company for the club, with Al Qadi keeping 40.5%.\nJordanian Al Qadi bought the League One club in 2016 and took full control in 2020. He will remain as club president with AlSaeed joining as chairman.\nCo-owner Samer Al Qadi has a 4.5% stake and the English Football League has already approved the agreement.\n\"I have been a huge football fan for many years, and it has always been my ambition to own a stake in a club. BRFC is the one club that I most desired to be a part of, due to its great fanbase and future potential,\" AlSaeed said., external\n\"From this day on, I assure the fans that we will be working tirelessly on the sustainability and growth of the football club.\n\"Rovers are a club with huge potential that is still untapped, and it is our duty to make sure that we do everything possible to improve the current state.\"\nAs part of the deal, all debt owed to Dwane Sports had been capitalised, Rovers said in a statement. \"This means that apart from our ordinary trade creditors the club is substantively debt free,\" it added.\n\"Over the past few months as discussions have developed it has been clear to me that Hussain and Abdullatif not only have a consistent vision with ours for the club but they also have the expertise and resource to help move us forward quicker.", "url": "https://www.bbc.com/sport/football/66397490"}