{"authors": ["Ed Dawes", "www.facebook.com"], "date_download": "2025-05-21 04:26:33", "date_modify": "2025-05-21 04:26:33", "date_publish": "2025-02-01 11:33:06", "description": "BBC Radio Derby commentator Ed Dawes gives his views on Eiran Cashin's departure to Brighton.", "filename": "sport_football_articles_c2d37x23z72o_1747801593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0680/live/f9eeb2d0-e08f-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2d37x23z72o_1747801593.html", "title": "BBC Radio Derby commentator Ed Dawes on Eiran Cashin's departure", "title_page": "BBC Radio Derby commentator Ed Dawes on Eiran Cashin's departure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eiran Cashin's departure from Derby County sees another academy graduate leave the club with hopes to make a Premier League living.\nBrighton's gain is Derby's loss with a huge hole left by the 23-year-old heart on the sleeve individual.\nHe has literally bled black and white ever since making his full debut under Wayne Rooney in 2021.\nBack then administration and Covid outbreaks meant Cashin was needed in the first team, but because of various EFL rules set out through administration, Derby were unable to register him.\nRooney's faith in the youngster saw him make 18 Championship appearances at the age of 19.\nFrom that moment on his allegiance to the cause has never been in question, he's grown into an experienced central defender who's developed his game from head it and kick, to play out from the back and switch play effortlessly.\nWhen Brighton first came knocking in the summer of 2023 it turned his head.\nHe missed the away defeat at Bolton in September because he had been waiting in a Little Eaton coffee shop in case a deal with the Seagulls could be reached.\nIt wasn't and he reached the team hotel in the north west at 2am.\nSince then he celebrated promotion from League One as a main stay of Paul Warne's side that finished second in the table.\nLike the majority of his team-mates, the return to the Championship has not been as comfortable as hoped.\nHis tears after the Cardiff City game recently led to speculation of a departure.\nFor him a move to Brighton is a sensible option with Derby in a relegation battle.\nHis stock might not be as high in League One, should that fate fall their way.\nHis personal ambition to play in the Premier League is an unselfish dream to which every fan should support.", "url": "https://www.bbc.com/sport/football/articles/c2d37x23z72o"}