{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:15:15", "date_modify": "2025-04-26 04:15:15", "date_publish": "2025-03-04 10:37:27", "description": "Jessica Pegula flies the other four finalists of the ATX Open from Austin to Indian Wells in California in her private jet.", "filename": "sport_tennis_articles_cy83kx8plryo_1745640915.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2fa/live/f29e5440-f8e0-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_cy83kx8plryo_1745640915.html", "title": "Pegula flies Austin finalists to Indian Wells on private jet", "title_page": "Jessica Pegula flies Austin finalists to Indian Wells on private jet - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After competing in the finals of the ATX Open on Sunday, McCartney Kessler, Zhang Shuai, Yue Yuan and Anna Blinkova faced a lengthy trip to their next event in Indian Wells - until Jessica Pegula stepped in.\nAmerican Pegula, who beat compatriot Kessler 7–5 6–2 in the singles final in Austin, offered the four players use of her private jet to fly straight from Texas to California.\nThe world number four even waited until after the doubles final - which saw Yue and Blinkova beat Kessler and Shuai 3-6, 6-1 10-4 - to ensure everyone could make the 1,263-mile trip.\nThe players would have otherwise faced a stopover in Los Angeles or trips to airports in Dallas and Houston, leaving little time to prepare for Indian Wells, which begins on Wednesday.\n\"She could have left right after her singles final, but she is such a selfless and generous girl,\" China's Zhang posted on Instagram.\n\"This message is not to show I took the jet, [I] just wanted to appreciate and transfer the love.\"\nRussian Blinkova and China's Yue shared Zhang's story on Instagram and also thanked 31-year-old Pegula, whose billionaire parents own NFL's Buffalo Bills and the NHL's Buffalo Sabres.\nBlinkova has been drawn to play Kessler in the first round at Indian Wells, while Yue will play Ukraine's Dayana Yastremska.\nPegula, seeded fourth, has been given a first-round bye. Zhang will enter the doubles event later in the tournament.", "url": "https://www.bbc.co.uk/sport/tennis/articles/cy83kx8plryo"}