{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:43", "date_modify": "2025-05-20 14:07:43", "date_publish": "2023-07-30 15:45:52", "description": "Innes Senior's four-try haul helps Wakefield thrash Warrington to boost their Super League survival bid.", "filename": "sport_rugby-league_66301927_1747750063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15D90/production/_130588498_jc_230730_008.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301927_1747750063.html", "title": "Super League: Wakefield Trinity 42-6 Warrington Wolves - Innes Senior claims four tries in victory", "title_page": "Super League: Wakefield Trinity 42-6 Warrington Wolves - Innes Senior claims four tries in victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Innes Senior's four-try haul helped Wakefield thrash Warrington to boost their Super League survival bid.\nSenior scored a 29-minute first-half hat-trick in his first match since rejoining Trinity, and Kevin Proctor's try put the hosts 22-0 up at half-time.\nPaul Vaughan cut the lead, but scores from Tom Lineham, Liam Hood, Senior and Max Jowitt quashed any comeback hopes.\nA fourth straight home win moves bottom side Trinity level on points with Castleford, while Wire are sixth.\nPre-season title favourites Warrington opened up with eight straight wins, while Wakefield lost their first 14 matches, but the formbook has turned on its head for both sides in recent weeks.\nTrinity racked up a fourth victory in six, and are now below Cas only on points difference. An eighth defeat from nine outings has left early-season pacesetters Warrington's hopes of a play-off run looking increasingly fragile.\nWhile Senior's dramatic start to his fourth loan spell at the Be Well Support Stadium was the headline act, Luke Gale produced a masterclass at scrum-half and influential in almost every score.\nWarrington created all the early pressure, but Trinity soaked it up and landed a classic sucker-punch with two tries in their first two visits to the Wire 20.\nGale created the space for the opening score before Jowitt sent Senior racing to the left-hand corner, and Proctor's powerful surge to the line moments later gave him a first try of the campaign.\nAnother incisive run from the lively Samisoni Langi and Gale's pass put winger Senior in acres of space to run to the left corner for his second as a buoyant Trinity raced into a 16-0 lead inside 24 minutes.\nAs Wire heads dropped, Wakefield took full advantage.\nStefan Ratchford spilled the ball on his 10m line and a couple of plays later, Gale put Senior away on his now familiar route to the left-hand corner for his hat-trick.\nBooed off at half-time by the travelling support, Wire responded soon after the restart, as returning playmaker George Williams marched the visitors upfield and Vaughan spun out of two tackles to force his way over.\nThe respite was brief as Mason Lino's long pass led to Lineham's acrobatic finish in the corner, before the Wire defence bought Hood's fake pass to Renouf Atoni and the dummy-half burrowed over for Trinity's sixth try.\nJowitt marked his 100th Super League appearance with a fine pass to tee up Senior's fourth before the full-back touched down himself late on to take Trinity past the 40-point mark.\nWakefield head coach Mark Applegarth told BBC Radio Leeds:\n\"I think that's the most clinical we've been all year. They had some early pressure on us and I thought we withstood that really well and when we got a chance to throw something at them I thought we were really clinical about how we went about our business.\n\"We've got to build on that now. It's really important we don't get carried away with ourselves and keep ourselves nice and grounded.\n\"We've given ourselves a fighting chance and we have to take it week by week and make sure we keep our standards up that we set.\"\nWarrington head coach Daryl Powell told BBC Radio Merseyside:\n\"We're lacking in a lot of confidence at the moment and I just thought we were outplayed.\n\"If you can't defend, your game plans goes out of the window. We ended up 16-0 down and we'd not really thrown much at them. They had 21 sets at half-time, we had 13 or 14 and we'd completed at 50 per cent\n\"We just put the ball down too often, lacked durability defensively and we just haven't got enough players playing well and haven't got enough resilience to win games at the moment.\n\"I think we've been pretty close against big opposition in the last couple of weeks with Wigan and St Helens, but today was a big drop off in standard.\"\nWakefield: Jowitt, Lineham, Lyne, Langi, Senior, Lino, Gale, Bowden, Hood, Proctor, Pitts, Ashurst, Atoni.\nInterchanges: Eseh, Battye, Bowes, Fifita.\nWarrington: Dufty, Thewlis, Mata'utia, Ratchford, Ashton, Williams, Drinkwater, Bullock, Clark, Vaughan, Currie, Nicholson, Philbin.\nInterchanges: Kasiano, Walker, Dudson, Holroyd.\nReferee: Tom Grant.", "url": "https://www.bbc.com/sport/rugby-league/66301927"}