{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:12:51", "date_modify": "2025-05-21 04:12:51", "date_publish": "2025-04-06 00:00:00", "description": "Watch live coverage and follow text updates as Scotland face Switzerland in the final of the Men's World Curling Championship in Canada.", "filename": "sport_live_ckg2nv87yvwt_1747800771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf1d/live/e407ac10-1343-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_ckg2nv87yvwt_1747800771.html", "title": "Watch: Men's World Curling Championship final", "title_page": "Watch: Men's World Curling Championship final - Scotland face Switzerland - LIVE - BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "gold-medal\nScotland take gold\nSwitzerland 4-5 Scotland\nA simple stone into the middle of the house wins it for Scotland.\nBruce Mouat's rink hug and scream with delight on the ice, and rightly so.\nThat was an epic, back-and-forth match and they held their nerve magnficently.\nSwitzerland 1-0 Scotland\nSwitzerland have the final-stone advantage in the first end and use it to take a 1-0 lead.\nThey had looked in position to score higher than that at one stage though, before some good tactical play from the Scots limited them to just the one point.\nHow did they get here\nScotland reached this evening's final by beating hosts Canada in a tense semi-final.\nBruce Mouat's rink, who reached the last four by beating defending champions Sweden 8-7 earlier on Saturday, followed that with a 7-4 win against the Canadians.\nThe Scots had been the only nation to beat Canada in the round robin in Moose Jaw, and they led 5-4 in the knockout tie after the hosts blanked the ninth end.\nThe Olympic silver medallists took two in the last end, despite Canada having the hammer, to guarantee a world medal of at least the same colour.\n\"I'm very proud of our performance,\" Mouat said, following that 7-4 victory.\n\"I'm just really happy with how we went about things after a bit of a roller-coaster of a week.\n\"We know the Swiss boys very well and we know they're an extremely strong team, so we're going to have to play just as well as we did today to hopefully get the win.\"\nSwitzerland beat China 7-3 to reach the final.", "url": "https://www.bbc.com/sport/live/ckg2nv87yvwt"}