{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:49:34", "date_modify": "2025-05-20 11:49:34", "date_publish": "2023-08-07 09:00:02", "description": "Henry Slade and Alex Dombrandt are among the notable absentees from Steve Borthwick's England squad for the Rugby World Cup.", "filename": "sport_rugby-union_66427035_1747741774.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12AA9/production/_130675467_slade_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66427035_1747741774.html", "title": "England World Cup squad: Henry Slade & Alex Dombrandt miss out, Joe Marchant & Theo Dan in", "title_page": "England World Cup squad: Henry Slade & Alex Dombrandt miss out, Joe Marchant & Theo Dan in - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Henry Slade and Alex Dombrandt are among the notable absentees from Steve Borthwick's 33-man England squad for the Rugby World Cup in France.\nJoe Marchant is included but there is no place for Exeter back Slade, 30, who played at the past two World Cups.\nSaracens hooker Theo Dan, 22, who made his debut in Saturday's warm-up loss to Wales, is selected while Billy Vunipola is the only specialist number eight.\nEngland's first game is against Argentina in Marseille on 9 September.\nOf the 33 players selected by Borthwick, 17 have previous World Cup experience and 16 were in the squad when England reached the final under Eddie Jones in 2019.\nThree players - Courtney Lawes, Dan Cole and Ben Youngs - will be appearing in their fourth World Cups and are named in a squad that contains more than 1,400 caps.\nVersatile back Henry Arundell, 20, is the youngest player selected.\nMarchant, who swapped Harlequins for French club Stade Francais at the end of the Premiership season, was one of the few players to enhance their World Cup chances in England's disappointing 20-9 loss to Wales on Saturday.\nIn contrast, debutant back row Tom Pearson, hooker Jamie Blamire and wing Joe Cokanasiga all struggled in Cardiff and are not in the final group.\nBlamire's absence means Dan and Jack Walker will provide cover for first-choice hooker Jamie George.\nVunipola is selected despite not playing since April because of a knee injury and not being part of Borthwick's Six Nations plans, with Lewis Ludlam, Ben Earl and Tom Curry alternatives to fill the number eight position if required.\n\"Billy's been fantastic in this training camp,\" said Borthwick. \"It's been an opportunity to work with him and see just how hard he's worked to come back from his injury.\n\"He looks in great shape, he looks as fit as I've ever seen him, and his experience will add to this squad.\"\nAnalysis: Chris Jones, BBC rugby union correspondent\nEight years on from being a surprise inclusion in the 2015 Rugby World Cup squad, Slade now faces the disappointment of being left out.\nIt is a huge call. Slade has been an ever-present in the midfield for the whole of the last World Cup cycle, but Marchant impressed against Wales on Saturday and offers a point of difference with his dynamism and versatility.\nElsewhere, the squad has a mix of youth and experience, with Borthwick opting for a large core of players who were there in Japan four years ago.\nBut while there is depth in certain areas, in others there is very little, with huge pressure on players such as George at hooker, Maro Itoje at lock and Vunipola at number eight.", "url": "https://www.bbc.com/sport/rugby-union/66427035"}