{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:15:35", "date_modify": "2025-04-26 04:15:35", "date_publish": "2025-03-04 09:57:12", "description": "Glamorgan Cricket have reported an annual operating loss of £286,192 for 2024 - a slight improvement on the previous year.", "filename": "sport_cricket_articles_c07zdkle9nvo_1745640935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c5ea/live/e12872c0-f8dd-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c07zdkle9nvo_1745640935.html", "title": "Glamorgan: Welsh county report reduced annual loss and debt in 2024", "title_page": "Glamorgan: Welsh county report reduced annual loss and debt in 2024 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glamorgan Cricket have reported an annual operating loss of £286,192 for 2024 - a slight improvement on the previous year.\nThe club say the finances are in line with expectations for what was expected to be a challenging year.\nThe club announced a profit before interest, tax and depreciation of £272,000\nIt is hoped that figure will rise to around a million pounds for 2025, thanks to new deals in place with the England and Wales Cricket Board.\nThe club is also set to benefit from major income streams as a result of the sale of half of the Welsh Fire franchise, based at Sophia Gardens.\nSanjay Govil, an Indian-American businessman who controls the Washington Freedom franchise in the USA, paid around £40m for a 50% stake in Welsh Fire.\nThe ECB sold 49% stakes in all eight franchises, with the income set to be distributed across the professional and amateur games, while Glamorgan sold an extra 1% directly.\nCEO Dan Cherry said: \"2024, whilst challenging in many respects, has been a year when we've been able to start establishing much firmer foundations for the future.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c07zdkle9nvo"}