{"authors": ["Holly Bacon", "www.facebook.com"], "date_download": "2025-05-21 05:52:22", "date_modify": "2025-05-21 05:52:22", "date_publish": "2025-01-31 14:42:01", "description": "Vitor Pereira press conference: Wolves vs Aston Villa preview", "filename": "sport_football_articles_cj91y4ll3wjo_1747806742.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4488/live/8cfca750-be1a-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj91y4ll3wjo_1747806742.html", "title": "Vitor Pereira press conference: Wolves vs Aston Villa preview", "title_page": "Vitor Pereira press conference: Wolves vs Aston Villa preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pereira said Jorgen Strand Larsen, who went off against Arsenal, is out with a muscle injury.\nOn whether he will change his system because of that injury, Pereira said: \"If we build a system, build a style of play or a game model around one player that will be a disaster for us. We must improve our qualities, our dynamic in our game mode, the way that we start to work since the first day. We can play with another striker, different qualities, different connections with the other players, different movements.\"\nHe added that Boubacar Traore has flu.\nOn January and transfers, he told reporters: \"Our priority is still the same, a midfielder and a centre-back. The club is working on it, I hope, until the end of the window and we can bring someone.\"\nPereira was asked if he would be comfortable with what he has if they can't bring someone in and said: \"If I stay like this I will do my best for sure but the club knows that we need to increase the level.\"\nSpeaking about Matheus Cunha Pereira said: \"He is doing good work, trying to come back to his potential and I'm happy with the work. I hope he can help us in the next game.\"\nHe was also asked about his midfield options, with Joao Gomes suspended, and said: \"I will play with another one [midfielder] and the player will try to do for sure the best to help us.\"\nPereira says he hopes Wolves can make their supporters proud: \"I play in my career a lot of derbies, big derbies and every time when I go to a country they say to me 'this is the most incredible derby in the world'. Of course I understand. It's important for us to play with our supporters. I hope we get a good result and hope that we can make proud our supporters.\"", "url": "https://www.bbc.com/sport/football/articles/cj91y4ll3wjo"}