{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-04-26 04:20:14", "date_modify": "2025-04-26 04:20:14", "date_publish": "2025-03-03 15:51:49", "description": "BBC Sport looks at Manchester United's attacking shortcomings and Rasmus Hojlund's goal drought.", "filename": "sport_football_articles_clyrgp489v9o_1745641214.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/579a/live/273189f0-f843-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyrgp489v9o_1745641214.html", "title": "Rasmus Hojlund: Why is Manchester United striker in goal drought?", "title_page": "Rasmus Hojlund: Why is Manchester United striker in goal drought? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Another bad result for Manchester United and another game without a goal from their misfiring forwards.\nUnited's penalty-shootout loss to Fulham in the FA Cup was the 18th consecutive game in which Rasmus Hojlund has failed to score since netting a double against Viktoria Plzen in the Europa League on 12 December.\nDuring that time Joshua Zirkzee has also managed just one goal in 16 games for a United side that has toiled in the final third of the pitch.\nAnd with United chasing an equaliser against the Cottagers, it was the Denmark international - signed from Atalanta in a deal worth up to £72m in 2023 - that made way for teenager Chido Obi.\nHojlund, 22, managed just one shot - and that went wide of the near post from Christian Eriksen's cross - on an afternoon when he struggled to have an impact.\nZirkzee, 23, also only had one effort on goal - a flick that also missed the target – while 17-year-old Obi had three and forced Fulham goalkeeper Bernd Leno into an outstanding reaction save.\nSo, with Hojlund's form another cause of concern at a club dealing with numerous issues on and off the pitch, BBC Sport look at United's attacking shortcomings.\nUnited manager Ruben Amorim recently blamed a lack of service for Hojlund's barren run in front of goal.\nAnd their options in that regard have been diminished with Amad Diallo out injured, the out-of-favour Marcus Rashford shipped out to Aston Villa on loan and Antony now at Real Betis until the end of the season.\nDuring February, there was even a comical situation when the Brazil winger had scored more goals for the La Liga side (three) than United's players had between them at that point in the month.\nYet Amorim is in control of the personnel and tactics and there were noticeable frustrations stirring around Old Trafford even before kick-off on Sunday when Alejandro Garnacho was left on the bench.\nUntil his introduction in the 53rd minute, United's Noussair Mazraoui and Diogo Dalot - two full-backs playing in wing-back roles - had struggled to provide any sort of attacking threat whatsoever.\nWhen the Argentina winger came on the dynamic of the match shifted, United played with more purpose and had six shots on target in the second half compared to two before the break.\nGarnacho was also involved in Bruno Fernandes' equaliser as United finally got players forward, unlike the first period where Zirkzee and Hojlund lacked support.\n\"I think United play too slow, the ball speed is too slow and for the centre-forwards they are just waiting around,\" said former United captain Wayne Rooney on BBC Match of the Day.\n\"Sometimes I made mistakes and had a bad game but I had good players around me. Hojlund is getting no help. He's having to try to hold the ball and use his body. He is making runs and is willing but is a little isolated.\n\"Not just Hojlund but Joshua Zirkzee has given up the ball too many times. There is not enough creativity and they are not holding up the ball for the midfielders and defenders to support them, so it's a bit of both.\"\nHojlund had to wait until 26 December for his first Premier League goal last term.\nBut that prompted a purple patch of eight goals in eight games, with an injury-interrupted first season at the club ending with 16 goals in 43 matches.\nHowever, he has only managed seven in 35 fixtures in all competitions this term and that drop-off appears no surprise given he has averaged 1.5 shots per game over the course of the season while making just 3.5 touches on average in an opponent's penalty area.\nGarnacho (8.4), Diallo (7.3), Rashford (5.1) and Zirkzee (4.7) have all had more touches in the opposition box than the Dane.\nThat same quartet plus Bruno Fernandes and Casemiro also average more shots on goal than Hojlund, who registered 12 goals in 21 appearances for Sturm Graz and another 10 in 34 games in Italy.\nThose figures also look woefully low when you consider that Liverpool's Mohamed Salah and Luis Diaz had 16 touches between them in the Manchester City penalty area in their Premier League victory just over a week ago.\nObi also managed six against Fulham in six minutes less and another cause for concern is that Hojlund's numbers have dropped since 19 December to 1.3 and 3.1.\nChris Sutton, who won the Golden Boot as joint-top Premier League goalscorer when he was with Blackburn in 1997-98 can relate to Hojlund's experience, having endured a miserable spell when at Chelsea where he went 21 games without a goal.\n\"The first thing I consider when any striker is being criticised is whether he is getting loads of chances? I'm not so sure Hojlund is,\" Sutton told BBC Sport.\n\"He is suffering, as a lot of strikers do, from that chronic lack of confidence which leads to a lack of belief and hesitancy. When strikers go on runs like the one he is on, it plays on your mind. It is probably affecting all his game, not just in front of goal, and the longer it goes on the worse it gets.\n\"Is the effort there? Yes, absolutely. Could he be doing better? Of course he could be but you could say that about virtually every Manchester United player.\n\"You have to remember that United are not just under-performing a little bit, they are miles off it. There is an argument that, under Ruben Amorim, they have got worse than they were under Erik ten Hag.\n\"His issue at United is that, as well as trying to find some form, all strikers are reliant on service and he is not getting much.\"\nChief football news reporter, Simon Stone\nHojlund's valuation jumped up a huge amount in a very short space of time with moves from Copenhagen to Sturm Graz and then Atalanta.\nAnd even though his goal record was not exceptional, comparisons were drawn at the time with fellow Scandinavian forward Erling Haaland due to the size, strength and speed of both players.\nWhile United were convinced of his potential to develop into a top-class centre-forward, he has not fulfilled that and although he has shown glimpses of his finishing power, his confidence now looks shattered.\nHe never looked like getting in a position to score against Fulham and is not the sort of forward that drops deeper and gets involved in the build-up play.\nThe Dane was also not helped by Garnacho being named as a substitute given he seems to be the one player in the current squad that can stretch a game and provide some support.", "url": "https://www.bbc.co.uk/sport/football/articles/clyrgp489v9o"}