{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 06:51:08", "date_modify": "2025-05-21 06:51:08", "date_publish": "2025-01-31 06:18:01", "description": "Thanks to Marcus Smith's versatility and Fin Smith's continuing rise, England's fly-half debate is far from settled.", "filename": "sport_rugby-union_articles_cd7d27x9yxgo_1747810268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00b1/live/a47e1350-dd9b-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cd7d27x9yxgo_1747810268.html", "title": "Six Nations: England's Marcus and Fin Smith conundrum at fly-half", "title_page": "Six Nations: England's Marcus and Fin Smith conundrum at fly-half - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New year, age-old problems.\nSteve Borthwick has spent early 2025 chewing over questions that have tormented coaches across all sports and eras.\nDoes he pick form-market movers - such as Tom Willis - or put a higher price on the delicate understanding between more-established names?\nHow much does he stick to a philosophy - such as an ultra-aggressive blitz defence - if the personnel can't live up to the ideal?\nAnd do the elite actions of captain Maro Itoje or the passionate words of predecessor Jamie George better lead his side in the fray?\nWhen he named his team for against Ireland though on Tuesday, there was one stark choice which could not be avoided - Marcus Smith or Fin Smith?\nUltimately it wasn't a surprise that he opted for the former at fly-half. Marcus was England's best player in the autumn, Fin is a Test rookie.\nBut Borthwick's call is unlikely to be the end of the debate either.\nWith England facing their two toughest opponents in the opening two rounds, this stand-off shoot-out could be a defining Six Nations saga.\nMarcus Smith delivered the stand-out moment of England's last campaign, with a last-play drop-goal that snatched victory over Ireland at Twickenham in March.\nThat replacement appearance, his first Test of the year, was the start of a sparkling run on the international stage.\nWith George Ford injured, the 25-year-old assumed the 10 shirt for the summer tour and was the brightest point in a drab autumn for England.\nSmith's matador trickery makes him a running threat to rival the best wings.\nAmong players representing top-10 Test nations last year, only New Zealand's Mark Tele'a, France's Damian Penaud and Scotland's Duhan van der Merwe beat defenders more regularly than Smith's average of 4.5 per 80 minutes.\nHis game-breaking ability has been central to England's attack.\nHe was involved in 12.7% of England's tries in 2024 - a number that eclipses New Zealand's Beauden Barrett and most others in the international game, and is all the more impressive considering Smith didn't start a single Six Nations match.\nPart of Borthwick's mission has been to create a team that excites England fans.\nAnd no-one has done that better than Smith.\nWhen the team was announced to Allianz Stadium in the autumn internationals, his name was cheered loudest.\nWhen fans thought Borthwick was preparing to replace Smith against Australia, their jeers almost matched those decibels.\nSo, where is the doubt? Where is the duel?\nWhile Marcus Smith has been excellent, results haven't been.\nIn the seven matches that he started at 10 last year, England won only two - both against Japan.\nMeanwhile, Fin Smith is a precocious understudy.\nThe 22-year-old plays flat, picking passes and poking holes while close enough to the defensive line to sniff a potential tackler's pre-match snack.\nHe steered Northampton to the Premiership title last season, marshalling a backline that includes fellow England internationals Tommy Freeman, George Furbank and Ollie Sleightholme.\nIf selected, he and Saints' team-mate Alex Mitchell would form a pre-baked half-back partnership.\nWhile Marcus Smith often operates with a gain-line battering ram at 12, Fin Smith's usual inside centres - Rory Hutchinson or Fraser Dingwall - more closely match the playmaker skills of Henry Slade, England's current occupant.\nMany of Marcus Smith's best moments have come in pockets of space that open up behind the backline or after multiple phases - the sort of opportunities that are often easier to access from full-back.\nCould the moving parts of the puzzle need another nudge?\nIn Marcus Smith might England have found their virtuoso soloist, but lumbered him with the conductor's baton as well?\nAs a former England age-grade team-mate of Marcus, Dingwall has played outside both Smiths.\n\"They are very different players, but have both have some really good strengths,\" he told BBC Radio Northampton's Saints Show.\n\"Fin's ability to bring everyone into the game is really impressive and he is bringing out more and more of his running game.\n\"Marcus has this natural ability to break lines and take people on himself. He sees opportunities slightly differently to Fin. Fin will do it as a unit, while Marcus has the ability to do it on his own, which is very impressive.\n\"If I was to play with Fin, I know that he would allow everyone else to come into the game. Playing with Marcus you are probably thinking more about how you can create opportunities for him.\"\nDingwall went on to explain how Fin's finest abilities are perhaps too subtle to make most showreels.\n\"I think his ability to see space for others is the cool thing,\" he added.\n\"He finds soft shoulders for other people. He might square up at the line to bring someone else into the game or use someone on his shoulder to manipulate a defender and give a team-mate space further along the line.\n\"Essentially he makes decisions based on what the defence is showing him when he has the ball in hand, picking off space in between defenders through timing of the pass and driving at the line.\"\nSlade, who will start at 12 in the Aviva Stadium, has a similar assessment; there is a lot more improvisation in the script when playing alongside Marcus Smith.\n\"Marcus attacks in a different way to most 10s really,\" Slade told Rugby Union Weekly.\n\"He's obviously a talented runner himself so if he sees something he's got to drop what preconceived idea he had just go with it and react.\"\nMarcus Smith's versatility is the curiosity in the equation. He insists he is a fly-half, but has been picked at full-back regardless. None more so than by Borthwick.\nSmith started at 15 three times in England's Rugby World Cup campaign in France.\nThe performance that might stick most in Borthwick's mind though followed his drop-goal heroics against Ireland.\nAfter seven minutes away to France in Lyon last year, full-back Furbank limped off with a tweaked calf, with Marcus Smith trotting on to replace him.\nThe Harlequins playmaker scored a try - with a superb support line and step - and then set up another, coming in at second receiver outside Ford to put Freeman into the corner.\nSmith isn't a complete full-back.\nHis tackling is better than his critics suggest, but his appetite for contact isn't always matched by execution.\nIn Lyon, he was caught out in the wide channels. Against Australia, he bit in on Len Ikitau, allowing Max Jorgensen to streak away for a game-winning score.\nAt 5ft 9in tall, he will never command the air like Freddie Steward either.\nYet backfield might turn out to be where he can sprinkle stardust most effectively.\nVictories over Ireland and then France would cement him at 10.\nFord, a cool hand in the heat of battle and far from done at 31, could well force his way back into contention.\nBorthwick might decide that Fin's time as a starter is a season or so away.\nBut the Smith conundrum is certainly not solved for good.", "url": "https://www.bbc.com/sport/rugby-union/articles/cd7d27x9yxgo"}