{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:36:22", "date_modify": "2025-05-20 14:36:22", "date_publish": "2023-07-28 15:18:27", "description": "'Lennon Miller will win us the league!'", "filename": "sport_articles_c3gdplede8qo_1747751782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1741/live/665d8140-2d58-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3gdplede8qo_1747751782.html", "title": "'Lennon Miller will win us the league!'", "title_page": "'Lennon Miller will win us the league!' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It’s Motherwell manager Stuart Kettlewell’s first full season in charge at Fir Park and he has to figure out how to solve the conundrum of Kevin van Veen no longer being available to start up top.\nSpeaking to the BBC's Scottish football podcast, Motherwell fan Jenna Thomson reckons a few more recruits are needed to find the goals this season.\nShe said: “It’s a new season now, it’s a new start, we’ve got Kettlewell at the wheel.\n“Obika has huge boots to fill [after Van Veen’s departure], he’s taken over the number nine jersey.\n“I am feeling hopeful but I feel we could definitely use a couple of extra options up-front, at least two more I think, to really pad things out and try and figure out the best options for ourselves.\nDespite their star striker departing, another talent is already showing signs of great promise at Fir Park.\n“One of the best things we could do as a club right now is to try and get Lennon Miller on some sort of long-term deal,” she added.\n“If we can get him tied down to us for at least another two years, if not three or four, we’ll be laughing ourselves all the way to the top of the Premiership!\n“The talent that boy has so far is amazing.\n“It’s such a beautiful thing to watch, it really does revitalise us as fans because it gives us something to root for as well, he’s a homegrown talent for us.”", "url": "https://www.bbc.com/sport/articles/c3gdplede8qo"}