{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:25", "date_modify": "2025-05-21 05:35:25", "date_publish": "2025-02-07 07:02:58", "description": "Katie Taylor's ambition to fight at Dublin's Croke Park stadium this year has been dampened by the Gaelic Athletic Association.", "filename": "sport_boxing_articles_c8d98y77em1o_1747805725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b132/live/053f7120-e521-11ef-a3c5-3b800e6443d5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c8d98y77em1o_1747805725.html", "title": "Katie Taylor: GAA 'can't see' bout at Croke Park in 2025", "title_page": "Katie Taylor: GAA 'can't see' bout at Croke Park in 2025  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Katie Taylor's ambition to fight at Dublin's Croke Park stadium this year have been dampened by the Gaelic Athletic Association (GAA).\nThe two-weight undisputed champion has been long linked with a bout at the 82,000-capacity stadium after fighting twice at Dublin's 3Arena.\nThe 38-year-old successfully defended her light-welterweight world titles with victory over Amanda Serrano in November 2024 in Texas.\nSpeaking to BBC Sport NI in January, Taylor's promoter Eddie Hearn said he wanted to deliver a bout at Croke Park for the Irishwoman but the GAA, who own the stadium, say there has been no contact about hosting a fight there this year.\n\"Eddie hasn't been in touch with us. It flashes up every so often but no, we haven't been contacted,\" stadium director Peter McKenna, external told RTE Sport.\n\"The approach seems to be megaphone diplomacy, throw everything at it and something will happen in that sense.\"\nTaylor won Olympic gold for Ireland at London 2012 and turned professional in November 2016, winning her first world title at lightweight a year later in Cardiff.\nShe went on- to become undisputed champion at lightweight and light-welterweight, losing the latter titles to Chantelle Cameron in May 2023 before winning them back in a rematch in November 2023.\nThe Bray native has fought across the UK and USA in big stadium fights but a date at the famous 82,000-capacity stadium in her home country has remained elusive - something that does not seem likely to change this year.\n\"Katie Taylor is a magnificent athlete and I think everyone is very, very proud of what she's achieved as an athlete, but to fill Croke Park with 80,000, you need an undercard, you need a whole razzmatazz to go with it,\" McKenna added.\n\"Those things can't be done in a short period of time.\n\"The calendar, really there's not a lot of space to say, 'yeah, we could fit it in on that weekend'. What time of the year would it be on? We have Oasis and Robbie Williams [in August].\n\"Even getting an event management plan together, getting the City Council to approve it and so on, there'd be a fair bit of work in that.\n\"So I think it's a kite-flyer rather than genuine. I can't see it happening because we haven't heard about it, bar reading in the papers.\"", "url": "https://www.bbc.com/sport/boxing/articles/c8d98y77em1o"}