{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 05:14:07", "date_modify": "2025-05-21 05:14:07", "date_publish": "2025-01-23 11:28:45", "description": "F1 drivers face bans if they repeatedly swear or criticise the sport's governing body under changes to the FIA's sporting code for the 2025 season.", "filename": "sport_formula1_articles_c78x03252mpo_1747804447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5cd0/live/7351f740-d974-11ef-a5c8-1da73bd59591.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c78x03252mpo_1747804447.html", "title": "Formula 1 drivers face race bans for swearing or criticising FIA", "title_page": "Formula 1 drivers face race bans for swearing or criticising FIA - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Formula 1 drivers face race bans if they repeatedly swear or criticise the sport's governing body under new rules introduced this year.\nChanges to the FIA's sporting code for the 2025 season codify the steps to a potential race ban for drivers deemed guilty of such offences.\nThey mean that if a driver commits three such offences they are at risk of a \"one-month suspension plus deduction of championship points\".\nThe Grand Prix Drivers' Association (GPDA) said it had \"no comment on that matter for the time being\".\nBut a source close to one top driver told BBC Sport the move was \"ridiculous\", adding: \"He [FIA president Mohammed Ben Sulayem] acts like a dictator\".\nMultiple sources have told BBC Sport that \"a lot of\" people at the FIA were against the move.\nOne source said it was pushed through on a \"snap e-vote and with no consultation with other stakeholders or the GPDA or the FIA's own drivers' commission\".\nAnother said it was \"not right\" to act in this way and questioned why this could not have been scheduled for discussion at the next meeting of the World Motor Sport Council (WMSC).\nThe changes mark the latest in a series of moves by the FIA which have been seen as attempts to stifle dissent or criticism of Ben Sulayem.\nThe most recent was a set of changes to the FIA statutes that opponents said would reduce accountability at the FIA, which were introduced in December at the end of a year in which a series of allegations had been made about the conduct of Ben Sulayem.\nAnd they come less than two months after GPDA director George Russell, the Mercedes F1 driver, said he and his colleagues were \"a bit fed up with\" the FIA leadership.\nThe changes for this year define heavy fines and a rising sequence of punishment for drivers guilty of breaching the sporting code.\nF1 drivers and others in top-level championships such as world rallying, world endurance and Formula E are subject to fines four times the standard amount.\nFor international-level drivers, a first offence is punishable by a 40,000 euro (£33,800) fine; a second offence by an 80,000 euro (£67,600) fine and a suspended one-month suspension from competition; and a third offence by a 120,000 euro (£101,000) fine and one-month suspension.\nThe penalties apply to all FIA licence holders, which would include F1 team principals.\nAn FIA spokesperson said the changes were an attempt to \"further enhance transparency and consistency in decision-making\".\nThe spokesperson added: \"The aim of this new appendix is to provide clear guidance to stewards regarding the penalties for violations of specific international sporting code articles.\n\"By establishing a more structured framework, the FIA seeks to ensure that penalties are applied uniformly and transparently, benefiting both stewards and drivers/competitors.\n\"Stewards have the authority to decide what penalty to enforce in the event of a breach of the the international sporting code and/or the applicable FIA regulations.\n\"Stewards retain the discretion to take into account any mitigating and/or aggravating circumstances as well as the nature and location of the event, to tailor the penalty to the specific situation.\"\nThe FIA did not respond to questions as to the method of passing the vote.\nLast year, stewards did not have it within their power to impose a race ban on a driver.\nThe spokesperson added: \"All major governing bodies have similar rules/fines to protect the integrity of the sport. The FIA is not alone in fining competitors for misconduct.\"", "url": "https://www.bbc.com/sport/formula1/articles/c78x03252mpo"}