{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:38", "date_modify": "2025-05-21 07:41:38", "date_publish": "2024-12-23 20:56:51", "description": "Rangers manager Philippe Clement does not think the busy festive period is conducive to good football, but says he will not accept any excuses regarding the schedule from his players", "filename": "sport_football_articles_c5y423lyee6o_1747813298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6e1c/live/6b24b050-c16c-11ef-95f6-e57573aa8b55.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y423lyee6o_1747813298.html", "title": "Clement will not accept excuses over busy schedule", "title_page": "Rangers: Philippe Clement will not accept excuses over busy schedule - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers manager Philippe Clement does not think the busy festive period is conducive to good football, but says he will not accept any excuses regarding the schedule from his players.\nThe Ibrox side have 11 matches to play between now and the end of January, as they compete in the Scottish Premiership, Scottish Cup and Europa League.\nWith no winter break this season, Clement says he will have to rotate his squad in order to maintain both performance and fitness levels in the coming weeks, starting at St Mirren on 26 December.\n\"This is the first time in the history of football that this has happened so we need to have a squad that's physically and mentally ready for that,\" Clement said.\n\"The more you complain about it, the more excuses you have, and I don't want to give excuses to the team because they all want to play football, they all want to win things.\n\"It's like running a marathon but only wanting to run 20 miles. Those are the rules, that's what was decided. Is it good for football? I don't think so and everybody agrees with that but we need to focus on ourselves and be ready.\n\"And in that way it can be an advantage for our group of players that there needs to be a rotation. It means everybody has to be on their toes, ready to show themselves as there is more opportunity to get chances.\n\"But then you need the depth in your squad to keep the same quality and that's going to be the challenge for us in the next few weeks.\"\nThe Belgian manager anticipates a \"big challenge\" in Paisley on Thursday and emphasised the need to win individual battles against Stephen Robinson's team.\nRangers moved above Aberdeen into second in the league with a victory against Dundee last time out, while the Buddies battled to a 2-1 win over Ross County and sit sixth.\n\"We know St Mirren is a big challenge,\" Clement added. \"It's a team with lots of physicality and a manager who always prepares his team really well.\n\"We know it's going to be a tough battle and we'll need to compete to win and then you can show your football quality. If you don't win your duels, you'll get into trouble.\"\nClement says the physicality of Scotland's top flight is far from unique in Europe, and is used to that side of the game from his time as a manager in Belgium and France.\nThe former Club Brugge and Monaco boss also believes his midfield trio of Nicolas Raskin, Mohamed Diomande and Connor Barron will continue to improve in that aspect as the season progresses.\n\"Don't forget that Raskin was injured for eight to nine months so it's impossible to be at your best after that long out right away,\" he said.\n\"Diomande is here less than a year. He had to adapt to things. Barron knows the league but is still a young player who can still grow, that's normal.\n\"The three of them are in the midfield and it's important to win the duels, it's important in Scotland.\n\"People always say this about Scotland but the Belgian league is also the same, in the French league it was the same. It's not as if you don't have physicality there.\n\"You need it in every league. I think in every good league it's a big part of football, an important part of football.\"", "url": "https://www.bbc.com/sport/football/articles/c5y423lyee6o"}