{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-04-26 03:50:47", "date_modify": "2025-04-26 03:50:47", "date_publish": "2025-03-05 12:25:39", "description": "Fenerbahce boss Jose Mourinho says \"Celtic and Rangers are two big clubs with incredible history\" and managing in Scotland appeals to him.", "filename": "sport_football_articles_cn0jq7xp9zvo_1745639447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82c5/live/620d6b40-f9b8-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn0jq7xp9zvo_1745639447.html", "title": "Jose Mourinho open to managing Celtic or Rangers", "title_page": "Jose Mourinho open to managing Celtic or Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fenerbahce boss Jose Mourinho says managing in Scotland appeals to him.\nMourinho, who is preparing to face Rangers in the last 16 of the Europa League, is attracted by the passion of Scottish football.\nHe is content with life in Turkey but did not rule out the prospect of taking over at Celtic Park or Ibrox one day when asked if working in Scotland would interest him.\n\"In this moment, no, because I have a job,\" the 62-year-old told a media conference before the first leg against Barry Ferguson's side in Istanbul.\n\"It's a job that motivates me and demands loyalty. But why not in the future?\n\"People can say the Scottish league is a league of two teams, but it is a league of passion. Passion in football is everything.\n\"To play in empty stadiums and competitions where there is not that fire of the passion does not make any sense.\n\"Celtic and Rangers are two big clubs with incredible history also in Europe. I have lots of respect. They are big clubs with big fan bases, expectations.\n\"Celtic has a fantastic coach in Brendan [Rodgers]. Rangers has Ferguson now and I am not searching for a new job.\"\nMourinho is looking forward to facing Ferguson as the interim Ibrox boss prepares for his first European tie - and suggested his side have a tougher task than if Philippe Clement was still in charge.\nThe Belgian criticised Mourinho's style of football when the draw was made.\n\"I know his history as a football player for Scotland and for Rangers,\" the Portuguese said about the former captain of the national team.\n\"I don't know much about his career as a coach. I respect the emotional connection between him and his club. That is a very important thing, the connection between the fans and the coach.\n\"You can tell me he doesn't have much experience in Europe as a coach, but I prefer to go on the positive side.\n\"It will be much more difficult against him than the previous coach. The previous coach was more worried about philosophy. Ferguson will be more pragmatic. It will be hard for us but it will be hard for them.\"\nMourinho says Rangers fans still thank him for beating Celtic in the Uefa Cup final in 2003, when his Porto side won a thrilling game in Seville.\nIt was the Mourinho's first European final and 12 months later he led Porto to the Champions League title.\n\"It's true. Not so much here in Turkey, although maybe this week it will happen,\" he added.\n\"Especially in London, some Rangers fans come up to me. But of course that was a big final, my first European final.\n\"Part of my formation was in Scotland - I have friends blue and green. We are very happy to go to Scotland and play a Scottish team.\"\nMourinho spent time in Scotland during his formative years as a coach as he gained his B Licence and has warm memories of his time on the Ayrshire coast in particular.\n\"The Largs pubs... a disaster. I was only drinking sparkling water,\" he said.\n\"But it was fantastic. From a learning point of view and a human point of view. They were the biggest guys in Scottish football at that time.\n\"It was very good on coaching - sometimes badges are just badges, but this was different.\n\"It was amazing for me. I went there with my university degree - I was still playing, at a low level, but still playing. That coaching course and the methodology level was different.\n\"After that so many times when I am asked by young coaches, 'where would be a good first step?' I say they should go there.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn0jq7xp9zvo"}