{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:50:27", "date_modify": "2025-05-20 14:50:27", "date_publish": "2023-07-25 06:59:12", "description": "Before the third season of The Hundred begins, get to know Manchester Originals and find out who their key players will be.", "filename": "sport_cricket_66228524_1747752627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/122B3/production/_130491447_-3d4c929f-6abd-44f8-977d-2195f5623d0a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66228524_1747752627.html", "title": "The Hundred 2023: Meet Manchester Originals as Sophie Ecclestone & Richard Gleeson name players to watch", "title_page": "The Hundred 2023: Meet Manchester Originals as Sophie Ecclestone & Richard Gleeson name players to watch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport has worked with data analysts CricViz to look at the strengths and weaknesses of each side.\nMen's team\nLast year's runners-up Originals have firepower and depth throughout their batting line-up, but on the face of it they lack left-handed options with Tom Lammonby and Max Holden likely to warm the bench - this may bring both leg spin and left-arm spin into play for the opposition.\nThe counter point here is that right-handers Buttler, Laurie Evans and Wayne Madsen have excellent records facing spinners who turn the ball away from them, capable of covering a potential threat.\nWanindu Hasaranga will be a big miss once again, the Sri Lanka spinner has been replaced by Pakistan leg-spinner Usama Mir, who impressed for Worcestershire in the Blast.\nThe Originals attack will be spearheaded by Josh Little and Richard Gleeson, two bowlers capable of bowling at high pace in all phases of the innings.\nTom Hartley's left-arm spin should tie down right-handed batters while the pace all-round talents of Jamie Overton, Paul Walter and off-spinner Ashton Turner all bring different skillsets to skipper Buttler, who should have enough options to adapt to the opposition and conditions.\nWomen's team\nWith the third pick in the draft, Manchester Originals opted for elegant South African batter Laura Wolvaardt, whose cover drive is sure to draw admiration at Old Trafford when coupled with the brutal ball striking of West Indies' Deandra Dottin.\nEngland's Emma Lamb will be expected to do a lot of the heavy lifting with the bat, as the only other frontline batter with top-level international experience.\nThe Originals will be strong in the spin bowling department, with the world's best women's bowler Ecclestone leading the attack, paired with the Hundred's leading wicket-taker Amanda-Jade Wellington, who has joined from Southern Brave.\nPace bowling remains an issue though. Katie George adds quality to the line-up alongside the emergence of 17-year-old Mahika Gaur who is an exciting prospect on the fast and bouncy pitches in Manchester.\nHowever, with questions over Dottin's fitness to bowl, Originals may find themselves searching for quality bowling options as the tournament goes on.", "url": "https://www.bbc.com/sport/cricket/66228524"}