{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 14:11:07", "date_modify": "2025-05-20 14:11:07", "date_publish": "2023-07-30 07:03:23", "description": "Para-swimmer Grace Harvey hopes her balancing act can pay off at this week's World Championships in Manchester.", "filename": "sport_disability-sport_66251151_1747750267.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/171DA/production/_130428649_gettyimages-1481979892.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66251151_1747750267.html", "title": "Para Swimming World Championships: Grace Harvey on balancing sport and study", "title_page": "Para Swimming World Championships: Grace Harvey on balancing sport and study - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Para-swimmer Grace Harvey is hoping her balancing act in and out of the pool can keep her on top of the world at this week's World Championships in Manchester.\nThe 24-year-old goes into the event as defending champion in the SB5 100m breaststroke event.\nBut the Tokyo Paralympic silver medallist combines training with studying for a Masters in Public Dental Health at the University of Manchester.\n\"I'm incredibly fortunate to live both the life of a student and of an athlete performing at the highest level,\" she told BBC Sport.\n\"There are very few people who do the two at the same time and to achieve well at both is something I want to do. It is quite difficult balancing them and a lot of it involves really good time planning.\n\"Sport has opened my eyes to so many other things that I wouldn't have got by only being a student, and it took me a long time to realise that there are so many experiences I get from sport which can be transitioned into the workplace.\n\"I also want to use my platform as an athlete to champion the three things I am passionate about - academia, sport and dental health.\"\nHarvey, who has cerebral palsy and is a wheelchair user, is part of a 28-strong British team which also includes Bethany Firth, Maisie Summers-Newton, Stephen Clegg and Ellie Challis, who were also victorious at last year's World Championships in Madeira.\nCompetition starts on Monday, with Harvey's breaststroke event on Friday, and having been based in Manchester for the past six-and-a-half years, she is hoping to make home advantage count at the newly refurbished Aquatics Centre.\nBut the Hertfordshire para-swimmer, who also has an undergraduate degree in immunology, is looking towards her long-term future with an ambition to study dentistry.\nThe dual demands on her life have involved switching her undergraduate degree to part-time; she is now completing her Masters over two years as she builds towards this week's championships and next year's Paris Paralympics.\n\"I want to go into special care or community dentistry and make a difference, because I feel there are so many unmet needs and health inequalities within our society and also globally,\" she explains.\n\"I really wanted to understand how dental policy is implemented, the challenges around it and the role of dental care professionals in other areas like global women's health - things I felt empowered by - to help me discover the big picture.\"\nHarvey's sporting career has had its setbacks. While London 2012 came too early for her, she suffered the heartbreak of missing out on qualifying for Rio four years later by half a second.\nBut her persistence was rewarded with her silver in Tokyo and gold at last year's Worlds, where she also claimed 200m individual medley silver and 100m freestyle bronze, before a silver at the Commonwealth Games in Birmingham, where she competed against less-impaired swimmers in the SB6 event.\nPreviously a backstroke specialist, she only started racing breaststroke in early 2021 and belied her lack of experience to finish behind defending Paralympic champion Yelyzaveta Mereshko of Ukraine in Tokyo.\nBut coming into this week's event she is now a more seasoned campaigner and has also spent time this year in Germany training alongside Tokyo bronze medallist Verena Schott, who will be her main rival at the Worlds.\n\"In Manchester I am the only swimmer in my category in the training group, which can be quite isolating, so it has been good to work alongside someone like Verena to see how I am fitting in,\" she says.\n\"We are both trying to be the best we can be in our sport and it is about how can we make each other faster and what technique can we learn from each other.\n\"Tokyo was only my second major international competition and there was a lot of pressure and anxiety around racing a new event and I didn't really know how to execute the race.\n\"Going into these Worlds, I'm confident I can do the best race that I can. I would love to retain my title and swim a season's best, but they are outcomes. I want to focus on nailing my start off the wall, making sure I really set my stroke up at the start of the race and then see what I have got coming back on the home straight.\n\"I'm really excited to be racing in my home pool and to have family and friends come along to support me.\n\"I am probably the most nervous person when it comes to racing but I have decided that if I am nervous it is because I want it so badly.\n\"We train day in and day out for that one moment when you stand on the blocks and race 100m and I use the nerves and the excitement as that bit extra.\n\"At the end of the day, it is two lengths of breaststroke and you have to swim it fast. But when you are head down and fighting in that last five metres, when it could be the difference between first or second or third and fourth, those nerves are what keep me going.\"", "url": "https://www.bbc.com/sport/disability-sport/66251151"}