{"authors": ["Richard Winton", "www.facebook.com"], "date_download": "2025-05-20 13:57:46", "date_modify": "2025-05-20 13:57:46", "date_publish": "2023-07-31 05:46:23", "description": "The World Cycling Championship in Glasgow will be emotionally wrought for Katie Archibald after partner Rab Wardell's death.", "filename": "sport_cycling_66285102_1747749466.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16178/production/_130588409_gettyimages-1392765596.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66285102_1747749466.html", "title": "UCI World Cycling Championships: Katie Archibald on Glasgow & partner Rab Wardell's death", "title_page": "UCI World Cycling Championships: Katie Archibald on Glasgow & partner Rab Wardell's death - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Being in the midst of a race is Olympic champion Katie Archibald's \"happiest place in the world\".\nIn those moments, nothing else matters. The nerves vanish. The emotional crash has yet to come. It's just her, a bike, and her competitors.\nThat feeling of being free will be heightened at the World Championships in Glasgow over the next week or so.\nIn her home city. At the Chris Hoy Velodrome, the place she first walked into as an 18-year-old with pink hair and a lip ring. The place where the dream began.\nBut dreams don't always come true. Last year was a horrendous one for the 29-year-old.\nInjuries are part of sport. Sometimes they come in quick succession. Shoulder surgery, then a back fracture. Covid, concussion, a broken collarbone. Another operation.\nArchibald was determined to return and represent Scotland at the Commonwealth Games but in late May, six weeks out from Birmingham, she \"went flying over the bonnet of a 4x4\".\nTwo burst ankles and a dented leg were the obvious consequence. But less apparent was the mental toll.\n\"All cyclists get injured. All the time. My collarbones are not good. My hips are wrecked. My knees are useless… but I got to the point where I really wasn't coping,\" she says, in a BBC Sport interview with Hoy.\n\"I ended up with a heart-rate response where I was just terrified all the time. It made training really hard and I was thinking, 'well, if I can't train, I can't do this, and it's all gone'. So I tapped out.\"\nArchibald's focus then became all about immersing herself in partner Rab Wardell's world.\nRab's life was \"a bit of a shambles\" when he and Katie met. But by last summer, she says he had \"figured it out\". He had a coaching business. He made films. He was \"thriving\".\nIn August, he won the Scottish mountain bike cross country championships.\nTwo days later, Archibald woke in their Glasgow flat to find him dead beside her. He had suffered a cardiac arrest in his sleep. He was 37.\n\"I tried and tried, and the paramedics arrived within minutes, but his heart stopped and they couldn't bring him back. Mine stopped with it,\" she wrote on Instagram the following day.\n\"When he left…\" Archibald begins, fighting back tears while talking to Hoy about Rab almost a year later. \"I got on the bike about three days afterwards and I realised I wasn't scared any more.\n\"The worst thing had happened and that anxiety had gone. There was just a total blankness, a pain that really overwhelmed it.\n\"Now I'm back to really relying on the sport as my one grounding thing.\"\nPart of the dream was that Katie and Rab would race in Glasgow - the city they lived in, their city - together.\nHer on the track in the team pursuit, Madison and omnium. Him in the cross country marathon. He'd even designed the course at Innerleithen.\nThat dream has been snatched away but Archibald has taken some slivers of solace from what lies immediately ahead.\nIt will be painful, physically and mentally. It will be emotionally wrought. But it will be imbued with a meaning for her that it won't for almost any other competitor.\n\"It's cathartic for me to tell people how special Rab was,\" she says. \"I'm quite serious about my career, but Rab was quite serious about having fun. He would bring a good time.\n\"His philosophy was 'ride bikes, get outside' and 'chill out, have fun'. We had this life that was mainly just bumming around on your bike and drinking coffee. Every day. It's not fair.\n\"Rab was so involved in this Championships and this dream of a home worlds. He had such a love for sport on two wheels and for Glasgow that's what this whole event is about.\"", "url": "https://www.bbc.com/sport/cycling/66285102"}