{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:27:09", "date_modify": "2025-05-21 07:27:09", "date_publish": "2025-03-28 14:02:03", "description": "Manchester City boss Pep Guardiola does not believe his squad deserve any of the £97m prize money the club would pocket by winning the Club World Cup.", "filename": "sport_football_articles_c8x4xg4wvkvo_1747812429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2cff/live/5e7c1dc0-0bf9-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8x4xg4wvkvo_1747812429.html", "title": "Manchester City 'don't deserve' bonus for winning Club World Cup, says Pep Guardiola", "title_page": "Manchester City 'don't deserve' bonus for winning Club World Cup, says Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola does not believe his squad deserve any of the £97m prize money the club would pocket by winning the Club World Cup.\nWorld governing body Fifa has announced the performance-related rewards for this summer's expanded 32-team event in the United States.\nEurope's major clubs are expected to get the lion's share, with both City and Chelsea - who qualified by winning the Champions League in 2023 and 2021 respectively - in line to collect the biggest prize pot in club football by winning it.\nReal Madrid, Bayern Munich and Paris St-Germain are among the other European heavyweights taking part.\nHowever, even if City triumph in the final at the MetLife Stadium on 13 July, Guardiola feels their overall 2024-25 campaign means players and staff should not receive any additional reward.\nCity were eliminated from the Champions League before the last-16 stage for the first time since 2013 and are currently fifth in the Premier League - and under severe pressure to secure qualification to Europe's elite competition next season.\n\"We don't deserve a bonus this season,\" said Guardiola. \"The bonus, if you win, I don't know how much, it's for the club.\n\"The managers, the backroom staff, the players, we don't deserve - not even a watch.\"", "url": "https://www.bbc.com/sport/football/articles/c8x4xg4wvkvo"}