{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-05-21 07:50:59", "date_modify": "2025-05-21 07:50:59", "date_publish": "2025-05-18 16:41:01", "description": "Brentford 2-3 Fulham: Cottagers show spirit to keep alive slim European hopes", "filename": "sport_football_articles_c14kx0v7l6mo_1747813859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e22/live/906d0f80-3406-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c14kx0v7l6mo_1747813859.html", "title": "Brentford 2-3 Fulham: Cottagers show spirit to keep alive slim European hopes", "title_page": "Brentford 2-3 Fulham: Cottagers show spirit to keep alive slim European hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham had picked up only three points out of a possible 15 going into Sunday's west London derby with in-form Brentford, but they showed tremendous spirit after falling behind to set a new club-record Premier League points tally.\nThe combination play between Adama Traore and Raul Jimenez caused the home side all sorts of problems in an entertaining first half, in which the Mexican twice went close to opening the scoring before his 16th-minute header squirmed under goalkeeper Mark Flekken.\nBryan Mbeumo and Yoane Wissa both scored their 19th Premier League goals of the season to hand the initiative back to Brentford, who would have gone into half-time 3-1 up had Mbeumo managed to beat goalkeeper Bernd Leno from the penalty spot in the 28th minute.\nBut Fulham responded brilliantly in the second half as Tom Cairney – whose contract is set to expire this summer – nodded in his second goal of the season to restore parity once more.\nMarco Silva's side weren't done yet, though, as Harry Wilson – who scored twice in stoppage time to earn Fulham victory in the reverse fixture – curled a sumptuous strike into the corner two minutes later to complete the scoring.\nEuropean qualification may be out of the Cottagers' hands, but a top-half finish remains within their grasp.\nFulham had picked up only three points out of a possible 15 going into Sunday's west London derby with Brentford, but they showed tremendous spirit after falling behind to come away with all three points.\nThe combination play between Adama Traore and Raul Jimenez caused the home side all sorts of problems in an entertaining first half, in which the Mexican twice went close to opening the scoring before his 16th-minute header squirmed under goalkeeper Mark Flekken.\nBryan Mbeumo and Yoane Wissa both scored their 19th Premier League goals of the season to hand the initiative back to Brentford, who would have gone into half-time 3-1 up had Mbeumo managed to beat Bernd Leno from the penalty spot in the 28th minute.\nBut Fulham responded brilliantly in the second half as Tom Cairney – whose contract is set to expire this summer – nodded in his second goal of the season to restore parity once more.\nMarco Silva's side weren't done yet, though, as Harry Wilson – who scored twice in stoppage time to earn Fulham victory in the reverse fixture – curled a sumptuous strike into the corner two minutes later to complete the scoring.\nEuropean qualification is out of the Cottagers' hands, but a top-half finish remains within their grasp.", "url": "https://www.bbc.com/sport/football/articles/c14kx0v7l6mo"}