{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-04-26 04:03:43", "date_modify": "2025-04-26 04:03:43", "date_publish": "2025-03-03 19:49:24", "description": "International Olympic Committee presidential candidate Kirsty Coventry says it's time the organisation was led by a woman.", "filename": "sport_olympics_articles_cz61341xv0jo_1745640223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4bcc/live/7b206be0-f84c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_olympics_articles_cz61341xv0jo_1745640223.html", "title": "Kirsty Coventry: Time the International Olympic Committee was led by a woman", "title_page": "Kirsty Coventry: Time the International Olympic Committee was led by a woman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "International Olympic Committee (IOC) presidential candidate Kirsty Coventry says it's time the organisation was led by a woman - but wants members \"to have confidence in me that I'm the right person\".\nThe 41-year-old former swimmer would also become the youngest - and the first from outside Europe or North America - to lead the organisation in its 130-year history if she beats her six male rivals in a vote later this month.\n\"I don't think it's just about gender, the same way that I don't think it's just about being the only African candidate,\" the Zimbabwean sports minister told BBC Sport.\n\"It really is about, 'what does the movement need today'?\n\"I think being a double Olympic champion and having the experiences that I've had within our movement and outside, all bring a lot of value to ensuring I could lead this organisation.\"\nCoventry, who won the 200m backstroke at the 2004 and 2008 Olympics and is Africa's most-decorated Olympian, is \"very positive\" about her chances of becoming sport's most powerful figure when IOC members make their choice in Greece on 20 March.\nWhen asked how she felt about being seen as the preferred choice of outgoing president Thomas Bach after his 12-year tenure, Coventry added: \"He's allowed the candidates to do what we need to do and talk to the members and it's [their] decision. He's been fair to all of the candidates.\"\nCoventry wants to \"try to challenge the status quo and to bring change\".\n\"Being able to showcase the biggest and most wonderful sports event in the world, where you have athletes from all different backgrounds coming together…that for me is what the world needs right now,\" she added.\n\"We have to make very good decisions so that this movement can remain relevant for generations to come. And, for me, being a mum of two young girls, I feel the weight on my shoulders is maybe a little bit more than that of the other candidates because I'm going have a constant reminder that I need to not mess this up.\"\nThe IOC currently allows each international federation (IF) to set its own gender eligibility rules, and in recent years a number have barred athletes who have undergone male puberty from competing in elite female competition, amid concerns inclusion may come at the expense of fairness and safety.\nCoventry has been an IOC executive board member since 2023, but confirmed that - as with rival presidential candidate Lord Coe - she is now backing a blanket ban of transgender women from competing in female Olympic sport.\n\"I believe with the work that has been done with the IFs, the rules they have put in place, you can see there has been research done where it's showing a disadvantage to women, to the female category\" she said.\n\"From the conversations that I've had now, a lot of the international federations want the IOC to take a more leadership role. We have more facts, there's more science and medical research being done.\n\"We need to protect the female category and I think it's time right now for the IOC to take that leading role.\"\nThe IOC was engulfed in controversy at the Paris Games last summer when Algeria's Imane Khelif won the women's welterweight boxing gold medal - a year after being disqualified from the World Championships for reportedly failing a gender eligibility test.\nThe IOC cleared the 25-year-old to compete - along with Taiwan's Lin Yu-ting, who was also banned by the suspended International Boxing Association (IBA). Both fighters have insisted they are women, and there is no suggestion they are transgender.\nWhen asked if she and her IOC colleagues could have avoided the episode, Coventry added: \"There are always lessons we can learn. There are always going to be things we can't foresee, but we should do the best to ensure something like that doesn't play out again at an Olympic Games.\"\nCoventry has faced criticism in Zimbabwe in her capacity as sports minister since 2018, but defended her association with the government of controversial president Emmerson Mnangagwa.\nIn 2022 Fifa banned Zimbabwe from international football over governmental interference in the running of the game. Last year the United States also imposed sanctions on Mnangagwa and other senior officials for corruption and human rights abuses. Zimbabwe's government condemned the decision.\n\"I don't believe you can really create change if you don't have a seat at the table\" said Coventry.\n\"It's not been the easiest thing but I have had incredible support and we are making a difference. Our sports are starting to do much better. With change it takes time, but I am someone that doesn't want to stand on the side.\n\"Sometimes you win, sometimes you don't, but I want to be able to try. I'm going to make my country better.\n\"Having to navigate very sensitive issues has definitely given me extra 'armour' if I can put it that way for what [the IOC] will face in in the future, and we're going to have to navigate difficult leaders that have different opinions on things. But what will help us to navigate that is to not verge away from our Olympic charter, our values.\"\nThe other six candidates for the IOC presidency are France's David Lappartient, Japan's Morinari Watanabe, Prince Feisal al Hussein of Jordan, Spaniard Juan Antonio Samaranch Jr, Swede Johan Eliasch and the UK's Lord Sebastian Coe.", "url": "https://www.bbc.co.uk/sport/olympics/articles/cz61341xv0jo"}