{"authors": ["Mike Whalley", "www.facebook.com"], "date_download": "2025-04-26 06:13:27", "date_modify": "2025-04-26 06:13:27", "date_publish": "2025-03-02 04:18:14", "description": "England suffer a record defeat at the hands of world champions Australia in Las Vegas as Tamika Upton scores five of their 17 tries.", "filename": "sport_rugby-league_articles_czjenlkjpgjo_1745648007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b78a/live/4bd726e0-f715-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_czjenlkjpgjo_1745648007.html", "title": "Australia 90-4 England: Lionesses suffer record defeat in Las Vegas", "title_page": "Australia 90-4 England: Lionesses suffer record defeat in Las Vegas - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England suffered a record defeat at the hands of world champions Australia in Las Vegas as Tamika Upton scored five of her team's 17 tries.\nStuart Barrow's Lionesses faced by far their biggest test since a World Cup semi-final defeat by New Zealand two-and-a-half years ago - and were outclassed comprehensively by the Jillaroos.\nJulia Robinson and Jessica Sergis scored hat-tricks and Isabelle Kelly crossed twice, with Tiana Penitani, Shannon Mato, Jakiya Whitfeld and Keilee Joseph also registering.\nEngland did at least have the final word as Georgia Roche, who plays her club rugby in Australia for Newcastle Knights, scored with the final play of the match.\nBut it was a dreadful night for England, with prop Vicky Whitfield carried off on a stretcher and taken to hospital for precautionary checks after being injured in a collision with Sarah Togatuki 10 seconds into the second half.\nThe margin of defeat is the biggest suffered by the Lionesses - either as England or Great Britain - passing their previous record, a 52-4 loss to New Zealand at the 2017 World Cup.\nEngland's last meeting with Australia was at the World Cup in Sydney eight years ago - where they were beaten 38-0.\nBarrow and his players knew it was always going to be asking a lot to beat a side packed with NRL Women's Premiership talent, but the margin of the defeat came as a huge shock.\nRoche was in tears on the pitch at full-time, and was embraced by both her head coach and Australia's players.\nThe tone was set early, with four Australia tries in the opening 15 minutes: Robinson dived over in the corner from Ali Brigginshaw's pass, and then Penitani scored after a fine break by Kezie Apps was held up by England's Anna Davies - before two sublime kicks from the excellent Tarryn Aiken set up first Upton, then Mato.\nUpton raced through twice to complete a first-half hat-trick, Kelly dodged the England defence for her first, and Robinson scored the eighth try of the half from another Aiken set-up.\nAfter a long hold-up at the start of the second half as England's Whitfield was treated on the pitch, Australia continued to add to the scoreboard. Kelly was set up unselfishly by Yasmin Clydsdale, Upton crashed over again for her fourth, then added a fifth, before Sergis - having had a try ruled out for a push - set up Robinson for her third.\nSergis then scored one that did count from Aiken's pass, and was fed by Upton to dart through for a second, with Whitfeld going over in the corner in between.\nIn the final seven minutes, Sergis completed a second-half hat-trick, and Keilee Joseph scored easily following another Apps break - before Roche had the last word for England, and got the biggest cheer of the night.", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/czjenlkjpgjo"}