{"authors": ["Constantin Eckner", "www.facebook.com"], "date_download": "2025-05-21 05:12:28", "date_modify": "2025-05-21 05:12:28", "date_publish": "2025-01-23 10:02:33", "description": "Omar Marmoush has joined Manchester City, but how will he fit into Pep Guardiola's team?", "filename": "sport_football_articles_cly55627y14o_1747804348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4230/live/367f1840-d4db-11ef-9aad-49f5f16e12eb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly55627y14o_1747804348.html", "title": "Omar Marmoush: How Man City may use Egyptian forward & how he was used at Eintracht Frankfurt", "title_page": "Omar Marmoush: How Man City may use Egyptian forward & how he was used at Eintracht Frankfurt - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is rare that a 25-year-old suddenly emerges as a £59m signing, almost from nowhere.\nWhile Omar Marmoush has been a relatively successful goalscorer in the German Bundesliga for a few seasons, he has had to patiently wait for his big break before being announced as Manchester City' s third January signing on Thursday after a prolific start to the season.\nHe arrived in Germany from the Egyptian second division as an 18-year-old, having been spotted by ex-Manchester United winger Ryan Giggs, spending a couple of seasons in the youth side before making his senior debut in May 2020.\nGiggs, then an analyst for Uefa, saw Marmoush at an under-17s tournament in Dubai and told an agent about him, who alerted Pierre Littbarski, head of scouting at Wolfsburg.\n\"Marmoush was really fast at that time, took a lot of risks, was technically strong and did some surprising things.\" Littbarski said later. \"He was an uncut diamond.\"\nWolfsburg invited Marmoush, 17 at the time, to a trial session and subsequently signed him for the club's youth academy.\n\"Imagine this, he goes from Cairo to Wolfsburg – that is a completely different world,\" Littbarski added.\n\"He just wanted to play. This is a typical street footballer. When he comes into such a passing-oriented system, then it is not easy.\"\nBack in 2021, the versatile forward was surplus to requirements and sent out on loan by Wolfsburg.\nHe had loan spells at St Pauli and Stuttgart, only displaying his abilities in spurts but never over the course of a full season.\nIt was the move from Wolfsburg to Frankfurt on a free in 2023 that turned Marmoush into a sought-after striker that has now seen Manchester City acquire his services.\nDespite the serious influx of cash, Frankfurt were not happy when the Blues first contacted them about a potential January transfer, because Marmoush has become their life insurance, repeatedly scoring game-winning goals right until the very end.\nFrankfurt can feel grateful for the 37 goals and 20 assists which he delivered in 67 games but, at the same time, the Egyptian ought to be thankful to Frankfurt and particularly manager Dino Toppmoller for bringing out the best in him.\nAfter a 2-0 win over Dortmund last Friday, Marmoush, who did not play in the game, said goodbye to the fans and then was celebrated by his team-mates.\nA team-mate of Liverpool's Mohamed Salah for his country, Marmoush has become one of the breakout stars in Europe this season with 20 goals in 26 games for Frankfurt - 15 in the Bundesliga.\nGerman football expert Raphael Honigstein told BBC Sport: \"He is really dynamic, a wide forward who can play through the middle.\n\"Some people have compared him to Mohamed Salah, perhaps not as tricky or as explosive but his finishing is incredible.\"\nToppmoller, a former assistant to Julian Nagelsmann at Bayern Munich, took his first managerial position at a big club when he joined Frankfurt in 2023. And he saw how Marmoush had not been utilised to the best of his abilities at other clubs.\nBecause of his undeniable versatility, he was sometimes employed on the wing as well as a number 10, while his true calling is that of a striker.\nHe also often played as a lone number nine during Frankfurt's 2023-24 campaign and played as part of a two-man frontline alongside Hugo Ekitike this season.\nIn both systems, Marmoush showed his tactical understanding, often dropping in the perfect spaces in between the lines or making deep runs with great timing in behind the defence, while also developing an impressive composure in and around the box.\nMarmoush's confidence has grown to the point that he knows exactly how often he can touch the ball and when to strike before a defender reaches him.\nFrankfurt are a well-coached pressing side who rely on the tactical and spatial awareness of players such as Tunisian Ellyes Skhiri and the experienced Mario Gotze in midfield, as well as smooth co-operation among position groups.\nThe full-backs and wingers need to know how to interact with each other just like the two strikers need to have an understanding of how to interchange positions and occupy different spaces to stretch the backline and disrupt man-marking schemes.\nWhile Marmoush was the more prolific goalscorer of the two, Ekitike did just as good a job as the newly signed City striker because Marmoush often found space when his French forward partner distracted at least one or even two defenders.\nFrom here on, Ekitike will have to shoulder much more of the goalscoring responsibilities, unless Frankfurt find an adequate replacement for Marmoush before the end of the January transfer window.\nAs for Frankfurt, the club are third in the Bundesliga and run the risk of losing ground in the league as well as in the Europa League, a competition they won in 2022.\nThe positive angle is they are flush with money for future signings, as they have become one of the best clubs in Europe in discovering gifted players and offloading them for decent transfer fees.\nWhat's more, the majority of their big sales in the past couple of years have failed to measure up to expectations.\nFrench striker Randal Kolo Muani moved for about £81m from Frankfurt to Paris St-Germain in 2023 and is on the verge of a loan at Juventus.\nAfter a two-year spell with Frankfurt, Serbia forward Luka Jovic was signed by Real Madrid for 60m euros (£50.6m) in 2019 and never made an impact at the serial Champions League winners and is now struggling for a spot at AC Milan.\nSebastien Haller left after 18 months to join West Ham for £45m, but scored just 14 times in 54 appearances. The list goes on and on.\nCity will hope Marmoush's move pays off and he can give the Premier League champions a spark in the attacking department and boost their trophy hopes for the rest of the campaign.", "url": "https://www.bbc.com/sport/football/articles/cly55627y14o"}