{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:41", "date_modify": "2025-05-21 07:10:41", "date_publish": "2025-03-30 00:00:00", "description": "Live text commentary from the SSE Arena as the Belfast Giants host the Manchester Storm in the Elite League", "filename": "sport_ice-hockey_live_c7vzv7qvg45t_1747811441.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_live_c7vzv7qvg45t_1747811441.html", "title": "Belfast Giants v Manchester Storm", "title_page": "Belfast Giants v Manchester Storm - Elite League Ice Hockey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Giants blown away by Storm\nBelfast Giants 1-5 Manchester Storm\nThoroughly deserved victory for Manchester.\nTheir precarious position of trying to secure the final play-off spot appeared to matter much more to the Storm than a Giants side chasing the title because they man-handled the home side.\nThey won the physical battle and every other puck battle all over the ice.\nIt was a poor performance from the Giants, especially considering the circumstances, and they never managed to roll though the gears.\nThe title race is still in their hands - two wins over Nottingham would still do it - but Sheffield and Nottingham are both still alive.\nIt’s a three-team race heading into the final weekend!\nGiants could clinch the Elite League title today\nBelfast Giants v Manchester Storm (16:00 BST)\nThe Giants will play in their fourth straight home game this afternoon with a chance to clinch the Elite League title.\nTheir opposition are the Manchester Storm who require nothing less than the full two points themselves as they look to close the gap on the eight-place Dundee Stars who currently occupy the last playoff spot.\nA win for the Giants coupled with a loss for Sheffield in Fife would be enough for the Giants to win a fourth title out of the past five times the league has been completed, with two years missing because of Covid.\nThe Storm head to the SSE being 5-5 in their last ten and their backs against the wall. A regulation loss tonight followed up by a Stars win would see the last playoff spot be clinched by the Stars.\nThe Giants, are 6-4 in their last ten but are on a three game winning streak.\nA multitude of outcomes for both teams tonight in Belfast - it is sure to be spectacle.", "url": "https://www.bbc.com/sport/ice-hockey/live/c7vzv7qvg45t"}