{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:57", "date_modify": "2025-05-21 05:23:57", "date_publish": "2025-01-23 08:04:33", "description": "Arsenal 3-0 Dinamo Zagreb: Fan views", "filename": "sport_football_articles_c93g2xllkqyo_1747805037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93g2xllkqyo_1747805037.html", "title": "Arsenal 3-0 Dinamo Zagreb: Fan views", "title_page": "Arsenal 3-0 Dinamo Zagreb: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Wednesday's Champions League game between Arsenal and Dinamo Zagreb.\nHere are some of your comments:\nVince: This was how it should have been against Manchester United in the FA Cup. The same kind of dominance with a proportionate output of goals. But without a natural goalscorer, can we stay consistent in the scoring department? There's only about a week left in January.\nSteve: Great result and great work from Kai Havertz and Gabriel Martinelli, polished off with martin Odegaard getting his first goal for a long time! Couldn't be happier and now comfortably onto the knockout stages!\nGuy: Good performance by all the team. The team looked a lot more effective with Ethan Nwaneri on compared to when Raheem Sterling was playing. It was good to see Kieran Tierney get some minutes as well. Sitting third in the table is good and avoiding the extra matches should be the main aim.\nWebmeister: Arsenal may have defeated Dinamo Zagreb with consummate ease but old problems still lingered: in-game defensive fragility and poor finishing. They will have to address these in the next phase of the competition as they will be up against better sides who will ruthlessly punish them.\nRachel: Do the Arsenal coaching team need to take a serious look at training methods and investigate reasons why so many players are out with injuries? Very disappointing to see new players like Riccardo Calafiori have already suffered several muscular problems... is this usual for this player or only an issue since he came to Arsenal? Or are certain players injury prone?\nJeffrey: If it was a dull 3-0 win then that's fine by me. Better going home cold and happy. Good minutes for everyone that played - except Sterling. Not sure of the point of his presence.\nMatthew: Defensively we didn't have much to do but offensively Martinelli looked fantastic and I was happy to see Havertz's performance too. Nwaneri coming back in and straight away - wow! The boy's electric!", "url": "https://www.bbc.com/sport/football/articles/c93g2xllkqyo"}