{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:15", "date_modify": "2025-05-21 06:38:15", "date_publish": "2025-04-01 00:00:00", "description": "Ricky-Jade Jones scores a stoppage-time penalty as Peterborough clinch a thrilling 4-3 victory at relegation-threatened Crawley.", "filename": "sport_football_live_cwyeyw3xvwet_1747809495.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/91b8/live/fb033110-0ee7-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwyeyw3xvwet_1747809495.html", "title": "Posh beat Crawley in seven-goal thriller", "title_page": "Crawley Town 3-4 Peterborough United: Posh beat Crawley in seven-goal thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ricky-Jade Jones scored a stoppage-time penalty as Peterborough clinched a thrilling 4-3 victory at relegation-threatened Crawley.\nJones kept his cool to settle the issue after substitute Ade Adeyemo had floored Abraham Odoh.\nForward Odoh hit a first-half hat-trick in the space of 21 minutes to give Posh a 3-2 advantage at the break.\nBoss Scott Lindsey went into the clash appealing to Crawley's fans to back the team in the same way as they did at Wembley last season when the Red Devils clinched promotion via the play-offs.\nThey made the ideal start when Jeremy Kelly's lofted ball found Armando Quitirna on the edge of the area and he coolly rounded goalkeeper Jed Steer to give the hosts the lead in the 12th minute.\nCrawley keeper Jojo Wollacott preserved the home side's advantage by smartly tipping over a goal-bound free-kick from Tayo Edun, but Odoh made no mistake in the 22nd minute with a low shot at the far post after being set up by Kwame Poku.\nOdoh struck again with a superb half-volley from 15 yards seven minutes later to put Peterborough ahead, but Kelly made it 2-2 after 32 minutes with a deft touch from close range after good work by Kamari Doyle.\nOdoh completed a first-half hat-trick two minutes before the interval, turning the ball home at the far post after Malik Mothersille had combined cleverly with Poku.\nDoyle forced Steer to save with his legs before Rushian Hepburn-Murphy made it 3-3 with his first goal at home for four months, slotting the ball past Steer shortly after the break.\nCrawley piled forward and after Doyle's shot struck a post, Steer parried a shot from Bradley Ibrahim.\nSubstitutes Ryan de Havilland, Mahamadou Susoho and Cian Hayes all went close for Posh in stoppage time before Jones' spot-kick decider.", "url": "https://www.bbc.com/sport/football/live/cwyeyw3xvwet"}