{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 12:40:35", "date_modify": "2025-05-20 12:40:35", "date_publish": "2023-08-03 07:23:59", "description": "Morocco reach the last 16 on their Women's World Cup debut by beating Colombia - eliminating Germany in the process.", "filename": "sport_football_66391725_1747744835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/177CB/production/_130630269_gettyimages-1574365750.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66391725_1747744835.html", "title": "Morocco 1-0 Colombia: Debutants reach Women's World Cup last 16", "title_page": "Morocco 1-0 Colombia: Debutants reach Women's World Cup last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Morocco have reached the last 16 on their Women's World Cup debut after beating Colombia - although the South Americans progress as Group H winners.\nGermany's failure to beat South Korea means Morocco are into the knockout rounds as runners-up.\nAnissa Lahmari scored the only goal via a rebound after captain Ghizlane Chebbak's penalty was saved.\nMorocco - who lost 6-0 to the Germans in their opener before successive wins - will face France in Adelaide next.\nColombia, who earned two wins in their first two matches and finish above Morocco on goal difference, will play Jamaica in Melbourne earlier on 8 August.\nOf the eight debutants at the 2023 Women's World Cup, seven had already exited the tournament before this match. Only Philippines, by beating co-hosts New Zealand, and Portugal in giving the USA a mighty scare, had come close to reaching the knockout stage.\nStep forward Morocco. Reynaud Pedros' side have recovered from their World Cup debut hammering to put in two impressive performances against South Korea and Colombia, and earn historic passage to the last 16.\nThey started brightly here - Ibtissam Jraidi's third-minute shot was turned behind by Catalina Perez at near post, before Chebbak almost caught the keeper out from a well-worked corner - and continued to look the more threatening side until they took the lead.\nJraidi was bundled over clumsily in the area by Daniela Arias, and though Chebbak's spot-kick was saved by Perez, the rebound was turned in by Lahmari.\nAs Germany tried and failed to find a winner against South Korea, Morocco stood sturdy to earn a remarkable and unexpected path into the knockouts.\nAt Qatar 2022, the Morocco men's team became the first African side to reach a Fifa World Cup semi-final. The country is now seeing a second historic football achievement in the space of a year.", "url": "https://www.bbc.com/sport/football/66391725"}