{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:37", "date_modify": "2025-05-21 05:29:37", "date_publish": "2025-01-31 18:15:08", "description": "Some of the goals Dessers has scored are actually incredible - Miller", "filename": "sport_articles_cd9qzv12y5zo_1747805377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ebb/live/13589e40-dfee-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd9qzv12y5zo_1747805377.html", "title": "Some of the goals Dessers has scored are actually incredible", "title_page": "Some of the goals Dessers has scored are actually incredible - Miller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Scotland striker Lee Miller believes Cyriel Dessers uses criticism from fans as \"motivation\".\nDespite being a polarising figure among the Ibrox support, Nigeria striker Dessers continued his impressive recent form in Thursday night's Europa League win over Union St-Gilloise - which sent Rangers through to the last 16 - and has netted 18 goals in 35 appearances this season.\n\"I like him, I know he misses chances and the Rangers fans get on his back but he scores some worldie goals, some really good goals,\" said Miller on the BBC's Scottish Football Podcast.\n\"I thought his hold-up play was really good last night. It's obviously come under criticism but his all-round game can be very good, he's just clumsy at times.\n\"He's a sweet player, he likes to meg people, he likes to get involved and he's very tidy. Do you know what I like about him? He's always just playing with a smile on his face.\n\"He gets absolute pelters. He gets booed on to the pitch, but he'll maybe turn that around and use it as a motivation.\n\"He comes across really well. Generally quite laidback, a likeable person, and some of the goals he has scored actually incredible. The goal against Man United and then the one against Dundee United are incredible finishes.\"", "url": "https://www.bbc.com/sport/articles/cd9qzv12y5zo"}