{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:54:51", "date_modify": "2025-05-20 12:54:51", "date_publish": "2023-08-01 11:55:42", "description": "Can County use comeback as a springboard to success?", "filename": "sport_articles_c72vx60468go_1747745691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/07ce/live/a0ac4730-3061-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72vx60468go_1747745691.html", "title": "Can County use comeback as a springboard to success?", "title_page": "Can County use comeback as a springboard to success? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross Morren, The County Corner podcast, external\nIt’s been 58 days since Josh Sims’ penalty hit the back of the net against Partick Thistle in the Premiership play-off penalty shootout to complete one of the most spectacular comebacks I’ve witnessed in football. (Yes, I may be a little biased in that opinion!). It sent the home fans in Dingwall absolutely delirious, but most importantly it secured Ross County’s Premiership status for another season.\nSo, how can County use that incredible comeback as a springboard to success in the upcoming season?\nOff the pitch, the play-off final drama has galvanised fans into supporting the club now more than ever. There’s been a 23.5% increase in season ticket purchases compared to last season, and the new home kit is also the clubs best selling on record. This kind of support and investment from fans has also helped County on the pitch, and allowed the club to bring in some real quality players.\nEamonn Brophy signing on a permanent basis is an exciting piece of business, and our marquee signing of this transfer window so far. Scoring three goals and two assists during his eight matches on-loan last season and striking up a strong partnership up front with Jordan White before his season was ended due to injury, Brophy made his mark.\nIf he shows the form we know he’s more than capable of, then perhaps a recall to the Scotland squad could be on the cards...\nAlong with Brophy, Jay Henderson has also made the move from Paisley to Dingwall this summer. He impressed with his direct running and technical ability in 21 appearances on-loan at ICT last season, scoring four goals and assisting five which are impressive stats for a young winger.\nHe’ll be spending this season on the other side of the Kessock Bridge alongside his former teammate, Scott Allardice, who shares the target of establishing himself as a Premiership player. A standout in midfield for ICT last season, he’ll add strength and physicality to the County midfield.\nAs it turned out, County fans had an early chance to get to know Kyle Turner during the play-off final last season. Turner was a real driving force in the Partick Thistle midfield, scoring seven goals and assisting a further 16 goals in 50 appearances. I believe Turner is a player who could improve the midfield of several Premiership sides, so convincing him to make the move north is a real coup.\nFans always love to see “one of their own”, a player who’s come through the youth academy and has Ross County in their blood, and that’s the perfect way to describe Josh Reid. Returning to Dingwall, Reid's ready to continue his development and help drive his local club to success.\nI think there’s a strong possibility that County can have a very successful season. As exciting as the ending was to last season, I’d quite like to avoid the play-offs for the foreseeable future!\nMalky’s first target this season will be aim for 10th place, and build from there. There’s a strong core group of players who will be looking to improve on last season, coupled with the quality additions so far and their hunger to prove themselves at their new club, there’s no reason why this squad can’t finish further up the table.\nMy gut feeling is we’ll have enough to comfortably avoid a relegation scrap, but with one or two more additions before the end of the transfer window, the squad could potentially put themselves in the mix for a top-six place come the end of the season...\nPredicted finish: 7th\nStandout player: Yan Dhanda", "url": "https://www.bbc.com/sport/articles/c72vx60468go"}