{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:07:08", "date_modify": "2025-05-21 06:07:08", "date_publish": "2025-01-14 10:38:31", "description": "Lazio sack club falconer, Juan Bernabe, for sharing explicit photos online.", "filename": "sport_football_articles_c30dp1r73e4o_1747807628.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d9a/live/1ebd87e0-d257-11ef-afca-fd8d41ed4ae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c30dp1r73e4o_1747807628.html", "title": "Lazio falconer sacked for sharing explicit photos", "title_page": "Lazio falconer sacked for sharing explicit photos  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Italian club Lazio have sacked a man responsible for handling the club's eagle mascot after he shared videos online of his own prosthetic penis.\nFalconer Juan Bernabe has handled the eagle, named Olimpia, since the 2010-11 season and flies the bird over the Serie A club's Stadio Olimpico before matches.\nHowever, Lazio - whose crest is emblazoned with an eagle - have parted ways with Bernabe after he shared images and videos online of his penis on his social media after undergoing implant surgery.\nLazio said they were \"shocked\" by the images and that Bernabe had been sacked with \"immediate effect\".\nThe Serie A club added they were aware of the \"shared pain that the loss of the eagle will cause to fans for upcoming home matches\" but added it was \"impossible to associate our historical symbol with such (an) individual\".\nBernabe defended his decision to publish the videos, telling radio station Radio24 he was trying to bring awareness to the operation and shared it on his private social media adding that \"nudity is normal, I grew up in an open-minded, naturist family\".\nThe 56-year-old was suspended by the club in 2021 for performing a fascist salute at the end of a match against Inter Milan.\nBernabe was filmed making the salute and chanting \"duce, duce\", which translates as \"leader, leader\" and is commonly associated with former fascist Italian leader Benito Mussolini.\n\"I did it and I don't regret it because I admire Mussolini, he did great things for Italy as Franco did for Spain,\" Bernabe said in 2021.", "url": "https://www.bbc.com/sport/football/articles/c30dp1r73e4o"}