{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:47:26", "date_modify": "2025-05-20 12:47:26", "date_publish": "2023-08-03 07:11:44", "description": "Wolves: Fabio Silva impresses against Luton as Wanderers bid to increase goal tally", "filename": "sport_articles_c89r57nrgx4o_1747745246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/497a/live/ea12e050-317e-11ee-90b4-1d2d90f6e870.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c89r57nrgx4o_1747745246.html", "title": "Wolves: Fabio Silva impresses against Luton as Wanderers bid to increase goal tally", "title_page": "Wolves: Fabio Silva impresses against Luton as Wanderers bid to increase goal tally - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Cartwright, BBC Sport at Molineux\nOne of the problems Julen Lopetegui needs to solve if Wolves are to avoid a repeat of last season's worrying scrape with relegation is a lack of goals.\nWanderers were the lowest scorers in the Premier League in 2022-23, finding the net just 31 times in their 38 matches.\nLopetegui chose to pair Sasa Kalajdzic and Fabio Silva up front in Wednesday's goalless friendly against Luton Town and there were glimpses of neat combinations between the two.\nAustria international Kalajdzic demonstrated clear endeavour and is a very tidy footballer, but he looked rusty at times - which is only to be expected for a player who missed almost all of last season after injuring his cruciate ligament on debut in September.\nLopetegui has already said this summer that it would be unfair to expect too much from him too soon as he continues his comeback from such a serious injury, and he will be much better for his 65 minutes against Premier League opposition.\nAs for Silva, he looked the most likely to break the deadlock against the newly promoted Hatters.\nParticularly in the second half, he dropped off Kalajdzic to great effect to provide a link between midfield and attack. He fizzed one angled effort over the bar and forced a fine save from another having slipped free of his marker and broken into the penalty area.\nWolves broke their transfer record to sign Silva, then aged 18 and one of Europe's hottest prospects, from Porto for £35m in 2020.\nHis first two seasons at Wolves were a struggle, but a year of playing regular first-team football on loan at Anderlecht and PSV Eindhoven appears to have done him the world of good on the evidence of his pre-season outings.", "url": "https://www.bbc.com/sport/articles/c89r57nrgx4o"}