{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 06:21:41", "date_modify": "2025-05-21 06:21:41", "date_publish": "2025-03-31 14:58:05", "description": "Wolves forward Matheus Cunha says he is committed to taking Wolves to \"another level\".", "filename": "sport_football_articles_c98g1121l54o_1747808501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f17/live/1b21b010-0e3a-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98g1121l54o_1747808501.html", "title": "Matheus Cunha: Brazil forward says he wants to take Wolves to 'another level'", "title_page": "Matheus Cunha: Brazil forward says he wants to take Wolves to 'another level' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matheus Cunha says he wants to take Wolves to \"another level\" and that a recent interview in which he seemed to imply he needed to leave the club had been misinterpreted.\nBrazil striker Cunha said in an interview with the Observer that he has told Wolves he needs to \"take the next step\" and fight for titles in his career.\nThe former Atletico Madrid player has a £62.5m release clause in the four-and-a-half-year deal he signed in February.\nSpeaking in a social media video on Monday, the 25-year-old said people did not have \"correct interpretation\".\n\"It's impossible for the player to be honest in an interview knowing that everything can be taken in any way he wants,\" he said.\n\"I don't think a lot of people read the interview, and I don't think that people have the correct interpretation. Of course the point was talking about Wolves, to show everyone how happy I am to be here, to play for this team, to play for these team-mates and of course give back all the love that they give to me.\n\"Ambitious players, of course we want to play for something more, to put this club in another level, and of course me and my team-mates will give our all to achieve this goal.\"", "url": "https://www.bbc.com/sport/football/articles/c98g1121l54o"}