{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:37:26", "date_modify": "2025-04-26 07:37:26", "date_publish": "2025-02-27 14:27:05", "description": "Kilmarnock fan views on defeat by Rangers", "filename": "sport_articles_cn89ye49xnno_1745653046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ab8/live/4ccac460-f451-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cn89ye49xnno_1745653046.html", "title": "Kilmarnock fan views on defeat by Rangers", "title_page": "Kilmarnock fan views on defeat by Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your thoughts on Kilmarnock going from two goals up to a 4-2 defeat at home to Rangers.\nHere's what some of you said:\nStephen: That was a total embarrassment. Complete capitulation to one of the worst Rangers teams in recent memory. Derek McInnes was outthought by a couple of BBC pundits and a guy who's never managed higher than the third tier. Totally fed up with his one-dimensional tactics, poor substitutions and baffling recruitment, bringing in players he then never selects.\nAdam: Kilmarnock started brilliant, then gave Rangers so much time and space to cut us apart. Bobby Wales should have been sacrificed for another defender early on, and even midfielders who would shut the game down. Great start, sore ending.\nJim: Rangers did not win this game, Killie lost it. First half we were in control. We change from three at the back to four and lose the midfield in the second half. Marley Watkins is useless, cannot score and never will. He misses chance after chance. We take Danny Armstrong off and bring on Liam Donnelly - why? What does he actually do in the team? Both should go.\nNeil: Same old Killie this season: in a lot of games, the lead is not protected, and it is as if we run out of steam. We should have been out of sight after 30 minutes, but didn't take the other chances we created after going 2-0 in front. In the second half, no creativity and Watkins was largely ineffectual. Time for some changes.\nRobert: We had it and then threw it away. All the good early work ruined by some inept defending. I can't work out if it's a concentration issue or a set-up problem but Rangers' second in particular was embarrassing. Can't fault the effort or application but we have to find some consistency.", "url": "https://www.bbc.co.uk/sport/articles/cn89ye49xnno"}