{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:30", "date_modify": "2025-05-21 03:56:30", "date_publish": "2025-04-07 13:08:21", "description": "Arsenal news: Bukayo Saka on his recovery goal of playing in Champions League quarter-final", "filename": "sport_football_articles_c9851del09no_1747799790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a1d/live/847f63e0-13a8-11f0-8bf3-33a2b06eeb4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9851del09no_1747799790.html", "title": "Arsenal news: Bukayo Saka on his recovery goal of playing in Champions League quarter-final", "title_page": "Arsenal news: Bukayo Saka on his recovery goal of playing in Champions League quarter-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal winger Bukayo Saka says Tuesday's Champions League quarter-final against Real Madrid was a focal point for his recovery after hamstring surgery in December.\nAs he began his rehabilitation, the goal was to not only be back in the fold for this match but to be \"back and in good shape\".\n\"If you ask my physios then there was a lot of conversation around this game and wanting to be back and in good shape,\" said the England international. \"I spent a lot of months working massively towards it.\n\"We are here now, so I am excited.\n\"I feel good. Obviously you can't define nature and you need to get on the pitch and get your minutes up, but I feel like in the past two games I have gone from strength to strength.\"\nArsenal, who host the Champions League holders in the first leg of the quarter-final, have not reached the semi-finals since 2008-09 and were knocked out at the same stage last season by Bayern Munich.\n\"We need to take the next step and get over the line,\" Saka added. \"It's Real Madrid, we respect their history but on Tuesday anything can happen.\n\"It is a big night and the stakes are high against one of the best teams in the competition.\"", "url": "https://www.bbc.com/sport/football/articles/c9851del09no"}