{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:18", "date_modify": "2025-05-21 07:29:18", "date_publish": "2025-03-28 18:17:37", "description": "Hearts ready to 'attack' run-in after 'chance to breathe' - Critchley", "filename": "sport_articles_c20l01j1987o_1747812558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9913/live/d690ea00-0c00-11f0-b5ba-bf75c437a038.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c20l01j1987o_1747812558.html", "title": "Hearts ready to 'attack' run-in after 'chance to breathe'", "title_page": "Hearts ready to 'attack' run-in after 'chance to breathe' - Critchley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Neil Critchley wants Hearts to \"attack\" the final stage of the season as they attempt to secure a top-six league finish and win the Scottish Cup.\nThe Tynecastle side are sixth in the Premiership, two points below Dundee United and a point above Motherwell, with European football next season up for grabs.\nHearts face Celtic, Dundee United and Motherwell in their three league matches before the split, then meet Aberdeen in the Scottish Cup semi-final at Hampden.\n\"They're vitally important games,\" Critchley said. \"I think the break has just given everyone a chance to breathe a little bit.\n\"There's only seven, eight weeks left, it'll fly by and we're ready to attack the last period of the season. Nine, hopefully 10 games left, maximum. That's it.\n\"So we're ready to go. We're fresh, we're positive and we're looking forward to a really exciting end to the season.\"\nDespite the tight nature of the league this season, Critchley insists his is not allowing himself to become distracted by the standings and how many points his side might need to finish in the top half.\n\"I looked at the league for about two minutes and then decided not to look at it because there are numerous permutations and I gave up trying to work them all out, so I thought that's pointless,\" he said.\n\"We just have to concentrate on us. We have three games and who knows how many points we're going to need.\n\"We have a tough run of games but so do a lot of the other teams around us and we obviously have teams around us that we're due to play.\"", "url": "https://www.bbc.com/sport/articles/c20l01j1987o"}