{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:01:15", "date_modify": "2025-04-26 07:01:15", "date_publish": "2025-03-02 00:00:00", "description": "Robert Lewandowski scores as Barcelona thrash Real Sociedad 4-0 to return to the top of La Liga.", "filename": "sport_football_live_cy7xgep0x48t_1745650875.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09ea/live/3e31ce90-f784-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cy7xgep0x48t_1745650875.html", "title": "Barcelona 4-0 Real Sociedad: Hansi Flick's side return to top spot", "title_page": "Barcelona 4-0 Real Sociedad: Hansi Flick's side return to top spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barcelona reclaimed top spot in La Liga with a comfortable victory over 10-man Real Sociedad.\nAtletico Madrid had leapfrogged them following their 1-0 win over Athletic Club on Saturday.\nHowever, Hansi Flick's side easily restored their one-point advantage - and extended their winning run to six games - in the title race with goals from Gerard Martin, Marc Casado, Ronald Araujo and Robert Lewandowski.\nNinth-placed Sociedad, who face Manchester United in the last 16 of the Europa League on Thursday, 6 March, came out on top when the two sides last met in November, winning 1-0.\nHowever, they were up always up against it at the Estadi Olímpic Lluís Companys after defender Aritz Elustondo received a straight red card in the 17th minute for bringing down a goalbound Dani Olmo.\nBarcelona capitalised on their advantage just eight minutes later, Lamine Yamal losing his marker in the box before combining with Olmo to pick out full-back Martin to finish at the back post.\nFour minutes later, Olmo was once again involved, with his strike from the edge of the box deflecting in off Casado. For both Martin and Casado, it was their first Barcelona goals.\nThe hosts didn't have to wait long for a third goal. Barely 60 seconds after Pedri had rattled the woodwork with a curling long-range effort, Araujo headed home an inswinging corner from Raphinha.\nPoland striker Lewandowski sealed the rout on the hour mark, sticking out a foot to direct Araujo's shot beyond a helpless Alex Remiro in the visiting goal.", "url": "https://www.bbc.co.uk/sport/football/live/cy7xgep0x48t"}