{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:36", "date_modify": "2025-05-21 05:53:36", "date_publish": "2024-12-24 20:27:37", "description": "'Games don't come bigger' - Gray and Critchley primed for derby battle", "filename": "sport_articles_cgkx82xyzmyo_1747806816.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a2ad/live/0044aa50-c235-11ef-aa93-3db4f6a1fa96.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgkx82xyzmyo_1747806816.html", "title": "'Games don't come bigger'", "title_page": "'Games don't come bigger' - Gray and Critchley primed for derby battle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One manager is sampling the Edinburgh derby for the first time, the other is a rookie boss but grizzled veteran of the frenzied fixture from his playing days.\nBoth Hearts and Hibs go into the Boxing Day showdown at Tynecastle on the back of morale-boosting wins. Hearts lifted some of their European gloom by beating St Johnstone to clamber off the bottom of the Premiership, while Hibs continued their recent resurgence with victory at Aberdeen.\nAs ever, the stakes are high when the rivals collide.\nHearts head coach Neil Critchley said: \"It was vitally important to go into derby with a win after the week we had. It's not been an easy week for all of us and this has given us a lift at the right time.\n\"I've been visualising the game in my head for a number of weeks, and on Boxing Day I get to experience it.\n\"That is an incentive, to go above them. The league is very tight and a couple of wins can change things very quickly. We want to back up Sunday's win with another in a big game on Boxing Day, get the crowd behind us.\"\nHibs boss David Gray has urged his team to embrace the hostile atmosphere in the Gorgie cauldron.\n\"It's a fantastic fixture for everyone to look forward to, especially off the back of such a positive result,\" said Gray.\n\"Games don't come any bigger than this. For a Hibs player to have the opportunity on Boxing Day to go there, a real hostile environment, is something the players should really relish.\n\"These are the greatest games I ever played in when I had the opportunity to do it. The magnitude of the game will take care of itself and we've given ourselves a right good chance as we go into it full of confidence and belief.\"", "url": "https://www.bbc.com/sport/articles/cgkx82xyzmyo"}