{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:43", "date_modify": "2025-05-21 07:36:43", "date_publish": "2025-02-11 00:00:00", "description": "Reading's League One play-off hopes are dented as they are held to a scrappy 1-1 draw by relegation-threatened Shrewsbury.", "filename": "sport_football_live_c5yerll9l3kt_1747813003.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5yerll9l3kt_1747813003.html", "title": "Reading 1-1 Shrewsbury Town", "title_page": "Reading 1-1 Shrewsbury Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reading's League One play-off hopes were dented on Tuesday night as they were held to a scrappy 1-1 draw by relegation-threatened Shrewsbury at the SCL Stadium.\nThe visitors squandered the chance to go ahead early on – when John Marquis missed a penalty – and Reading took the lead in the 28th minute through Jayden Wareham.\nTaylor Perry levelled 11 minutes after the break as Town enjoyed the better of the second half without finding a winner.\nAfter a disjointed opening, the game came to life when Chem Campbell clumsily fouled Harrison Biggins in the home area.\nBut Marquis, Shrewsbury's nine-goal leading marksman, missed his third spot-kick of the season with a tame effort at Joel Pereira.\nPereira also did well to turn Marquis' follow-up attempt over the crossbar.\nTown counted the cost 11 minutes later, when Kelvin Ehibhatiomhan superbly cut the ball back from the byeline for Wareham to tuck past Jamal Blackman.\nSlack defending by the hosts allowed Shrewsbury to equalise in the 56th minute with Perry driving in powerfully from an acute angle.\nReading were somewhat fortunate to cling on to a draw, with Marquis and Vadaine Oliver both wasting good openings for the away side towards the end.\nShrewsbury head coach Gareth Ainsworth was also booked late on for venting his frustrations in his technical area.", "url": "https://www.bbc.com/sport/football/live/c5yerll9l3kt"}