{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 03:43:18", "date_modify": "2025-05-21 03:43:18", "date_publish": "2025-02-05 19:08:57", "description": "World champion Luke Littler says retaining his Premier League Darts title \"would mean everything\" as he prepares to face Michael van Gerwen in Belfast.", "filename": "sport_darts_articles_cx2qe89yl0qo_1747798998.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57ee/live/fd860420-e3e1-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cx2qe89yl0qo_1747798998.html", "title": "Luke Littler: Defending Premier League title 'would mean everything' to world champion", "title_page": "Luke Littler: Defending Premier League title 'would mean everything' to world champion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champion Luke Littler says retaining his Premier League Darts title \"would mean everything\".\nThe 18-year-old won the eight-player elite invitational tournament in his debut year in 2024, defeating Luke Humphries in the decider.\nIn a repeat of January's World Championship final, Littler kicks off his title defence on Thursday against Michael van Gerwen in Belfast, where he won his first night of Premier League Darts last year.\n\"Ever since last year, I know these players are going to have to pull it out of the bag to beat me,\" said Littler.\n\"This is probably the biggest one I'm going to defend all round until it comes to the World Championships.\"\nPremier League Darts takes place over 16 nights in February, March, April and May across the UK, Ireland and Europe, before the play-offs in London on 29 May.\nLittler says his goal is to secure a top-four finish to secure a place on finals night at London's O2 Arena.\n\"I have to get the top four, but I want to get that win tomorrow night.\n\"If it doesn't happen, then I'll reset but I'm hoping for a quick start tomorrow just like the world final.\n\"Throughout the weeks [last year] I was always fourth or fifth, and I went on the run I went on with more wins.\"", "url": "https://www.bbc.com/sport/darts/articles/cx2qe89yl0qo"}