{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 06:08:59", "date_modify": "2025-05-21 06:08:59", "date_publish": "2025-01-14 10:21:43", "description": "Eddie Howe press conference: Newcastle vs Wolves", "filename": "sport_football_articles_cpvmz8nxw0do_1747807739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpvmz8nxw0do_1747807739.html", "title": "Eddie Howe press conference: Newcastle vs Wolves", "title_page": "Eddie Howe press conference: Newcastle vs Wolves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Howe confirmed Joe Willock and Jacob Murphy are expected to be fine after being rested for Sunday's FA Cup win over Bromley, while Alexander Isak will train today for the first time since last week's win at Arsenal. However, Harvey Barnes is ruled out for \"around a month\" with a thigh injury.\nHe also updated on defender Sven Botman who was rested at the weekend: \"After two big physical games with Sven, we needed to rest and recover. There was a few warning signs that he was going into a fatigue. Then of course, you need to get back up and running again because the schedule is unrelenting.\"\nWhen asked if Newcastle are at risk of profit and sustainability rule [PSR] breaches with the Premier League set to announce the clubs charged today: \"No, I don't believe we are.\"\nNewcastle made it eight wins in a row in all competitions for the first time in 20 years with victory against Bromley but Howe would not be drawn on that: \"I don't think we can look two games ahead. For me it's always one step ahead, making sure we approach the game in the right way. There's dangers to winning games, warning signs you need to be aware of.\"\nAlso, striker Isak could set a club record by scoring in eight straight Premier League games: \"He'll be desperate to play of course. I'd love Alex to continue to score but the most important thing for me is the team is functioning well for him and he's functioning well for the team. The two go hand in hand.\"\nThe boss also said there is \"no change\" in the situation surrounding Martin Dubravka's future: \"Discussions will take place but I'm not directly involved in that\".\nHe also added there has been \"no change\" to his initial assessment that it will be a quiet January transfer window.\nOn opponents Wolves: \"Vitor Pereira has connected with the players very quickly - I think you can see that. They're playing with confidence and that shows with their form. They look a settled team with a clear identity. They will be very dangerous opponents\"", "url": "https://www.bbc.com/sport/football/articles/cpvmz8nxw0do"}