{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:25", "date_modify": "2025-05-21 06:09:25", "date_publish": "2025-03-31 10:49:29", "description": "Offaly joint-manager Mickey Harte \"makes a difference everywhere he goes\", says Oisin McConville on the GAA Social podcast.", "filename": "sport_articles_cx2yx2y2z99o_1747807765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7699/live/9d806ea0-0e14-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2yx2y2z99o_1747807765.html", "title": "Mickey Harte: Joint Offaly manager 'makes a difference wherever he goes'", "title_page": "Mickey Harte: Joint Offaly manager 'makes a difference wherever he goes' - Oisin McConville - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Offaly joint-manager Mickey Harte \"makes a difference everywhere he goes\", says Oisin McConville.\nHarte, along with Declan Kelly, guided Offaly to the Division Three title after a 2-17 to 1-18 win over Kildare in the final.\nIt is a sixth league title with four different counties for Harte, including four triumphs in the past five seasons with three different teams.\n\"Everywhere he goes he definitely brings something,\" McConville said on the GAA Social podcast.\n\"There is a massive respect there so he is going to get a response from players.\"\nSunday's victory at Croke Park with Offaly also means he has won the a league in his first year in charge of Tyrone, Louth, Derry and now the Faithful County.\nAfter winning Divisions One and Two with Tyrone in 2003 and 2016, Harte guided Louth to the Divisions Four and Three titles in 2021 and 2022, before coming out on top with Derry in the top tier last year.\n\"Hats off to him. His record is phenomenal, you can't argue with that,\" added 2002 All-Ireland winner McConville.\n\"He seems to have given a massive bounce to Offaly.\"", "url": "https://www.bbc.com/sport/articles/cx2yx2y2z99o"}