{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 08:01:23", "date_modify": "2025-05-21 08:01:23", "date_publish": "2025-05-19 16:15:55", "description": "The Scottish FA are set to announce a record turnover of £78.72m, with pre-tax profits of £7.41m resulting largely from participation in the Euro 2024 finals.", "filename": "sport_football_articles_c4ge75zxrjjo_1747814483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2dd3/live/e837c8a0-34aa-11f0-bb4c-2971b3da45d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4ge75zxrjjo_1747814483.html", "title": "Euro 2024 participation helps Scottish FA post record turnover", "title_page": "Euro 2024 participation helps Scottish FA post record turnover - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Euro 2024 helps SFA increase turnover and profit\nPublished\n19 May 2025\nEuro 2024 participation helped the Scottish FA to post a record turnover of £78.72m last year.\nThe figure is a £21.6m increase on 2023, while pre-tax profit was also up to £7.41m, compared with £2.05m the previous year.\nFurthermore, the SFA has benefited from additional funds from Grassroots Facilities Funding and the Scottish Government Extra Time initiative, and has committed £5m to increasing facilities across the country.\nReserves and cash at bank and in hand were listed as £16.23m (reserves) and £18.1m (cash).\nThe accounts state the increase in revenues and profits are \"mostly related to the revenue generated from participation in the Uefa Euro 2024 finals tournament\".\nScotland's second successive men's European Championship appearance pitted Steve Clarke's side against hosts Germany plus Switzerland and Hungary.\nThe Scots lost to the Germans and Hungarians but drew with the Swiss in their second match.\nScotland women reached the Euro 2025 play-offs last year but, after defeating Hungary, fell short against Finland and missed out on the finals, with head coach Pedro Martinez Losa soon moving on.\nMelissa Andreatta has recently started as the new permanent head coach after Michael McArdle oversaw the team on a temporary basis.", "url": "https://www.bbc.com/sport/football/articles/c4ge75zxrjjo"}