{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:00", "date_modify": "2025-05-21 06:57:00", "date_publish": "2025-02-08 10:05:30", "description": "Cardiff City: Omer Riza to rotate for Stoke City FA Cup test as new signings available", "filename": "sport_football_articles_cgq0py9xg15o_1747810620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e813/live/e6c2ceb0-e483-11ef-89a1-3f5b746fc0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgq0py9xg15o_1747810620.html", "title": "Cardiff City: Omer Riza to rotate for Stoke City FA Cup test as new signings available", "title_page": "Cardiff City: Omer Riza to rotate for Stoke City FA Cup test as new signings available - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Omer Riza expects to make changes to his starting line-up for Cardiff City's FA Cup fourth-round contest at Stoke City on Saturday (15:00 GMT).\nThe Bluebirds are aiming to respond following a 7-0 defeat to Championship leaders Leeds United at Elland Road last weekend.\nNew signings Yousef Salech, Will Alves and Sivert Mannsverk are all in contention to feature against the Potters, and Riza says he will give some fringe players the opportunity to impress at the bet365 Stadium.\n\"We've got a good squad, I'm really happy with the squad,\" said Riza.\n\"There are players that haven't played as many minutes as we'd have liked and they'll get a chance to play on Saturday.\n\"So we are looking forward to the game and all of the interesting things that brings.\"\nStoke have appointed Mark Robins as boss since Cardiff last travelled to Staffordshire before Christmas, when Narcís Pèlach's Stoke side snatched a 2-2 draw courtesy of Ben Gibson's goal in added time.\nBut Riza believes Stoke's principles will not have changed under their new boss.\n\"It's going to be intense, aggressive and they're going to want to win,\" he said.\n\"They're always an industrious team, the crowd expect them to work hard first and foremost.\n\"With Robins going there, the style of play may have changed a little bit, but we're focused on ourselves to go and win the game.\n\"I want to win the game, and from that game, you're in the fifth round. We just want to win and keep momentum going.\"", "url": "https://www.bbc.com/sport/football/articles/cgq0py9xg15o"}