{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-21 05:56:42", "date_modify": "2025-05-21 05:56:42", "date_publish": "2025-01-31 14:48:44", "description": "Hibs, on the longest current unbeaten run in the top flight, look to add to Aberdeen's long winless sequence as Celtic welcome back a familiar face.", "filename": "sport_football_articles_c1welwq5zrdo_1747807002.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb2e/live/1709a0b0-dfe0-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1welwq5zrdo_1747807002.html", "title": "Celtic's Jota, St Johnstone's Simo Valakari & Hibs v Aberdeen in spotlight", "title_page": "Celtic's Jota, St Johnstone's Simo Valakari & Hibs v Aberdeen in spotlight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eight teams get the chance to make ground on Scotland's two European representatives on Saturday before leaders Celtic and second-top Rangers play on Sunday.\nMotherwell host the reigning champions under caretaker Stevie Frail after Stuart Kettlewell's resignation, but there is plenty of intrigue elsewhere too.\nHere are some things to look out for.\nWhen Hibs and Aberdeen drew 3-3 at Easter Road in November, the hosts were sitting bottom of the Premiership, 23 points adrift of a Dons side just two behind Celtic at the top.\nLittle did we know then that the previous week's defeat away to St Mirren was the start of a 13-match run without a league win for the side that started the season unbeaten in their first 16 games under new manager Jimmy Thelin.\nThat dismal run included a 3-1 home loss to Hibs in December and another win over the Dons would lift David Gray's in-form hosts to within two points of a side who, remarkably considering those poor recent results, remain fourth in the table.\nSince that draw in Leith, Hibs have lost just once in 11 outings, are unbeaten in nine, six at home, and are up to sixth place, their eight-game unbeaten run currently being the longest in the top flight.\nThey have scored three times in five of those six home games despite their 35 goals from 39.2 'expected goals' making them the second most underperforming side in the Premiership behind Kilmarnock.\nIn contrast, the Dons have scored just once in their latest seven league games and have won once in 14 outings overall - and that was away to League 2 side Elgin City in the Scottish Cup.\nThelin's side will have to overturn the form book if they are not to go 10 games without an away league win and 13 overall without a victory since that last trip to Easter Road.\nIt is that time of year when debuts are being handed out right, left and centre as signings are made in the final days of the January transfer window.\nOn-loan Lille centre-back Rafael Fernandes will be itching for his Rangers debut after the Portuguese was an unused substitute against Dundee United, who have just signed Allan Campbell from Luton Town, while Victor Lopez has yet to feature for Dundee after his arrival from Queretaro in his native Mexico.\nFellow midfielder and Gambia international Alasana Manneh only joined Hibernian from Odense Boldklub in midweek and is still waiting on a visa, but Heart of Midlothian and St Johnstone both have two new arrivals to consider for selection.\nGiven Craig Halkett's latest injury blow, Michael Steinwender could be handed a quick introduction by Hearts after the Austrian centre-half's arrival from Swedish club Varnamo, while Norwegian Sander Kartum has been brought in from Brann to bolster the midfield.\nSwedish former Halmstad midfielder Jonathan Svedberg and, should he receive a work permit, Latvia defender Daniels Balodis, previously of RFS, will be keen to start their bid to steer Saints off the bottom of the table.\nHowever, it is probably Jota's return to Scottish football that will be most keenly anticipated by neutral observers.\nThe 25-year-old Portuguese lit up the Premiership during his first two seasons with Celtic after arriving from Benfica but was unable to live up to his £25m price tag during a miserable time with both Al-Ittihad and Rennes since leaving Glasgow in summer 2023.\nNow he is back with the Scottish champions, where he will compete with in-form Nicolas Kuhn and Daizen Maeda for a place on the wings as they visit managerless Motherwell, against whom he has scored twice previously, on Sunday.\nTwo days after losing to St Johnstone, their second defeat in Perth within seven days and third consecutive loss, Motherwell were to lose their manager.\nKettlewell cited as the reason for his resignation the fan abuse he was receiving despite his side sitting fifth in the table - four places better off than at the same stage last season.\nContrast that with Saints counterpart Simo Valakari.\nSt Johnstone owner Adam Webb admitted this week that, despite Saturday's win, the seven-point gap between themselves and second-bottom Kilmarnock means he has to make contingency plans for possible relegation.\nHowever, he doubled down on the summer appointment of Valakari, even saying \"I can't be happier with Simo\".\nWebb is also backing his manager in the transfer market, with two new arrivals this week and centre-half Jack Sanders, sold to MK Dons, being the latest to exit as the Finn reshapes his squad.\nThat should take some of the pressure off, but the American businessman also stressed that he and Valakari have not given up hope of avoiding relegation and that those two victories over Well - first in the Scottish Cup and then the league - prove \"he's doing the right things to get us to the right place\" despite previous results.\nThey will be hoping those wins mean they have turned the corner after the previous nine games without a victory as they head to Paisley on Saturday.\nHowever, hosts St Mirren also appear to be on the up after ending a four-game losing streak by scoring three times in each of two away victories.\nIndeed, the Perth side, who currently have not won in six away games, losing five of them, have not won in Paisley in 10 visits since December 2018.\nOvercoming their rival Saints would be further proof of their potential resurrection under Valakari.", "url": "https://www.bbc.com/sport/football/articles/c1welwq5zrdo"}