{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:50", "date_modify": "2025-05-21 07:16:50", "date_publish": "2025-05-20 10:16:42", "description": "Sione Tuipulotu embracing pressure of proving international allegiance for Lions", "filename": "sport_articles_c3655ek1wl3o_1747811810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15f8/live/22308b10-355e-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3655ek1wl3o_1747811810.html", "title": "Sione Tuipulotu embracing pressure of proving international allegiance for Lions", "title_page": "Sione Tuipulotu embracing pressure of proving international allegiance for Lions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Melbourne-born Scotland captain Sione Tuipulotu is relishing the pressure of proving his international allegiance for the British and Irish Lions.\nAmid ongoing debate about the selection of foreign-born players, the Glasgow centre is set to line up against his native Australia during this summer's Lions tour.\nTuipulotu, who made his Scotland debut in 2021, is among seven members of Andy Farrell's 38-man Lions squad who hail from overseas.\nWhile five of those players are eligible for their adopted nations purely on residency rules, Tuipulotu qualified through ancestry.\nThe 28-year-old's Greenock-born grandmother was at Murrayfield last autumn to see him score a try while leading Scotland to a 27-13 defeat of the Wallabies.\n\"I put so much on myself that I really wanted to be a Lion because I know how much it means to people over here,\" said Tuipulotu, who initially feared his tour participation may be ruined by injury.\n\"I had gone all in with the stuff with Scotland and I just felt what better way to prove my allegiance to Scotland than go all in and try and make the Lions. That's why it meant so much to me.\n\"Genuinely early days you have that feeling of 'Am I part of this?'. I always feel like talking about it is one thing but showing people how much it means to you in how you play (is another).\n\"When my gran came over before the Australia game, it allowed the public to put a face to the story and listen to my grandma and how much it meant to her. I think that gave eyes to the public that my story was authentic.\n\"I'm all in and I'm looking forward to showing how committed I am to playing for the Lions.\"\nTuipulotu is raring to go after returning from four months out with a pectoral issue during Glasgow's 13-5 defeat to Leinster on Saturday.\n\"I've been nothing but embraced by the Scottish public ever since I started playing for Scotland,\" said Tuipulotu, who has 30 caps.\n\"There's always going to be a couple of people (who criticise), like there are for some of the Irish boys, but I take that in my stride because I don't blame those people either.\n\"I didn't grow up dreaming of playing for Scotland or the Lions, that's the truth.\n\"But this is where my path has led me and I'm all in for this Lions team and for Scotland and for Glasgow, and I genuinely feel like this is where I'm supposed to be.\"", "url": "https://www.bbc.com/sport/articles/c3655ek1wl3o"}