{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:52", "date_modify": "2025-05-21 06:52:52", "date_publish": "2025-03-29 18:41:30", "description": "Norwich boss Johannes Hoff Thorup is happy to see his side beat West Brom after an injury to Callum Doyle forced a tactical re-think.", "filename": "sport_football_articles_cj0z88ygdmdo_1747810372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4990/live/22daf7d0-0ccd-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj0z88ygdmdo_1747810372.html", "title": "Callum Doyle: Norwich full-back could miss rest of season", "title_page": "Callum Doyle: Norwich full-back could miss rest of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An injury to left-back Callum Doyle forced a tactical rethink by Norwich boss Johannes Hoff Thorup, which paid off with a dramatic 1-0 win over West Brom.\nDoyle missed the game with a calf problem and the Dane opted for a back five instead of a four, with Kellen Fisher deputising down the left.\n\"Knowing that we will be without a left-back for probably the rest of the season was one of the reasons behind the different approach because last time we played against West Brom, (Tom) Fellows on the right side created problems for us,\" Thorup told BBC Radio Norfolk.\n\"When you decide to have a five in the backline instead of four, you probably lose a bit of intensity in the first line of your pressing game and that's what we had to accept and do what it takes to be compact as a team.\n\"At the end of the day, everyone just wants to see us win so we do what is necessary. Is it my favourite kind of football? No, 100% not - but I'm not that stubborn, not to do once in a while what it takes to get a result.\"\nAsked about Doyle's injury, Thorup replied: \"He's still with us, he's doing his rehab with us but he felt some pain after the Bristol (City) game and we scanned it and could see it was a calf injury.\n\"It's probably three to five weeks - if we are optimistic and it's three, then we can use him (again this season), but if it's the opposite, then his season can be over.\"\nNorwich are next in action away to Plymouth Argyle next Saturday.", "url": "https://www.bbc.com/sport/football/articles/cj0z88ygdmdo"}