{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-21 06:14:26", "date_modify": "2025-05-21 06:14:26", "date_publish": "2025-01-14 09:23:58", "description": "Los Angeles Lakers and Los Angeles Clippers players say it was \"tough\" to return to NBA action as wildfires continue.", "filename": "sport_basketball_articles_c5y7mje04m4o_1747808066.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a4c1/live/417f8750-d253-11ef-afca-fd8d41ed4ae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_c5y7mje04m4o_1747808066.html", "title": "Los Angeles wildfires: LA Lakers & LA Clippers back in NBA action", "title_page": "Los Angeles wildfires: LA Lakers & LA Clippers back in NBA action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Los Angeles Lakers and Los Angeles Clippers players said they found it \"tough\" as they returned to NBA action with wildfires in the city ongoing.\nTwo Lakers games and one Clippers match were postponed but Monday's contests went ahead and both teams dedicated the night to the community and emergency services.\nThe Lakers lost 126-102 to the San Antonio Spurs while the Clippers beat the Miami Heat 109-98.\nFire crews in the Los Angeles area are still battling two large blazes, with fears of new outbreaks as a result of forecasted high winds.\nAt least 24 people have died in the fires and 23 others are missing. More than 90,000 people remain under evacuation orders while Lakers coach JJ Redick is among those who lost their house in Palisades.\nLakers forward Anthony Davis had mixed emotions after finishing with 30 points and 13 rebounds as his side lost for the third game in a row.\n\"We were eager to play basketball again in front of our fans. It sucks that we weren't able to get to win,\" said the 31-year-old.\n\"I've been thinking about it a lot. We come out and play and whether we win, lose or draw, this game is over and everything's still going on in the world.\n\"So, [it's] bittersweet in a sense because we still have people who are dealing with real-life situations. And we get to go out and play basketball. So it's tough.\"", "url": "https://www.bbc.com/sport/basketball/articles/c5y7mje04m4o"}