{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 07:59:55", "date_modify": "2025-05-21 07:59:55", "date_publish": "2025-01-13 09:56:42", "description": "Vannes 25-29 Edinburgh: Three things we learned", "filename": "sport_articles_c391lkjjv3ko_1747814395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2602/live/0b95b3e0-d194-11ef-8338-e1043e56241a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c391lkjjv3ko_1747814395.html", "title": "Vannes 25-29 Edinburgh: Three things we learned", "title_page": "Vannes 25-29 Edinburgh: Three things we learned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Signs of attack sharpening up\nThe big criticism of Sean Everitt's team in recent times has been the lack of spark in attack, but there were signs against Vannes that when it clicks, Edinburgh do have the tools to hurt teams.\nDarcy Graham, unsurprisingly, was at the heart of a lot of Edinburgh's best moments. He was instrumental in a wonderful third try, linking up with James Lang who then set Ali Price free to score.\nIt was a terrific move, the kind that a team with so many exciting runners produces far too infrequently.\nEveritt must find a way to embolden his creative players to express themselves more. Edinburgh will be better for it.\nSoft defence a cause for concern\nIf the attack is showing encouraging signs of improvement, some of the defence on show against Vannes was a real concern.\nSalesi Rayasi time and again was able to blast through a succession of soft shoulders, while Tani Vili was able to do likewise for his try in the second half.\nEveritt and his players spoke after the 1872 Cup victory over Glasgow at Murrayfield about how the standard had been set in terms of aggression and discipline in defence. They fell well short of that against Vannes.\nEdinburgh got away with it against an inexperienced side, but they won't when they take on the top teams in the URC and at the business end of the Challenge Cup, should they make it there.\nPrice gives Townsend food for thought\nAli Price has found himself slipping down the Scotland pecking order in the last couple of years with the fine form of Ben White and George Horne and the emergence of Jamie Dobie.\nEyebrows were raised when Price was selected to start the first of the autumn Tests against Fiji, with Townsend saying he was the form Scottish scrum-half. He saw no further action in that series.\nAgainst Vannes, Price showed flashes of his old self, especially in the first half when he scored two tries off good support lines after firing a lovely pass out to Wes Goosen for the opening try.\nWhite's consistency and control, Horne's tempo and goalkicking and Dobie's speed and versatility means forcing his way to the front of the scrum-half queue is going to be tough, but Townsend has always been Price's biggest fan and he will have taken note of his good moments against Vannes as the head coach gets set to name his squad for the Six Nations on Wednesday.", "url": "https://www.bbc.com/sport/articles/c391lkjjv3ko"}