{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:50:16", "date_modify": "2025-05-20 12:50:16", "date_publish": "2023-07-24 21:34:06", "description": "Kwon realises 'childhood dream' to play for Celtic", "filename": "sport_articles_cmlxvpdz3vzo_1747745416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/50b4/live/bd6faf90-2a69-11ee-b70d-2383e2c68b6b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cmlxvpdz3vzo_1747745416.html", "title": "Kwon realises 'childhood dream' to play for Celtic", "title_page": "Kwon realises 'childhood dream' to play for Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kwon Hyeok-kyu says he has realised an ambition he had as a child to join Celtic - having watching games involving fellow South Koreans Ki Sung-yueng and Cha Du-ri.\nThe 22-year-old midfielder has signed for the Scottish champions from Busan I-Park, for whom he has played 20 times this season as they sit third in K-League 2.\nMidfielder Ki and wide-man Cha both spent two years at Celtic Park from 2010.\n\"Since I was a youth player, I always watched the Celtic matches of Ki Sung-yueng and Cha Du-ri and it is one of my dreams to become a part of this club,\" Kwon told Celtic TV.\nHe had earlier posted an Instagram post telling Busan I-Park fans it was \"heartbreaking\" to leave the club - and he hopes to one day return - but \"I've decided to move because it's time to start a challenge\" to realise that childhood dream.\nKwon arrives at Celtic along with compatriot Yang Hyun-jun, the winger signed from Gangwon, while South Korea striker Oh Hyeon-gyu joined the Scottish champions in January - and he thinks their company will help him settle in.\nAsked what Celtic fans can expect, he added: \"My style is fighter because my position is defensive midfielder. I am pretty sure that I can be a great support to these offensive attackers and I like to attack myself.\"", "url": "https://www.bbc.com/sport/articles/cmlxvpdz3vzo"}