{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:16:42", "date_modify": "2025-04-26 04:16:42", "date_publish": "2025-03-04 00:00:00", "description": "India face Australia in the Champions Trophy semi-final in Dubai - follow live cricket scores, text updates, in-play video clips and radio commentary", "filename": "sport_cricket_live_clyepz1qvewt_1745641002.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2669/live/f4833150-f916-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_live_clyepz1qvewt_1745641002.html", "title": "India vs Australia; 2025 Champions Trophy semi-final, Dubai", "title_page": "India vs Australia; 2025 Champions Trophy semi-final, Dubai – cricket score, radio commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye\nWell, that's one finalist confirmed and also, the venue.\nIndia will find out their opponents tomorrow with hopefully another cracking match in store, as in-form South Africa take on New Zealand, who are looking to bounce back from their defeat by India a few days ago.\nWe'll bring you live coverage of that game in Lahore from 9:00 GMT, so make sure you join us. Until then, you can catch up on today's action with Matt Henry's match report from Dubai.\nBye for now!\n'We were very clinical with the bat'\nIndia captain Rohit Sharma: \"Until the last ball is bowled, nothing is certain. That's how this game is. Halfway through the game, we felt like it was a reasonable score and we'd have to bat really bat well to get it because the nature of the pitch was - it didn't allow you to play how you wanted to play.\n\"We were very, very clinical with the bat. Yes, we got the runs at the 48th over but I thought we were very calm and composed in our chase.\"\nOn the pitch: \"Looked a better batting surface. That has been the nature of the surfaces here, it is very uncertain. The one today played slightly better than the one against New Zealand.\n\"It's just about playing good cricket and taking it from there, not reading too much into what the pitch is doing. There are a lot of experienced guys in the group so we leave it up to them to decide what to do out in the middle.\"\nOn having six bowling options: \"I really wanted to have six bowling options and have batting until number eight as well. It was a bit of a challenge but when we were putting together the squad, this is something we discussed at length.\n\"Credit goes to everyone involved in making that team.\"\n'We lost wickets at crucial times' - Smith\nAustralia captain Steve Smith: \"I thought the bowlers did a really good job. Our spinners squeezed and enabled us to take the game deep. It was tough to rotate the strike at times but I thought everyone did a good job tonight.\n\"I think [the pitch] played pretty similar throughout. There was a bit of hold for the spinners, some skid, and there was a two paced-ness to the wicket. It wasn't the easiest of batting conditions.\n\"Having said that, we could have put a few more on. We lost wickets at crucial times and if we got 280+, it might have been different. It always felt like we were one wicket too many down.\"\nOn Australia's takeaways from the tournament: \"The bowling attack was quite inexperienced but they did a wonderful job throughout. There were glimpses tonight of good stuff. There's some really good cricketers in that changing room.\"\n'I don't think of the milestones, they just happen along the way'\nPlayer of the match Virat Kohli: \"I think it was pretty similar to the other day against Pakistan. For me, it's about conditions, and reacting accordingly. On this pitch it was about partnerships, they're the most important thing. Sometimes you can't execute things how you want to. The conditions tell me how I need to play and I'll change accordingly.\n\"My timing, composure at the crease. I was happy hitting ones around. That's when you know you're playing good cricket and that you're in for a good partnership. In today's game and against Pakistan, that's been the most important thing.\n\"It's all about pressure. If you go deep into the innings, the opposition usually gives in. It's about controlling your impulses, knowing the number of overs left. You know when you can turn the game around.\n\"I'm never focused on them [milestones]. I don't think of the milestones, they just happen along the way to victory. If we win it's a happy dressing room, you look back and you can be happy about what's happened out there. Then put your head down and focus on improving yourself.\"", "url": "https://www.bbc.co.uk/sport/cricket/live/clyepz1qvewt"}