{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:28:06", "date_modify": "2025-05-21 06:28:06", "date_publish": "2025-01-04 15:09:17", "description": "Team news for Sunday's six Scottish Premiership fixtures.", "filename": "sport_football_articles_cvg9y74dx12o_1747808886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/21fd/live/add6cce0-cb5c-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg9y74dx12o_1747808886.html", "title": "Sunday's Scottish Premiership team news", "title_page": "Sunday's Scottish Premiership team news - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell striker Apostolos Stamatelopolous is a major doubt with a strain and Lennon Miller, Steve Seddon, Ross Callachan, Callum Slattery and Zach Robinson remain out.\nAberdeen striker Ester Sokler went off injured on Thursday and will be assessed, but centre-half Slobodan Rubezic and midfielders Sivert Heltne Nilsen and Ante Palaversa are all back from suspension.\nGoalkeeper Dimitar Mitov has been ruled out for four weeks following his recent return from a hamstring injury, while Vicente Besuijen, Jack Milne and Pape Habib Gueye are still sidelined.\nCeltic midfielder Arne Engels could start after illness restricted him to a late appearance against Rangers.\nWinger James Forrest remains out through injury.\nGoalkeeper Zach Hemming is vying for a start after returning to St Mirren on loan from Middlesbrough, but incumbent Ellery Balcombe himself remains on loan from Brentford.\nForward Conor McMenamin is a doubt, while centre-half Charles Dunne remains out.\nDundee United hope to have midfielder David Babunski back from illness.\nLouis Moult and Craig Sibbald remain out.\nHearts hope to have winger Elton Kabangu, who has signed from Belgian club Royale Union Saint-Gilloise, registered in time to be involved, while centre-half Jamie McCart has been signed from Rotherham United.\nBut captain Lawrence Shankland is facing several weeks out with a calf strain.\nFrankie Kent, Stephen Kingsley, Calem Nieuwenhof and Gerald Taylor are still out injured.", "url": "https://www.bbc.com/sport/football/articles/cvg9y74dx12o"}