{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:06", "date_modify": "2025-05-21 04:35:06", "date_publish": "2025-04-04 17:57:23", "description": "IPL 2025 results: Mitchell Marsh helps LSG beat MI", "filename": "sport_cricket_articles_cd9lxykk3keo_1747802106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9bd/live/232eb360-117e-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cd9lxykk3keo_1747802106.html", "title": "IPL 2025 results: Mitchell Marsh helps LSG beat MI", "title_page": "IPL 2025 results: Mitchell Marsh helps LSG beat MI - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia's Mitchell Marsh smashed 60 from just 31 balls at the top of the order to set up Lucknow Super Giants' comfortable 12-run win over Mumbai Indians in the Indian Premier League.\nMarsh was used as an impact player and registered his third half-century in four innings as Lucknow posted 203-8.\nThe chase went to the final over but with 22 required from it, Lucknow seamer Avesh Khan held his nerve as Mumbai fell short on 191-5, with captain Hardik Pandya unbeaten on 28.\nLucknow raced to 69-0 inside the six-over powerplay, with Marsh scoring 60 of those runs and Aiden Markram had just seven.\nMakram went on to score 53 from 38 balls before cameos of 31 from Ayush Badoni and 27 from David Miller helped them past 200, while Hardik took 5-36.\nMumbai lost openers Will Jacks and Ryan Rickelton cheaply, but Naman Dhir's 46 and an entertaining 67 from 43 balls from Suryakumar Yadav kept them in contention.\nBut his dismissal left 52 runs required from the final four overs and swung the game back in Lucknow's favour, and they closed out the victory with spinner Digvesh Singh Rathi bowling a brilliant spell of 1-21.\nThe result takes Lucknow to sixth in the table while Mumbai are in seventh with just one win from four matches so far.", "url": "https://www.bbc.com/sport/cricket/articles/cd9lxykk3keo"}