{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 05:44:59", "date_modify": "2025-05-21 05:44:59", "date_publish": "2025-01-31 17:01:39", "description": "Formula 1's governing body is to introduce tougher tests on wing flexing in the 2025 season.", "filename": "sport_formula1_articles_c8635dp1zqzo_1747806299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4221/live/bd418750-dff3-11ef-b989-9b0a61de45dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c8635dp1zqzo_1747806299.html", "title": "Formula 1's governing body to introduce tougher tests on wing flexing in the 2025 season", "title_page": "Formula 1's governing body to introduce tougher tests on wing flexing in the 2025 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Formula 1's governing body is to introduce tougher tests on wing flexing in the 2025 season.\nThe ability to exploit flexibility of front and rear wings while staying within the rules was regarded as a key component in McLaren's constructors' championship victory.\nAnd it led to a series of rows between them and rivals Red Bull as the championship drew to a conclusion.\nA spokesperson for governing body the FIA said: \"We are committed to ensure that bodywork flexibility is no longer a point of contention for the 2025 season.\"\nTougher tests will be applied to wings in two phases in the first part of the new season, the FIA said.\nThe first of these, which applies to rear wings, will be introduced at the season-opening race in Australia on 14-16 March.\nThe second, regarding front wings, will come into force at the Spanish Grand Prix, running from 30 May to 1 June.\nThe spokesperson added: \"This phased approach allows teams to adapt without the need to discard existing components unnecessarily.\n\"These adjustments are aimed at further refining our ability to monitor and enforce bodywork flexibility regulations, ensuring a level playing field for all competitors to promote fair and exciting racing.\"\nThe FIA said the change in testing was as a consequence of \"further analysis carried out by the FIA single-seater department after the conclusion of the 2024 season\".\nBut the spokesperson denied that the technical directive detailing the tougher tests, which was first revealed by Italy's autoracer.it website, was a response to complaints from Red Bull about the flexibility of McLaren's wings.\nTeams have long used the ability to make wings flex as a tool to increase performance.\nThe principle is that drag can be reduced on the straight as the wing changes shape under increased load, boosting straight-line speed, before the wing flicks back to a maximum downforce-producing specification as the car slows for corners, to boost grip.\nIn general, the process allows teams to run the cars with more downforce in the corners without sacrificing straight-line speed, which would normally be a consequence of more powerful wings.\nThis has become especially important with the current generation of cars, because their inherent design makes it difficult to achieve an ideal handling balance between high- and low-speed cornering.\nThat was the major issue Red Bull came up against last year as their competitiveness suffered following a dominant start to the season.\nRed Bull's Max Verstappen won a fourth consecutive world title after fending off McLaren's Lando Norris in the second half of the championship.\nBut Red Bull's performance struggles - and a resultant poor season by Verstappen's team-mate Sergio Perez - meant they finished third in the constructors' championship behind McLaren and Ferrari.\nHaving wings that can flex and reduce drag on the straights allows teams to find a more optimum balance to reduce understeer - a lack of front grip - in slow corners while not suffering from excessive oversteer - a lack of rear grip - at high speed.", "url": "https://www.bbc.com/sport/formula1/articles/c8635dp1zqzo"}