{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:37:40", "date_modify": "2025-05-19 15:37:40", "date_publish": "2017-07-26 16:47:02", "description": "Carl Frampton says he may be left without a boxing future if he loses Saturday's WBC featherweight title eliminator.", "filename": "sport_boxing_40730161_1747669060.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31E0/production/_97086721_frampton.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_40730161_1747669060.html", "title": "Carl Frampton: Belfast man says defeat on Saturday 'could be career-ending'", "title_page": "Carl Frampton: Belfast man says defeat on Saturday 'could be career-ending' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carl Frampton has said defeat by Mexican Andres Gutierrez in Saturday's WBC world featherweight title eliminator could prove \"career-ending\".\nFrampton, 30, has not fought since his loss to Leo Santa Cruz in their WBA featherweight title fight in January.\nGutierrez, 24, has lost one of his 35 bouts and has earned 24 knockout wins.\n\"What happens if I lose this fight? There is no future,\" said Frampton, also a previous IBF world super-bantamweight champion.\nSanta Cruz's victory over the Northern Irishman in Las Vegas six months ago avenged Frampton's triumph in New York last July.\nDespite that first career defeat, Frampton believes he can re-establish himself as the planet's best featherweight.\n\"I lost a close fight with an under-par performance to a three-weight world champion.\n\"If I'm performing, I still believe I'm the best featherweight in the world and I believe I can beat guys like Leo Santa Cruz.\n\"But I don't want to overlook this guy Gutierrez. He is a very good fighter. He's had as many knockout wins as I've had fights.\"\nFrampton had hoped to fight Santa Cruz for a third time this summer but with the WBA champion refusing to travel to Northern Ireland and a mooted contest with IBF champion Lee Selby also not materialising, he is instead fighting Gutierrez in his home city's SSE Arena.\n\"The most important thing for me was to come back and fight at home,\" added Frampton.\n\"But I need to look good. I need to be impressive and show the rest of the featherweights that the last fight was just a blip.\"\nWhile Frampton has insisted he will not under-estimate Gutierrez, ranked eighth by the WBC, the Belfast man believes the home town crowd could help him clinch a knockout triumph.\n\"The noise, the atmosphere in the arena inspires me and the Chris Avalos fight (February 2015), the last time I fought in Belfast, I think that was my best performance even though some people say that was my first fight against Santa Cruz.\n\"If I'm performing, and with the way the last couple of weeks in sparring have gone, if I can carry that into the ring on Saturday night then I think I will get rid of this guy (knock him out).\"\nBoth fighters attended a public workout with Gutierrez noticeably slimmer than when he attended the fight announcement in Belfast six weeks ago.", "url": "https://www.bbc.com/sport/boxing/40730161"}