{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:53:49", "date_modify": "2025-05-20 14:53:49", "date_publish": "2023-07-27 13:31:56", "description": "Britain's Heather Watson beats Belarusian Yuliya Hatouka in three sets to reach the Poland Open quarter-finals, but compatriot Jodie Burrage's run is over.", "filename": "sport_tennis_66326572_1747752829.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BD83/production/_130551584_gettyimages-1517139164.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66326572_1747752829.html", "title": "Poland Open: Britain's Heather Watson reaches quarter-finals but Jodie Burrage knocked out", "title_page": "Poland Open: Britain's Heather Watson reaches quarter-finals but Jodie Burrage knocked out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Heather Watson is through to the Poland Open quarter-finals, but compatriot Jodie Burrage's run is over.\nWatson, 31, defeated Belarusian Yuliya Hatouka in three sets, recovering from losing the second to win 6-2 5-7 6-1.\nThe British number five will play her Belgian doubles partner Yanina Wickmayer in the last eight.\nHowever, British number two Burrage, 24, fell to a 6-4 6-1 defeat by Italian world number 108 Lucrezia Stefanini in Warsaw.\nWatson missed her first two match points when leading Hatouka 5-4 in the second set but produced a dominant finish after the Belarusian forced a deciding set.\nBurrage, who reached the second round at Wimbledon, lost eight games in a row after breaking for a 4-3 lead in the first set as the second quickly unravelled.\nWatson and Wickmayer overcame British pair Olivia Nicholls and Alicia Barnett 6-2 5-7 10-7 in the second round of the women's doubles later on Thursday.\nElsewhere, British number two Dan Evans was beaten in three sets by German world number 88 Dominik Koepfer at the Atlanta Open.\nThe third seed was a break up in the deciding third set of the last-16 tie.\nHowever he lost five successive games to suffer a 2-6 7-6 6-4 defeat.", "url": "https://www.bbc.com/sport/tennis/66326572"}