{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:54", "date_modify": "2025-05-21 05:51:54", "date_publish": "2025-04-02 09:27:31", "description": "Chelsea accounts 2024-25: Kieran Maguire on profits", "filename": "sport_football_articles_cy4vgpyg4lvo_1747806714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad76/live/8e2f8ee0-0fa4-11f0-b696-d3bfdfb825fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy4vgpyg4lvo_1747806714.html", "title": "Chelsea accounts 2024-25: Kieran Maguire on profits", "title_page": "Chelsea accounts 2024-25: Kieran Maguire on profits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Chelsea announced a pre-tax profit of £128.4m for the year ending June 2024, Uefa have said they will assess the sale of the women's team to parent company BlueCo at the end of the season.\nBBC Sport asked football finance expert Kieran Maguire for his thoughts on the accounts:\nIt's certainly an unprecedented level of profit, which we have not seen before. At the same time, nobody's quite certain how much a women's team is worth.\nChelsea had to submit their accounts to the Premier League by 31 December 2024. The Premier League had two weeks to review them to take things further and decided not to, so it must be satisfied.\nChelsea certainly benefit from being in a very upmarket part of London, so therefore the ability to sell those hotels as real estate assets is more beneficial to them.\nThere has been an enthusiasm from some club owners to outlaw this particular rule. It is not possible to sell your assets to yourself and book profits in the EFL. The rules under Uefa are complex and difficult to understand, but then again it is not guaranteed that Chelsea will be able to utilise these profits.\nUefa tends to fine clubs for breaching the financial rules as opposed to on-field penalties, so if I was a Nottingham Forest or Everton fan I suspect I would feel very aggrieved, because they have been punished severely in terms of historical points deductions for spending money, but spending far less money than Chelsea.\nBut the Premier League owners have decided to allow this particular feature and it does seem strange, but it is their ball and that is how they are choosing to play with it.", "url": "https://www.bbc.com/sport/football/articles/cy4vgpyg4lvo"}