{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 14:42:26", "date_modify": "2025-05-19 14:42:26", "date_publish": "2017-08-25 13:36:52", "description": "Lewis Hamilton starts his Belgian Grand Prix weekend in perfect fashion as he sets the pace in the second Friday practice session.", "filename": "sport_formula1_41050114_1747665746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8E51/production/_97533463_lewis_hamilton_epa-5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_41050114_1747665746.html", "title": "Lewis Hamilton tops Belgian Grand Prix second practice", "title_page": "Lewis Hamilton tops Belgian Grand Prix second practice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Hamilton started his Belgian Grand Prix weekend in perfect fashion as he set the pace in the second practice session.\nHamilton was 0.262 seconds quicker than Ferrari's Kimi Raikkonen in second, with Mercedes' Valtteri Bottas third.\nHamilton's title rival Sebastian Vettel - 14 points ahead in the title race - was fifth quickest, 0.482secs down.\nRed Bull's Max Verstappen pipped Vettel by just 0.01secs to separate the German from the rest of the front-runners.\nHamilton was in strong form all day. Although he was second behind Raikkonen in the first session, the margin was only 0.053 seconds and Hamilton set his time on the slowest of the three types of tyre, the soft, while Raikkonen was on the ultra-soft.\nHamilton was also quickest earlier in the second session, when he was running the soft tyre again. He was 0.7secs quicker than anyone else, with Bottas in second on the super-soft.\nHowever, the long runs later in the session told a different story.\nOn the so-called race-simulation runs, when teams fill up their tanks with fuel and practise the first part of the race, Vettel was 0.7secs on average quicker than Hamilton, with Bottas a further 0.1secs back.\n\"It was a good day,\" said Hamilton. \"The car was feeling good from the get-go and the set-up changes we made were in the right direction.\n\"On the long run, the Ferraris looked quickest but I don't think we are in a bad place.\"\n\"They looked very strong,\" said Vettel. \"Whenever they went out, they had the possibility to go fast.\n\"For me I was not so happy. I did not really find the rhythm, especially on the short run. The long run was better. So overall I think the car is there to do the job, to go fast, but we just need to get it right on all fronts and I just need to do my job and then we should be fine.\"\nCurrent weather forecasts expected rain to affect Saturday's qualifying session, but not the race on Sunday.\nBehind the big six, Nico Hulkenberg continued Renault's improved form with seventh fastest time, his team-mate Jolyon Palmer also showing better pace after a difficult first half to the season in 10th place, 0.3secs behind the German.\nThe Renault drivers were split by the Force India of Esteban Ocon - four places ahead of team-mate Sergio Perez - and Toro Rosso's Carlos Sainz.\nIt was a difficult day for the Williams team. Felipe Massa missed both sessions after a heavy crash at Malmedy on his first flying lap in the first session damaged his chassis and required a new one.\nTeam-mate Lance Stroll was 15th fastest, three seconds off the pace.\nSecond practice results\nBelgian Grand Prix coverage details", "url": "https://www.bbc.com/sport/formula1/41050114"}