{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:16:51", "date_modify": "2025-05-20 14:16:51", "date_publish": "2023-07-29 16:28:08", "description": "St Johnstone slump to an embarrassing 4-0 home loss to League 2 champions Stirling Albion as five top-flight rivals progress in the Viaplay Cup.", "filename": "sport_football_66349321_1747750611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10F2/production/_130583340_maclean.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66349321_1747750611.html", "title": "Viaplay Cup: St Johnstone slump to 4-0 home loss to Stirling as five top-flight sides progress", "title_page": "Viaplay Cup: St Johnstone slump to 4-0 home loss to Stirling as five top-flight sides progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone slumped to an embarrassing 4-0 home defeat by League 2 champions Stirling Albion as five top-flight rivals progressed in the Viaplay Cup.\nThe Perth side had already missed out before their final game of the group stage in Perth.\nBut Kilmarnock, Livingston, Motherwell, Ross County and St Mirren have all reached the last 16.\nChampionship sides Airdrieonians, Ayr United and Partick Thistle also go through as group winners.\nStirling, who finish second in their group behind Ayr, join them as they are assured of being one of three best runners-up along with Greenock Morton.\nRaith Rovers currently occupy the other qualification spots, but the Kirkcaldy side will miss out should Dundee beat visitors Inverness Caledonian Thistle by two clear goals in Sunday's final game of the group stage.\nCounty topped their group despite being held to a 3-3 draw at home to League 1 side Kelty Hearts, who also took the bonus point be winning the penalty shoot-out.\nAs a result of Kelty's penalty-kick prowess, Motherwell will be one of the seeded sides in Sunday's draw along with Airdrieonians and Ayr.\nVeteran striker Greig Spence headed Stirling into an 11th-minute lead against St Johnstone, Lewis Milne fired the second before the break before two headed goals from Paul McLean early in the second half sealed the Premiership side's fate.\nAyr cruised to qualification and were 4-0 ahead by the break against League 1 visitors Alloa Athletic, with Fraser Bryden scoring twice and other goals coming from Nick McAllister, Jamie Murphy, Olly Pendlebury before Steven Hetherington was sent off and Ahkeem Rose added another against the 10 men.\nPartick Thistle edged out Falkirk to top place thanks to captain Brian Graham's penalty two minutes from time in a 2-1 win over League 2 visitors Spartans.\nJames Lyon gave the Glasgow side the lead shortly after the break, Blair Henderson equalised - the forward's fourth goal in four group games - to give Spartans hope of topping the group themselves, but James Craigen was sent off as he conceded the crucial spot kick.\nFalkirk miss out by a point despite a 4-1 win over League 2 visitors Peterhead. Conor O'Keefe gave the visitors an early lead before replies from Tom Lang, Ross MacIver, Alfredo Agyeman and Calvin Miller.\nLivingston dominated possession against League 2 strugglers Clyde, but Bruce Anderson's 75th-minute winner was enough to top the group, although the striker also had a penalty saved.\nHamilton Academical could have edged out the Premiership side, but they were held to a 2-2 draw at home to League 1 rivals Cove Rangers and missed out on the bonus point by losing the shoot-out.\nKevin O'Hara gave Accies the early lead, Mark Gallagher and Rumarn Burrell put Cove ahead only for Reghan Tumilty to equalise deep into stoppage time.\nSt Mirren had to beat Forfar Athletic to overtake the visitors and win the group and duly did so thanks to two goals from new signing Mikael Mandron, plus others from Mark O'Hara and Alex Gogic.\nMeanwhile, Arbroath eased to victory in their derby at home to Montrose thanks to goals from Leighton McIntosh, Kenan Dunnwald-Turan and Jay Bird.", "url": "https://www.bbc.com/sport/football/66349321"}