{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:27", "date_modify": "2025-05-21 06:01:27", "date_publish": "2025-01-23 00:01:11", "description": "Real Madrid become the first football club to generate more than 1bn euros in annual revenue, according to analysis by Deloitte.", "filename": "sport_football_articles_c9qj0j87nlwo_1747807287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f90/live/facf58a0-d8a9-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9qj0j87nlwo_1747807287.html", "title": "Deloitte Money League: Real Madrid top, Man City second, Man Utd fourth", "title_page": "Deloitte Money League: Real Madrid top, Man City second, Man Utd fourth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Real Madrid have become the first football club to generate more than 1bn euros in annual revenue, according to analysis by Deloitte.\nThe Spanish club retain top spot in Deloitte's Money League study with revenue of 1.05bn euros (£883m) from a 2023-24 season in which they won La Liga and the Champions League.\nManchester City are again second with revenue of £708m.\nThey won an unprecedented fourth consecutive Premier League title and the Club World Cup and European Super Cup last season.\nParis St-Germain (£681m), Manchester United (£651m) and Bayern Munich (£646m) complete the top five.\nAston Villa enter the top 20 after competing in Europe last season for the first time since 2011.\nNine Premier League clubs are in the top 20, with Arsenal, Liverpool, Tottenham, Chelsea, Newcastle and West Ham retaining their places.\nLyon are the only other new club, with Napoli and Eintracht Frankfurt dropping out.\nA further five Premier League clubs are in the top 30, with Brighton 21st after competing in the Europa League for the first time in their history.\nCrystal Palace, Everton, Fulham and Wolves are ranked 26th to 29th.\nRevenues for the top 20 clubs rose by 6% to a record £9.47bn.\nMatchday revenue was the fastest growing revenue stream, rising by 11% to £1.77bn, helped by an increase in stadium capacity, ticket prices and premium hospitality.\nReal benefited most from an increase in matchday revenues, generating £210m - double last year's figure - after renovation of their Bernabeu Stadium.\nBarcelona dropped from fourth to sixth after a £53m fall in matchday revenue, with games played at a smaller stadium while the Nou Camp is redeveloped.\nCommercial revenue remained the largest revenue source in the Money League, rising 10% to £4.14bn and accounting for 44% of total revenue, helped by the hosting of non-football live events such as concerts.\n\"Money League clubs continue to break records with ongoing growth in commercial and matchday revenues,\" said Tim Bridge, lead partner in the Deloitte sports business group.\nTotal broadcast revenue remained at £3.64bn because each of the big five leagues - the Premier League, Spain's La Liga, German Bundesliga, France's Ligue 1 and Italy's Serie A - are in the same domestic broadcast cycle.\n*Figures converted from euros may differ from previously reported figures because of a change in currency exchange rates", "url": "https://www.bbc.com/sport/football/articles/c9qj0j87nlwo"}