{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:57:18", "date_modify": "2025-05-20 12:57:18", "date_publish": "2023-08-02 22:45:53", "description": "Ex-West Ham midfielder Manuel Lanzini and former Spurs winger Lucas Moura agree deals with their boyhood clubs after leaving the Premier League.", "filename": "sport_football_66390459_1747745838.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16D48/production/_130621539_microsoftteams-image-4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66390459_1747745838.html", "title": "Manuel Lanzini and Lucas Moura return to boyhood clubs in South America", "title_page": "Manuel Lanzini and Lucas Moura return to boyhood clubs in South America - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Premier League players Manuel Lanzini and Lucas Moura have agreed deals with their boyhood clubs in South America.\nArgentina midfielder Lanzini and Brazil winger Moura were released by West Ham and Tottenham Hotspur respectively at the end of last season.\nLanzini, 30, has signed for River Plate, who are based in Buenos Aires, Argentina, on a one-year deal.\nWhile Moura, also 30, has returned to his home country with Sao Paulo.\nRiver Plate announced the deal on Wednesday, with club president Jorge Brito saying: \"Manuel will be a unique player in Argentine football because of the level of play he comes from. He is very important for us.\" Lanzini began his career at River Plate in 2010 before spells at Fluminense in Brazil, Al-Jazira in the United Arab Emirates and West Ham, where he made more than 200 appearances between 2015 and 2023. Meanwhile, ex-Paris St-Germain winger Moura has joined Sao Paulo after his Spurs contract came to an end in June.He made his professional debut with the Brazilian club in 2010, winning the Copa Sudamericana with them two years later before heading to Europe for a decade.\nThe 35-cap international said returning to the club had been \"a whirlwind of emotions\".\nMoura joined Spurs in 2018 and memorably scored a hat-trick against Ajax in the 2019 Champions League semi-final, before the club's loss to Liverpool in the final.\nHe joins another former Premier League player, Colombia forward James Rodriguez, 32, who has also recently signed with Sao Paulo.\nThe 90-cap international played for Everton in the 2020-21 season after spells with Monaco and Real Madrid.", "url": "https://www.bbc.com/sport/football/66390459"}