{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:09:32", "date_modify": "2025-05-20 12:09:32", "date_publish": "2023-08-05 09:00:20", "description": "Manchester City sign Croatia centre-back Josko Gvardiol on a five-year deal from RB Leipzig for £77m.", "filename": "sport_football_66012707_1747742972.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7950/production/_130665013_gvardiol1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66012707_1747742972.html", "title": "Josko Gvardiol: Manchester City sign Croatia centre-back from RB Leipzig", "title_page": "Josko Gvardiol: Manchester City sign Croatia centre-back from RB Leipzig - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City have completed the signing of Croatia centre-back Josko Gvardiol on a five-year deal from RB Leipzig for 90m euros (£77m).\nHe is the second most expensive defender of all time after Harry Maguire, who joined Manchester United for £80m from Leicester City in 2019.\nGvardiol, 21, has impressed in his two seasons at Leipzig after joining from Dinamo Zagreb in July 2021.\n\"I have always dreamed of one day playing in England,\" he said.\n\"To be doing so now with Manchester City - after the season they have just had - is a real honour for me.\"\nGvardiol, who has been capped 21 times by Croatia and helped his side finish third at the 2022 World Cup as well as runners-up to Spain in this year's Nations League, will wear the number 24 shirt.\n\"Anyone who saw Manchester City play last season knows they are the best team in the world. To win the Treble says everything you need to know about the quality this team has,\" he added.\n\"To be joining City is something very special for me and my family. To have the chance to work with Pep Guardiola will be amazing. I know I am not yet the finished article and I am sure my game will progress under the best coach in football.\n\"To be linking up with [Croatia midfielder] Mateo Kovacic will also be special.\"\nCity signed Kovacic from Chelsea for an initial £25m in June.\nGvardiol said he would also be pleased to be playing alongside, rather than facing, City's prolific striker Erling Haaland.\n\"Luckily, I'm on his side now and I don't have to take care of him anymore,\" he said.", "url": "https://www.bbc.com/sport/football/66012707"}