{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 14:57:40", "date_modify": "2025-05-20 14:57:40", "date_publish": "2023-07-27 06:56:48", "description": "Could the tide be turning after the United States - a dominant force for so long - are held by the Netherlands at the Women's World Cup?", "filename": "sport_football_66321567_1747753060.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11F0/production/_130529540_trinityrodman.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66321567_1747753060.html", "title": "Women's World Cup 2023: USA boss Vlatko Andonovski sees holders fail to fire", "title_page": "Women's World Cup 2023: USA boss Vlatko Andonovski sees holders fail to fire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For 45 minutes of an absorbing contest in New Zealand's capital, something quite extraordinary was developing.\nWhen Jill Roord fired the Netherlands into a 17th-minute lead at the Wellington Regional Stadium, the United States trailed in a Women's World Cup match for the first time since the 2011 tournament.\nThe USA were heading for defeat until Lindsey Horan's headed equaliser in the 62nd minute rescued a point in an entertaining 1-1 draw.\nWhen asked if his team had not shown their best and had more to come after two games where the defending champions have failed to fire on all cylinders, United States boss Vlatko Andonovski said: \"I think that's a fair statement.\n\"Part of the reason is this team has not had time together. The first time we have seen this team together was in game one and now we saw them again in game two.\n\"In game three we expect to grow from there and as we hopefully move forward we are going to see better and better.\"\nDespite Andonovski's confident outlook, the Dutch showed that the world's number one team, the four-time world champions and super-power of the women's game, might not be as invincible as they once were.\nThe Group E encounter was a repeat of the 2019 final in which the United States won 2-0 in Lyon courtesy of a penalty by Megan Rapinoe and another goal by Rose Lavelle.\nThere were four survivors from that game four years ago in the USA's starting XI on Thursday - keeper Alyssa Naeher, defenders Crystal Dunn and Julie Ertz and forward Alex Morgan.\nLavelle came on and provided the assist for Horan's equaliser.\nBut this USA squad is a balance of seasoned veterans who have been there and done it, along with 14 players who are making their first appearance on the World Cup stage.\nAfter defeating Vietnam 3-0 in their first match, when they were guilty of wasting a host of chances, the Stars and Stripes had to dig deep to stretch their unbeaten run to 16 World Cup matches stretching across three tournaments.\nThe Americans will be next in action on Tuesday, when Portugal will be the opposition.\n\"This is the next generation, it will take time,\" former England defender Anita Asante said on BBC One.\n\"But now we are seeing a turning of the tide and they are in transition.\n\"It will take time for them to mesh and gel. They still have exciting players who can spark ingenuity and creativity in those attacking areas. When it does click, they can still be frightening.\"\nThe United States are in the hunt for an unprecedented third consecutive world title.\nThis is a long tournament, of course, and after two games they have four points and are on course for the knockout stage.\nDespite a strong finish against the Netherlands, this felt like a missed opportunity for the champions to send out a message.\nWith so many players appearing on the global stage for the first time, fans will have to show patience, according to former England midfielder Fern Whelan.\n\"There's individual brilliance going on, but in terms of gelling, they're still trying to find the identity of this US team,\" added Whelan on BBC One.\nAndonovski preferred to concentrate on the positives as he praised his side for battling from behind to get a point.\n\"It's one thing to have an experienced team and do that [come from behind], but it's a lot bigger with a younger team and an inexperienced team like this,\" said the head coach.\n\"The resilience this team has is sometimes crazy. This team is not just young, this is also a fresh team that hasn't spent a lot of minutes together.\n\"We can be disappointed we didn't win, but there are lots of positives coming out of this game going forward.\"", "url": "https://www.bbc.com/sport/football/66321567"}