{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 05:59:34", "date_modify": "2025-05-21 05:59:34", "date_publish": "2025-01-25 21:22:20", "description": "Paul Hughes' bid to become Bellator lightweight champion falls agonisingly short as Usman Nurmagomedov claims a thrilling majority decision win in Dubai.", "filename": "sport_mixed-martial-arts_articles_clye7ne7v5ro_1747807174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/54a6/live/e78a37f0-db70-11ef-a991-65e04595f231.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_clye7ne7v5ro_1747807174.html", "title": "Usman Nurmagomedov vs Paul Hughes: Irishman Hughes falls short in lightweight title bout", "title_page": "Usman Nurmagomedov vs Paul Hughes: Irishman Hughes falls short in lightweight title bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paul Hughes' bid to become Bellator lightweight champion fell agonisingly short as Usman Nurmagomedov claimed a thrilling majority decision win in Dubai.\nNurmagomedov retained the belt and extended his unbeaten streak to 19 fights after the judges scored the fight 47-47, 48-46, 48-46 in his favour.\nIt is a devastating result for Irishman Hughes, who had hoped to take his career to the next level after an impressive win over AJ McKee in October.\nAnd while the 27-year-old did his reputation no harm in what was his second defeat, it was ultimately Nurmagomedov's night.\n\"I underestimated this guy. It was my little mistake but I'm still undefeated,\" said Nurmagomedov.\n\"Bellator lightweight champion Usman Nurmagomedov, thank you so much. The wrestling, takedown defence he did very well. He is strong brother, you're really strong.\"\nA visibly crestfallen Hughes said he was \"so gutted\" after a fight which \"played out how I expected\", while calling for a rematch in Belfast.\n\"I really thought I won that one. I should have pushed harder,\" he said.\n\"We're gonna fight again, I really respect Usman, I probably left some in the tank but I won't next time.\n\"I really thought I was going to win tonight, I'm heartbroken. We have to do the rematch in Belfast, it has to be in Belfast. I think I've earned this. All the guys in Dagestan, you will be welcome in Ireland.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/clye7ne7v5ro"}