{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:08:11", "date_modify": "2025-05-20 14:08:11", "date_publish": "2023-07-30 15:46:48", "description": "Demi Vollering wins the Tour de France Femmes title after coming second in the individual time trial on stage eight.", "filename": "sport_cycling_66355480_1747750091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C9E8/production/_130588615_gettyimages-1580865440-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66355480_1747750091.html", "title": "Tour de France Femmes: Demi Vollering wins title as Reusser claims stage eight victory", "title_page": "Tour de France Femmes: Demi Vollering wins title as Reusser claims stage eight victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Demi Vollering has won a maiden Tour de France Femmes title after coming second in the individual time trial on stage eight.\nMarlen Reusser won the final stage with a time of 29 minutes 15 seconds.\nDutch rider Vollering took possession of the yellow jersey on Saturday after a sensational stage seven win.\nHer time of 29:25 in the time trial meant she finished three minutes three seconds ahead of Belgian team-mate Lotte Kopecky in the overall standings.\n\"I still cannot believe it,\" Vollering, 26, said.\n\"Of course I worked hard, but it's not only working hard, it's believing in it. It's so many things together in the end.\n\"You have your dream and you work really hard but you also need to keep calm and have balance in your life and find a relaxed way to do all this. This year, I feel really comfortable in what I'm doing.\"\nThe SD Worx duo were joined on the podium by Poland's Katarzyna Niewiadoma of Canyon-SRAM, who matched her finish in last year's race, while defending champion Annemiek van Vleuten came fourth.\nReigning world champion Van Vleuten, 40, who is planning to retire at the end of the season, said: \"Of course I am disappointed that I was not good in the last two days.\n\"I was in a battle and I gave it my all, I didn't make any mistakes or do something wrong. I was obviously not myself as I can be, which is a bit sad in my last Tour de France.\"\nKopecky finished the tour with the points jersey, while Niewiadoma took the polka-dot queen of the mountains jersey.", "url": "https://www.bbc.com/sport/cycling/66355480"}