{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:15:29", "date_modify": "2025-05-19 15:15:29", "date_publish": "2015-02-27 14:24:03", "description": "Jordi Murphy's inclusion for injured Jamie Heaslip is Ireland's only change for Sunday's Six Nations game against England.", "filename": "sport_rugby-union_31662786_1747667729.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81287000/jpg/_81287754_jordimurphy.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31662786_1747667729.html", "title": "Six Nations: Murphy inclusion only Ireland change for England game", "title_page": "Six Nations: Murphy inclusion only Ireland change for England game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jordi Murphy's inclusion in place of Jamie Heaslip is Ireland's only change from the win over France for Sunday's big Six Nations game against England.\nNumber eight Heaslip is ruled out by injury after being kneed in the back by France's Pascal Pape two weeks ago.\nMurphy, who will be earning his seventh cap, started in Ireland's opening Six Nations win over Italy when Heaslip was missing because of a shoulder problem.\nJack McGrath remains at loose-head prop despite the claims of Cian Healy.\nBritish and Irish Lions front-rower Healy is back in action after more than three months of hamstring trouble.\nHealy was released to play for Leinster at the weekend after coming off the bench for Ireland's win over France.\nHowever, coach Joe Schmidt has opted to retain Healy's Leinster colleague McGrath in the prop role in the potential Six Nations decider.\nIreland and England are the only teams in the championship who can still win the Grand Slam.\nHeaslip cracked three vertebrae in Ireland's 18-11 victory over the French in an incident that earned lock Pape a 10-week ban.\nThe Ireland management are hopeful Heaslip, 31, will be fit for their next game against Wales in Cardiff on 14 March.\nMurphy, 23, made his first Six Nations start in the game in Rome.\nEoin Reddan and Tommy O'Donnell return to the replacements bench after missing the game against France.\nSchmidt insisted that McGrath had been selected on merit despite Healy's recent fitness issues.\n\"We did have temptation in a couple of areas, but when it comes to players who are performing in their slot, it's pretty hard to go past them in terms of selection.\n\"But, that said, no one owns a jersey.", "url": "https://www.bbc.com/sport/rugby-union/31662786"}