{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:29", "date_modify": "2025-05-21 06:32:29", "date_publish": "2025-03-31 16:58:37", "description": "Everton news: 'I don't want to end the story with Goodison' - Gueye", "filename": "sport_football_articles_c3ev9389jy4o_1747809149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2987/live/d4c9fa90-0e4e-11f0-8fda-f199207bcb26.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3ev9389jy4o_1747809149.html", "title": "'I don't want to end the story with Goodison' - Gueye", "title_page": "Everton news: 'I don't want to end the story with Goodison' - Gueye - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton midfielder Idrissa Gueye says the team have not yet started having conversations about moving on from Goodison Park and he will personally struggle to play his final games at the stadium.\nThe Toffees will move to their new Bramley Moore Dock home in the summer after 132 years at Goodison.\n\"We haven't started speaking about this yet but it will come in the next couple of games,\" Gueye told BBC Radio Merseyside's Giulia Bould.\n\"It will be a special moment for the club and for the team. But I'm not looking forward to this moment.\n\"Everything; the fans, the pitch, everything. It's not something you can explain, the atmosphere is unbelievable. This atmosphere helps us a lot and makes it more intimidating for the opponent. It's a special area and it's good for us because it gives us more opportunities to win games.\"\nGueye added: \"I enjoy my life at Everton because Everton means a lot to me.\n\"I have nice friends here, my two kids were born here and they are big fans.\n\"It's hard for me to talk about the new stadium because I don't want to end the story with Goodison - it's a special area for us.\"", "url": "https://www.bbc.com/sport/football/articles/c3ev9389jy4o"}