{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-04-26 07:56:06", "date_modify": "2025-04-26 07:56:06", "date_publish": "2025-02-25 12:24:27", "description": "Newcastle news: Fan opinion on inconsistency and panicked football", "filename": "sport_football_articles_cd650d58612o_1745654166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd650d58612o_1745654166.html", "title": "Newcastle news: Fan opinion on inconsistency and panicked football", "title_page": "Newcastle news: Fan opinion on inconsistency and panicked football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "I wrote last week that I was getting whiplash from these results and performances. People have been saying inconsistency is Newcastle United's identity this season, and we managed to typify that literally within the game this weekend. What a feat!\nWe started against top four side Nottingham Forest reasonably well, aside from a mistake causing us to concede within six minutes. If you ignore that bit, it was fine.\nThen came a wild 12 minutes in which we scored four goals. By the fourth goal, the crowd was laughing, enjoying a complete performance in which we totally dominated a team that we were worried about facing.\nBy 90 minutes, I was not laughing. I looked around at the faces in the stand. We had all visibly aged. It is a draining thing as a fan to feel so heartened and comfortable at one moment then anxious and desperate the next.\nOne thing that stuck out to me was the nervousness. After half-time, Newcastle were not really playing like a team 4-1 up. We looked worried.\nDid whatever Nuno Espirito Santo said (and did, switching Callum Hudson-Odoi and Anthony Elanga) to his team just work?\nNewcastle played like they were barely clinging on to a lead, misplacing passes and panicking on the ball. Substitutions were made a little late and could not calm the pace of the game and it was scrappy.\nI am not angry about it, as people on social media seem to be (permanently, about everything). I am just confused and unsettled.\nWe are about to play Liverpool, who are 20 points ahead of us and having an incredible season.\nAt half-time on Sunday at St James' Park, I was thinking that it might be a good game at Anfield. By full-time, I was thinking Liverpool must be buzzing to be up against us next.", "url": "https://www.bbc.co.uk/sport/football/articles/cd650d58612o"}