{"authors": ["Adam Pope", "www.facebook.com"], "date_download": "2025-04-26 06:30:20", "date_modify": "2025-04-26 06:30:20", "date_publish": "2025-02-27 10:37:05", "description": "BBC Radio Leeds reporter Adam Pope says Leeds United simply cannot be replicated as owners San Francisco 49ers Enterprises look to invest in Rangers.", "filename": "sport_football_articles_c62zz45l23qo_1745649020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c63e/live/aecc9530-f4f6-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62zz45l23qo_1745649020.html", "title": "'Quite simply, nobody does it quite like Leeds'", "title_page": "Leeds United: Opinion - 'Quite simply, nobody does it quite like Leeds' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Who wouldn't want a slice of Leeds United, hey?\nBack-to-back heart-stopping victories in not dissimilar fashion to the 2018-19 season when United came from two down at Aston Villa to win 3-2 and then win by the same scoreline, having lost a first-half lead, to Blackburn Rovers with a last minute brace from Kemar Roofe on Boxing Day were worth anyone's money.\nIf that was prime Marcelo Bielsa then Daniel Farke is in his own prime at Elland Road right now. Coming from behind to beat two promotion rivals in Sunderland and then Sheffield United in the final knockings of crackling atmospheres is why football has us addicted.\nWhen it means more, like a promotion-beckoning moment, then the rush is fierce. Harnessing the ride Leeds United provides makes the club even more attractive, especially to investors.\nQuite simply, nobody does it quite like Leeds.\nRed Bull have a significant financial interest, but not to the same extent as owners San Francisco 49ers Enterprises, and that, according to club chairman Paraag Marathe, is not an equation he sees flipping.\n\"That's not contemplated at all,\" he revealed when asked if the energy drinks giant could takeover when speaking at the Financial Times Business of Football Summit this week. \"There is no language to that effect. It's not something we have discussed ever.\"\nThat may be so, but the trajectory Leeds are on will only increase the desire for Red Bull and others to have more of this special and unique club on the verge of completing its return to the lucrative trappings of the Premier League.\nNow it appears Marathe and the 49ers feel the opportunities for commercial growth, and therefore returns for their investors, is available elsewhere. Scottish giants Rangers are reportedly in their sights.\n\"I can't really comment on whatever rumours might be out there,\" Marathe added. \"But we are looking at other opportunities. It is doable to replicate the passion [of Leeds].\n\"What we are looking for is clubs with the right bones, history of success and potential for growth.\"\nWith technical director Gretar Steinsson announced recently as being set to join the 49ers Enterprises' executive global football structure, a multi-club football model seems imminent.\nMarathe will be delighted to expand the family, adding \"absolutely there is enough room in your heart to love all your sports properties, just like there is to love all your children!\"\nBut no two children are the same, with some needing more attention than others... and nobody puts Leeds United in a corner.", "url": "https://www.bbc.co.uk/sport/football/articles/c62zz45l23qo"}