{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:53:47", "date_modify": "2025-05-21 07:53:47", "date_publish": "2024-12-23 18:17:47", "description": null, "filename": "sport_articles_cd60x67y5g3o_1747814027.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/101e/live/12227440-c15a-11ef-b200-e594162e2327.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd60x67y5g3o_1747814027.html", "title": "BBC Sport", "title_page": " - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Rangers striker Rory Loy insists Aberdeen will finish in the top three this season, despite their recent dip in form.\nThe Dons have failed to win their last six league games and after Saturday's defeat to Hibs, they've been leapfrogged in the Premiership table by Rangers.\nHowever, the Dons are still eight points clear of Motherwell behind them in fourth as they prepare to visit Kilmarnock on Boxing Day.\n\"A lot of things can affect momentum,\" Loy told the BBC's Scottish Football Podcast.\n\"Whether it's the 6-0 loss in the League Cup, although they did bounce back from that, but generally speaking, there's a number of factors.\n\"I think if you look at when Jimmy Thelin came in and he sat down with the board at the start of season and they looked at what they would want to achieve, they got to the semi-final in League Cup, third place definitely would have been up there if it wasn't that, at the very least making top six.\n\"Over the last condensed period it's not been good, that does cause slight concerns because you do want to turn that corner. I would just be hesitant to talk too much about the dip in form at this moment in time because they're still third.\n\"I don't think Thelin will be too concerned but he will want to that next league win on the board as soon as possible and I do think he'll finish third comfortably.\"", "url": "https://www.bbc.com/sport/articles/cd60x67y5g3o"}