{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-21 08:39:08", "date_modify": "2025-05-21 08:39:08", "date_publish": "2025-02-07 22:02:29", "description": "Wales aim to end a 13-Test losing run while Italy feel they are not shown enough respect by other rugby nations.", "filename": "sport_rugby-union_articles_c74edyl8227o_1747816748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e585/live/f98743d0-e584-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c74edyl8227o_1747816748.html", "title": "Six Nations: Italy and Wales battle in Rome for respect", "title_page": "Six Nations: Italy and Wales battle in Rome for respect  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This ancient city could hardly be a more fitting setting for what has become an old-fashioned battle for respect.\nIt has dramatically deserted one of these rugby nations while the other's captain suspects they have never truly been shown it.\nBut how things have changed between the two last holders of the Wooden Spoon and how much more could Saturday bring?\nSure, there is no silverware to be won or titles on the line in Rome but both teams are acutely aware of just what is at stake.\nAnd they both understand this game presents their best chance to make a statement.\nVictory will signify a new step forward while a thumbs down in a Roman colosseum can mean only one thing for the loser.\nWales are in the grip of their worst losing run and a 14th successive loss would see them drop to their lowest place in the world rankings.\nThe irony that they would fall to 12th behind Georgia will not be lost on Los Lelos who have been screaming from the rooftops of Tblisi for a place in the championship.\nGeorgia gave Wales their last win - way back at the 2023 World Cup - but will point to comments by former Wales captain Sam Warburton who called for promotion and relegation to the Six Nations.\nThis is surely the first time Wales have arrived in Rome as such rank outsiders.\nEven ahead of the defeats in 2003 and 2007, they came in the genuine belief they would win.\nBut as one Wales fan summed up to Rugby Union Weekly podcast host Ugo Monye: \"It's not the hope that kills you, it's the no hope.\"\nWales have spent the week together in Nice away from the pressure cooker back home but they know what awaits inside Stadio Olimpico.\n\"It's a huge game. A win is a long time overdue but it's about getting that balance where you don't put too much pressure on yourself,\" said flanker Dafydd Jenkins.\n\"We know externally there's big pressure on us but playing under pressure won't help anyone. We need to play freely to give ourselves the best chance of winning.\"\nMake no bones about it, Italy's supporters are convinced they are going to win. And why not considering the form book?\nBut there is a nervousness within the Azzurri camp. They are unused to wearing the favourite's tag and it has never sat well.\nHead coach Gonzalo Quesada believes the lack of a winning mentality was key to letting slip victory over Scotland when they were locked at 19-19 in Murrayfield last week.\nAnd captain Michele Lamaro knows they badly fumbled a chance to register a first home win in the Six Nations for ten years the last time they hosted Wales.\n\"It's something new [to be odds-on favourites] but it's massively important for Italian rugby that we learn to deal with this situation,\" said Lamaro.\n\"Many of this team played that game two years ago and it gave us the experience to manage that pressure better.\"\nLamaro was also unhappy the last time Italy faced Wales - in Cardiff - at what he felt was a lack of respect shown to his team by the Welsh Rugby Union.\nIn a newspaper interview, he complained of \"several small, unpleasant situations unworthy of a host country\" around the warm-up and players' families.\nBoth unions rushed to smooth the waters after the column appeared, but the feeling of being slighted remains.\n\"It's always difficult to say if we have respect of other nations,\" Lamaro said on Friday.\n\"I think the way teams prepare for our games has changed but I'm pretty sure in the back of their minds, they think Italian rugby is still not at the same level as theirs.\n\"We can use that as motivation and have 80 minutes to get credibility and respect back. Saying that, I'm not sure it's ever been there.\n\"Yes, teams fear us on a one-off occasion but respect is different against countries with such big rugby traditions and cultures.\"\nWales, across the two starting teams, are taller, heavier and older but not necessarily wiser given Italy have far more Test caps.\nIn the opening game, Jac Morgan made the most carries, most metres and Tomos Williams made the most passes - yet Wales were still nilled by France.\nGatland bemoaned his team \"over-playing\" in the wrong areas so expect a far simpler and more, well, Gatland performance.\nEddie James replaces injured centre Owen Watkins for the 37th different 10-12-13 combination in the last 60 Tests and Warren Gatland has a late injury worry over full-back Liam Williams.\nBut has number eight Taulupe Faletau back for the first time since the 2023 World Cup to win his 105th Wales cap - and move clear of Steohen Jones to stand fifth on the all-time list.\nThe last time the British & Irish Lion played was the last time Wales won - they will hoping his return is an omen.", "url": "https://www.bbc.com/sport/rugby-union/articles/c74edyl8227o"}