{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-05-21 05:30:11", "date_modify": "2025-05-21 05:30:11", "date_publish": "2025-02-08 22:18:30", "description": "Kylian Mbappe rescues a point for Real Madrid in a tense derby with city rivals Atletico Madrid as the hosts remain top of La Liga.", "filename": "sport_football_articles_c360y50pr68o_1747805411.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/36e9/live/3dd57a90-e669-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c360y50pr68o_1747805411.html", "title": "Real Madrid 1-1 Atletico Madrid: Kylian Mbappe rescues point as Real stay top", "title_page": "Real Madrid 1-1 Atletico Madrid: Kylian Mbappe rescues point as Real stay top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kylian Mbappe rescued a point for Real Madrid in a tense derby with city rivals Atletico Madrid as the hosts remained top of La Liga.\nDiego Simeone's side had gone in front through a controversial 35th-minute penalty converted by Julian Alvarez, who chose the 'Panenka' style approach from the spot, chipping the ball down the middle as goalkeeper Thibaut Courtois dived past.\nThe referee pointed to the spot after going to the video assistant referee (VAR) monitor as Aurelien Tchouameni was adjudged to have fouled Samuel Lino.\nFive minutes after the break, Mbappe scored his 16th league goal of the season when he reacted quickest after Jude Bellingham's shot bounced into his path.\nEngland international Bellingham had a greater impact in the second half, heading on to the crossbar and having a shot saved by Jan Oblak as Real pushed for a winner.\nThe result left them a point clear of second-placed Atletico, with Barcelona five points behind Carlo Ancelotti's side.\nHowever, Barca could close the gap on Sunday evening when they travel to Sevilla (20:00 GMT).\nFocus now turns to the Champions League for Real, who travel to Manchester City for the first leg of the knockout phase play-offs.", "url": "https://www.bbc.com/sport/football/articles/c360y50pr68o"}