{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 07:48:12", "date_modify": "2025-05-21 07:48:12", "date_publish": "2025-05-18 18:23:38", "description": "Thirteen years to the day since he joined from Fleetwood for £1m, Jamie Vardy ended his Leicester City career with a goal - his 200th for the Foxes.", "filename": "sport_football_articles_c4gk2xxjkg5o_1747813692.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eac0/live/d89f9950-340e-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gk2xxjkg5o_1747813692.html", "title": "Jamie Vardy: Leicester City striker scores 200th Foxes goal in farewell game", "title_page": "Jamie Vardy: Leicester City striker scores 200th Foxes goal in farewell game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was inevitable.\nThirteen years to the day since Leicester City paid £1m to Fleetwood Town for Jamie Vardy, he ended his Foxes career with a goal - his 200th for the club.\nAs the ball rolled past Alex Palmer, those inside King Power Stadium drew breath in expectation before exploding in celebration for a Vardy goal one final time.\nHe raced towards the Ipswich fans, placing a finger over his lips, before raising the corner flag - leaving no-one in any doubt this was his day.\n\"I missed a couple before that but once JJ [James Justin] put me through there I was never going to miss it,\" Vardy said.\n\"Obviously getting the dogs' abuse from the away fans up there, there was only one place I was going.\"\nA 500th and final appearance could not have gone much better, and Leicester's relegation - which has come during a dismal season - was briefly forgotten as Vardy dominated the narrative as he so often has.\nA Premier League title, an FA Cup triumph, a Champions League quarter-final, a Europa Conference League semi-final, two Championship titles. He wrote himself into Leicester folklore like no-one could have expected.\n\"It's been amazing, it's been a rollercoaster, it really has,\" he said after Leicester's 2-0 home win.\n\"But the good thing is there's been way, way, way more highs [than lows] and I thank everyone. I never thought we'd be in the Champions League, we'd win the league, and we've all been there for a reason.\"\nNow, with the Champions League a fading memory, there are fractures at Leicester, supporters unhappy with the running of the club after a second relegation in three seasons, but Vardy has been a lightning rod to unite and drive the club forward in his 13 years of service.\nThe 38-year-old former England striker will play on elsewhere and the Foxes need to find a replacement, but moving on from Vardy will be hard.\n\"They'll be fine, they'll be fine,\" said Vardy when asked about how Leicester go forward without him.\n\"We've got a good squad and we've got all the youngsters coming through as well. I'm glad I'm not them, because football is a killer mentally and I couldn't do it all again if I'm honest.\n\"But I've enjoyed every minute of it and I look forward to keeping an eye on the club I love.\"\n\"If you score your 200th goal on your 500th appearance, then you are a great one,\" said Leicester boss Ruud van Nistelrooy.\n\"He has been a unique player and person for this football club. In years to come we will realise we were part of this moment. He's a character as well, there's a story and an edge to him. He's a great captain as well.\n\"We were motivated to do well for Jamie, but also to get more momentum after the Southampton win and the point against Nottingham Forest. It's some positives towards the end of the season.\"\nThat guard was repeated after the game with title winners Wes Morgan, Marc Albrighton, Jeff Schlupp, Danny Drinkwater and Danny Simpson lining up to pay their tributes while Nigel Pearson - the manager who brought Vardy to the club - also watched on.\nThere was an embrace from chairman Aiyawatt Srivaddhanaprabha and a montage of Vardy's goals and great moments on the big screens as he watched on with his family in the centre circle.\nHe was presented with a golden fox memento and was also named the club's player of the season before addressing fans for a final time.\n\"The only thing I really can say, from the bottom of my heart, is thank you for taking me and my family in as one of your own,\" he said. \"Thank you all so much.\"\nVardy put that improvement down to small changes. Before games, throughout the day, he started drinking three cans of Red Bull and a double espresso and eating a cheese and ham omelette with baked beans.\nHe also drank port from a Lucozade bottle the evening before matches during the 2015-16 season - having stopped with the Skittles vodka which was a previous favourite tipple and involved dissolving the sweets in the alcohol.\nIt helped him score 24 goals to win Leicester the league, and he went on to earn the Premier League's Golden Boot in 2019–20, becoming the oldest player to lift the award.\nTitle-winning Leicester manager Claudio Ranieri described Vardy as \"a fantastic horse\" back in 2016 as the Foxes closed in on the Premier League.\nThe veteran may not be a thoroughbred any more but he has been synonymous with Leicester's rise - and fall - as their last title winner to leave the King Power Stadium.\nIt was the end of an era and Leicester must find a new talisman. They will never find someone quite like Jamie Vardy again.", "url": "https://www.bbc.com/sport/football/articles/c4gk2xxjkg5o"}