{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:07", "date_modify": "2025-05-21 05:57:07", "date_publish": "2025-01-04 22:44:18", "description": "Manchester United's players are sometimes \"too anxious, too afraid to play football\" on the pitch, says boss Ruben Amorim.", "filename": "sport_football_articles_crl36g92eglo_1747807027.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/24e6/live/ac417530-cabf-11ef-8449-159a99d87232.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crl36g92eglo_1747807027.html", "title": "Ruben Amorim: Man Utd boss says his players are 'too anxious, too afraid'", "title_page": "Ruben Amorim: Man Utd boss says his players are 'too anxious, too afraid' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United boss Ruben Amorim says his players are \"too anxious, too afraid\" and that his team's poor form has taken its toll on him.\nUnited head to leaders Liverpool on Sunday (16:30 GMT) on the back of four successive defeats in all competitions - including three in the Premier League.\nThey have won just two top-flight matches since Amorim took charge in November and are only seven points above the relegation zone.\n\"You can see in my face, you can compare it to the way when I arrive and now,\" said Amorim, who has lost five of his eight Premier League games in charge.\n\"Of course there is a lot of pressure. For me, it's the pride and also the performance.\n\"It's harder when we don't perform well.\"\nUnited lost 3-0 at home to Bournemouth, 2-0 at Wolves before slumping to a 2-0 home defeat against Newcastle in the space of eight days over the festive period.\nThey have not lost four league games in a row in the same season since between December and February 1979, while they last suffered four defeats in a row without scoring back in April 1909.\n\"They are anxious, sometimes afraid on the pitch,\" Amorim said of his players. \"We have to cope with that.\"\nOn Friday, United's Portuguese boss said \"we are starving for leaders on the pitch\" as he praised defender Harry Maguire for bouncing back from difficult times.\n\"We need the leaders to step up to help the other guys and I'm the most responsible person here to improve the performances,\" he added.\n\"You can see the players are trying, sometimes too anxious, too afraid to play football because this is a difficult moment and we will help the players to be better.\"\nUnited, who are 23 points behind Liverpool having played one game more, have not won at Anfield since January 2016 when Wayne Rooney scored the only goal of the game.\nMeanwhile, United have failed to score on the past five visits, with their last goal at the venue coming in December 2018.\nDespite his team's worrying form, Amorim said better times were coming for United and their fans.\n\"I will do my best,\" he said. \"I am giving everything to help the club and we are going to succeed. I know it is hard to understand that in this moment, but we are going to succeed.\"", "url": "https://www.bbc.com/sport/football/articles/crl36g92eglo"}