{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:56", "date_modify": "2025-05-21 05:24:56", "date_publish": "2025-01-31 21:30:54", "description": "Gloucester survive a scare as they beat spirited Championship side Cornish Pirates 26-19 in the Premiership Rugby Cup.", "filename": "sport_rugby-union_articles_c07k5y0912xo_1747805096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7768/live/be590770-e017-11ef-be98-798cbbed3362.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c07k5y0912xo_1747805096.html", "title": "Premiership Rugby Cup: Cornish Pirates 19-26 Gloucester", "title_page": "Premiership Rugby Cup: Cornish Pirates 19-26 Gloucester - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester survived a scare as they beat spirited Championship side Cornish Pirates 26-19 in the Premiership Rugby Cup.\nThe Premiership side went ahead in the third minute when Danny Eite powered over after good pressure.\nBut an unconverted try from Pirates' Matt Cannon soon after made it 7-5 - a score which did not change as the half wore on - as Pirates defended their line well at times, while Gloucester spurned a number of good chances.\nPirates almost went over soon after the restart before Gloucester soaked up the pressure, and Eite scored their second try seven minutes after the break.\nGloucester put down a couple more chances before George Barton superbly skipped through for Gloucester's third try midway through the half, and Will Butler blasted in under the posts from distance three minutes later to secure a visiting bonus point.\nBut most of the 2,775 fans at the Mennaye had something to cheer when Harry Hocking was forced over from a driving maul with 11 minutes left.\nThe hosts kept up the pressure and Tomi Agbonbon went over after a tap penalty with four minutes to go to set up a grandstand finish.\nBut the Premiership side held out to go level on points with Exeter at the top of their pool - the Chiefs travel to Hartpury on Saturday with the chance to go clear at the top of the group again.", "url": "https://www.bbc.com/sport/rugby-union/articles/c07k5y0912xo"}