{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 07:26:33", "date_modify": "2025-05-21 07:26:33", "date_publish": "2025-01-13 20:03:11", "description": "David Moyes says he will try to prove himself again after returning to Everton as manager 12 years after he departed to take over at Manchester United.", "filename": "sport_football_articles_c5ydx0dp5q4o_1747812393.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a5ad/live/37c31f80-d1f2-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ydx0dp5q4o_1747812393.html", "title": "David Moyes: Everton job a 'different beast' and 'too big' to turn down", "title_page": "David Moyes: Everton job a 'different beast' and 'too big' to turn down - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton's managerial job is a \"different beast\" and rejoining the club was \"too big an opportunity to turn down\", says David Moyes.\nThe Scot replaced the sacked Sean Dyche to become Toffees boss for the second time after leaving them for Manchester United in 2013.\nThe 61-year-old has been out of a job since leaving West Ham in the summer, where he also spent two spells, winning the Europa Conference League in 2023.\nMoyes revealed he was close to coming back to Everton \"three or four times\" and this move happened \"really quickly\" after speaking to chairman of the ownership group Dan Friedkin and executive chairman Marc Watts last week.\nMoyes, who has also been at Real Sociedad and Sunderland in recent years, said: \"I thought Sean was doing a really good job and I didn't see any changes materialising at the time.\n\"I wasn't necessarily out there looking to go back but as everyone knows this is a different beast to me than other clubs.\"\nAsked by BBC Sport if it was the only club job he would have taken, Moyes replied: \"Yes, I believe so, because I don't think there is anything else.\n\"I have had opportunities to consider other jobs, quite a few since I left West Ham, and I didn't feel ready for it but I always thought if the job came in, it was too big an opportunity to turn down. I want to show I can go again.\n\"In football, you always have to prove yourself and I'll try to do that again.\"\nMoyes became the Premier League's youngest manager when he took over at Everton in 2002 at the age of 39, and 23 years later he is now the top-flight's oldest boss.\nIn his first spell in-charge, Everton consistently finished in the top half of the table, competing in Europe and reaching an FA Cup final.\nBut he picks up the reigns from Dyche in a very different position.\nEverton avoided relegation last season after being docked eight points for two separate breaches of financial fair play rules.\nAnd they are again battling at the wrong end of the table this season, just one point above the relegation zone in 16th place.\nMoyes has to ensure the club moves to the new stadium in the summer at Bramley-Moore Dock as a Premier League outfit.\n\"I don't think it'll be the same Everton,\" said Moyes, whose first game comes against Aston Villa on Wednesday. \"And it's probably not the same David Moyes. A bit more experience maybe, a bit wiser.\n\"Ultimately, we've got to make sure that we're not near the bottom. That's the big key. After that, we can decide how we go and what we do from there.\"\nHe added to BBC Sport: \"I see it as a huge pressure and when you care so much about a club and have such a long period [away], it makes me realise it is a really popular club, one that needs to be - and has been - in the top flight.\n\"It would be a great feeling for us all to be in the new stadium. But it would mainly be great if we are a Premier League club and can give everyone something to shout about.\"\nEverton have won only three of their 19 league games this season, scoring just 15 goals - only bottom side Southampton have fewer.\nThey have only scored fewer after playing this number of league games on three previous occasions and they have the division's lowest expected goals (xG) rate at 18.33.\nThe club's number nine Dominic Calvert-Lewin struggled to find his best form under Dyche and has scored only twice this season, the last of which came back in September.\nThe 27-year-old is on a run of 15 games without scoring and is out of contract in the summer.\n\"We all feel he could make a big difference,\" said Moyes of the striker who scored four goals in 11 England appearances during 2020-21. \"Get his goalscoring boots back on and be a big help to Evertonians and the manager as well.\n\"We will give him as much confidence as we can and as much practice as we can but then there is a bit where you need the player to stand up and do his bit as well.\n\"I am just in and hopefully we will get them working but I have told him I am needing goals off him right away and he has to start to deliver.\"", "url": "https://www.bbc.com/sport/football/articles/c5ydx0dp5q4o"}