{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:39:25", "date_modify": "2025-05-21 07:39:25", "date_publish": "2025-05-20 00:00:00", "description": "Watch live coverage as England take on Belgium in their opening game of the UEFA European U17 Championship.", "filename": "sport_football_live_c17rez4qq19t_1747813165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9296/live/fdf7c2c0-3564-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c17rez4qq19t_1747813165.html", "title": "UEFA European Under-17 Championship LIVE: England U17 vs Belgium U17", "title_page": "UEFA European Under-17 Championship LIVE: England U17 vs Belgium U17 - live video coverage and score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who to look out for?\nEngland\nEngland are looking to win their first European Under-17 Championship since 2014 in what is a record 17th appearance at the competition.\nTo win the tournament they will have to face defending champions Italy, who knocked them out of the quarter-finals last year.\nThe Young Lions made it through the qualifying rounds, winning all six of their games.\nThe team is made up of mostly under-18 and under-21 Premier League players, but also features Leeds United's Harry Gray, the 16-year-old who made an appearance off the bench for Daniel Farke's team in their 6-0 home win over Stoke in the Championship in April.\nItaly\nThe Italians won the European Under-17 Championship last year, beating Portugal in the final and will be the team to beat in Group B.\nThey had previously made it to three finals without success before last year's triumph.\nEngland chase U17 Euros glory\nEngland are looking for their third European Under-17 Championship title as they kick-off their campaign in Albania on tonight, and you can watch all of their matches on BBC Sport.\nEngland face Belgium in their opener (16:45 BST) in Group B, which also features holders Italy and the Czech Republic.\nThere are two groups of four, with the top two teams from each group advancing to the semi-finals.\nAs well as England's matches, the BBC will also be showing the semi-finals and final of the tournament.", "url": "https://www.bbc.com/sport/football/live/c17rez4qq19t"}