{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-20 11:39:13", "date_modify": "2025-05-20 11:39:13", "date_publish": "2023-08-06 20:35:35", "description": "Arsenal's Community Shield win against Manchester City has lifted the \"mental block\" the Gunners had when facing the Premier League champions.", "filename": "sport_football_66421029_1747741153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3A4F/production/_130672941_arsenal.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66421029_1747741153.html", "title": "Community Shield: Arsenal 'make statement' with victory over Manchester City", "title_page": "Community Shield: Arsenal 'make statement' with victory over Manchester City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It rarely sets the tone for the season ahead and it may not be considered a major trophy by many but, in the context of how last season ended for Arsenal, the psychological impact of their Community Shield win against Manchester City on Sunday should not be underestimated.\nAfter Cole Palmer's stunning goal, the Gunners battled back through Leandro Trossard's last-gasp equaliser before Kevin de Bruyne and Rodri missed spot-kicks in the shootout and Arsenal converted all of theirs to secure the first piece of silverware of the season.\nArsenal led the Premier League for 248 days last season - no side has spent as long at the summit of the English top flight and failed to win it - but as Mikel Arteta's side capitulated, City charged to stage a successful defence of the title.\nOn top of that they appeared to have no answer to City throughout last season. They faced them three times - twice in the Premier League and once in the FA Cup - and they lost all three by an aggregate scoreline of 8-2.\nIn fact, the Gunners had lost their last nine matches against the champions.\nTo finally get one over their rivals, no matter the competition, was critical for Arsenal to ensure they are not mentally beaten before they even take to the pitch against Guardiola's side.\n\"It's a statement,\" Arsenal goalkeeper Aaron Ramsdale told ITV. \"It's a marker to know we can go and beat Manchester City in a big game when it matters.\n\"I'm not sure what it'll be like this season. But that mental block is gone. We're ready to push on now.\"\nArteta, too, was encouraged by the result.\n\"We showed again that we can compete against an incredible team,\" he told BBC Radio 5 live.\n\"There will be so many problems and challenges ahead but we did very well.\"\nInjuries and fatigue contributed to Arsenal's title challenge falling away last season and the Gunners worked to address that by spending big in the months since.\nEngland midfielder Declan Rice arrived from West Ham for £100m, while Germany international Kai Havertz joined from Chelsea in a £65m deal and Netherlands defender Jurrien Timber was recruited from Ajax for a fee which could rise to £38.5m.\nIt has no doubt improved the core of the Gunners' side and, prior to Sunday's game, City boss Guardiola conceded those arrivals have taken Arsenal to another level.\nRice got the biggest cheer from the expectant Arsenal fans when his name was read out prior to kick off but, bar one or two moments, he did not particularly stand out, while Havertz was guilty of failing to convert two really good chances in the first half.\nTimber was the most impressive of the three as he was deployed at left-back but, crucially, the arrival of the trio adds some important depth that was so lacking last season.\n\"Timber looked superb, a good defender but adept at stepping into midfield. He looked a great signing,\" Chelsea women's manager Emma Hayes said on ITV.\n\"This will be a second season of Arsenal competing [at the top] and this is where Rice, Timber and Havertz will help.\"\nHayes added: \"Arsenal have learned, they know they need to be more physical, more decisive. They need to adapt.\n\"The learnings have given fans greater expectations.\"\nRice showed his quality at West Ham, playing a crucial role in their Europa Conference League win, but former Manchester United captain Roy Keane believes the pressure will be on him to replicate that form at Arsenal given the price paid for him.\n\"Rice is now surrounded by better players,\" he told ITV. \"They have obviously paid way too much for him, he isn't worth over £100m.\n\"We will find out how good Declan is. Has he got the real top quality, in terms of seeing a pass and getting nine, 10 goals, we will find out.\nIt was once again a frustratingly long trip without reward for Manchester City fans.\nThis was their third successive appearance in the Community Shield and the third time it has ended in defeat, but it is highly unlikely it will set any alarm bells ringing.\nA slow start to last season did them no harm as they went on to claim the Treble of Premier League, Champions League and FA Cup, and their successes meant they finished their campaign later than Arsenal and, subsequently, began their preparations for the coming one later than the Gunners.\nAs a result, there were some signs of rustiness with last season's Golden Boot winner Erling Haaland, who scored 52 goals in all competitions, struggling to make an impact as he had just 13 touches of the ball before he was replaced by Palmer in the second half.\n\"Manchester City is a good team but sometimes you lose,\" accepted Guardiola.\n\"In the end we could not do it, their penalty takers were better than us.\"\nIt was ultimately a game that was perhaps more important for Arsenal than it was for City, and Keane doubts it will have any impact on their title challenge this season.\n\"It means more to Arsenal than Manchester City to win this game,\" he told ITV.\n\"I don't think desire will be in doubt for City. We know the quality they have, they will need a bit of luck obviously but are going to be very difficult to stop.\"", "url": "https://www.bbc.com/sport/football/66421029"}