{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:46:55", "date_modify": "2025-05-20 13:46:55", "date_publish": "2023-07-31 14:27:21", "description": "Cheslea: Match of the Day Africa top 10 - 'For me he was the best'", "filename": "sport_articles_cz9qqq6rlgqo_1747748815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed45/live/113beeb0-2f9f-11ee-8243-4988349acd8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cz9qqq6rlgqo_1747748815.html", "title": "'For me he was the best'", "title_page": "Cheslea: Match of the Day Africa top 10 - 'For me he was the best' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three former Chelsea players are on the shortlist for the top 10 players of African heritage in the latest episode of the Match of the Day Africa podcast.\nFormer Manchester City midfielder Yaya Toure on Claude Makelele: \"Makelele is an enormous player and when he came to Chelsea he confirmed it. People were talking about Drogba and Lampard and Ballack, but he was the one in front of defence just controlling everything. He was a big part of the success of Chelsea.\n\"People underestimated Makelele in terms of his simplicity of the game. Recover the ball, come and take it, recover the ball, come and take it and what people never mention is that longevity of it.\n\"For me he was the best.\"\nFormer Premier League striker Efan Ekoku on Makelele: \"The way he played he played bigger than his size, which is a big compliment for a guy who is not very big to be that commanding in a very important position in midfield, in this type of league in the Premier Leagie.\n\"In that zone in front of the back three or four he was as good as anybody we have seen in the last 25 years.\"\nEkoku on N'Golo Kante: \"For me from 2015 until last season where Kante had quite a few injuries and not played as much, he has been the best defensive midfielder I think in the country, one of the best in Europe, in the top five for sure.\n\"I think that ability to do things further up the field in terms of pressing the ball further up the field, it was only [Maurizio] Sarri that played him in a more advanced role which was always a bit strange.\n\"But Kante has been one of the best for me for quite a long time and I would put him above Makelele because I think of that greater ability to cover ground and he is faster, so that for me brings him a little bit higher.\"\nEkoku on Marcel Desailly: \"You talk about longevity, he was a big name and performer for all of the 90s and into the 2000s, so 13-14 years at a high level winning the World Cup, winning the Champions League with Marseille and with AC Milan, and winning stuff with Chelsea.", "url": "https://www.bbc.com/sport/articles/cz9qqq6rlgqo"}