{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:15:30", "date_modify": "2025-04-26 08:15:30", "date_publish": "2025-02-26 10:44:26", "description": "The fans' verdict on managerial change at Rangers", "filename": "sport_articles_c1w0egnenwro_1745655330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e02/live/b08c41e0-f3ca-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c1w0egnenwro_1745655330.html", "title": "The fans' verdict on managerial change at Rangers", "title_page": "The fans' verdict on managerial change at Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Philippe Clement's sacking and the appointment of Barry Ferguson as interim Rangers manager.\nHere's what some of you had to say:\nFerguson\nJohn: Barry Ferguson would run through a brick wall for Rangers for free, half of this squad would think he is insane, they will never understand his mindset and never will - it's called loyalty and love for your club.\nAnon: Not for me. His footballing ability was there for sure but interim manager at Rangers given his managerial career to date - an absolute joke of an appointment. Non-league to Europa League next week! The board are ultimately to blame. They've made false promises.\nKen: Just the man to give a number of players a good kick up the you know where. It is badly needed.\nAnon: Appeasement written all over it! While the Rangers fans will accept it, they know this is a stop-gap until a suitable candidate is appointed.\nClement\nPaul: Nine managers in 100 years since 1900 and 14 in the last 26 says it all. The fans are too quick to turn on them and we are getting the results of that. Doing the same thing time and again and expecting a different result is stupidity. We need stability and to give the manager time to build the team. We need to stop the knee-jerk reaction.\nMichael: Nobody likes to see anyone lose their job but in this case his position was totally untenable. There is no way that a club with the stature of Glasgow Rangers can be allowed to become the laughing stock that it currently is. This is not just the manager's fault but deep-rooted issues that attended from above. Things must change and now!\nMoray: Sadly the right call, he has reduced the wage bill but also reduced the quality of play. So many problems to fix, the 49ers money could solve some, but we need Rangers standards of old to return to success and silverware.", "url": "https://www.bbc.co.uk/sport/articles/c1w0egnenwro"}