{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 06:17:36", "date_modify": "2025-05-21 06:17:36", "date_publish": "2025-01-04 18:51:36", "description": "Cliftonville manager Jim Magilton says he wanted make Michael Newberry's family aware of \"how much he meant to us all\" in the club's first game since the defender passed away.", "filename": "sport_football_articles_ce8xe8n3kj0o_1747808256.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c850/live/34bb0ba0-cacb-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8xe8n3kj0o_1747808256.html", "title": "Michael Newberry: Tributes paid to defender ahead of Irish Cup ties", "title_page": "Michael Newberry: Tributes paid to defender ahead of Irish Cup ties - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cliftonville manager Jim Magilton says he wanted to make Michael Newberry's family aware of \"how much he meant to us all\" in the club's first game since the defender passed away.\nFormer Newcastle defender Newberry died suddenly on Monday aged 27.\nTributes were paid to Newberry ahead of the Reds' Irish Cup tie with Banbridge Rangers, while he was also remembered at Windsor Park before his former club Linfield took on Wellington Rec.\nA minute's silence was also held at the other Irish Cup ties.\n\"It's been a really difficult week for everyone connected with the football club,\" said Magilton.\n\"We've lost a wonderful human being who had so many unbelievable qualities. None more so than his enthusiasm, passion and vigour to play.\n\"He loved training, he loved the matches but more than anything he loved being in the dressing room. To lose someone of that magnitude is absolutely horrendous.\"\nSaturday's Irish Cup fifth round tie was Cliftonville's first game since Newberry's death after Monday's Irish Premiership match with Dungannon Swifts was postponed as a mark of respect.\nCliftonville and Banbridge Rangers laid wreaths in the centre circle alongside Newberry's Cliftonville shirts before a moving minute's applause.\nThe hosts also had Newberry's number five on the front of their shirts as both Cliftonville and Linfield fans left scarves and tributes outside Solitude.\n\"It's very difficult to sum up, but more importantly it is the Newberry family who we are thinking about at this stage,\" added Magilton, whose side won 4-0.\n\"We want to show them what Michael meant to us and how much he was loved and cherished and how much we are all going to miss him.\n\"You have to commend Banbridge Rangers because this is a huge day for them in the landscape of their football club, and they did it with such grace and dignity. On behalf of the club we thank them.\n\"I don't think you ever recover from this in terms of what Michael left. It was a matter of taking care of the game, which we did, but all we really wanted to do is to make the family aware of how much Michael meant to us all.\"\nHealy admitted he struggled to focus on the match after a difficult week but says \"we found a way as a club\".\n\"He played a huge part in our success. More importantly than that, it was the relationships and friendships that he made at this club.\n\"I said earlier in the week about the numbness that I felt, and we all felt, when the news came through.\n\"You break that down and realise the family, those closest to him, how they were feeling, and it was incredibly tough.\n\"The least important thing was playing football and the results. We had to, and speaking to Michael's dad yesterday, he wanted us to go and smash it for his son.\n\"I don't think we quite smashed the performance but hopefully we made the family proud.\"", "url": "https://www.bbc.com/sport/football/articles/ce8xe8n3kj0o"}