{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:28:57", "date_modify": "2025-04-26 06:28:57", "date_publish": "2025-02-27 11:21:54", "description": "England head coach Brendon McCullum faces bigger problems than Jos Buttler's future following a frustrating Champions Trophy campaign.", "filename": "sport_cricket_articles_cp9yy25dg5yo_1745648937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/949e/live/1dbb36d0-f4f8-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cp9yy25dg5yo_1745648937.html", "title": "England cricket: 'Brendon McCullum's problems go far beyond Jos Buttler's future'", "title_page": "England cricket: 'Brendon McCullum's problems go far beyond Jos Buttler's future' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Afghanistan fans had barely stopped dancing as Rob Key departed Pakistan in the early hours of Thursday morning.\nEngland's director of men's cricket was booked on the 3am flight out of Lahore long before a miserable Champions Trophy exit was confirmed, but left with plenty to ponder.\nKey is yet to sack a captain since taking on his role in April 2022 but, when the jetlag subsides, must decide whether Jos Buttler's time is done.\nIt may be that Key is spared the most difficult decision.\nButtler did not sound like a man keen to stay on after the eight-run defeat by Afghanistan - a tantalising encounter in which Joe Root almost rescued England from the brink.\n\"I don't want to say any emotional statements right now,\" he said. \"For myself and the guys at the top, we should consider all possibilities.\"\nA speech of defiance, it was not.\nIt was hard not to feel for Buttler when he slumped in his chair, having dragged himself from the dressing rooms to face the media.\nFrom Bangalore to Barbados, Lucknow to Lahore, the 34-year-old has been here before over the past 15 months. The same questions asked by the same faces after three poor showings in global events.\n\"I know lots of people think it doesn't sit well with me being captain and that kind of thing but I really do enjoy it,\" Buttler said.\nIt is not just his tactics or his batting technique that have been doubted over England's poor run but his very make-up. That is not easy.\nIt was hoped the arrival of Brendon McCullum as coach would reinvigorate Buttler, who was known to have taken defeats in the India World Cup particularly hard.\nWord is the defeat by Australia on Saturday was dealt with more easily, with the weight lifted by the presence of the New Zealander, but Wednesday's mood was familiarly sombre, leaving McCullum at his trickiest juncture in English cricket to date.\nHis friendship with Buttler dates back long before this working relationship - the pair once business partners rather than captain and coach - and McCullum is unnervingly loyal.\nThat should never be mistaken for a softness, however. Do not forget the ruthless decisions to move on James Anderson, Jack Leach or Ollie Robinson.\nMcCullum will also surely not have underestimated the size of the task in turning this ship around, but the issues in front of him - not least a public growing louder with its discontent - are mounting.\nBrydon Carse's toe injury is serious enough that it could rule him out of the Indian Premier League or the early county season, while Mark Wood was understood to be in significant pain as he bowled through a knee issue against Afghanistan.\nWood will be assessed again on Thursday and serious damage, to a knee operated on in 2019, would be a huge blow before a Test series against India in the summer and Australia in the winter.\nEngland's focus now switches to the challenge McCullum faces.\nWhen taking on the white-ball role, he said his coaches would step up to lead when he needed time away, but evidence suggests this team cannot afford a half-in leader.\nEngland's next one-day internationals are against West Indies in May - sandwiched between a Test against Zimbabwe and the India series - before they play South Africa in September, by which time the Ashes will loom large.\nThe idea of England failing to qualify for the 2027 World Cup may seem extreme but only the top eight in the rankings - nine if South Africa are one of those - are guaranteed their spots. England are currently seventh with Afghanistan having closed in and Bangladesh and West Indies lurking below.\nContinuing to take their white-ball side for granted could mean a qualification tournament alongside the likes of Nepal and Oman.\nButtler, Root, Wood and co are also the last generation of England cricketers who grew up on 50 (or 40)-over cricket. Given the lack of it played in England, the search for the next generation will continue to be educated guesswork.\nAnd if Buttler is replaced, any supporter hoping it will bring in a change of approach is likely to be disappointed.\nThree men have captained this side in the past year when Buttler has been injured - Harry Brook, Liam Livingstone and Phil Salt, who are all disciples of the attacking approach.\nHaving ascended to be Buttler's vice-captain in January after leading in his absence in five matches against Australia, Brook is the obvious next move.\nDuring that 3-2 defeat by Australia, Brook said he wanted the team to play like McCullum's Bazballing Test side and was also criticised for his \"who cares\" if you are caught on the boundary or in the in-field comment at Trent Bridge.\nThat was a misstep but he did well to recover in a promising first stint as captain, which included his only one-day international century to date.\nResponsibility may be what Brook, a former England Under-19 captain, needs to turn his undeniable white-ball talents into match-winning performances because the current status quo is helping neither him nor the team.\nTen innings, 169 runs and an average of 16.90 in matches this year may not feel like the form of a captain-elect, but he remains the best option.\nBrook's ascension would bring issues in that he would not always be available because of his key role in the Test team. But it would also give England another option if Stokes' body was to fail him down under, in addition to Ollie Pope who could be out of the XI by the time they reach Perth.\nAnd there I go, relegating the white-ball team to a second-tier status. England got to the top of the white-ball world by prioritising it under Eoin Morgan, only to collapse when the Test side retook the focus when McCullum was first appointed.\nIt will take longer than one flight for Key to find a way to navigate English cricket's longstanding problem.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cp9yy25dg5yo"}