{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-04-26 04:09:05", "date_modify": "2025-04-26 04:09:05", "date_publish": "2025-03-02 19:45:10", "description": "Arsenal produce a spectacular fightback to beat West Ham despite the Irons having a two-goal cushion.", "filename": "sport_football_articles_cr72z805v44o_1745640545.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e8d6/live/631ca5d0-f79e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr72z805v44o_1745640545.html", "title": "Arsenal 4-3 West Ham: Incredible fightback proves Gunners' saviour", "title_page": "Arsenal 4-3 West Ham: Incredible fightback proves Gunners' saviour - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is hard to decide which was more surprising: West Ham being 2-0 ahead within just 12 minutes, or Arsenal scoring three in six minutes to come from behind.\nThe Irons had not only had the lead, but they were defending it well.\nTheir back line marshalled Arsenal's attempts to go forward excellently – especially given many of the Gunners' long balls produced nothing of note – and Kinga Szemik was regularly in the right place to bail out the Irons when tested.\nChloe Kelly, making her first start, netted her first goal for Arsenal and made it 2-1 before the break.\nBut after Stina Blackstenius had a one disallowed and Shekiera Martinez restored West Ham's two-goal cushion it felt like there was only one likely conclusion; West Ham seemed destined to win it.\nIn an instant, though, that all changed.\nThe fact that Szemik got a hand to Mariona Caldentey's penalty – the goal which put Arsenal in front – was symbolic of the game slipping out West Ham's reach.\nHaving turned the tide in such a rapid fashion, Arsenal were energised and seemed a completely different side. Substitutes made an impact, too, with Kyra Cooney-Cross playing a significant role in improving their attacking intent.\nThis was a big win for Arsenal given Chelsea dropped points. The manner of defeat will be crushing for West Ham, but it was a great display nevertheless.", "url": "https://www.bbc.co.uk/sport/football/articles/cr72z805v44o"}