{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:25", "date_modify": "2025-05-21 05:34:25", "date_publish": "2025-04-02 15:31:53", "description": "Owner Martin Hellier will continue investing in Yeovil Town despite confirming his plans to sell says the club's interim chairman.", "filename": "sport_football_articles_cm257j73491o_1747805665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/52b4/live/eabe1870-0fd6-11f0-94e9-65dc0da473ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm257j73491o_1747805665.html", "title": "Hellier Group to continue investing in Yeovil despite sale plans says interim chair", "title_page": "Hellier Group to continue investing in Yeovil despite sale plans says interim chair - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yeovil Town owner Martin Hellier will continue investing in the National League club until a new buyer is found, says interim chairman Stuart Robins.\nHellier stepped down as chairman on Monday and confirmed plans to sell the Glovers citing abuse he had suffered online from fans. Robins has taken on the role while a new owner is found.\nBusinessman Hellier took over Yeovil in June 2023 but has been involved in a hostile relationship with sections of the fanbase for some time, including exchanging abuse of his own via social media and issuing banning orders from games.\n\"We're being supported by the Hellier Group and I've been given some good assurances that that will continue,\" Robins told BBC Radio Somerset.\nHellier, a long-time Yeovil fan and previous club sponsor through his firm, took over the Glovers during another turbulent period two years ago, following a failed takeover attempt by the SU Glovers and their relegation from the National League.\nThe club won promotion from National League South at the end of last season and are 14th in the fifth tier.\nAccounts released for the 2023-24 season show that debts total £2.8m and Robins said it was now \"absolutely critical\" that new investment was brought in.\n\"I don't think we're any different from a lot of clubs at this level and indeed above,\" Robins said.\n\"It's not great reading but my major task now is to bring in new investment and that will hopefully bring bigger and even better times to Huish Park and Yeovil Town.\"", "url": "https://www.bbc.com/sport/football/articles/cm257j73491o"}