{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:54:00", "date_modify": "2025-05-21 04:54:00", "date_publish": "2025-01-23 11:56:12", "description": "Liverpool news: Opinion - Fara Williams on 'massive momentum'", "filename": "sport_football_articles_cy8pdd64ed8o_1747803240.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8pdd64ed8o_1747803240.html", "title": "Opinion - Fara Williams on 'massive momentum' - BBC Sport", "title_page": "Liverpool news: Opinion - Fara Williams on 'massive momentum' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The win over Brentford last weekend was a massive result for Liverpool, not just because it was three points added but also because Arsenal played after them.\nHad Liverpool drawn that game, Arsenal would have gone into their game against Aston Villa knowing they could close the gap to four points. We know now that had no effect but it could have caused a change in mentality to Liverpool had the gap been closed.\nBrentford did not make it easy for Arne Slot's men. They had the correct attitude and approach to the game and they will see conceding the two goals in the final moments as a sucker-punch, but credit to Liverpool as they threw everything at them.\nNo one probably predicted Darwin Nunez to be the hero of the hour and finish his two chances the way he did because he doesn't normally! They were trying everything to get a goal and it was clear from his substitutions that Slot was not going to settle for a draw.\nThat in itself shows the mentality of the players and the manager.\nI did not expect Liverpool to come away with three points as there was not much in the game but it will give them massive momentum going forward.\nIt is the game we will probably look back at and say 'those points helped them to win the league'.", "url": "https://www.bbc.com/sport/football/articles/cy8pdd64ed8o"}