{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:30", "date_modify": "2025-05-20 11:41:30", "date_publish": "2023-08-06 18:00:08", "description": "Hibernian 2-3 St Mirren: What the manager said", "filename": "sport_articles_ckrj8z419j1o_1747741290.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ckrj8z419j1o_1747741290.html", "title": "Hibernian 2-3 St Mirren: What the manager said", "title_page": "Hibernian 2-3 St Mirren: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian manager Lee Johnson says it is \"fair game in terms of team selection after that\" as he ponders facing Luzern in Europa Conference League qualifying after a dramatic 3-2 defeat at home to St Mirren.\nJohnson had stuck with the same starting XI that defeated Inter Club D'Escaldes on Thursday.\n\"That's up for debate I suppose - whether I should have made those changes or not,\" he told BBC Scotland. \"But the reality is we were not at the races and they were in that first 20-30 minutes.\n\"It was a poor start from us. We certainly weren't expecting it off a very good performance in Europe and the boys were well rested.\n\"We found ourselves 2-0 down through sloppiness- a domino effect of errors - and we have to hold our hands up to that.\n\"We did show character obviously in the second half. The shape had to change. I don't like making subs in the first half because you're effectively admitting you got it wrong, or individuals aren't where they need to be, but something had to happen and it was a bit of a catalyst.\n\"One of our challenges at Hibs is to get a consistency out of the players. It's not easy because you have an opposition who did a good job on us in the first half.\"", "url": "https://www.bbc.com/sport/articles/ckrj8z419j1o"}