{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:23:10", "date_modify": "2025-05-20 14:23:10", "date_publish": "2023-07-29 07:57:47", "description": "Manchester United: Sofyan Amrabat of interest but players must be sold first", "filename": "sport_articles_cm5j831vmz7o_1747750990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28cc/live/72fda410-2de5-11ee-9a65-45d5b11d79ed.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cm5j831vmz7o_1747750990.html", "title": "Manchester United: Sofyan Amrabat of interest but players must be sold first", "title_page": "Manchester United: Sofyan Amrabat of interest but players must be sold first - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Stone, BBC Sport\nManchester United are interested Fiorentina’s Morocco midfielder Sofyan Amrabat, but a deal almost certainly hinges on the revenue they can generate through player sales.\nDespite talk in Italy that a deal is close, BBC Sport understands that is not the case.\nThere has been communication, as there has around a number of midfielders - but United's priority is Atalanta striker Rasmus Hojlund and Financial Fair Play restrictions make further signings difficult without raising the funds.\nSo far this summer, United have sold forward Anthony Elanga to Nottingham Forest in a deal that could be worth £20m, and full-back Alex Telles has joined Saudi Pro League side Al-Nassr.\nIn addition, youngsters Zidane Iqbal and Charlie Savage have gone to Belgian side Royal Antwerp and Reading respectively, although the true value of those transfers comes through the sell-on clauses, as is the case with Ethan Laird, who has joined Birmingham City.\nIt is understood United received almost £1m from Birmingham as part of the deal that saw winger Tahith Chong join Luton Town this summer.\nAmrabat impressed for club and country last season.\nThe 26-year-old played every minute in Morocco’s surprising run to the World Cup semi-finals in Qatar.", "url": "https://www.bbc.com/sport/articles/cm5j831vmz7o"}