{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:14", "date_modify": "2025-05-21 08:01:14", "date_publish": "2025-05-19 16:34:32", "description": "Ireland back row Aoife Wafer is named Player of the Championship for the 2025 Women's Six Nations.", "filename": "sport_rugby-union_articles_cn9j1p7wl8jo_1747814474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2830/live/79db06f0-34ce-11f0-8ca3-49a2defac508.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn9j1p7wl8jo_1747814474.html", "title": "Women's Six Nations: Ireland back row Wafer named Player of the 2025 Championship", "title_page": "Women's Six Nations: Ireland back row Wafer named Player of the 2025 Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland forward Aoife Wafer has been named the Women's Six Nations Player of the Championship for 2025.\nThe back row earned 41% of a fans' vote, edging out France second row Manae Feleu by just 333 votes.\nThe other players on the four-woman shortlist were England wing Abby Dow and Scotland back row Evie Gallagher, and over 18,500 votes were cast.\nWafer finished as the joint second-highest try scorer in the Six Nations with four - matching the most by any forward in the tournament.\nThat took her tally to 12 tries in 15 caps for Ireland.\nIn addition, she made 70 carries, the most by any player, covering 424.7 metres and beating 17 defenders - the second-highest total for a forward.\nThe 22-year-old's performances helped Ireland secure third place in the competition.\nWafer was also named on the team of the tournament alongside team-mates Neve Jones and Aoife Dalton.\nCommenting on her award, Wafer said: \"It means the world to me because I want to be the best in the world, and I want my name up there with those Irish women's rugby stars; I feel that this award is a little step towards that.\n\"It's huge for me but also for our team; it really shows how much we have done in the last two years and how much we are growing. This trophy is not just mine: it's for the team, it's for my family. It's more so for them than it is for me.\n\"It's great to be nominated and win this trophy, and hopefully this can inspire the younger generation to pick a rugby ball or to pick up any sport.\"\nIreland will next be in action when they play World Cup warm-ups against Scotland and Canada at the start of August.\nThey face Japan, Spain and New Zealand in Pool C of the World Cup in August and September.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn9j1p7wl8jo"}