{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:32:57", "date_modify": "2025-04-26 03:32:57", "date_publish": "2025-03-08 00:00:00", "description": "Holders Manchester United cruise past Championship opponents Sunderland to reach the Women's FA Cup semi-finals.", "filename": "sport_football_live_ckg8qggpgjqt_1745638377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53af/live/8e9d5c50-fc52-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ckg8qggpgjqt_1745638377.html", "title": "Manchester United 3-1 Sunderland: Holders progress to Women's FA Cup semi-finals", "title_page": "Manchester United 3-1 Sunderland: Holders progress to Women's FA Cup semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Skinner warned his players beforehand that it would not be an easy task to beat Sunderland and they would have to earn their place in the semi-finals.\nBut United made it look easy for large periods as they dominated from start to finish, moving the ball around quickly and limiting Sunderland's attacking options.\nIt was the two starting centre-backs Le Tissier and Millie Turner who dictated things, spraying passes from left to right and finding team-mates in behind Sunderland's backline.\nGalton's opener came from the right-hand side as she stooped to meet Celine Bizet's cross.\nCaptain Le Tissier immediately sprinted over to the sidelines to collect a shirt from a member of the coaching staff and Toone held it up to cameras in the corner of the stadium, displaying the name of Poppy Atkinson - the 10-year-old girl who was fatally hit by a car on a football pitch this week.\nAn applause by supporters in the 10th minute was another touching tribute, while United continued to create chances and entertain at Leigh Sports Village.\nHad they been more clinical, the scoreline could have been humbling for Sunderland as Melvine Malard skewed a volley on to the crossbar and Bizet twice missed from close range.\nLe Tissier, who was easily the standout performer on the night, capped off her display with a perfectly placed header on the stroke of half-time, making it 2-0 before the bizarre clearance that bounced off Griffiths for Sunderland's goal threatened a nervy ending.\nHowever, there was little danger of United losing their lead as Sunderland tired and struggled to get out of their own half before Toone punished them with a crowning third goal.\nThis is a competition that United have enjoyed in recent seasons, reaching back-to-back finals before getting their hands on the trophy in 2024.\nThey will find out their semi-final opponents on Sunday following the conclusion of the other three matches involving WSL rivals Chelsea, Arsenal and Manchester City.", "url": "https://www.bbc.co.uk/sport/football/live/ckg8qggpgjqt"}