{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:25", "date_modify": "2025-05-21 04:07:25", "date_publish": "2025-01-15 10:35:58", "description": "Chelsea 2-2 Bournemouth: Fan views", "filename": "sport_football_articles_c99xekpxjkvo_1747800445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99xekpxjkvo_1747800445.html", "title": "Chelsea 2-2 Bournemouth: Fan views", "title_page": "Chelsea 2-2 Bournemouth: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Tuesday's Premier League game between Chelsea and Bournemouth, which finished in a 2-2 draw.\nHere are some of your comments:\nChelsea fans\nJulian: Looks like we're slipping back into old habits of not killing off teams when we dominate. I thought Nicolas Jackson was incredibly unlucky tonight. Hit the post, fantastic header saved, insane bounce off a divot... We're still in a great place in the league but we need to get out of this rut.\nAsh: I really like Nico Jackson, but when we signed him it was never the intention for him to be starting every game. He still has a lot to learn and keeps missing a host of chances. Chelsea would be fools to let Christopher Nkunku leave. He needs to start more games and with his finishing, we could have easily seen Bournemouth off before half-time.\nAlan: I'll keep it simple. How long before Enzo Maresca realises that there is a serious problem with our back four as well as Robert Sanchez? It's just full of holes and disorganisation. Yet again, Jackson is running round like a headless chicken trying to look good. Reece James out of position - what's the point? Is it so simple that Maresca can't see the problem or is he out of his depth in this league?\nJames: The way we are playing every game in the first half is promising, but we can't keep dropping much-needed points due to poor second half performances. That needs to change if we are going to secure champions league next season. Delighted with Reece's goal and just hoping he stays fit at least for the remainder of the season.\nBournemouth fans\nGabriel: Would have loved to win the game, but I am more feeling so proud of that performance from us! That second half we were fantastic all over the pitch, especially with our pressing being extremely effective. Special shoutouts to Antoine Semenyo, Justin Kluivert and Lewis Cook!\nPaul: Outstanding display from the Cherries to extend their unbeaten run against a tough Chelsea team. The fitness levels of the Bournemouth players are incredible and need to be, with the constant high press. Definitely need that number nine to complete the line-up but until he arrives there are plenty of goals in Kluivert, Semenyo and Dango Ouattara. A joy to watch!\nWing: Having taken the lead and been the better side for much of the second half, given the context of all the injuries we have, we are still disappointed with a draw at Chelsea. We really have come a long way as a great front-footed side, and it is a pleasure to be a Cherries fan right now come what may.", "url": "https://www.bbc.com/sport/football/articles/c99xekpxjkvo"}