{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:27", "date_modify": "2025-05-21 08:02:27", "date_publish": "2025-03-27 16:14:18", "description": "Arsenal news: Opinion - 'Mikel Arteta trusts Gabriel Martinelli' - Nedum Onuoha", "filename": "sport_football_articles_cjryegy13v5o_1747814547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb06/live/ee5b2940-6e9c-11ef-8c1a-df523ba43a9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjryegy13v5o_1747814547.html", "title": "Opinion - 'Mikel Arteta trusts Gabriel Martinelli' - Nedum Onuoha - BBC Sport", "title_page": "Arsenal news: Opinion - 'Mikel Arteta trusts Gabriel Martinelli' - Nedum Onuoha - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Earlier this week, BBC Sport asked its fan writers to name a player who has to step up to the plate late in this season and do that bit more.\nArsenal supporter Laura pointed to Gabriel Martinelli, who has probably not done as well as people would have hoped or expected him to in recent seasons, though he has proved to be a valuable player.\nWe put that to our pundit and former Manchester City defender Nedum Onuoha:\nIt doesn't feel like \"Martinelli will be playing for his future\" in the remaining games to me because Arsenal play their best football when he occupies that left side and Bukayo Saka is on the opposite wing.\nIn the 2022-23 season he scored 15 goals in 36 games, but aside from that campaign, the number of goals and assists he has produced have been very similar in each season.\nThere is potential for him to improve and get his numbers closer to that prominent season, but I don't believe that is the standard for him. That output does not feel like the real version of him and is beginning to look like more of an outlier in his statistics.\nMartinelli can certainly step up to improve on the season he is having so far and he is very good at doing his role for Arsenal, so I am sure he – like everyone else – would want to score more goals.\nThe most important thing is that Mikel Arteta puts him out there because he trusts him. He has trusted him in big games in the past and he will trust him again.\nIt could be a good option for Arsenal to switch him to playing up top in the absence of a forward, but I am not sure it would be any different to what they are trying now with Mikel Merino or what Leandro Trossard can offer.\nIt is good that Arteta has these options though, and against Real Madrid it could question them in different ways as all three of those players have the ability to stretch the game. But it is obviously not as simple as saying 'go and play up there.'\nMerino, Trossard and Martinelli all have different traits that will suit different games and there are the nuances of partnerships that have to be considered.\nDuring the run-in, it is about keeping Martinelli healthy so he can find his form. If he can do that, then he will be a huge asset to Arsenal like he has been in previous seasons.", "url": "https://www.bbc.com/sport/football/articles/cjryegy13v5o"}