{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:34:46", "date_modify": "2025-05-21 07:34:46", "date_publish": "2025-03-26 00:00:00", "description": "All the fallout from Trent Alexander-Arnold's proposed move from Liverpool to Real Madrid, plus latest football news.", "filename": "sport_football_live_cdx2wl557w8t_1747812886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53cd/live/ebfb34f0-0a47-11f0-88b7-5556e7b55c5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cdx2wl557w8t_1747812886.html", "title": "Football latest LIVE: Trent Alexander-Arnold in talks to join Real Madrid", "title_page": "Football latest LIVE: Trent Alexander-Arnold in talks to join Real Madrid - debate, stats, news - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Recap: Alexander-Arnold move debate\nThank you for joining us today as we reacted to Trent Alexander-Arnold's possible move to Real Madrid as well as Wales' point against North Macedonia and Northern Ireland's defeat to Sweden.\nWe also reported on former England Under-21s and Watford manager Aidy Boothroyd's Parkinson's Disease diagnosis, and send him our best wishes.\nRead more on the Trent Alexander-Arnold backlash: 'Brilliant servant' or 'tarnished legacy'?\nIf you're just joining us and would like a catch-up, click on the links in the summary of this page for the latest stories or scroll below to read more.\n'We can create something magical' - Slegers\nArsenal v Real Madrid (20:00 GMT, 0-2 Agg)\nArsenal manager Renee Slegers hopes to create “something magical” going into the second leg of their Women's Champions League quarter-final against Real Madrid.\nThe Gunners are currently 2-0 down on aggregate.\nTravelling away to Madrid for the first leg, goals from Linda Caicedo and Athenea del Castillo at the Alfredo Di Stefano Stadium, alongside the debate regarding the playing surface, was enough to trouble Arsenal.\nSpeaking on Wednesday's second leg, Slegers said: \"We are aware of Real Madrid's threat, but we know what we need to do.\n\"We have lots of quality in the squad and will try to make the correct decisions when needed. Together with our fans, we can create something magical and it's down to us and what we bring to the game.\"\nArsenal are out of the FA Cup and currently eight points behind leaders Chelsea in the Women's Super League, which means the Champions League is their only likely chance of silverware this season.\nArsenal have made the Champions League last-eight for a record-equalling 16th time and are the only English team to have lifted the trophy, in 2007.\nArsenal take on Real Madrid in Champions League\nArsenal v Real Madrid (20:00 GMT, 0-2 Agg)\nArsenal will be hoping to use their home advantage to turn around a 2-0 deficit against Real Madrid tonight in the Women's Champions League quarter-finals at the Emirates Stadium.\nThe return match comes after Arsenal's players struggled to come to terms with tough pitch conditions at the Estadio Alfredo di Stefano in the first leg.\nFormer England and Arsenal striker Ian Wright said in a video posted during the game: \"Watching the Champions League quarter-final. Real Madrid's pitch - this is worse than Derby's pitch the other day in the Conti Cup final.\n\"This is a disgrace the pitches these girls have to play on.\"\nArsenal manager Renee Slegers said the wet and muddy conditions in Madrid played a part in the defeat, which took place three days after the previous game at the ground.\nCould Alexander-Arnold play for Real Madrid at the Club World Cup?\nSimon Stone\nBBC Sport's chief football news reporter\nNormally, this deal would be a simple case of allowing Trent Alexander-Arnold’s Liverpool contract to run out on 30 June and Real Madrid would conclude the deal.\nBut this is no ordinary summer.\nWorld governing body Fifa has changed their rules to allow clubs competing in the Club World Cup to sign players ahead of the tournament, from 1 to 10 June.\nThat would require Real and Liverpool to strike a deal to allow Alexander-Arnold to complete his switch early and be available for the new, expanded tournament in the United States.\nAlternatively, Real could wait and register Alexander-Arnold mid-tournament, when clubs are allowed to change their squads in a short window between 27 June and 3 July.\nBut it could have been so different...\nLet's not forget that two of those four Champions League titles won by Real Madrid while Trent Alexander-Arnold was playing for Liverpool were accomplished with victories against the Reds in the final.\nReal Madrid beat Liverpool 3-1 in the 2018 final in Kyiv and scraped a 1-0 win in Paris in 2022, when Jurgen Klopp's side were thwarted by an outstanding display by Belgian stopper Thibaut Courtois.\nIn a parallel universe, Trent Alexander-Arnold could have had three Champions League winners' medals to Real Madrid's two during the England defender's playing career, thus far.\nHow Alexander-Arnold ranks in Premier League duels\nWhen Trent Alexander-Arnold has managed to get in a tackle, he has the second worst success rate in duels (46.6%) of any full-back or wing-back in the Premier League this season.\nThe England defender has only won 90 of the 193 duels he has been involved in. Only Ipswich Town's Ben Johnson (45%) has a worse success rate.\nIn comparison, Manchester City's Josko Gvardiol leads the way, winning 129 of his 207 duels in the Premier League this season, with a success rate of 62.3%.", "url": "https://www.bbc.com/sport/football/live/cdx2wl557w8t"}