{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:17:33", "date_modify": "2025-04-26 04:17:33", "date_publish": "2025-03-04 07:19:25", "description": "Ipswich news: Kieran McKenna says 'players will have renewed belief'", "filename": "sport_football_articles_c4gedldrn0go_1745641053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e799/live/9c7ec9f0-f8c7-11ef-b344-371784530eac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4gedldrn0go_1745641053.html", "title": "Ipswich news: Kieran McKenna says 'players will have renewed belief'", "title_page": "Ipswich news: Kieran McKenna says 'players will have renewed belief' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ipswich Town manager Kieran McKenna, speaking to BBC Sport: \"It's a really disappointing way to lose the game, but it can happen in a penalty shootout. One team is going to be on the wrong end.\n\"They left everything out on the pitch. We came into the game with challenges and got a lot more challenges on the pitch. The way the team competed and fought their way through the game was really good. We can take a lot of positives from the game.\n\"It's a cup competition so I don't draw all the comparisons to the league, but against a very good team we can be proud of the performance. We knew we had to manage aspects of the game as they are the fastest team in the league, so we knew we couldn't make it 100mph because it would suit them too much.\"\nOn whether he will need to lift the group: \"I don't think mentally I will, to be honest. The players will come in with renewed confidence with the way they competed, renewed belief in the squad and the way we are working. They will have good feelings from the performance. The biggest challenge is how we recover physically for Saturday.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4gedldrn0go"}