{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:14:59", "date_modify": "2025-04-26 06:14:59", "date_publish": "2025-03-01 22:44:58", "description": "Luke Littler and Luke Humphries both book their place in the quarter-finals of the UK Open with victories in the fifth and sixth rounds on Saturday.", "filename": "sport_darts_articles_c2erwyr1lz7o_1745648099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9a7/live/c9d6cde0-f6eb-11ef-ab5b-eb63ff571c9c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_darts_articles_c2erwyr1lz7o_1745648099.html", "title": "UK Open: Luke Littler and Luke Humphries through to the quarter-finals", "title_page": "UK Open: Luke Littler and Luke Humphries through to the quarter-finals  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Luke Littler and Luke Humphries both booked their place in the UK Open quarter-finals with victories in Saturday's fifth and sixth rounds.\nWorld champion Littler defeated Jermaine Wattimena 10-4, before battling past Krzysztof Ratajski 10-8 in Minehead.\nMeanwhile, world number one Humphries dominated his two matches, sweeping aside Ryan Searle 10-0 and then breezing into the last eight with a 10-2 win against Ryan Joyce, averaging 101.59.\nLittler will face Dutchman Gian van Veen in Sunday's quarter-finals, while Humphries will take on fellow Englishman James Wade.\nHumphries, twice a UK Open runner-up, told ITV his finishing has been \"really good\".\nThe 30-year-old added: \"My scoring is decent, but I know it can be better. If I can really up the scoring, I could be very, very, very dangerous.\"\nFollowing a comfortable fifth-round victory over Dutchman Wattimena, teenager Littler had to dig deep to overcome Poland's Ratajski in the last 16.\nLittler was 6-2 ahead when Ratajski won the next four to level. The pair were evenly matched in the closing stages before world number two Littler sealed the success with a single one and double two.\n\"I made it harder than it looked, but I just had to stick in there and get the win,\" said the 18-year-old.\nDutchman Michael van Gerwen was a shock departure in the fifth round, losing 10-8 to Welshman Rob Owen, who was then beaten 10-8 by Wade.", "url": "https://www.bbc.co.uk/sport/darts/articles/c2erwyr1lz7o"}