{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:24:05", "date_modify": "2025-05-20 14:24:05", "date_publish": "2023-07-24 20:15:21", "description": "Dundee sign 20-year-old defender Aaron Donnelly from Nottingham Forest on a season-long loan.", "filename": "sport_football_66288927_1747751045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BAF4/production/_130506874_aarondonnelly.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66288927_1747751045.html", "title": "Aaron Donnelly: Twenty-year-old joins Dundee on loan from Nottingham Forest", "title_page": "Aaron Donnelly: Twenty-year-old joins Dundee on loan from Nottingham Forest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee have signed 20-year-old defender Aaron Donnelly from Nottingham Forest on a season-long loan.\nThe left-sided player made 20 appearances on loan with Port Vale in the second half of last season.\nHe made Northern Ireland's squad for their June Euro 2024 qualifiers after representing his country at Under-21 level.\nThe former Dungannon Swifts player told Dundee's website: \"I am thrilled to have signed for Dundee.\"\n\"The club has been promoted last season to the Scottish Premiership, it's going to be a massive season for the club and I am excited to be involved and can't wait to get going.\n\"I am hoping to get as many first-team minutes as possible this season. I was on loan at Port Vale from January till the end of the season and I am now looking forward to getting a full season under my belt.\n\"For me, it is all about delivering week in week out and being consistent.\n\"I feel Port Vale has given me a platform to push on and now that I have signed for Dundee I feel like it is about pushing on even more and showing the fans what I can do.\"\nDundee manager Tony Docherty said: \"We are extremely pleased to get someone of Aaron's stature in.\n\"He is only 20 but is already a member of the Northern Ireland national squad and has just been away with Nottingham Forest's first team on their pre-season tour in Spain.\n\"The move has come through our recruitment team and the relationship I have with Nottingham Forrest and I am delighted to get the move over the line.\n\"I am really pleased Aaron chose us as he did have three other suitors down in England and he chose to come to Dundee after conversations with us and coming up to see the facilities.\n\"I am hugely encouraged to get him here and he is an exciting young player, a good defender and he is held in high regard.\n\"He is a left-sided defender, he enjoys the defending part of the game, he is strong in the air, comfortable on his left side and a good user of the ball.\"", "url": "https://www.bbc.com/sport/football/66288927"}