{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:34:26", "date_modify": "2025-04-26 07:34:26", "date_publish": "2025-02-27 15:48:05", "description": "The Hundred 2025: Jamie Smith moves to London Spirit, Welsh Fire sign Chris Woakes", "filename": "sport_cricket_articles_cdxqq2yy5eqo_1745652866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e410/live/6bb47fb0-f51e-11ef-b1cf-3b30ef6eb80e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cdxqq2yy5eqo_1745652866.html", "title": "The Hundred 2025: Jamie Smith moves to London Spirit, Welsh Fire sign Chris Woakes", "title_page": "The Hundred 2025: Jamie Smith moves to London Spirit, Welsh Fire sign Chris Woakes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wicketkeeper-batter Jamie Smith will play for London Spirit in the 2025 edition of The Hundred after a mini draft for the last two centrally contracted England men's places.\nSmith, who played two seasons in the tournament for Birmingham Phoenix, will be captained at Spirit by New Zealander Kane Williamson who was directly signed by the Lord's-based franchise earlier this month.\nThe 24-year-old Surrey player made his Test debut last summer and has since appeared in both one-day internationals and T20s for England.\nMeanwhile, experienced England and Warwickshire all-rounder Chris Woakes has moved to Welsh Fire.\nWoakes, 35, missed last year's edition of The Hundred after the England and Wales Cricket Board (ECB) opted to manage his workload.\nHe played three matches for Phoenix in the 2023 edition of the tournament.\nThe remaining players with ECB red-ball and white-ball central contract points, and not retained by their franchises, are now eligible to move into The Hundred draft.\nEngland's Test players are expected to be available for the majority of The Hundred following the conclusion of their series against India.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cdxqq2yy5eqo"}