{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:21:11", "date_modify": "2025-04-26 04:21:11", "date_publish": "2025-03-03 14:59:51", "description": "Simone Biles, Max Verstappen and Tom Pidcock are among the nominees for next month's Laureus World Sports Awards.", "filename": "sport_articles_cx2r0xw30x4o_1745641271.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/911f/live/3534b090-f74e-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx2r0xw30x4o_1745641271.html", "title": "Laureus World Sports Awards: Simone Biles, Max Verstappen, Leon Marchand, Aryna Sabalenka among nominees", "title_page": "Laureus World Sports Awards: Simone Biles, Max Verstappen, Leon Marchand, Aryna Sabalenka among nominees - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Olympic champions Simone Biles, Mondo Duplantis, Leon Marchand, Faith Kipyegon, Sifan Hassan and Sydney McLaughlin-Levrone are among a star-studded shortlist for the Laureus World Sports Awards.\nAmerican Biles, the world's most decorated gymnast, is a three-time winner of the women's award and also claimed the comeback award last year.\nShe won three golds in Paris in the team, all-around and vault plus a silver on floor and now has 11 Olympic medals.\nShe is joined on the shortlist by a trio of athletes - American McLaughlin-Levrone, the 400m hurdles and 4x400m relay champion, Kenya's Kipyegon, who won a third 1500m title and Dutch star Hassan, the marathon champion.\nLast year's winner, the Spanish footballer Aitana Bonmati, and tennis world number one Aryna Sabalenka of Belarus complete the list.\nOn the men's side, pole vaulter Duplantis, who retained his Olympic title and has broken the world record 11 times, and swimmer Marchand, the winner of four golds at his home Games, both enjoyed Olympic success last year.\nAlso on the shortlist are the 2023 winner Max Verstappen, who claimed his fourth consecutive Formula 1 title, Slovenian cyclist Tadej Pogacar, who won the Tour de France, Giro d'Italia and world title, and Spanish tennis player Carlos Alcaraz, the winner of Grand Slam titles at the French Open and Wimbledon", "url": "https://www.bbc.co.uk/sport/articles/cx2r0xw30x4o"}