{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:37", "date_modify": "2025-05-19 14:40:37", "date_publish": "2017-08-18 16:58:14", "description": "A Celtic side with six changes still dominated against Kilmarnock to extend their run of unbeaten domestic games to 52.", "filename": "sport_football_40908203_1747665637.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15D8C/production/_97448498_13780468.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40908203_1747665637.html", "title": "Kilmarnock 0-2 Celtic", "title_page": "Kilmarnock 0-2 Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic clocked up another dominant performance and victory over Kilmarnock thanks to strikes by James Forrest and Callum McGregor.\nThe goals came late in both halves, and were created by the vision and touch of Tom Rogic.\nCeltic were not at full strength, making six changes to the starting line-up, but still commanded the game.\nKilmarnock were restricted to half chances and unable to disrupt the visitors' accomplished passing.\nThe victory - Celtic are now 52 domestic games unbeaten - moved the defending champions top of the Scottish Premiership, with the rest of the teams still to play later in the afternoon.\nKilmarnock have now lost all three of their opening league games for the first time since 1995.\nBrendan Rodgers' team selection was an expression of Celtic's growing dominance. Only five players remained from the side that began Wednesday's Champions League play-off tie against Astana, and five of the starters at Rugby Park were graduates from the club's youth academy.\nThe back line, in particular, was testament to Celtic's potential strength in depth, with Kieran Tierney the eldest at 20, alongside Anthony Ralston, 18, Kristoffer Ajer, 19, and Calvin Miller, 19. Elsewhere, Kundai Benyu and McGregor were provided with opportunities to impress and Forrest returned to his makeshift centre-forward role.\nKilmarnock ought to have responded with a sense of purpose against a visiting side that was not at full strength, but the recent 5-0 Scottish League Cup defeat to another Celtic side that contained several fringe players, would also have played on their minds.\nThe home side conceded territory and possession to Celtic, as they sat off the visitors, stayed behind the ball and attempted to close off their passing angles. Celtic are accustomed to facing that level of containment, though, and they merely passed from side to side with an air of calm governance.\nRodgers talks often about the strategy of his side, and elements of this display were recognisable, such as Miller playing high and wide on the left, Benyu tucking in as another central attacker, and Ralston dropping back when attacks were on the left to leave a solid back three.\nPatience rather than urgency shaped Celtic's approach. Scott Brown was central, collecting the ball from his centre-backs, moving it from flank to flank, and also providing a further level of defensive security on the rare occasions when Kilmarnock carried the ball forward.\nThere were moments for Celtic to endure, as Ralston headed a Stephen O'Donnell cross wide of his own post, but otherwise the visitors could play as if convinced of their eventual breakthrough.\nIt came when Rogic embarked on one of his ghosting runs into the Kilmarnock penalty area, ambling past tackles before slipping the ball back for Forrest to side-foot into the net.", "url": "https://www.bbc.com/sport/football/40908203"}