{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:35:08", "date_modify": "2025-05-21 07:35:08", "date_publish": "2025-01-13 18:38:06", "description": "Calvin Ramsay 'had a phone call' with Matty Kennedy before Kilmarnock move", "filename": "sport_articles_cj48vnql95do_1747812908.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0801/live/677f0550-d1dd-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj48vnql95do_1747812908.html", "title": "Calvin Ramsay 'had a phone call' with Matty Kennedy before Kilmarnock move", "title_page": "Calvin Ramsay 'had a phone call' with Matty Kennedy before Kilmarnock move - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Kilmarnock announced Calvin Ramsay, Derek McInnes thanked Liverpool. He might want to thank Matty Kennedy too.\nThe on-loan Liverpool right-back joined the Rugby Park club until the end of the season and revealed a chat with former Aberdeen team-mate Kennedy played a part in his decision.\nRamsay was at Pittodre when McInnes was manager and trained with the first-team as a youngster, and he's kept in touch with a few former Dons who now play for Killie.\n\"I remember Derek McInnes from Aberdeen, Paul Sheerin gave me my debut, they're top coaches,\" the 21-year-old told club media.\n\"I know a lot of the boys, Matty [Kennedy], Marley [Watkins], I could go through almost half of the dressing room.\n\"I spoke to Matty a few days ago. He gave me a phone call and just went through what the club's like, how the manager works and just said it's a great place to play.\n\"Hopefully when I'm playing week in, week out, I can get back to really enjoying my football and playing my best football as well.\n\"Having relationships with some of the lads is a massive part of it. There's always a settling in period at any new club but knowing so many of the boys, it makes it easier to settle in.\"", "url": "https://www.bbc.com/sport/articles/cj48vnql95do"}