{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:06:33", "date_modify": "2025-05-20 12:06:33", "date_publish": "2023-07-25 00:00:00", "description": "Kylian Mbappe is the subject of a world-record-shattering bid from Al Hilal, Wilfried Zaha joins Galatasaray, plus more transfer news and gossip", "filename": "sport_live_football_66297370_1747742793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E100/production/_130500675_gettyimages.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66297370_1747742793.html", "title": "Latest transfer news: Kylian Mbappe given permission to discuss record move with Al Hilal", "title_page": "Latest transfer news: Kylian Mbappe given permission to discuss record move with Al Hilal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks all!\nToday finished with the Kylian Mbappe story on whether he will move to Saudi Arabia or Real Madrid.\nBut here are the rest of today's stories:\nFormer midfielder Chris Bart-Williams dies aged 49\nTributes paid to Britain's first £1m footballer\nNottingham Forest sign Anthony Elanga\nChelsea reject bid from West Ham for Conor Gallagher\nPep Guardiola on the future of Kyle Walker\nStay across the site for more stories this evening!\nMbappe could enjoy the 'challenge' of the Premier League\nBBC Radio 5 Live\nFrench football journalist Lisa Leroux, speaking on BBC Radio 5 on if Kylian Mbappe might play in the Premier League, she added: \"It's the best league in the world, so I definitely see him playing in the Premier League and just wanting to give himself that challenge but which team he goes to, I'm not sure.\n\"I think if say Manchester United or Chelsea give him an offer and say 'we want you to be our star and we have the money' I don't see why he wouldn’t go.\"\nListen to the full discussion at 10:03 on BBC Sounds\nSanson joins Nice on loan\nAston Villa midfielder Morgan Sanson has signed for Ligue 1 side Nice on a season-long loan deal.\nThe 28-year-old returns to his native France having spent the second half of last season at Strasbourg.\nSanson joined Villa from Marseille in January 2021 and has made 23 appearances. His one goal for the club came against Stevenage in the FA Cup last season.\nMbappe wants to be 'the best football player'\nBBC Radio 5 Live\nFrench football journalist Lisa Leroux, speaking on BBC Radio 5 Live on why Kylian Mbappe might reject Al-Hilal: \"I think he wants to be the best football player, he wants to reach the level that Lionel Messi has reached that Cristiano Ronaldo has reached and play in Europe for the best teams.\n\"No player has ever been offered this salary in football, and I think even in sporting history for one year, it would be about 59 million euros a month, almost two million a day.\n\"I mean the salary that he would be getting would just be historic and out of this world.\"\nListen to the full discussion at 10:03 on BBC Sounds\nMbappe's level is 'bound to drop'\nBBC Radio 5 Live\nUK football writer Alison Bender, speaking on BBC Radio 5 Live about the Kylian Mbappe bid: \"Numbers now in football don’t surprise me especially now the Saudi Pro League is involved. I hear the numbers and it is like monopoly money now.\n\"This is a 24-year-old at the peak of his powers. He wants to play for Real Madrid so if he plays in a team like Al Hilal which is not one of the major leagues. His level is bound to drop and that is very sad.\n\"If he really loves football, that would be very sad to see an incredible player levels drop like that.\n\"It is spiralling out of control now and with Saudi Arabia, money is no object, I just don’t think we need to be surprised about the amounts we are talking about anymore.\n\"It is not about money anymore, it is about legitimizing the league if you get a player like Mbappe to your league.\"\nListen to the full discussion at 10:03 on BBC Sounds\nWill Mbappe go to Saudi Arabia or Real Madrid?\nThe future of Kylian Mbappe has become this summer's headline transfer saga.\nAfter refusing to sign a contract extension at Paris St-Germain, the French champions are attempting to cash in on their World Cup winner to avoid losing him for nothing next summer.\nStep forward Saudi Arabian side Al-Hilal, who shocked the footballing world on Monday with an eye-watering world record bid of £259m for the France captain and PSG's record goalscorer.\nBut what happens now? Could he actually swap the Champions League for the Saudi Pro League? And where is the striker likely to end up?\nRead more here\n'Our players will be desired by other clubs'\nManchester City\nDias on City's squad staying together this season: \"When it comes to all of our players, we are all important and we will all be desired by other clubs. It is good when we manage those who are most being spoken about and gett them to stay.\n\"Football is about people coming and going. Sometimes it is unfortunate because of how well we work together; it is sport, not like any other profession. We need to adapt and see what happens.\"\n'We have a good environment'\nManchester City\nDias on Jack Grealish and Erling Haaland being jokers in the dressing room: \"You can see it clearly, but we have a good environment between all of us. Even Mateo [Kovacic], who just came in; one of the first conversations we had, he told me 'wow, this is amazing, how well you all get on.'\n\"Mostly, it is about having people who can make jokes, but also people accepting being made a joke. The friendly environment helps us come together at the right time.\"\n'I can see myself living here'\nManchester City\nNow it is the turn of Manchester City defender Ruben Dias, who is asked about heat in Japan and whether the team have seen any sights: \"Yes, we had some time, but the boss keeps us busy. We had a walk around the city, it looks amazing and I could see myself living here.\n\"But the heatwave, especially today, is bad. We have been dealing with it fine.\"\nNo decision made on new captain\nManchester City\nOn Manchester City's new captain, Guardiola said: \"When we come back to Manchester when the squad will be definitive that is when we will choose our new captain. I will speak with the old captains' and they can help decide.\"\nOn replacing his assistant managers: \"I don't know what happens with my assistant managers. I take care of them so well and they drop me, so if you want to come to the bench I have a space now.\n\"I want to thank Rodolfo Borrell for an incredible seven years together and he was a huge part of our success especially last season, so I wish him and Enzo Maresca the best. We are looking to have someone to now help us.\"\n'I don't know what is going to happen' - Walker's future\nManchester City\nOn Kyle Walker's future Guardiola said: \"He is an incredibly important player for us. He has specific qualities which are so difficult to find. However I don't know what is going to happen.\n\"He is still our player and is in the plans tomorrow. We hope he is going to stay next season with us. Why should he not play?\"", "url": "https://www.bbc.com/sport/live/football/66297370"}