{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 03:53:26", "date_modify": "2025-05-21 03:53:26", "date_publish": "2025-04-07 09:04:38", "description": "After the opening meet of the Grand Slam Track, BBC Sport looks at whether the new concept from Michael Johnson was a success.", "filename": "sport_athletics_articles_c787x8m142jo_1747799606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e46d/live/774bd5e0-1377-11f0-a2fa-438095678417.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c787x8m142jo_1747799606.html", "title": "'Love to see more spectators' - was Grand Slam Track a success?", "title_page": "Grand Slam Track: 'Love to see more spectators' - was Grand Slam Track a success? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "From empty stands and absent superstars to innovative formats and unusual match-ups - did the inaugural Grand Slam Track meeting deliver?\nThe 12 athletes who left Kingston, Jamaica this weekend with an additional $100,000 (£77,500) after competing in just two events might suggest it was a huge success.\nHowever, huge swathes of empty seats at the National Stadium led to the feeling that the innovative new format, the brainchild of four-time Olympic champion Michael Johnson, has work to do in order to capture an audience.\n\"Obviously, look, let's be honest. We would love to see more spectators here, you know?\" Johnson said.\n\"We think we'll get that, we think that'll happen. But the crowd was engaged, and that's what's really important. People were really engaged with what's happening here.\"\nAmerican Johnson said he launched the concept, broadcast on TNT Sports in the UK, in a bid to maintain the attention and excitement athletics generates every four years at the Olympics.\nThe event in Jamaica was the first of four scheduled three-day events - each of the next three take place in the United States - and Johnson was pleased with how it played out, although he admitted there are issues to iron out.\n\"Everything went smooth from a competition standpoint,\" Johnson added. \"But we had a few things behind the scenes that we didn't like.\n\"Other people probably didn't notice it, but we did. We will look at everything. We noticed lots of different things. But those aren't the things we're going to get into right now.\n\"Right now we're just celebrating that we had a great event, athletes and fans enjoyed it. We'll continue to improve.\"", "url": "https://www.bbc.com/sport/athletics/articles/c787x8m142jo"}