{"authors": ["Phil Cartwright", "www.facebook.com"], "date_download": "2025-05-21 06:40:10", "date_modify": "2025-05-21 06:40:10", "date_publish": "2025-01-31 10:24:42", "description": "Eddie Howe press conference: Newcastle vs Fulham", "filename": "sport_football_articles_c5yvqq8vr1po_1747809610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yvqq8vr1po_1747809610.html", "title": "Eddie Howe press conference: Newcastle vs Fulham", "title_page": "Eddie Howe press conference: Newcastle vs Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Callum Wilson is closing in on a return from injury but the striker will not be involved against Fulham, while winger Harvey Barnes remains \"two or three weeks away\" from being fit again.\nAfter Miguel Almiron's six-year spell at the club ended on Thursday, Howe praised the departed winger: \"A very special player and a very special person who will be greatly missed by everyone connected with us. He's a very bubbly and bright personality but, behind the scenes, ultra professional. He did everything he could to be at his very best every day and, from my perspective, you can't have enough of those players who set the right standards.\"\nHowe does not expect any other players to leave before Monday's transfer deadline. \"Things can change, but as we stand at this moment I expect the squad to remain the same.\"\nOn potential incomings: \"Barring something huge happening, we didn't expect it would be a window we would recruit in. That's still the case - we're not actively looking to bring players in. Hopefully, the squad will be in a decent place if we can get Callum and Harvey back.\"\nOn facing Fulham again after losing the reverse fixture in September: \"It was a tough day - we didn't perform anywhere near where we can. It was a phase when we were struggling to reach our best form. In the Premier League, every team has really strong qualities and on the day they deserved to win.\"\nNewcastle's previous home game was their 4-1 loss to Bournemouth and Howe is keen to remedy that result: \"We definitely had that feeling going into the Southampton game of knowing we needed a big response. The players gave that. But that was an away game and we're coming back to the same environment where we didn't perform. We felt we let ourselves down in that moment so it's an opportunity to finally put that game to bed.\"", "url": "https://www.bbc.com/sport/football/articles/c5yvqq8vr1po"}