{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:36:30", "date_modify": "2025-05-20 12:36:30", "date_publish": "2023-07-25 06:23:03", "description": "Former West Ham goalkeeper turned TV pundit Shaka Hislop says he is \"thankful\" for support after his on-air collapse.", "filename": "sport_football_66298535_1747744590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0F8B/production/_130497930_gettyimages-1133290176.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66298535_1747744590.html", "title": "Shaka Hislop 'thankful' for support after on-air collapse at Real Madrid v AC Milan game", "title_page": "Shaka Hislop 'thankful' for support after on-air collapse at Real Madrid v AC Milan game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former West Ham goalkeeper Shaka Hislop has offered thanks for the support he received after his \"awkward\" on-air collapse on Sunday in California.\nThe 54-year-old was working as an analyst for US broadcaster ESPN when he stumbled and fell during a pre-match pitch-side interview.\n\"That was awkward,\" Hislop said in a video on Twitter, external on Monday.\n\"What a 24 hours this has been. Every so often life gives you a moment to pause and this was mine.\"\nHislop added: \"My response now has to be to seek out the best medical opinion I can get and listen to what my doctors have to say.\n\"There is so much I have to be thankful for - wife, children, family, loved ones, friends, people I have shared space with over the years and have lost touch with for whatever reason and who have reached out either directly or indirectly - thank you.\"\nHislop, who played 121 games for West Ham in two spells from 1998 to 2002 and 2005 to 2006 and won 26 caps for Trinidad and Tobago, also thanked broadcast colleagues for their help.\nDan Thomas, who was presenting alongside Hislop in the game between Real Madrid and AC Milan at the Rose Bowl in Pasadena, called for assistance as the channel cut for a commercial break.\nTemperatures in California on Sunday were reported to be about 30C, but it is unclear if heat was a factor in Hislop's collapse.\n\"I would like to say thanks to Dan and the ESPN family - the camera operators, the medical staff at the Rose Bowl who all responded in the way they did and afforded me the care that I got. Thank you,\" said Hislop, who also played for Reading, Newcastle and Portsmouth.\n\"I know now that even when we argue and disagree, I have the fullest support of each and every one of you and I am looking forward to getting back and doing what I enjoy doing most.\"", "url": "https://www.bbc.com/sport/football/66298535"}