{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:12:47", "date_modify": "2025-05-21 06:12:47", "date_publish": "2025-01-22 23:39:51", "description": "PSG 4-2 Man City: 'Not many people thought City would be in this position' - Nedum Onuoha", "filename": "sport_football_articles_clyn30w8x65o_1747807967.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd41/live/f574d860-d919-11ef-8206-e9659207ddd1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyn30w8x65o_1747807967.html", "title": "PSG 4-2 Man City: 'Not many people thought City would be in this position'", "title_page": "PSG 4-2 Man City: 'Not many people thought City would be in this position' - Nedum Onuoha - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City's match against Club Brugge will be like their \"first knockout game\" of the Champions League campaign, says former defender Nedum Onuoha.\nCity's 4-2 defeat away to Paris Saint-Germain has left them sitting 25th in the table and in danger of exiting the competition unless they win their final game at home to Club Brugge next Wednesday.\nSpeaking on MOTD: Uefa Champions League, Onuoha said: \"Manchester City looked like they suffered for the vast majority of that second half, which is unlike City, and they were never able to rebound because the pressure was on all the time.\n\"This one [losing the lead] feels different to the Brentford one and different to the Feyenoord one, because Paris Saint-Germain were by far the better team.\n\"The most shocking thing about City's performance is how poorly they managed the game from 2-0 up. City teams of the past would have taken the sting out of the game and stayed in control, but instead they could not keep the ball at all.\n\"Not many people thought that Manchester City would be in this position whereby they would have to have a must-win game against Club Brugge in the final game to essentially scrape through into the knockout rounds.\n\"But, the opportunity is there. There is going to be some nervousness, but it is a big game and it is basically their first knockout game of the competition.\"", "url": "https://www.bbc.com/sport/football/articles/clyn30w8x65o"}