{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:40:14", "date_modify": "2025-05-20 12:40:14", "date_publish": "2023-08-03 07:31:40", "description": "Seven-time Super Bowl champion Tom Brady becomes a minority owner in Birmingham City.", "filename": "sport_football_66393033_1747744814.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3928/production/_130623641_tb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66393033_1747744814.html", "title": "Tom Brady: NFL legend becomes minority owner of Birmingham City", "title_page": "Tom Brady: NFL legend becomes minority owner of Birmingham City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Seven-time Super Bowl champion Tom Brady has become a minority owner of Championship side Birmingham City.\nThe NFL legend, who retired from the sport in February, has \"entered a partnership\" with Blues' new owners Knighthead Capital Management LLC.\nThe 46-year-old will become chairman of a new advisory board at St Andrew's.\n\"Tom Brady joining the Birmingham City team is a statement of intent. We are setting the bar at world class,\" Knighthead co-founder Tom Wagner said.\n\"Tom is both investing [as well as] committing his time and extensive expertise.\n\"As chair of the advisory board Tom will have a direct impact on the club. The men's, women's, and academy teams are going to benefit from [his] knowledge.\n\"The goal that Tom has committed to is to make Birmingham City a respected leader in nutrition, health, wellness, and recovery across the world of football.\"\nThe club said Brady would also work closely with the board and the management team on global marketing efforts and the identification of new commercial partnership opportunities.\nA number of American stars have made minority investments in English football clubs in recent months.\nFormer NFL defensive end JJ Watt became a shareholder at Burnley in May, while actor and producer Michael B Jordan invested in Bournemouth at the end of last year.\nAmerican golfers Jordan Spieth and Justin Thomas, and NBA All-Star Russell Westbrook are also minority stakeholders in Leeds United.\nFellow NBA star LeBron James also become a minor partner in Fenway Sports Group (FSG), the owners of Liverpool, in 2021.\nUS-based Shelby Companies Limited (SCL), a subsidiary of Knighthead Capital Management, completed its takeover of Birmingham in July.\nAs part of that deal SCL became controlling shareholders of the previously Chinese-owned club.\n\"Birmingham City is an iconic club with so much history and passion, and to be part of the Blues is a real honour for me,\" Brady said.\n\"BCFC is built on teamwork and determination and I'm excited to work alongside the board, management and players to make our Second City club second to none.\n\"I've been part of some amazing teams in my day, and I'm looking forward to applying my perspective to create that same success here in Birmingham.\"\nWidely recognised as one of the greatest American footballers in NFL history, the quarterback won six Super Bowls with the New England Patriots and one with the Tampa Bay Buccaneers in 2021.\nBrady's final season before his retirement earlier this year ended in the Bucs' 31-14 play-off defeat in January.\nBlues, who finished 17th in the Championship last season, begin the new campaign with a trip to Swansea on Saturday.\nPhilippou added there was little comparison between Brady's role and that of Hollywood superstars Ryan Reynolds and Rob McElhenney at League Two Wrexham.\n\"There is a big difference between the ownership, which is effectively what we're seeing at Wrexham where they are involved in a lot of the day-to-day running of the club and what we're seeing here where basically a minority ownership means you don't have much power,\" she said.\n\"He's not even on the board of directors. It does feel almost more of a sponsorship-type deal rather than an ownership. Time will tell.\"", "url": "https://www.bbc.com/sport/football/66393033"}