{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:15", "date_modify": "2025-05-21 07:48:15", "date_publish": "2025-05-18 18:18:56", "description": "Gloucestershire call the shots on day three of the County Championship match against Kent to raise the prospect of a first home win in three seasons.", "filename": "sport_cricket_articles_c5y6mrpzj95o_1747813695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9c16/live/00c16530-3414-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5y6mrpzj95o_1747813695.html", "title": "County Championship: Gloucestershire take control against Kent", "title_page": "County Championship: Gloucestershire take control against Kent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucestershire called the shots on day three of the County Championship match against Kent at the Seat Unique Stadium to raise the prospect of a first home win in three seasons.\nThe home side posted 516 to establish a useful first-innings lead of 92 courtesy of hundreds from Cameron Green and James Bracey, who scored 128 and 127 respectively and staged a fifth wicket stand of 222 in 54 overs.\nNathan Gilchrist took 3-141 and Jake Ball 3-132 as Kent fought to stay in the game, but Tom Price hit 76 to give Gloucestershire a potentially crucial advantage.\nRequired to show resilience in the face of pressure, Kent were undone by seam on a batter-friendly track, losing openers Harry Finch and Ben Compton, captain Daniel Bell-Drummond and Tawanda Muyeye as they subsided to 98-4 in the late-afternoon Bristol sunshine.\nJack Leaning and Chris Benjamin dug in to advance the score to 135-4 by the close, but the visitors are just 43 runs ahead and face an uphill task if they are to save the game on the final day.\nHaving failed to win any of their last 15 home matches since defeating Warwickshire at Bristol in September 2022, Gloucestershire will feel they have a genuine opportunity to register their first win of the season.\nKent's hopes of establishing a first-innings lead were dependent upon the new ball, which was taken in the second over of the day. Charged with the task of taking early wickets, Gilchrist and Ball failed to take advantage, sending down too many four balls and enabling Gloucestershire's fifth wicket pair to come flying out of the blocks.\nWhenever Gilchrist fell short of a length, Green punished him, carving two consecutive deliveries through the covers for four, while Ball suffered a similar fate when allowing the Australian width outside off stump. Not to be outdone, Bracey twice drove Ball handsomely through the covers, pulled Gilchrist for another four in the next over and then crunched the same bowler backward of square to raise the 200 partnership in exactly 50 overs.\nGreen guided a ball from Gilchrist to the third man boundary to secure a third batting bonus point for Gloucestershire, who added 54 in the first eight overs of a high-octane morning session. But the Australian succumbed to Gilchrist when feathering a catch behind and departing for a brilliant 128, much to the relief of the visiting team. The 25-year-old Australia Test star had faced 184 balls, struck 17 fours and a six and propelled the hosts into a strong position.\nGrant Stewart then removed Graeme van Buuren lbw without scoring as Kent made further inroads, but there was no stopping the indefatigable Bracey, who went to his fifteenth career first-class hundred and his second of the season from 176 deliveries, flicking Kashir Ali off his legs for a single before raising his bat in celebration.\nAlthough the rate of scoring slowed following Green's departure, Bracey and Tom Price still raised a 50 partnership from 86 balls, accelerating at the right time in their pursuit of maximum bonus points. The seventh wicket pair had wiped out the arrears and were in credit by the time Bracey skied a catch to mid-on off the bowling of Ball and departed for 127, his superb innings spanning 192 balls and including 17 fours and a six. Zaman Akhter hit Gilchrist straight to mid-off, but Price was on 35 not out, his highest score of the season, when lunch was taken with the home side 438-8, a slender lead of 14 runs.\nJosh Shaw pulled Gilchrist to deep mid-wicket and ran two as Gloucestershire secured a fifth batting bonus point by the skin of their teeth off the final ball of the 110th over, while Price raised his first half century of the season from 88 balls with his seventh four as the home side looked to forge a meaningful lead. As the pitch flattened out even more and the ball softened, so Price began to force the issue, raising a notable 76 from 120 deliveries with 11 fours before falling lbw to Kashif. Ajeet Singh Dale fell in identical fashion to the Pakistan international, leaving Shaw unbeaten on 34 made from 45 balls.\nKent openers Finch and Compton set their sights on seeing off the new ball and reaching tea with their wickets intact, and they almost succeeded. Gloucestershire required a breakthrough if they were to exert real pressure and Singh Dale obliged, producing late swing to pin Finch lbw in his crease for 23 in the final over before the interval with the score on 37.\nTrailing by 55 runs at the start of the final session, the visitors had work to do. Compton and Daniel Bell-Drummond staged a defiant stand of 48 in 13.3 overs, saw off the dangerous Singh Dale and looked to have done the hard work, only for the former to edge a fullish delivery from Shaw to Cameron Bancroft at second slip and fall for 35. When Bell-Drummond offered Tom Price a return catch in the act of driving in the very next over, Kent were 89-3, still three runs behind.\nThey were a mere six runs to the good when Akhter angled a delivery into Muyeye, who was given out lbw, at which point the visitors had surrendered three wickets in five overs. Thereafter, Leaning and Benjamin safely negotiated 14 overs of seam to reach the close unbeaten on 15 and 17 respectively.", "url": "https://www.bbc.com/sport/cricket/articles/c5y6mrpzj95o"}