{"authors": ["Luke Reddy", "www.facebook.com"], "date_download": "2025-05-19 15:37:03", "date_modify": "2025-05-19 15:37:03", "date_publish": "2017-08-24 12:44:24", "description": "Floyd Mayweather's name draws fighters from around the globe to his Las Vegas gym, but what lies inside - and how do you get in?", "filename": "sport_boxing_41026927_1747669023.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3494/production/_97506431_mayweather_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_41026927_1747669023.html", "title": "Floyd Mayweather v Conor McGregor: Behind the doors of the Mayweather Gym", "title_page": "Floyd Mayweather v Conor McGregor: Behind the doors of the Mayweather Gym - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I've been here since 3am, man, and I haven't had any sleep.\"\nOtis Pimpleton Jr sits on a window ledge outside the Mayweather Boxing Gym. He is still at work, 15 hours after Floyd Mayweather performed one of his famous late-night workouts four days before he faces Conor McGregor.\nThe end of Pimpleton's daily grind nears at a gym that has been referred to as the 'Mecca of boxing'.\nThe Mayweather name draws fighters, their kitbags filled with dreams, from around the globe. But what lies inside this humble piece of Las Vegas real estate? And how does a fighter get access?\nHere, with the help of some of Mayweather's fighters and closest aides, BBC Sport takes a look.\nNestled behind seemingly endless rows of Chinese restaurants a 10-minute drive from the Las Vegas strip, a frosty welcome awaits at this unassuming building tucked away off the main road.\nMy visit coincides with a private Badou Jack training session just days before he challenges Nathan Cleverly for the WBA light-heavyweight title. I am told, in no uncertain terms, to wait in a reception area until the Mayweather fighter is done.\nA door to the gym floor is slammed tight, Jack's grunts coinciding with the sound of glove hitting pads. Images of Mayweather line the waiting area. A sofa looks old under harsh lighting.\nFew fighters are made in glitzy gyms, and this isn't one. Still they flock.\n\"Five years ago I was British champion and wanted a change of scenery having been in New York all the time,\" says London-born Ashley Theophane, who fights for Mayweather Promotions. \"I didn't know where the gym was. I just got a flight here, found it online and went in.\n\"There's boxers from all over the world who come over. The sparring goes down and it's crazy in there. It's sink or swim. You have to be prepared. Don't come trying to get fit. Get there already fit. It's a high level, that's why they call sparring there 'The Dog House'. If you aren't good, you are going to be found out.\"\nMayweather, his uncles, father and wider team are quick to spot talent. Theophane says some fighters in the gym as young as 10 are \"amazing\", and their fathers push them to soak up the Mayweather skillset.\nTwo rings dominate the room, mirrors run the length of two of the walls, punch bags of all shapes and sizes make up a background. The stench of sweat is not as pungent as in some gyms, though Tabiti is sodden. Peppering the walls above the mirrors are Mayweather fight posters. The opponents listed read like a who's who of global talents and hard men.\nMayweather is a man of abundance when it comes to talent, self-belief and money. Yet this room, so key in defining him, is fundamentally straightforward.\n\"I first went there in 2007,\" says BBC Radio 5 live boxing analyst Steve Bunce. \"It was quirky then, things like you could watch Floyd train but you couldn't talk.\n\"So many British fighters have turned up with their kitbag. The numbers in the gym seem to have grown over the years but I'll say this, there may be many around Mayweather, a few men catching his sweat and doing jobs, but not much comes out of there. They keep their mouths shut.\"\nBunce describes Mayweather as a \"thief of ideas\", pointing to his ability to work through a session from shadow boxing in mirrors to heavy bag work and pad work while taking on bits of advice from different coaches along the way.\n\"When he's in there, it's electric,\" says Bunce. \"Him on that heavy bag is something to witness, measuring every detail.\n\"He'll have one guy in charge of one bag, one guy in charge of the next, one doing the water. They have to almost build a role. They then have to protect that role. So it's territorial and there's not a lot of laughs in there.\"\nI'm told Mayweather ordered a staff member to leave instantly for not having his hand weights in the right place when they were needed. There is no room for slack in pursuing perfection.\nSophie Whittam - a Sheffield-based designer of boxing shorts - arrives to run through designs for Jack, one of her clients. His team buzz around, while Tabiti's team stress to me how badly fighters in this gym \"have to earn the right\" to work here.\nThere's a chaos about the place, even at a quiet time. Members of the public can train if professional fighters are not in need of privacy, but unusual opening hours (about midday to 5pm) neither align with boxing tradition nor are convenient to suit the working hours of the common man.\nMayweather is anything but a common species. In preparing for McGregor he has done much of his training in the early hours.\n\"Lots of the gym staff are telling me they are tired,\" says Theophane with a smile. \"You won't get me in there at that time.\"\nOften bringing order to chaos is Mayweather's publicist Kelly Swanson, a hugely respected and long-standing member of his team.\n\"When I've been in there, Kelly is key,\" adds Bunce. \"Floyd respects her immensely and so do others around him. She has worked with some of the greatest names over the past 30 years.\"\nSwanson laughs when I ask her if she keeps the 'Money Team' in check. \"I'm not sure about that,\" she says. \"I always feel nothing but respected in there.\n\"They actually help me train. A few times I've gone in there and hit the mitts, worked the heavy bag. Hopefuls, amateurs, they all know in that gym you will get the best instruction because of the coaches.\n\"And, importantly, the gym involves the community with things like back-to-school programmes and giveaways.\n\"I have always done my job for Floyd and it has become a close relationship.\n\"I like him. He's quiet. When he's just with his family and friends it's a lot different to the persona you see on the outside.\"\nThe lights are bright and bounce off the combination of mirrors and white walls. But there is a dark side to this place.\nThe 'Dog House' sparring Theophane alludes to is commonplace - to a point. Trainers the world over may put fighters through rounds lasting over the standard three minutes to harness endurance.\nBut criticism has arrived at the doors of the Mayweather Gym over the years, when footage of 30-minute rounds was published, with fighters roared on and bets placed on which would fold.\n\"It's uncivilised and barbaric and it's not going to help any fighter,\" adds Bunce. \"Any fighter thinks sparring beyond four or five-minute rounds is not quite right. In rounds longer than that, you simply stop learning.\"\nTheophane tells me fighters can choose how long they spar for, but it is easy to see how things could get out of hand.\nWe are, after all, in a landmark gym in a city where every fighter wants to make it. The rewards boxing delivers are visible simply by looking at the shimmering vehicles usually found in the car park. Bravado, a desire to mark territory and prove oneself, will naturally be present.\nWith his fight against McGregor now so close, Mayweather's sparring days should be over. His father, Floyd Sr, has again watched over his training, though even he concedes his son has lost \"a lot\" in the two years he has been retired.\nBut there remains a focus about Mayweather when the cameras are away. Those who doubt his commitment may only analyse the sound bites or social media posts. He has been grafting. On a recent trip to London he hopped off his private jet after a transatlantic flight and hit the running track, keeping pace with world champion Gervonta Davis, a fighter 18 years his junior.\nThe 40-year-old is a \"genetic freak\", his promoter Leonard Ellerbe tells me.\n\"He is gifted with certain genes,\" says Ellerbe. \"I can look at food and gain weight. He eats what he wants and goes about his business.\"\nTheophane says the energy of a Mayweather training camp was sorely missed during his two-year retirement spell.\nThat void now looks unavoidable. The end is nigh. But will fight 50 go the same way as the previous 49 - ending with a Mayweather victory?\nBunce adds: \"If he loses, it could shine a sharp light on that gym, because at some point someone would have to say: 'Who of you 20-something people on the payroll didn't tell him that he wasn't looking as sharp as he could have been?'\"\nAs I leave, passing the Pac-Man arcade machine near the front door, it is clear Mayweather has mastered his craft in simple surroundings.\nWin, lose or draw on Saturday, all he has done means many will still come here, kitbag in hand, dreaming.", "url": "https://www.bbc.com/sport/boxing/41026927"}