{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:43", "date_modify": "2025-05-21 06:52:43", "date_publish": "2025-03-29 18:56:15", "description": "Swansea City: Alan Sheehan hails 'togetherness' after Leeds draw", "filename": "sport_football_articles_cvg7eepn088o_1747810363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b52/live/7eb0e7f0-0ccc-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg7eepn088o_1747810363.html", "title": "Swansea City: Alan Sheehan hails 'togetherness' after Leeds draw", "title_page": "Swansea City: Alan Sheehan hails 'togetherness' after Leeds draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan said togetherness was key for Swansea City as they stunned Leeds United with a 96th-minute equaliser to claim a point at Elland Road.\nSwansea looked destined to get no reward for their spirited performance against one of the Championship's heavyweight clubs when Wilfried Gnonto put Leeds 2-1 ahead four minutes from the end of normal time.\nBut there was a memorable climax to a dramatic game as Zan Vipotnik struck to ensure Swansea became only the fifth visiting side to avoid defeat at Leeds in the second tier this season.\nIt was a sweet moment for caretaker head coach Sheehan after he agreed to remain in charge until the end of the season with the club declining to offer him a longer-term deal at this stage.\n\"You see a togetherness and a character and how happy everybody is when we score,\" the Irishman said.\n\"We said before the game, no individual can succeed at Elland Road.\n\"It's got to be a team. Make sure we get to the end of the game and look to the left and the right and think 'you had my back today'. What a feeling that is, hey?\"\n\"We are competing against ourselves. We have had six games now and five of them we have been OK.\"\nThe point earned at Leeds – and the psychological boost it should offer – could be key for Swansea as they look to extinguish relegation concerns.\nSheehan's 16th-placed team are now seven points clear of the bottom three with seven games remaining this season, though the gap could be cut by the time they host Derby County next weekend as the 22nd-placed Rams face Preston in midweek.\nSwansea recovered from a desperate start at Leeds as they conceded to Brenden Aaronson after only 35 seconds, while they also overcame the blow of missing a first-half penalty when Josh Tymon's spot-kick was saved by Illan Meslier.\nMeslier went from hero to villain when his fumble saw Harry Darling score Swansea's first equaliser before the pendulum swung way and then the other late on.\n\"We were disappointed with the manner of the goal so early, it gets this place absolutely rocking, but then you find out things about your players,\" Sheehan added.\n\"When you come to places like this, you can go one way or the other.\n\"In everything I do, we talk about character, resilience, togetherness, honesty, never giving up and fighting for this club. It's an honour to play for this club so we have to give every ounce that we have.\"", "url": "https://www.bbc.com/sport/football/articles/cvg7eepn088o"}