{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:59", "date_modify": "2025-05-19 15:13:59", "date_publish": "2015-03-03 00:05:23", "description": "Chelsea could sign 44-year-old keeper, Guardiola tipped for City move, Di Maria \"too ugly\" for Real Madrid, plus more.", "filename": "sport_31704162_1747667639.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80715000/jpg/_80715661_gossip_promo_464_main.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_31704162_1747667639.html", "title": "Gossip column: Friedel, Guardiola, Beckham, Sturridge, Terry", "title_page": "Gossip column: Friedel, Guardiola, Beckham, Sturridge, Terry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea could move for Tottenham goalkeeper Brad Friedel, who will be 44 in the summer, as a replacement for second choice Petr Cech, should the 32-year-old leave Stamford Bridge this summer. (Daily Telegraph), external\nFormer Liverpool midfielder Jamie Carragher believes Chelsea cannot afford to let defender John Terry, 34, leave the club and it will cost them dearly to get a replacement. (Daily Mail), external\nDavid Beckham's 15-year-old son Brooklyn could follow his father's example and play for Manchester United if he is released by Arsenal at the end of the season. (Daily Star), external\nPSV Eindhoven's 21-year-old winger and reported Manchester United target Memphis Depay \"has the option\" to leave the Dutch club in the summer. (Manchester Evening News), external\nInter Milan have ruled out selling striker Mauro Icardi, 21, who is attracting interest from Arsenal, Manchester United and Chelsea. (Daily Star), external\nEverton will have to look elsewhere after reports in Italy claimed that Galatasaray's 31-year-old striker Goran Pandev has signed a pre-contract agreement with Genoa.(Talksport), external\nLiverpool manager Brendan Rodgers says striker Daniel Sturridge is close to full fitness and will play a crucial role in the Premier League run-in this season. (Liverpool Echo), external\nFormer Premier League referee Howard Webb has defended his colleagues after a number of officiating controversies in the game over the last couple of weeks. (Times - subscription required), external\nCrystal Palace manager Alan Pardew has suggested television pundits are influencing the Football Association after midfielder Mile Jedinak, 30, was charged with violent conduct.(Daily Mirror), external\nSpurs winger Andros Townsend believes his side's double cup exit could help their ambitions of playing in the Champions League next season. (Sun - subscription required), external\nFormer Middlesbrough and Celtic manager Tony Mowbray has agreed to become Coventry City boss. (Coventry Telegraph), external\nThe investigation into Wigan manager Malky Mackay's exchange of offensive messages with former Cardiff head of recruitment Iain Moody has been extended after new information was passed to the Football Association. (Daily Mail), external\nHull winger Robbie Brady, 23, could be ruled out for the rest of the season after falling down a hole at the club's training ground. (Daily Mirror), external", "url": "https://www.bbc.com/sport/31704162"}