{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:47:49", "date_modify": "2025-05-21 05:47:49", "date_publish": "2025-01-14 14:17:43", "description": "Exeter Chiefs have recruited Wallabies back row Tom Hooper for the 2025-26 Premiership season.", "filename": "sport_rugby-union_articles_cm217pv1yn6o_1747806469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c4e/live/7a8cb2b0-d281-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cm217pv1yn6o_1747806469.html", "title": "Tom Hooper: Exeter Chiefs sign Wallabies back row on deal from next season", "title_page": "Tom Hooper: Exeter Chiefs sign Wallabies back row on deal from next season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter Chiefs have recruited Wallabies back row Tom Hooper for the 2025-26 Premiership season.\nThe 23-year-old, who has 10 international appearances for Australia, will play out the current season with Canberra-based Super Rugby ACT Brumbies before heading to the Premiership later this year.\nHooper has made 38 appearances for the Brumbies across five seasons, and will follow the likes of Scott Sio and Tamati Tua in having swapped the jersey for the Chiefs.\nOn his move to England, the Sydney-born forward said: \"With the changing dynamic of rugby, sometimes you must fly the coop. That's what I'm going to be doing next year.\n\"I'm going to leave the Brumbies and try my best to become a better player, with a view to coming back to Australia and becoming an older, more experienced player later down the track, whenever that may be.\"\nHooper, who made his Super Rugby debut in 2021 after playing at that year's U20 Junior World Championship, is described as fiercely competitive by many in the Wallabies set-up.\nHe first drew interest from national team coaches in 2022 before suffering an injury, and was handed his test debut by then-Wallabies boss Eddie Jones during The Rugby Championship in July 2023 before being named in Australia's 2023 Rugby World Cup squad months later.\nChiefs Director of Rugby Rob Baxter said the club was \"delighted\" by the signing.\n\"A young international who is a big, abrasive back-five forward, we see him having the opportunity to play across our back row but cover second row as well,\" Baxter told the Chiefs' official website, external.\n\"He's got a lot of the attributes that are really important in Premiership rugby – high work-rate along with good physical size and good physical abilities.\n\"He's also an interesting character and someone we're excited to bring to the club to grow the team we want to put together going forward.\n\"Alongside our other young back five forwards, such as Dafydd Jenkins, Rusi Tuima, Greg Fisilau and Ethan Roots, the back five has the ability to be a really strong group that can build over a number of years.\"\nThe Chiefs are currently on a poor run of form, with their latest loss a heavy 69-17 defeat at the hands of Bordeaux in the Champions Cup on Saturday.", "url": "https://www.bbc.com/sport/rugby-union/articles/cm217pv1yn6o"}