{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:37", "date_modify": "2025-04-26 03:40:37", "date_publish": "2025-03-05 09:49:55", "description": "Great Britain Matt Weston says he has only got his \"eye on the top step\" of the podium at the skeleton World Championships.", "filename": "sport_articles_cm2n0v2y3ryo_1745638837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ad2/live/16468d90-f9a4-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cm2n0v2y3ryo_1745638837.html", "title": "Matt Weston: Briton 'eyes the top step' at skeleton World Championships", "title_page": "Matt Weston: Briton 'eyes the top step' at skeleton World Championships - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Great Britain's Matt Weston has his \"eye on the top step\" of the podium only at the skeleton World Championships, which begin on Thursday in Lake Placid, USA.\nLast month Weston secured the skeleton World Cup overall title for the second successive year.\nThe 28-year-old won world gold in St Moritz in 2023 and came within 0.23 seconds of doing so again last year, but had to settle for silver.\n\"Training's going pretty well so far and that's all I've got my eye on, the top step of the podium,\" Weston told BBC Radio Somerset.\n\"I set myself two goals this year - win the [World Cup] overall again, which I have managed to do, and win the World Championships, so that's the main goal.\"\nWeston will complete four runs of the Lake Placid track over two days of heats at the Worlds.\n\"This track is really tough, really technical and [you need] consistency - not only over four runs but over two days where you could be in a good position after day one and then for some people the pressure might get to you to go and perform the next day,\" he said.\n\"That's part of a toughness of the World Championships but it means a lot to me.\"\nWhile Weston said his focus is very much on competing at his best this week, part of Team GB's efforts will also be looking towards the Winter Olympics in Milano Cortina next February.\nHe finished 15th at his first Winter Olympics in Beijing in 2022.\n\"We are practising things in preparation for Milan - how we work with coaches, equipment, personal things for me like how to get my headspace in the right place for racing, how do I overcome this problem, that problem,\" Weston said.\n\"Most of the things we do are with Milan in mind as well, so it's definitely there and the fact that it's less than a year to go kind of makes you a bit nervous as well but very excited.\"", "url": "https://www.bbc.co.uk/sport/articles/cm2n0v2y3ryo"}