{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:04", "date_modify": "2025-05-21 05:00:04", "date_publish": "2025-04-04 11:28:50", "description": "United States captain Kate Zackary signs a contract extension at Premiership Women's Rugby side Trailfinders Women.", "filename": "sport_rugby-union_articles_c705enljkryo_1747803604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2122/live/0a4ce5c0-1146-11f0-bf77-53586c0d950e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c705enljkryo_1747803604.html", "title": "Kate Zackary: USA skipper extends contract with Trailfinders Women", "title_page": "Kate Zackary: USA skipper extends contract with Trailfinders Women - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "United States captain Kate Zackary has signed a contract extension at Premiership Women's Rugby side Trailfinders Women.\nThy 35-year-old back-row will begin a third campaign in Ealing having moved from Exeter in 2023, making 26 appearances.\nThis past season she scored six tries as the London side finished seventh in the table with five wins and 11 losses.\nZackary, who has played in the last two World Cups, was one of the biggest names to move to the club after they were awarded a place in the women's top flight two years ago.\n\"Kate's level of professionalism is unmatched,\" head coach barney Maddison told the club website.\n\"She leads by her performances and the team naturally just looks to her as a leader.\n\"She has a wealth of experience, and her work with our youth programme has been invaluable.\n\"We're delighted to see her continue to lead and perform at the highest level.\"\nZackary added: \"We're finding our momentum as a team and club, and I want to be a part of that process.\n\"Our team is filled with diversely talented players who have a desire to become a contender in the PWR and I can't wait to step back on the pitch with them.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c705enljkryo"}