{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:51:42", "date_modify": "2025-05-20 11:51:42", "date_publish": "2023-07-24 13:19:46", "description": "Wolves: Raul Jimenez's first two seasons at Molineux", "filename": "sport_articles_cy9qdjn5w87o_1747741902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6efe/live/b7fd17b0-2a0e-11ee-a1af-dd14c64ad1dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cy9qdjn5w87o_1747741902.html", "title": "Wolves: Raul Jimenez's first two seasons at Molineux", "title_page": "Wolves: Raul Jimenez's first two seasons at Molineux - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Cartwright, BBC Sport\nFew players in recent history have captured the hearts of Wolves fans like Raul Jimenez and it will be a sad day for many when he completes his expected move away after five years at Molineux.\nHe joined Wolves on loan in 2018, shortly after the club had blitzed the Championship. Nuno's team were too good for the second tier, but one thing they needed for the step up was a genuine number nine. A focal point. Someone to occupy and worry Premier League defences.\nA scoring rate of about one in four for Benfica suggested he was not going to be banging in 30 goals per season. So was he the man for the task?\nAbsolutely.\nJimenez ended his first campaign with 17 goals in 44 games, including four in the club's run to an FA Cup semi-final, as a strike partnership with Diogo Jota blossomed.\nAfter helping Wolves finish seventh and with a Europa League campaign on the horizon, parting with a club-record £30m to sign Jimenez was a no-brainer.\nWolves' 2019-20 season lasted more than a calendar year owing to their early entry into Europe, but the almost ever-present Jimenez was at the heart of their success. Featuring in 55 of Wolves' 59 games, an incredible statistic for a player often operating as a lone striker, he scored 27 times and accounted for a third of their Premier League goals that season (17 of 51).\nFrom Turin to Tottenham, from Bournemouth to Bratislava; more often than not, Jimenez was on the scoresheet - Adama Traore his chief supplier.\nThe only blemish? A penalty failure in the Europa League quarter-final loss to Sevilla.\nThere was no blame, just pride in our pack.\n\"Si senor, give the ball to Raul and he will score,\" we sang from our armchairs, watching from afar during the Covid pandemic.\nAnd then came 29 November, 2020 at Emirates Stadium - when Raul's football career, and his life, changed forever.", "url": "https://www.bbc.com/sport/articles/cy9qdjn5w87o"}