{"authors": ["Dan George & Jerome Sale", "www.facebook.com"], "date_download": "2025-05-21 07:23:12", "date_modify": "2025-05-21 07:23:12", "date_publish": "2025-01-13 18:09:34", "description": "Oxford United boss Gary Rowett says that the U's want to make further signings in this transfer window.", "filename": "sport_football_articles_ckg0v0l2dpko_1747812192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/981b/live/531bde00-d1d1-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg0v0l2dpko_1747812192.html", "title": "Oxford United: Gary Rowett wants to be 'aggressive' in transfer window", "title_page": "Oxford United: Gary Rowett wants to be 'aggressive' in transfer window - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United boss Gary Rowett has said that the U's want to be \"aggressive\" with their recruitment in this January transfer window.\nThey have already added Alex Matos and Ole Romeny to their ranks this winter and Rowett has said that they want more.\nMidfielder Matos joined on loan from Chelsea until the end of the season last Friday, five days after Romeny arrived for a club record fee from FC Utrecht.\n\"We certainly want to be quite aggressive,\" Rowett told BBC Radio Oxford.\n\"There is a risk to that because we have to change a settled squad but I think the risk is probably worth it in the long term.\n\"There is a lot of work going on in terms of recruitment. It is a challenge but we want to build when we're in a positive position, the owner and ownership group is very keen to back us and strengthen.\"\nOxford are currently 17th in the Championship table and five points clear of the relegation zone.\nOver the summer they broke their transfer record and had 16 players come in through the door after winning promotion from League One.\nFast forward to January and they have already broken that record again with Romeny's arrival from the Eredivisie, eclipsing the most they had previously paid for a player.\nCentre-back is a priority position for Rowett but, should opportunities arise, he is likely to want players all over the park as Oxford look to secure their Championship status.\n\"It's going to be about finding a balance this window,\" Rowett added.\n\"Some of those that come in might be long term and others may be almost short-term stop-gaps to get us to where we want to be this season.\n\"We will do the best that we can to be as aggressive as we can, it will just be a case of can we get the players through the door.\"\nSince joining the U's shortly before Christmas, Rowett has won three games and drawn one in the Championship, with Saturday's exit in the FA Cup to Exeter City his first defeat as head coach.\nOxford next travel away to Plymouth Argyle on Tuesday as they look to beat the side they eased past 2-0 at the end of December.", "url": "https://www.bbc.com/sport/football/articles/ckg0v0l2dpko"}