{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:13", "date_modify": "2025-05-21 08:00:13", "date_publish": "2025-05-19 17:10:15", "description": "Crystal Palace news: Oliver Glasner plays down 'legacy' after FA Cup win", "filename": "sport_football_articles_cx2e01zvr2no_1747814413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c93d/live/78e6ed80-34cf-11f0-8ca3-49a2defac508.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2e01zvr2no_1747814413.html", "title": "Crystal Palace news: Oliver Glasner plays down 'legacy' after FA Cup win", "title_page": "Crystal Palace news: Oliver Glasner plays down 'legacy' after FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace boss Oliver Glasner does not feel he has made a \"legacy\" at the club yet, despite their FA Cup final victory.\nThe Austrian guided the team to a 1-0 win over Manchester City at Wembley on Saturday - securing the club a first major trophy in their 120-year professional history.\nDespite the achievement, Glasner has been playing down his status in the Palace history books.\n\"It's just two days ago we were winning it and, all of a sudden, a legacy? No, it's a great achievement. But it's still a little bit unreal. It's also enjoying that moment, but on the other side, having a game tomorrow, we're within these feelings,\" said Glasner.\n\"I don't know, I don't feel it's a legacy. I'm just part of an amazing group and we achieved everything together, so I don't think that it's a legacy.\n\"We're all defined by our character - everyone. The players as well, of course, every one of us has different talents. These people, they have a great talent, they can play football quite well.\n\"But, we are defined not by what we are doing, we are defined by our character. This is what they are - they are outstanding. I mention it so often and this is what they showed. The togetherness, always supporting the group, always having the team on the top.\n\"Everybody puts his ego into the group, into the team, and I think this is what this group is defined by - the great characters of every single player.\"", "url": "https://www.bbc.com/sport/football/articles/cx2e01zvr2no"}