{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:28", "date_modify": "2025-05-21 07:16:28", "date_publish": "2025-01-22 00:00:00", "description": "Reaction as Arsenal, Chelsea, Man City & West Ham reach the Women's League Cup semi-finals.", "filename": "sport_live_cpql9n24pd0t_1747811788.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cpql9n24pd0t_1747811788.html", "title": "Women's League Cup: Arsenal, Chelsea, Man City & West Ham reach last four", "title_page": "Women's League Cup: Arsenal, Chelsea, Man City & West Ham reach last four - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye for now\nThanks for tuning in to our coverage of the Women's League Cup quarter finals.\nMake sure to join us again this weekend as the WSL returns.\nRunaway leaders Chelsea host Arsenal in the game of the weekend at Stamford Bridge on Sunday, a fixture that will be broadcasted live on BBC Two.\nSee you then. Bye!\nBBC Sport Women's Football page\nBefore we go there's been plenty of exciting transfer news involving WSL clubs in recent days, none more so than the pending arrival of USA international defender Naomi Girma to Chelsea for a record breaking fee.\nMake sure to keep up to date with all the latest transfer stories and other WSL updates on the BBC Sport Women's Football page.\nOnce on the page click 'follow' to receive all of the latest straight to your chosen devices.\nFULL-TIME\nBrighton 0-4 Arsenal\nArsenal's title defence remains alive as they book their spot in the semi-finals.\nBrighton put on a determined defensive display for 65 minutes but the introduction of Mariona Caldentey changed the game, setting up Frida Maanum and Kyra Cooney-Cross either side of a Katie McCabe strike as Arsenal scored three goals in five minutes.\nAnd she deservedly joined them on the scoresheet in the 83rd minute, with a stylish lob which put the result beyond any doubt.", "url": "https://www.bbc.com/sport/live/cpql9n24pd0t"}