{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:39:03", "date_modify": "2025-05-20 13:39:03", "date_publish": "2023-08-01 15:08:27", "description": "England's Lauren James did \"special things\" in their impressive 6-1 victory over China in the Women's World Cup, says manager Sarina Wiegman.", "filename": "sport_football_66375627_1747748343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1239A/production/_130605647_gettyimages-1585111203.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66375627_1747748343.html", "title": "Lauren James: England star did 'special things' in win over China", "title_page": "Lauren James: England star did 'special things' in win over China - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Lauren James did \"special things\" in their impressive 6-1 victory over China in the Women's World Cup, says boss Sarina Wiegman.\nThe 21-year-old produced one of the individual performances of the tournament, scoring twice and assisting three times as England booked their place in the last 16 as group winners.\n\"She feels good, you can tell - she did special things today,\" said Wiegman.\nEngland will play Nigeria in their next match, live on BBC One, on 7 August.\nJames, starting her second match in Australia, set up Alessia Russo for England's opener within four minutes and later slipped the ball through to Lauren Hemp to make it 2-0.\nThe Chelsea forward then struck a first-time finish into the left corner from the edge of the box before another stunning effort was ruled out by the video assistant referee (VAR) for offside in the build-up.\nJames then volleyed in Jess Carter's cross for her second goal and grabbed a third assist when she played in Chloe Kelly, who took advantage of a goalkeeper error.\n\"Unfortunately that one goal was cancelled,\" added Wiegman. \"But [James] flows over the pitch.\n\"I could tell [she was enjoying herself] but you could tell that from the whole team. Of course she was one of them. The whole team was enjoying every goal except the one from China!\"\nJames said it was \"what dreams are made of\" and hopes to now continue her impressive form, having also scored the winner in the 1-0 victory over Denmark.\n\"Everyone is buzzing,\" she added. \"We are looking forward to the next round. I felt free, whether I'm on the wing or in the middle, I'm happy to be playing and contributing to goals.\n\"I think [I'm] just playing with freedom, just enjoying my football and tonight showed that.\"\nOn her disallowed goal, James added: \"I was disappointed in the moment obviously but that's football for you.\"\nEngland defender Lucy Bronze was involved in the build-up to James' disallowed goal - where she fired superbly into the far corner from outside the box and would have completed an impressive hat-trick.\nHowever, the VAR ruling was controversial as the ball appeared to bounce off a Chinese defender despite Bronze being in an offside position and clearly not attempting to play the ball.\n\"I'm sad for LJ [James] because I don't know why it's been called offside,\" said Bronze. \"If Hemp scored the cross, I wouldn't have been offside.\n\"The [defender] deliberately played it. I said that at the time, I said that to the referee, 'I don't know why you've given me offside'.\"\nBronze was later shown a yellow card for handball after China were awarded a penalty, which Shuang Wang put away to prevent goalkeeper Mary Earps from keeping a third clean sheet.\nShe did not shake the hand of referee, Australian Casey Reibelt, after the match either.\n\"As a team it's something we've been through before,\" added Bronze. \"I had more go against me than anyone else. It wasn't a fun game in that respect.\n\"I knew it hit my hand but it wasn't deliberate. Unless I cut my arm off I don't know how I get my arm out the way. We sit down with referees every tournament to discuss the rules.\n\"I guess she just wanted to give me a yellow card for fun. Playing for England you tend to know that sometimes decisions don't go your way and luckily enough for us we finished the game off ourselves.\n\"I think LJ's [James'] goal should have stood, she should have had a hat-trick and it would have been a huge moment for her in her first World Cup to score a hat-trick for England.\"", "url": "https://www.bbc.com/sport/football/66375627"}