{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:33:11", "date_modify": "2025-04-26 03:33:11", "date_publish": "2025-03-08 00:00:00", "description": "Wolves move six points clear of the Premier League relegation zone after coming from behind to draw against Everton.", "filename": "sport_football_live_cd7eg77pqdnt_1745638391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9a81/live/d96ff320-fc5f-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cd7eg77pqdnt_1745638391.html", "title": "Munetsi edges Wolves closer to safety", "title_page": "Wolverhampton Wanderers 1-1 Everton: Marshall Munetsi edges Wolves closer to safety - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolves moved six points clear of the Premier League relegation zone after coming from behind to draw against Everton.\nJack Harrison gave the Toffees the lead with his first goal of the season when his deflected strike beat Jose Sa.\nZimbabwe international Marshall Munetsi equalised five minutes before the break with a first-time finish past Jordan Pickford from Jean-Ricner Bellegarde's pass to score his first goal for the club.\nIn a cagey second half with few chances, Jorgen Strand Larsen went closest for the hosts but had his effort from a narrow angle well saved by Pickford.\nBeto came closest to finding a winner for Everton but Sa denied the in-form former Udinese striker by palming his low effort away.\nThe draw means Wolves are six points ahead of Ipswich Town and Leicester City, though the Foxes have a game in hand.\nEverton move into 14th, above Manchester United and West Ham on goal difference.\nAfter Ipswich's late defeat at Crystal Palace, Wolves knew a win would put them eight points above the relegation zone - a comfortable gap at this stage of the season.\nVitor Pereira's side had picked up a respectable six points from the last 15 available before Everton's trip to Molineux.\nBy contrast, Leicester had managed three points and Ipswich just one.\nThat has been the story of the fight for survival in recent weeks, with Wolves crawling towards safety as their rivals fail to apply the sort of pressure that would really test their mettle.\nThere was no real sense of nerves at Molineux, even when Everton took the lead.\nIt helped that Wolves found an equaliser within five minutes.\nThe source of the equaliser was unlikely, with midfielder Munetsi scoring his first goal for the club.\nHe ghosted through Everton's midfield, before finding space between Jarrad Branthwaite and Vitalii Mykolenko to hit home.\nThe midfielder's reward for getting his side on level terms was to be hooked at half-time, as he made way for Pablo Sarabia at the break.\nPereira was clearly keen to get more attacking intent in his side as Wolves felt the absence of Matheus Cunha, who watched on from the sidelines as he served the first game of his three-match ban following his red card against Bournemouth.\nThe Brazilian is Wolves' top scorer this season with 13 goals and only Ait-Nouri (five) has more assists than the four he's managed.\nCunha will miss the trip to bottom-placed Southampton and the visit of West Ham to Molineux in Wolves' next two fixtures.\nIf Wolves win those two matches they will feel their Premier League safety is assured.\nEarlier this week, David Moyes called on wingers Harrison and Jesper Lindstrom to up their output in order to stay in his starting XI.\n\"You won't have longevity if you're not going to get me assists and goals,\" said Moyes.\n\"You have to find ways of coming up with those numbers. I think both have done well but I need goals from them, I need assists from them. They both need to improve greatly on that.\"\nNeither player had scored or assisted for the Toffees this season in 54 appearances between them.\nUntil the trip to Molineux, that is.\nLindstrom, a summer loan signing from Serie A club Napoli, took down James Tarkowski's header and found Harrison with a smart switch of play.\nThe midfielder, on loan from Leeds United, needed a slice of luck to net his fifth goal for the Toffees, with his left-footed effort deflecting in off Matt Doherty and past Sa.\nThe Toffees' draw means Everton are unbeaten in eight league matches under Moyes and they have not lost since his first game back at Goodison Park against Aston Villa.\nThough they are not mathematically safe, there are 16 points between Everton and 18th-placed Ipswich.\nUnlike in previous campaigns when the Toffees' survival has gone down to the wire, fans can start to look up, not down, in the final weeks of the season.", "url": "https://www.bbc.co.uk/sport/football/live/cd7eg77pqdnt"}