{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:50:12", "date_modify": "2025-05-21 06:50:12", "date_publish": "2025-04-02 00:00:00", "description": "Manchester City 2-0 Leicester City: Jack Grealish scores in comfortable home win", "filename": "sport_football_live_cr727jj4ez9t_1747810212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48b0/live/07ee6530-0ffa-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr727jj4ez9t_1747810212.html", "title": "Manchester City 2-0 Leicester City: Jack Grealish scores in comfortable home win", "title_page": "Manchester City 2-0 Leicester City: Jack Grealish scores in comfortable home win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jack Grealish scored his first Premier League goal for almost 16 months as Manchester City moved into fourth and pushed Leicester closer to relegation with victory at the Etihad Stadium.\nBlues boss Pep Guardiola was watching from the stands as Grealish - making his first league start since December - applied the finishing touch to a second-minute cutback from Savinho.\nAt least Guardiola, who is serving a touchline ban, saw the goal. Hundreds of home fans had not taken their seats by that point as part of a protest against anticipated season ticket price rises and a new commercial deal with ticket resale agency Viagogo.\nOmar Marmoush, who led the hosts' attack in place of the injured Erling Haaland, added a second just before the half-hour, rattling a first-time effort in off the underside of the bar when Leicester goalkeeper Mads Hermansen failed to hold Ruben Dias' chipped ball into the penalty area.\nAmid a litany of sorry statistics, Leicester have now lost 14 of their past 15 league games and remain 12 points from safety, with just eight games to save themselves from an immediate return to the Championship.\nThey have become only the fourth side in English top-flight history to lose seven consecutive games without scoring, have conceded the first goal in 25 of their 30 games, and are still to keep a clean sheet away from home.\nThe supporter protests began outside the stadium 45 minutes before kick-off and ended with a noticeable number of fans filtering in after nine minutes - to mark the number of ticket partners the club has globally.\nIt meant they had to be told of Grealish's goal.\nIt was a simple effort, swept in from Savinho's cutback, and Grealish looked like he enjoyed it.\nOperating in the number 10 role behind Marmoush, he took up some intelligent positions and, albeit against limited opposition, was effective.\nWe will not find out until Sunday whether Guardiola was merely rotating his squad so they have the best possible chance of avenging December's surprise Manchester derby defeat.\nHowever, it was already known a big decision needs to be made around the future of the £100m England international, who still has two seasons left on his contract.\nGuardiola has repeatedly stated the form of Savinho and Jeremy Doku has made it hard for Grealish to force his way into his team. But he has also suggested he wants more from the former Aston Villa man - and goals are an element of that.\nOn that metric, Marmoush's £59m January move from Eintracht Frankfurt has been a success.\nThe 26-year-old now has five Premier League goals - all of which have come on home soil. He twice came close to a sixth, but had one effort saved, then ran into a wall of defenders rather than finding space to shoot inside the area.\nIn an otherwise non-event of a second half there was a welcome return for Norway international Oscar Bobb, who fractured his leg in training on the eve of the season, then suffered an ankle injury in February as he closed on his comeback.\nAfter starting the game as the visitors' captain, Jamie Vardy looked less than impressed as he took his seat at the back of the dugout after being replaced at half-time by midfielder Oliver Skipp.\nAnd the response from Foxes fans on social media to the removal of a striker in favour of a defensive midfielder at 2-0 down was predictably negative.\nYet, like many decisions Ruud van Nistelrooy has made since replacing Steve Cooper as manager part way through the season, it was akin to shuffling deckchairs on the Titanic.\nDeep in the second half, it seemed a moral victory when the visitors got numbers into the home side's box and the ball bounced in the six-yard area, but it was easily dealt with.\nThe nearest Leicester came to ending their wait for a goal came early in the opening period, when they were already behind, as Bilal El Khannouss attempted a curling effort from just outside the penalty area. For a brief moment it looked as though it might go in, but it did not bend enough and drifted wide.\nManchester City have now recorded seven straight league wins against Leicester, so the Foxes do not need to be as bad as they were here for Guardiola's side to beat them.\nBut while there is over a fifth of the campaign to go and, mathematically, nothing is certain, it is impossible to see how this miserable season can end in anything other than relegation, which could easily be confirmed before April is at an end.", "url": "https://www.bbc.com/sport/football/live/cr727jj4ez9t"}