{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-21 05:42:35", "date_modify": "2025-05-21 05:42:35", "date_publish": "2025-01-05 03:28:18", "description": "Manager Phil Parkinson reflected on 1,000 games, family support and admiration for Sir Alex Ferguson, as victory over Peterborough maintained Wrexham's promotion push.", "filename": "sport_football_articles_c9wlzkd97wgo_1747806155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9985/live/1acc7330-cae6-11ef-a732-2563c0a5ce3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9wlzkd97wgo_1747806155.html", "title": "Phil Parkinson: Wrexham deliver on manager's landmark day", "title_page": "Phil Parkinson: Wrexham deliver on manager's landmark day - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Speaking before his 1,000th game as manager, Wrexham boss Phil Parkinson acknowledged it was a momentous day in a career which began 22 years ago.\nBut it would be a day he would only truly enjoy if Wrexham, the seventh club the 57-year-old has managed, secured three points.\n\"Today's a great milestone,\" he told BBC Radio Wales' Rob Philips prior to his side's League One game against Peterborough United.\n\"But I'll only enjoy the day if we get the result and put in a performance.\"\nWrexham did not let down their manager – although they did leave it late to secure a win that maintains their promotion charge.\nSteven Fletcher's goal three minutes from time secured a 1-0 victory over Peterborough – a performance that has typified Wrexham during Parkinson's four-year reign.\nFor Parkinson himself, thoughts turned to the very first game of his managerial career – as Colchester United boss - in March 2003 and those that had been with him from the start.\n\"It was great to share today with my family,\" Parkinson said.\n\"I had my parents here, my uncle and auntie, my wife and my kids.\n\"That's important because my first ever game my wife, my dad and George my eldest lad were at that game.\"\nParkinson says their support has been unwavering and key in his success.\n\"Twenty plus years later they're still here supporting,\" he added.\n\"You need a great family behind you as a manager and a good wife who understands the demands of the job and I've certainly got that.\n\"Obviously I'm immensely proud of getting to 1,000 games.\n\"There's a lot of people to thank as well to get to this milestone. You need good people with you to still be around and get to 1,000 games.\"", "url": "https://www.bbc.com/sport/football/articles/c9wlzkd97wgo"}