{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:12:52", "date_modify": "2025-05-21 05:12:52", "date_publish": "2025-04-05 00:00:00", "description": "Wycombe's hopes of claiming an automatic promotion place in League One suffer a major setback as they lost 1-0 at Reading.", "filename": "sport_football_live_cp34wqk2k04t_1747804372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6376/live/d5915f80-108e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cp34wqk2k04t_1747804372.html", "title": "Reading 1-0 Wycombe Wanderers", "title_page": "Reading 1-0 Wycombe Wanderers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wycombe's hopes of claiming an automatic promotion place in League One suffered a major setback as they lost 1-0 at Reading.\nWith second-placed Wrexham beating relegation-threatened Burton, also in an early kick-off, Wanderers now trail the Welsh side by six points, albeit with a game in hand.\nWycombe dominated a spiky first half but it was Reading who made the breakthrough through a Harvey Knibbs penalty in the 77th minute.\nThat proved enough for Reading to extend their unbeaten home record to nine games.\nWycombe had made a lively start, with Adam Reach attempting an audacious 20-yard lob, only for home keeper Joel Pereira to claw it away for a corner.\nSonny Bradley headed over from a Luke Leahy cross and Reach tested Pereira from distance as the visitors continued to dominate.\nReading offered little going forward and the cross-border Berks-Bucks rivalry threatened to spill over with a series of niggly challenges from both sides.\nChairboys keeper Will Norris was forced into action for the first time early in the second period, saving a header from Mamadi Camara.\nBut it was Pereira soon to the fore again at the other end, superbly tipping over a firmly-headed effort from former Royals winger Garath McCleary.\nThirteen minutes from the end, Cameron Humphreys clumsily fouled Chem Campbell in the area and Knibbs slammed in his 16th goal of the season from the spot to settle the outcome.", "url": "https://www.bbc.com/sport/football/live/cp34wqk2k04t"}