{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:02", "date_modify": "2025-05-21 04:35:02", "date_publish": "2025-04-04 18:09:00", "description": "Tom Aspinwall takes 4-32 as relegated Lancashire bowl out Middlesex to have the better of the first day at Lord's.", "filename": "sport_cricket_articles_c8rkrkyz71zo_1747802102.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/062a/live/de110ee0-116e-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c8rkrkyz71zo_1747802102.html", "title": "County Championship: Tom Aspinwall stars for Lancashire at Middlesex", "title_page": "County Championship: Tom Aspinwall stars for Lancashire at Middlesex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rookie Lancashire seamers Tom Aspinwall and Ollie Sutton launched the Red Rose bid for an immediate return to the top flight in positive fashion by bowling out Middlesex for 260 on the opening day of the new County Championship season at Lord's.\nRelegated Lancashire began the new campaign without injured England veteran James Anderson and West Indies paceman Anderson Phillip, unavailable due to a visa issue.\nBut 21-year-old Aspinwall, with 4-32, and Liverpudlian left-armer Sutton, who took 2-57 on his first-class debut, swung the game after a century stand between Sam Robson (70) and Max Holden (69) had given Middlesex a strong platform.\nHaving reached 215-3 in front of an impressive Lord's crowd of 4,257, the home side stumbled – losing their last seven wickets for 45 runs – before Lancashire openers Keaton Jennings and Michael Jones shaved 68 off the deficit before the close.\nNathan Fernandes, restored to an opener's role at Middlesex following Mark Stoneman's departure, was the first to go, nibbling at a Tom Bailey delivery slanted across him.\nHolden was given a life on 28 when he hooked Sutton to long leg, only for the ball to slip through Luke Wells' fingers and over the rope. But Wells redeemed himself by coming on for an over of leg-breaks just before lunch to pin Robson lbw on the back foot with his fifth ball.\nHolden posted his half-century in the first over after the resumption and looked a good bet for a ton until he fell to a smart take by Matty Hurst, standing up off Will Williams, then Ryan Higgins nudged George Balderson behind to trigger a middle-order collapse, as four more wickets fell in just 21 deliveries.\nDebutant Ben Geddes became Sutton's maiden first-class victim when he miscued a pull to midwicket and Jack Davies was lbw shuffling across his stumps before Du Plooy was on the sharp end of a similar decision in Aspinwall's favour.\nAspinwall then brought the ball a long way back down the slope to take Toby Roland-Jones' leg stump, mopping up the innings after tea with the wickets of Zafar Gohar and Henry Brookes.\nLancashire skipper Jennings and new opening partner Michael Jones then capitalised on anything loose, but there were close calls for both when Jennings' inside edge off Blake Cullen rebounded off his pad but avoided the wicket and Jones almost played on to Brookes.", "url": "https://www.bbc.com/sport/cricket/articles/c8rkrkyz71zo"}