{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:25:30", "date_modify": "2025-05-21 04:25:30", "date_publish": "2025-01-18 00:00:00", "description": "Substitute Darwin Nunez scores a late double to guide Liverpool to victory at Brentford and extend their lead at the top of the Premier League table to seven points.", "filename": "sport_football_live_c87dxe183d1t_1747801530.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c87dxe183d1t_1747801530.html", "title": "Brentford 0-2 Liverpool: Darwin Nunez scores late double in Premier League", "title_page": "Brentford 0-2 Liverpool: Darwin Nunez scores late double in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Substitute Darwin Nunez scored a late double to guide Liverpool to victory at Brentford and extend their lead at the top of the Premier League.\nIt looked as though Liverpool's wait for a league win in 2025 was going to stretch to three games until Nunez stepped up in stoppage time.\nThe Uruguay forward grabbed the opener in the 91st minute with a simple finish from close range after meeting a low cross from Trent Alexander-Arnold.\nAnd Nunez scored again two minutes later, showing patience in a crowded area to round off a counter-attack as Brentford were caught short in defence.\nDespite taking so long to break the deadlock, Liverpool had dominated possession and territory for large periods and were fully deserving of all three points.\nDominik Szoboszlai saw an effort crash off the top of the crossbar in the first half and Luis Diaz should have made more of an attempt with his head after emerging unmarked at the far post.\nBrentford were happy to sit deep and soak up pressure but struggled to pose any serious threat on the counter, with striker Bryan Mbeumo left isolated.\nThe Merseyside outfit maintained complete control of the tempo in the latter stages as Brentford dropped ever deeper, but lacked the potency in front of goal which they oozed in the first half of the season until Nunez delivered the decisive blows.\nLiverpool sit six points clear of second-placed Arsenal, who drew 2-2 against Aston Villa later on Saturday, and they also have a game in hand.\nBrentford stay 11th after a third loss in four home fixtures.\nLiverpool looked unstoppable in the first half of the season but have shown signs of slowing in the past few weeks.\nDraws against Manchester United and Nottingham Forest in the league came either side of defeat at Tottenham in the first leg of their Carabao Cup semi-final.\nThere was no lack of conviction at Brentford as Liverpool tried everything to get their noses in front, though hitting the target with just eight of their 37 shots was disappointing.\nMohamed Salah is usually a reliable figure for the Reds but had an off day, hitting the target just once, with the likes of Szoboszlai and Diaz offering their best outlet until Nunez was introduced.\nNunez had scored just two league goals coming into the game but has clearly taken on board the wishes of manager Arne Slot, who stressed the need to \"make a late-goal winner\" more regularly in the second half of the season.\nHis first goal was taken instinctively, with more care required as he held off a defender and picked his spot for the second.\nWith Diogo Jota unavailable because of injury, Slot will need players like Nunez to chip in and help them over the finish line.", "url": "https://www.bbc.com/sport/football/live/c87dxe183d1t"}