{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:55", "date_modify": "2025-05-19 15:05:55", "date_publish": "2015-02-13 00:20:15", "description": "Chelsea striker Diego Costa says he has never seriously injured an opposition player and his challenges are \"noble\".", "filename": "sport_football_31450221_1747667155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80978000/jpg/_80978088_diego_costa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31450221_1747667155.html", "title": "Chelsea striker Diego Costa says he is a 'strong but noble' player", "title_page": "Chelsea striker Diego Costa says he is a 'strong but noble' player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea striker Diego Costa claims his challenges are \"strong but noble\" and that he has never seriously injured an opposition player.\nThe Brazil-born Spain international, 26, has just served a three-match ban for a stamp on Liverpool's Emre Can in their League Cup semi-final last month.\n\"My challenges are strong but noble at the same time.\" Costa said in an interview with Sport magazine., external\n\"Check my records, you'll find I've never caused a bad injury to a player.\"\nChelsea manager Jose Mourinho claimed the stamping incident was an accident and the player has been targeted by sections of the media.\nIn the wake of Costa's suspension Manchester City boss Manuel Pellegrini urged the player to learn from the incident and change his game in the future.\nCosta, scorer of 17 Premier League goals this season, believes the reactions to certain incidents he is involved in are blow out of proportion.\n\"I consider myself a player who fights and gives everything on the pitch. Those who know me and appreciate those values understand what I say,\" he said.\n\"The bottom line is that sometimes the little things I do on the pitch provoke exaggerated reactions.\"\nCosta, who joined Chelsea from Atletico Madrid for £32m in July 2014, says he has received some rough treatment by players from other teams which should have been more harshly dealt with.\n\"Some of the kicks I suffer in England would be punished with a red card in Spain,\" he added.\n\"I am getting used to getting kicked more than before. Premier League defenders are really strong and physical.\n\"In England, the referees don't call many fouls, as opposed to Spanish football. Consequently, you must be really strong all through the 90 minutes.\"", "url": "https://www.bbc.com/sport/football/31450221"}