{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:35", "date_modify": "2025-05-21 04:17:35", "date_publish": "2025-04-05 17:09:28", "description": "European football expert Guillem Balague takes a closer look at how manager Luis Enrique has transformed PSG - guiding them to successive Ligue 1 titles.", "filename": "sport_football_articles_c62x94lx158o_1747801055.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/70bb/live/d19c4d30-10b2-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62x94lx158o_1747801055.html", "title": "Paris St-Germain win title: How Luis Enrique has transformed French side", "title_page": "Paris St-Germain win title: How Luis Enrique has transformed French side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Je m'appelle Luis Enrique.\"\nThat's how the Paris St-Germain manager introduced himself to the cameras in Paris back in July 2023.\nBut beyond that, he keeps his French private - except for his favourite phrase: on va gagner (\"we're going to win\").\nThat pretty much sums the Spaniard up: Honest, direct and not one for show.\nLuis Enrique doesn't perform. He is intense, an obsessive and he lets the work speak for itself.\nAnd what work it has been, transforming PSG from a star-studded squad to a collective, cohesive and resilient unit.\nThey have already secured back-to-back Ligue 1 titles and have a chance of repeating last season's domestic treble.\nAnd with a Champions League semi-final coming up against Arsenal, a first European title is a serious possibility.\nWinning titles is nothing new to the French champions but Luis Enrique has helped turn them from a team long associated with egos and big-money into a vibrant, youthful and thrilling team to watch.\nSo how have PSG and Luis Enrique finally started to win over the neutrals?\nLife has hit Luis Enrique hard.\nIn 2019, he lost his nine-year-old daughter Xana to a rare form of bone cancer.\nHe has spoken about her with remarkable calm. \"Her body is gone,\" he said, \"but she hasn't died. She's still with us.\"\nIn a deeply moving documentary for Zoomsport, he talked about visiting his mother.\n\"My mother couldn't keep photos of Xana. Until I came home and asked, 'Why are there no photos of Xana, Mom?' 'I can't, I can't…,' she used to say. 'Mom, you have to put up photos of Xana, Xana is alive,' I replied.\"\n\"Physically, she may not be here, but spiritually she is. Because every day we talk about her, we laugh, and we remember because I think Xana still sees us.\"\nIn her memory, he and his wife have launched a foundation to help families of terminally ill children - especially those who can't afford to stop working during their child's final months.\nIt's an act of love and fierce purpose. Like everything he does.\nHe is a man grounded in more ways than one.\nFor over two years, he's walked barefoot most mornings on the grass of the pitches of the PSG training ground.\nHe's convinced that 'earthing' helps him avoid spring allergies and reconnect with something deeper.\nHe's strict with his body, too. He stretches every 30 minutes at the training ground, trains daily - even at home sometimes, weaving between sofas and walls - and has turned both house and office into functional gyms, with straps and bars hanging from ceilings and walls.\nHe enjoys surfing, swimming, endurance running and long cycle rides up the steep climbs of Spain's Picos de Europa.\nIn 2007, he completed the Frankfurt Ironman challenge - a 2.4-mile swim, a 118-mile cycle and a full marathon. The following year, he ran the legendary Marathon de Sables, a 155-mile race over six days in the Sahara desert.\n\"I only know how to compete,\" he said to himself when he retired from playing in 2004. Managing was the only option for the former Barcelona and Spain forward.\nAs a coach, Luis Enrique has copied the philosophy of his former team-mate Pep Guardiola from the beginning.\nHe hasn't brought anything truly new to the table, but, using the tonnes of energy he has, he has become one of the top representatives of a broader cultural shift.\nHis relentless edge is now driving everything at Paris St-Germain, although initially he didn't even want the job.\nHe thought the club only cared about names. Players such as Neymar, Lionel Messi and Kylian Mbappe. Uncoachable, he assumed.\nBut when he heard the philosophy had changed - that they now wanted to build a team - he reconsidered.\nAnd, soon after he arrived, Neymar and Marco Verratti were gone. Messi, who might have stayed had he known Luis Enrique was coming, had already committed to Inter Miami.\nHe understands and appreciates the importance of individual stars, but only up to a point.\nIn a recent documentary about his first season at PSG, he was seen warning Mbappe, his star player at the time, about his obligation to fulfil his defensive duties - just after the player had scored a hat-trick.\n\"He's the best player in the world,\" the Asturian insisted several times. \"But if the team with the best player in the world always won, PSG would have eight Champions League titles and they haven't had any.\"\nHe is a manager who respects structure, but is never afraid to speak his mind.\n\"I'm not afraid of the worst in football... if they sack me, no problem,\" he said. \"The next day, I'll go for a cycling trip.\"\nIt's that perspective that helped him ride out a rocky start last season - including a 4–1 loss to Newcastle in the Champions League and heavy criticism from the supporters.\nBut he stayed calm and kept faith in his footballing beliefs. Structure, repetition, and positional discipline.\nHis dream? One day, managers will have mics in the stands and be able to talk players through their positions during a match.\nHe had to rewire a squad addicted to chaos when he arrived in Paris.\nSo he spent little time in an office, instead sitting with his assistants, working directly with his players and embedding his ideas.\nSome players push back against his intensity. Mbappe, for example, didn't love being boxed in as a number nine or publicly challenged after a hat-trick.\nBut others thrive, because he doesn't do favourites.\nForward Ousmane Dembele has been one of PSG's success stories.\nLast summer, Luis Enrique gave him a mission to score more goals. The message was clear: be more selfish and shoot more.\nDembele listened. He's now thriving in a central role, playing as a false nine, more involved in the build-up, getting more touches, more shots, more goals.\nHe's not the erratic winger from his Barcelona days. He's focused. And the goals have flowed, having now scored 32 goals in all competitions this season.\nFor Luis Enrique, failure isn't trying and falling short. It's failing to give everything.\nHe has carried the belief that football isn't life or death since his playing days. He'll never shed a tear over a defeat.\nWhen it became clear that Mbappe was leaving last summer, he said something that may come to define his PSG reign.\n\"The team will play better,\" he said. No longer forced to design a side around one star, he felt liberated. \"Next year,\" he thought, \"I'm going to control everything that happens on the pitch.\"\nAnd this is very much his PSG, a team that many believe could achieve their dream of finally winning the Champions League.", "url": "https://www.bbc.com/sport/football/articles/c62x94lx158o"}