{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-04-26 08:09:28", "date_modify": "2025-04-26 08:09:28", "date_publish": "2025-02-26 13:12:18", "description": "Barrow boss Andy Whing describes the derby with Carlisle United as a \"perfect showcase\" for his players.", "filename": "sport_football_articles_cn4ymrjvrxno_1745654968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3cd6/live/7243ef30-f43a-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn4ymrjvrxno_1745654968.html", "title": "Barrow: Andy Whing describes derby with Carlisle as 'perfect showcase'", "title_page": "Barrow: Andy Whing describes derby with Carlisle as 'perfect showcase' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barrow manager Andy Whing says he cannot wait for Thursday night's Cumbrian derby as it offers a \"showcase\" for his players to perform.\nThe match is live on television with Barrow looking to beat Carlisle in a league game for the first time in 65 years.\nBut with the Bluebirds 18th in League Two and their opponents propping up the table, the result is as vital as local bragging rights.\n\"This is a perfect game for the players to showcase what they're all about,\" Whing told BBC Sport.\n\"We're at home, it's live on TV, so I've said to the players, whatever your outcome here or whether you go elsewhere, this is a chance to put yourself in the shop window for us or for anyone else.\"\nWhen Barrow last won a league game against Carlisle in 1960, Cumbria did not even exist.\nBarrow was in the north-westernmost part of Lancashire and Carlisle was situated in Cumberland - and the Bluebirds had disappeared out of the Football League by the time Cumbria was created in 1974.\nNow, they are situated on opposite corners of the Cumbrian peninsula, still separated by more than 80 miles by road.\nSince Barrow returned to the EFL in 2020, their only victory in eight meetings with the Brunton Park outfit has come in the EFL Trophy, but the rivalry between the clubs has grown with each game.\nWhing has only been in charge for a little over a month since arriving from Solihull Moors, but he has quickly been made aware of the importance of this fixture in these parts.\nAnd the message has been rammed home about beating their rivals.\n\"People have been telling me how bad our record is, how we never beat them and how big the game is,\" he said.\n\"But where we both are in the league, we're really underachieving. That makes it a big game in itself.\n\"Add to that the locality and what the fans want and expect, we want to turn the stats around and put them in our favour.\"\nIn Whing's seven games since taking charge, Barrow have won three and lost four, with all the victories coming at home.\nThey come into this game on the back of consecutive away defeats, facing a Carlisle side still searching for a first win under Mark Hughes and in desperate need of points, sitting five adrift of safety in bottom spot.\nBut back on home turf, under the lights and with their rivals on the other side, Whing is expecting a reaction.\n\"We're trying to make it as horrible as we can for teams coming and playing here against us,\" he said.\n\"Be in their faces, have the crowd on top of them. We've got that right blend of how we are on and off the ball in those games.\n\"We've had some fantastic games at home so far and hopefully we can build on that in this one.\n\"We should be excited. I can't wait for it. It's a perfect game for us to come back off two really disappointing away defeats.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn4ymrjvrxno"}