{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:18", "date_modify": "2025-05-21 05:29:18", "date_publish": "2025-01-31 19:06:29", "description": "Portsmouth have signed Rotherham United left-back Cohen Bramall and bring in Sunderland midfielder Adil Aouchiche on loan.", "filename": "sport_football_articles_c360zyk28k1o_1747805358.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a4c/live/71add250-e005-11ef-b245-47ce1f5b2d62.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c360zyk28k1o_1747805358.html", "title": "Cohen Bramall and Adil Aouchiche: Portsmouth add two signings", "title_page": "Cohen Bramall and Adil Aouchiche: Portsmouth add two signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth have signed Rotherham United left-back Cohen Bramall and brought in Sunderland midfielder Adil Aouchiche on loan.\nBramall, 28, has signed for an undisclosed fee with the former Arsenal youngster agreeing a deal until the end of the current season.\nHe joined Rotherham in the summer of 2022 and made 102 appearances, including 75 in the Championship.\nFormer France Under-20 international Aouchiche, 22, has scored twice in 38 appearances since moving to Wearside from Lorient in September 2023.\nThe pair take Portmouth's number of new recruits to six this month.\n\"We're delighted to bring in another player who has plenty of experience competing at this level of the game,\" Pompey boss John Mousinho said of Bramall, external.\n\"We've now have real competition in the left-back position and I can't wait to get started working with Cohen.\"\nOn Aouchiche, he added: \"We already saw first-hand just how dangerous he can be when we played Sunderland a few weeks ago.\n\"He's an incredibly talented young player who will complement the attacking options we already have in the squad.\"", "url": "https://www.bbc.com/sport/football/articles/c360zyk28k1o"}