{"authors": ["Ben Rich"], "date_download": "2025-04-26 06:58:26", "date_modify": "2025-04-26 06:58:26", "date_publish": "2025-02-28 13:39:17", "description": "Itchy eyes? Sore throat? Tree pollen may be to blame as experts predict it will be an above-average season.", "filename": "weather_articles_cwyd747q953o_1745650706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/a549/live/e31f37c0-f5be-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/weather_articles_cwyd747q953o_1745650706.html", "title": "Severe pollen season causing hay fever symptoms for allergy sufferers", "title_page": "Severe pollen season causing hay fever symptoms for allergy sufferers - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The tree pollen season is underway and experts say it is going to be more severe than usual.\nAn estimated 13 million people in the UK suffer from hay fever - the allergy to pollen.\nOnly a minority are triggered by trees but itchy eyes, sore throats and runny noses are already affecting those who do suffer.\nAlder pollen is at its peak with hazel trees also causing symptoms.\nScientists at the University of Worcester are predicting that high levels will continue for several weeks.\nThere are actually three different hay fever seasons relating to three broad types of pollen.\nThe first - tree pollen - generally runs from March to May or June. However some species such as alder, hazel and elm produce pollen earlier meaning it can start as soon as January.\nThe Met Office suggests that around 25% of hay fever sufferers are affected by tree pollen.\nGrass pollen, on the other hand, has more widespread impacts affecting nearly all sufferers during its season which runs from around May to July.\nThe third major trigger is weed pollen with a season that peaks between June and September.\nThe exact dates will vary depending on where you live while some areas with less vegetation - such as major towns and cities - are likely to have less pollen than rural locations.\nAccording to scientists at the University of Worcester this tree pollen season is expected to be more severe than average due to a combination of factors.\nDr Beverley Adams-Groom, senior palynologist and pollen forecaster, said: \"Trees that produce allergenic pollen in the UK tend to have alternating high and low years of severity – this year is a high year.\"\nHigh temperatures during last spring and early summer meant there was the right weather for pollen production, with a warm May being a major factor.\nDr Adams-Groom added: \"Mild, dry weather with breezes provides the best conditions for pollen release and that is what is forecast for the next week or so.\"", "url": "https://www.bbc.co.uk/weather/articles/cwyd747q953o"}