{"authors": ["Louise Lear"], "date_download": "2025-05-21 06:05:58", "date_modify": "2025-05-21 06:05:58", "date_publish": "2025-04-01 14:14:54", "description": "Warnings for a 'once in a generation' storm with tornadoes, flooding and freezing rain affecting the United States and Canada.", "filename": "weather_articles_cwyn98wwd7xo_1747807558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/2c43/live/236ab770-0fbc-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cwyn98wwd7xo_1747807558.html", "title": "threatening flooding rain and tornadoes", "title_page": "US storms forecast to bring  life-threatening flooding rain and tornadoes - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Huge areas of the US are preparing for potential flooding and tornadoes with storm risks upgraded to their highest levels, as authorities describe them as 'once in a generation'.\nOfficials say there has been at least one fatality and warn that the worst may yet be to come.\nThe same area of low pressure will also deliver yet more snow and freezing rain to eastern Canada which experienced a powerful ice storm last weekend.\nIn addition, the high winds and a surge of low humidity will increase the chance of further wildfires to parts of the desert south-west.\nSeveral days of torrential rain are likely to lead to extensive, catastrophic flash flooding which could be life-threatening.\nIt has been described by NOAA, the US weather service, as a 'once in a generation' event.\nOver the next few days relentless rainfall could bring as much as 10in (250mm) over Kentucky, Tennessee and Missouri, leading to huge accumulations of water in a relatively short period to time.\nTotals of 12-15in (300-300mm) have been predicted across the state of Arkansas.\nWarm, moist air flowing in from the Gulf of Mexico will be responsible for triggering severe thunderstorms along the cold front affecting areas from central Texas to the Midwest.\nThe high level warnings include those to cover a 'tornado outbreak'. On Wednesday there were 21 reported tornadoes mainly over Missouri and Kentucky, with some in Illinois and Arkansas.\nOfficials said one person was killed in Tennessee and there has been widespread damage reported.\nThreats continue across the Central Plains including multiple strong tornadoes, damaging winds, large hail and flash flooding.\nThe area of low pressure is pushing eastwards and will bring more snow on the leading edge to north-eastern parts of the US and south-eastern Canada where storm watches are in force.\nAs mild air tucks in behind there will be the risk of freezing rain and ice on Thursday and Friday. Freezing rain occurs when sub-zero water droplets fall on surfaces and freeze on impact creating particularly dangerous travelling conditions.\nThere is likely to be a further 6-8in (15-20cm) snow in Quebec and the brisk easterly winds will cause blizzard-like conditions.\nSince Tuesday some areas of Minnesota have had 10-12in (25-30cm) of snow with 8in (20cm) in North Dakota.", "url": "https://www.bbc.com/weather/articles/cwyn98wwd7xo"}