{"authors": ["Matt Taylor"], "date_download": "2025-05-21 07:49:27", "date_modify": "2025-05-21 07:49:27", "date_publish": "2025-01-13 14:09:56", "description": "Following a few days of quieter conditions, Santa Ana winds will strengthen again increasing fears of explosive fire growth", "filename": "weather_articles_cm2177lrn64o_1747813767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/6f7c/live/a96f56e0-d269-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cm2177lrn64o_1747813767.html", "title": "Crucial day for LA fires as Santa Ana winds pick up speed", "title_page": "Crucial day for LA fires as Santa Ana winds pick up speed - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The fire threat remains critical in and around Los Angeles as Santa Ana winds are expected to increase again.\nFirefighters have used the spell of quieter winds to do as much as they can to contain fires, but with winds forecast to peak again on Tuesday, gusty conditions may aid the spread of flames again.\nWith high pressure established over the Great Basin (an area around Nevada, Utah and Idaho), Santa Ana winds are expected to strengthen again on Tuesday. Winds blowing in from the east or north-east, are set to peak with gusts up to 70mph (112km/h) possible.\nBut the strongest winds will be on hills and in some valleys to the north and east of Los Angeles, including the counties of Ventura and Los Angeles. However, the winds near the Palisades and Eaton fires are not expected to be as strong this time round.\nThe areas threatened by those two fires are facing wind gusts closer to 30mph (48km/h), which a local fire chief described as \"normal\".\nLast week, winds in excess of 100mph (160km/h) were recorded and the presence of a deep area of low pressure centred on the border with Mexico, boosted the strength of the Santa Ana wind. That area of low pressure has now moved away and the winds are not expected to be quite as fierce this week.\nThe wind direction is slightly different this week and some valleys will experience stronger winds than last week, whilst others will see much lighter winds.\nEven though winds are lighter than last week, their dry and gusty nature means they are still capable of causing explosive fire growth.\nThe Santa Ana wind is very dry. With humidity levels remaining low, further moisture will be stripped from vegetation making it easier to catch alight and more likely for the fires to spread rapidly.\nThe US National Weather Service has various red flag warnings in force across southern California. Red flag warnings mean that \"warm temperatures coupled with very low humidity and strong winds are expected to combine, bringing a greater risk of fire danger\".\nStrong winds may help to spread these fires extremely quickly and their gusty nature adds to the unpredictability around their direction and speed of movement.\nThere is some good news here. Lighter winds are forecast to develop after Wednesday bringing a longer window than we've seen so far, for fire fighters to contain the remaining blazes.\nRain would also help the situation by returning some moisture to the ground and surrounding vegetation. However, the weather forecast still shows very little rainfall on the horizon.\nThe lack of rain during what should be California's wet season, has been a key reason behind why the fires took such a firm grip and spread so rapidly.\nParts of southern California have barely seen any rain in recent months.\nAnd in contrast, the wet conditions we've seen here over the last two years have encouraged the growth of vegetation meaning there is a lot more of it to burn right now.\nThe ongoing dry weather means that even if fires are extinguished, the area will still be ripe for more to develop.", "url": "https://www.bbc.com/weather/articles/cm2177lrn64o"}