{"authors": ["Helen Willetts"], "date_download": "2025-05-21 08:39:04", "date_modify": "2025-05-21 08:39:04", "date_publish": "2025-01-13 12:18:13", "description": "Helen Willetts takes a look at what's going on in the night sky and the chances of seeing this month's Wolf Moon.", "filename": "weather_articles_cdxnl5lrje1o_1747816744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/a658/live/558775e0-cf57-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cdxnl5lrje1o_1747816744.html", "title": "Wolf Moon 2025: How to see the year's first full Moon alongside Mars", "title_page": "Wolf Moon 2025: How to see the year's first full Moon alongside Mars - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The first full moon of 2025 - known as the Wolf Moon - will brighten the night sky alongside Mars on Monday 13 January.\nSkygazers will be treated to a spectacular show as the planets appear to be close together in the night sky, an event known as a conjunction.\nIn parts of the Americas and Africa, the Moon will eventually hide the red planet completely for about an hour.\nThe first full Moon of the new year rises just before 17:30 GMT on Monday and it could be visible through to Wednesday morning.\nThe cold and frosty nights we have seen recently will start to disappear as milder Atlantic air moves in. However, this also means a fair amount of cloud is expected for many parts of the UK, which is likely to obscure the view of this celestial show at times.\nA weather front will move across Scotland on Monday, stalling across northern England on Monday night, bringing some patchy light rain and drizzle for central parts of the country. However, skies will clear behind it, giving better viewing conditions especially across eastern Scotland and later for Northern Ireland.\nThere could also be cloud-free skies across parts of central southern, south-east England and East Anglia on Monday night but with a risk of some mist or fog patches forming.\nFull Moons are given names that reflect what is happening in nature during the different months of the year.\nThe Old Farmer's Almanac publication began printing full Moon names back in the 1930s.\nJanuary's full Moon apparently became known as the Wolf Moon because wolves were more likely to be active at this time of year, so their howling could be heard more often in January.\nIt is sometimes also called the Ice Moon or Old Moon.", "url": "https://www.bbc.com/weather/articles/cdxnl5lrje1o"}