{"authors": ["Sarah Keith-Lucas", "Jo Wade"], "date_download": "2025-05-21 05:29:43", "date_modify": "2025-05-21 05:29:43", "date_publish": "2025-01-14 13:46:02", "description": "Firenadoes were spotted during the Palisades Fire.", "filename": "weather_articles_cjw408qydx4o_1747805383.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/80bf/live/88d32830-d26e-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cjw408qydx4o_1747805383.html", "title": "Fire devil forms in LA wildfires as winds whip up flames", "title_page": "Fire devil forms in LA wildfires as winds whip up flames - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fire tornadoes were spotted as the Palisades fire blazed through the San Fernando Valley in California on 10 January 2025.\nWinds peaked at over 70mph (112km/h) in a few spots on Friday however the fire threat still remains as Santa Ana winds are expected to increase again on Tuesday.\nFire devils or \"firenados\" are not really tornadoes at all.\nA tornado forms downwards from a cloud base when warm, moist air collides with colder air.\nA \"firenado\" actually has more in common with a whirlwind or dust devil, as they form from the ground upwards.\nWhen a wildfire intensely heats air close to the ground, it can rise rapidly and start to spin into a narrow vortex. As more hot air gets drawn in around the base of the vortex, wind speeds accelerate inwards, like an ice skater pulling in their arms.\nWhile most whirlwinds pick up dust and debris, a fire whirl is characterised by flames, ash and smoke which are whipped upwards in the rotating shaft.\nTypically firenadoes grow up to around 100ft (30m) tall but are usually only a few feet wide. They are often very short-lived but can be extremely dangerous, as winds can blow as fast as in a tornado, though on a much smaller scale.", "url": "https://www.bbc.com/weather/articles/cjw408qydx4o"}