{"authors": ["BBC Weather"], "date_download": "2025-05-20 13:28:09", "date_modify": "2025-05-20 13:28:09", "date_publish": "2012-03-14 13:23:59", "description": "Help and FAQs for BBC Weather", "filename": "weather_about_17185651_1747747689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/0907/production/_130511320_weatheroverview-devicecluster-june2017.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/weather_about_17185651_1747747689.html", "title": "BBC Weather - Help and FAQs", "title_page": "BBC Weather - Help and FAQs - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A short spell of rain or showers has been forecast. Why hasn't it rained where I am?\nShowers can be especially hard to forecast. Their time or location doesn't have to be far out for the forecast not to be 100% correct. Showers (including hail/thunder/snow) can be very heavy or long lasting. It is also possible for showers to form into bands which can cause one area to have continuous rain.\nWe flag this up on the TV and video forecasts where we can give more context, and in the text on the website. If you are making plans and spot a showers symbol on our website or app, you may find it helpful to review the latest video forecast for more in-depth information from our team of meteorologists.\nThis video offers further detail: Why are showers so hard to forecast?\nWhat does % chance of precipitation (rain, snow, hail, etc) mean?\nOur data supplier MeteoGroup uses the probability of precipitation (% chance), and this ranges from 0% (no chance at all) to 100% (it will be wet).\nSo what does a 20% chance of rain actually mean? It means that out of 100 situations with similar weather, it should rain on 20 of those, and not rain on 80. In a nutshell, it means that, whilst you may get some rain, it's much more likely (but not certain) to stay dry.\nThe probabilities are given for the location chosen, and thus are valid for that location only. As MeteoGroup forecasts take advantage of hourly updates, which include real-time information from radar, satellite, and nearby weather station observations, you may notice the probabilities changing in the short-term (next 2-3 hours).\nThis gives you the chance to spot when, for example, a shower may be approaching your location, as the probabilities will tend to rise.\nNote that when the chance of precipitation is less than 5% it will appear grey on the website. Above 5% it will be blue.\nHow does % chance of precipitation relate to the weather symbol?\nThe weather symbol is generated by taking a number of weather measurements, and then working out the most likely weather type based on them. For \"wet weather\" symbols these measurements include the hourly rainfall amount as well as the % chance of rain (probability of precipitation).\nIn order to generate a wet weather symbol, there needs to be both a measurable amount (over 0.1mm per hour, say) and a reasonable chance of rainfall expected.\nThis means that where very light, patchy rain or drizzle is expected, there may be occasions where the chance of seeing at least a few spots of rain is high (so a high % chance of rain), but the actual amount expected is very low (less than 0.1mm of rain in one hour).\nThis would be the type of weather where you feel a few spots of rain on the breeze, but it's not enough to dampen the roads and pavements. In this case, the weather symbol would remain as a \"dry\" weather symbol (e.g. a cloud) but the probability of rain could be quite high.\nOn the other hand, in shower situations the chance of rain for an individual hour might be low. This is because it is very difficult to predict with high confidence the exact time that an isolated shower will hit a particular place. When it does occur, however, it can be a strong, short downpour and therefore the predicted amount of precipitation is high enough to generate a \"wet\" weather symbol - despite a relatively low precipitation probability.\nWhat does \"feels like\" temperature mean?\nThe temperatures in our forecasts represent the \"air temperature\" forecast - that is, the temperature that a properly shielded thermometer would record.\nHowever, there are factors which can lead to a day feeling hotter or colder than this value alone might suggest. The two main factors which cause this sensation are wind speed and humidity.\nOur perception of temperature comes down to how quickly (or not) our skin is cooled. In light winds and high humidity, especially with higher temperatures, any moisture on our skin will be slow to evaporate, and so the cooling will be lower.\nThus, the air may \"feel\" somewhat warmer than the temperature indicates. Similarly, but going the other way, a windy and dry day, especially when cold, may lead to the air \"feeling\" colder than the temperature may suggest.\nThus, the \"feels like\" temperature is designed to give an indication as to when these extra factors may combine to make the apparent temperature seem higher, or lower, than indicated. Of course, the perception of temperature is rather subjective, so these should only be taken as broad guidelines.\nWhy does the detail keep changing on the hourly forecast?\nWorking with our weather data provider MeteoGroup, we provide hourly forecasts out to 14 days.\nWhen producing forecasts beyond the next few days, MeteoGroup uses weather model information which tends more towards trends in the weather, rather than a single 'deterministic' output. Small changes in conditions now can have a cumulative effect and create dramatic changes in the weather several days away, so the forecast further ahead can change considerably.\nTherefore, confidence in the forecast decreases as you move further into the future. However we believe our audiences understand that and would rather have the information, to give them the ability to see the trends over time to help them make the decisions they need to make.\nWhy is there sometimes a discrepancy between the day symbol, hourly information and map weather forecasts on the BBC Weather site/app?\nDaily weather symbol: The daily symbol shows the most representative weather type for the whole day, or whole night, at that location. This could either be the predominant weather - that is, the weather that lasts for the longest period of time - or alternatively, the most significant weather.\nIt is hard to give a single weather symbol to cover a whole day as the weather can change a fair bit. The symbol is chosen to reflect the weather that is most likely to cause impacts - for example, even if it is only expected to rain for a few hours, if a sufficient enough amount of rain is expected, the daily symbol will highlight this risk. As the day moves on, this rule applies to the most impactful weather for the remainder of the day. At 18:00, the daily symbol for 'today' then changes to the weather for the overnight period.\nThis does mean that if there is severe weather in the morning that clears that the day symbol may not match the remaining hourly symbols. This should be corrected at midday. For the purposes of the forecast the day covers the period from 0600 to 1800 GMT and the night from 1800 to 0600 GMT on the following day.\nHourly weather symbol: The symbol that appears for each hourly time step indicates the weather expected at or near the relevant location, around the time indicated. For example if a shower symbol appears for Wolverhampton at 1500, we are saying there is a chance of a shower in the Wolverhampton area at or close to 1500. There could be one a short distance away and it may actually occur at 1430.\nThere can be discrepancies seen between the maximum/minimum temperature given for the daily summary and the highest and lowest temperatures seen in the hourly breakdown. This is because the hourly value is given for \"on the hour\" whereas the max/min may occur between the hourly points so may be slightly higher/lower.\nMaps: The weather maps are produced using MeteoGroup data once every three hours whereas the text-based data refreshes on an hourly basis, meaning the map data can sometimes lag behind the 14-day forecast spot data.\nWhy does the wind symbol sometimes jump to over 40mph and turn black? Why are there no wind speeds in the 30s?\nWhen the forecast predicts gusts of wind over 40mph, the white wind icon - which usually shows the sustained wind speed - will change to a black icon showing the expected wind gust speed. This black icon will help to inform you in advance of potential hazards that may shape your day, for example severe impacts on transport. Once sustained winds are above 30mph, it is more likely that the wind gusts will be above 40mph. You may find, therefore, that sustained wind speeds between 30mph and 40mph rarely appear.\nWhat is UTC (Coordinated Universal Time)?\nThe Coast & Sea section, apart from Tide Tables, uses the UTC time standard. UTC is, for practical purposes, the same as Greenwich Mean Time (GMT). During the months when the UK is observing GMT, the times shown on the website are equivalent to GMT.\nDuring British Summer Time (BST), UTC is one hour behind the time observed in the UK. For Coast & Sea sections other than Tide Tables, you should therefore add one hour to the times shown during BST.\nOur Tide Tables pages use UTC/GMT for dates when the UK is observing GMT, and BST for dates when the UK is observing BST.\nWhy wasn't there a warning? Why was a warning issued when there weren't any impacts? I want more information about storm naming.\nNational Severe Weather Warnings are issued by the Met Office. We do feed back to the Met Office, external but you can contact them directly via enquiries@metoffice.gov.uk.\nThe naming of storms is a collaboration between the Met Office (UK), Met Eireann (Republic of Ireland) and KNMI (Netherlands).\n--------\nCan I save a list of favourite locations?\nTo find out more about the BBC's 'My Locations' feature, please see our 'My Locations' FAQs page.\nWhy is there missing data in the observations section and '--' displayed instead?\nThe main reason you may be seeing this symbol is that the local weather station does not collect this data. If all of the data is missing, then it is more likely that there is a fault with the weather station or the data feed to the website. This is likely to have been reported but can sometimes take a while to fix.\nWhy do I see adverts when I visit the BBC Weather website?\nTo make sure we're offering the best value for licence fee payers, users outside of the UK have access to the international version of the BBC Weather website. The international version of the website contains advertising.\nWe try to make sure that the advertising is only visible to people outside the UK, but due to the way certain Internet Service Providers (ISPs) connect you to the web, your location may be detected incorrectly.\nAnother reason you may be seeing adverts is if you're using a VPN (Virtual Private Network) connection to a server outside of the UK. People often do this for work reasons, for example to connect to their company networks.\nHowever, nowadays people are using VPN connections more frequently to access foreign versions of streaming websites. You can see the UK version of our website (advert-free) by disconnecting from the VPN.\nIf you're viewing the BBC Weather website from within the UK and you can see advertising, please use this form to let us know.\nHow can I request my town/city is added/correct an error with it?\nGo to the 'Contact the BBC' section on the website and follow the appropriate instructions to leave comments about a town to be added or an error to be corrected.\nHow can I download the BBC Weather app?\nThe BBC Weather app is available on Android, Amazon and iOS devices.\nYou can download the Android version from Google Play, external, the iOS version from the App Store, external and Amazon version from the amazon.co.uk website, external.\nThe BBC Weather app is only available to download in the UK.\nIf you have a specific question about the BBC Weather app which isn't covered on this page, please refer to our Apps FAQs.\nSomething is broken on the website. Why?\nWe rigorously test the BBC Weather website on a variety of devices, operating systems and browsers. Many of the issues that our users face can be resolved by updating to the latest version of the browser and checking that you have the correct settings enabled.\nThe site uses cookies and JavaScript to help us provide the best possible user experience. If either of these is disabled, the website might not work as expected.\nSome antivirus/security software or administrator policies on a work computer can also interfere with expected behaviour, e.g. preventing you from changing your preferences (from Celsius to Fahrenheit, for example), on the site.\nUnfortunately, due to the combination of available devices, operating systems, browsers and settings that can cause issues to appear, we cannot offer technical support on an individual basis.\nHowever, if you find that something is broken with the website, we advise you to:", "url": "https://www.bbc.com/weather/about/17185651"}