{"authors": ["Matt Taylor"], "date_download": "2025-05-21 05:36:35", "date_modify": "2025-05-21 05:36:35", "date_publish": "2025-04-01 07:43:30", "description": "March was one of the driest and sunniest on record for some parts of the UK.", "filename": "weather_articles_cj9ejl21p72o_1747805795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/ae80/live/8508e900-0e33-11f0-a4bb-6b40441fc890.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cj9ejl21p72o_1747805795.html", "title": "Record dry March for parts of England and Wales", "title_page": "Record dry March for parts of England and Wales  - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "March was an incredibly dry month across the UK with England and Wales experiencing their driest March conditions since at least 1961.\nParts of East Anglia have seen their sunniest March on record. But as the dry and sunny conditions continue there is an increased fire risk across large areas of England.\nCentral and southern parts of England were the driest through the month and at St James's Park in Central London just 2.6mm (0.1in) was recorded, making it the weather station's driest March on record.\nEven with the severe storms that battered a few parts of England with intense rain, hail and thunder on Saturday 22 March, many places avoided the heavy downpours.\nFor Lyneham (Wiltshire) and Plymouth (Devon), it was the driest March since 1961, with Blackpool (Lancashire) extending that record to 1960. Lyneham only recorded 3.2mm (0.13in) of rain through the entire month - this was just 6% of the long-term average for March.\nAccording to the Met Office, across England and Wales as a whole only a quarter (25%) of the typical March rainfall was recorded, with south-east England driest of all, receiving just 13% of its normal rainfall.\nNorthern Ireland and Scotland also experienced a drier March than usual, picking up just 32% and 64% respectively of their typical rainfall amounts.\nWeather patterns were fairly static across north-west Europe during March.\nWith the Jet stream often looping to the north of the UK large areas of high pressure dominated. These were linked to large zones of drier air descending through the atmosphere which helps to prevent rain clouds from forming.\nThe position of the high pressure also meant that winds often blew out of dry continental Europe rather than from the moisture laden air of the Atlantic.\nIn contrast this same weather pattern brought wet and stormy weather across Spain and Portugal, with Madrid experiencing its wettest March ever recorded.\nThese blocked patterns are fairly common in spring. In 2024 the UK was on the flip side of the block and had it's sixth wettest spring on record. Some areas received almost double their normal amount of rainfall.\nResearch is ongoing to establish whether there is a link between the frequency and duration of such blocked weather patterns with the changing global climate.\nClear skies linked to these areas of high pressure also meant that most of the UK experienced sunnier conditions during March compared to normal. The far north of Scotland being the exception.\nFor Norfolk and Suffolk it was the sunniest March on record. At Wattisham, Suffolk, the sun shone for over 220 hours, surpassing the previous March record here of 198.3 hours of sunshine, set thirty years ago back in 1995.\nThe abundance of sunshine helped to make it a warmer than normal month for most of the UK, especially in Scotland. However, clear skies by night brought more frequent frosts for much of England and Wales. Weather stations at Benson (Oxfordshire), Shoeburyness (Kent) and Trawsgoed (Ceredigion) all saw night-time temperatures drop around 1C below the long-term average.\nThe dry conditions during March contributed to a number of wildfires across each of the four nations.\nFirefighters dealt with dozens of wildfires across Wales. Over just two days around the middle of the month 113 grass fires were reported in mid and south Wales.\nOn 21 March ash fell in the centre of Inverness, Highland, carried on the wind from a wildfire burning close to the city. Six fire engines and a water tanker were involved in tackling the blaze.\nWith dry conditions persisting and stronger winds forecast across England, the risk of further fires is set to increase into the first week of April.\nThe Met Office Fire Severity Index, external is currently at \"Very High\" for large areas of the Midlands and southern England from Wednesday to Friday. This is the second highest classification on a five point scale.\nThe Dorset and Wiltshire Fire and Rescue Service has issued their second amber alert of the year for fires, urging people not to use disposable barbecues or set campfires and to make sure cigarettes have been extinguished.\nRiver levels in many areas also continued to drop through March due to the lack of rainfall. According to the UK Centre for Hydrology and Ecology, external, some rivers in northern England especially, are experiencing notably low flow for this time of year.\nWet conditions and rainfall accumulations prior to spring meant that groundwater levels in many areas have held up well, so far.", "url": "https://www.bbc.com/weather/articles/cj9ejl21p72o"}