{"authors": ["Simon King"], "date_download": "2025-05-21 07:18:53", "date_modify": "2025-05-21 07:18:53", "date_publish": "2025-05-20 09:28:25", "description": "Intense thunderstorms with large hail ripped through parts of southern France on Monday.", "filename": "weather_articles_cp3nn50xzx4o_1747811933.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/ff47/live/ada7e0e0-3558-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cp3nn50xzx4o_1747811933.html", "title": "Huge hailstones hit parts southern France", "title_page": "Huge hailstones hit parts southern France - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Severe thunderstorms with large hail hit parts of south-west France on Monday afternoon.\nMeteo-France - the French weather service - had issued amber weather warnings in the Midi-Pyrenees and Aquitaine regions for thunderstorms and flash flooding. The service has provisionally reported that one person has been killed and another has been reported missing.\nTo the south of Toulouse, residents captured video of impressive hailstorms which ripped off tree branches and damaged crops.\nSome of the large hail was reported to be the size of ping pong balls.\nThe area of thunderstorms, producing approximately 13,000 lighting strokes in south-west France, also gave some significant rainfall totals.\nOne weather station in the town of Montauban, about 50km (31 miles) to the north of Toulouse recorded 83.5mm (3.3in) of rain in 24 hours up to 08:00 local time on Tuesday.\nNearly 30mm - just over an inch - of that fell between 19:00 and 20:00 local time.\nTo put this into some context, the average rainfall for the whole of May here is around 43mm (1.7in).\nThe heavy showers and thunderstorms moved east overnight with an amber warning in place for the Var region into Tuesday morning for a risk of some flash flooding.", "url": "https://www.bbc.com/weather/articles/cp3nn50xzx4o"}