{"authors": ["Chris Fawkes"], "date_download": "2025-05-20 12:26:34", "date_modify": "2025-05-20 12:26:34", "date_publish": "2022-02-15 15:37:28", "description": "As the UK braces for a second storm this week BBC Weather's Chris Fawkes explains more about named winter storms and their impacts.", "filename": "weather_feeds_60392598_1747743994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/E868/production/_123269495_uk_warnings_wednesday2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/weather_feeds_60392598_1747743994.html", "title": "Storm Dudley and Storm Eunice: What you need to know", "title_page": "Storm Dudley and Storm Eunice: What you need to know - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n16 February 2022\nAnother named storm is heading for the UK this week.\nAfter Storm Dudley brought disruption on Wednesday, Storm Eunice is expected to arrive on Friday. It will be the fifth named storm of the 2021-22 UK season.\nWhy are storms named?\nStorms are named to alert the public to a heightened risk of severe weather that is expected to cause disruption. Storms have been named by the Met Office, along with the Republic of Ireland weather service, Met Éireann, since 2015. The Royal Netherlands Meteorological Institute (KNMI) also joined the initiative in 2019. You can see the current list of storm names below.\nWhat are weather warnings and what do the colours mean?\nWeather warnings are issued when severe weather is forecast. Warnings are given one of three colours: yellow, amber or red. The colour is based on the expected impacts of the severe weather and how likely it is to happen. Red warnings are issued infrequently, but are the top tier of warnings with the greatest impacts.\nHow do UK weather warnings work?\nWeather warnings are issued when severe weather is forecast. Warnings are given one of three colours: yellow, amber or red. The colour is based on the expected impacts of the severe weather and how likely it is to happen. Red warnings are issued infrequently, but are the top tier of warnings with the greatest impacts.\nWhy is the storm track so crucial?\nThe track of a storm determines where the most severe weather will be in terms of the strongest winds or the heaviest rain. It can also be really important in determining whether rain may turn to heavy snow.\nHow important is wind direction?\nWind direction can determine whether we get extreme rainfall during storms. Extreme rainfall can result from moisture-laden winds hitting high ground. For example, parts of Aberdeenshire could experience extreme rainfall if an easterly wind rises up the Cairngorms, but that would be less likely if the wind is westerly. In this example, any heavy rain would be more likely to hit west Scotland instead.\nWind direction can also influence how much damage the weather can cause in strong winds. For example, trees that grow braced against the prevailing wind direction may be more susceptible to being blown over in severe winds coming from the opposite direction.\nWhy does it take so long to be certain about the storm's track?\nSome storms can be very accurately forecast many days in advance. The Met Office first issued yellow weather warnings for Storm Dudley last weekend. These warnings were upgraded to amber warnings on Monday 14 February, yet the impacts from the storm weren't felt until Wednesday, 16 February, giving plenty of time to plan ahead.\nBut it's expected Eunice could have bigger impacts. Again, weather warnings have been issued well ahead of time. The warnings are amber at the time of writing and state the risk of very damaging 80 mph inland gusts of wind, the chance of 100 mph gusts on western coasts, and disruptive areas of heavy snow with blizzards. The fact that we could warn for Eunice so far ahead is an amazing achievement of modern science, when you consider warnings were issued before the storm even existed. It only started forming on Wednesday afternoon.\nHow unusual is it to get two storms back to back?\nThere are a number of examples of storms forming in quick succession. In 2018, Storm Ali brought damaging, disruptive winds on 19 September with a gust of 102 mph recorded at the Tay Road Bridge. This was followed the next day by Storm Bronagh, which brought a gust of 78 mph and floods to parts of Wales and the north of England.\nEven the most famous, or infamous storm in living memory had a follow-up act. The 'Great Storm' of 16 October 1987 brought extreme damage to southeast England. Gusts of 115 mph were reported in Shoreham in West Sussex, 94 mph at London Weather Centre and 135 mph across the Channel in Granville, France. There were 18 fatalities reported and an estimated 15 million trees flattened. Just two days later, on 18 October 1987, another storm hit the UK with a top gust of 85 mph recorded at Berry Head in Devon.", "url": "https://www.bbc.com/weather/feeds/60392598"}