{"authors": ["Sarah Keith-Lucas"], "date_download": "2025-05-21 05:29:17", "date_modify": "2025-05-21 05:29:17", "date_publish": "2024-12-25 01:43:45", "description": "Did you know that snow is not white? Or that it falls at three miles an hour? Sarah Keith-Lucas has these facts and more.", "filename": "weather_articles_c1lg6zdyemyo_1747805357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/44b1/live/b03023a0-ab46-11ef-b929-77253fe9e947.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_c1lg6zdyemyo_1747805357.html", "title": "UK snow: Five things you might not know", "title_page": "UK snow: Five things you might not know about snow - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The mention of snow in our forecasts always pricks people ears up, whether it is the prospect of sledging and snowball fights, or the threat of travel disruption and school closures.\nLove it or loathe it, here are five things you might not know about snow.\nIt is actually translucent.\nWhen light enters a snowflake, the complex structure of the ice crystals scatter the light into the seven colours of the rainbow.\nThese colours are reflected so many times within a snowflake that they combine to make white light, and this is what is reflected back to our eyes.\nA snow depth of 1.65m or 5ft 5in is almost deep enough to completely bury the average adult.\nThis was recorded back in March 1947 in Denbighshire, North Wales, during the snowiest UK winter of the 20th century. Snow drifts caused by blowing winds also led to drifts as deep as 6m (20ft).\nScotland is the snowiest part of the UK due to its latitude and altitude, so it is no surprise that the language around snow is much more diverse in Scotland compared to the rest of the UK.\nSome of the 421 terms to describe snow include snaw (snow), feefle (to swirl) and skelf (a large snowflake).\nThe Cairngorms mountain range averages 76 snow days every year. The number of days when snow falls is higher, but it does not always settle.\nThis is around walking pace but, in calm conditions, a snowflake can take around an hour to reach the ground after leaving the base of the cloud.\nThe path and time taken for a snowflake to fall depends on several factors including the wind speed, the humidity of the air and the height of the cloud.\nStrong winds combining with heavy snowfall lead to blizzards which can be particularly disruptive.", "url": "https://www.bbc.com/weather/articles/c1lg6zdyemyo"}