{"authors": ["Simon King"], "date_download": "2025-05-21 07:35:46", "date_modify": "2025-05-21 07:35:46", "date_publish": "2025-01-22 11:41:35", "description": "Storm Éowyn will bring severe gales to parts of the UK on Friday with widespread disruption likely", "filename": "weather_articles_cr46z2dv606o_1747812946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/8927/live/862e9d80-d8ef-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/weather_articles_cr46z2dv606o_1747812946.html", "title": "Storm Éowyn: Amber weather warning issued for UK amid threat of 90mph winds", "title_page": "Storm Éowyn: Amber weather warning issued for UK amid threat of 90mph winds - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Amber severe weather warnings from the Met Office have been issued for Friday as Storm Éowyn brings severe gales.\nThe strongest winds are likely around Irish Sea coasts where gusts could be in excess of 90mph (145km/h).\nBut gusts of 60-70mph (97-113km/h) are widely expected throughout the day with yellow weather warnings issued from Thursday.\nHeavy rain and hill snow will also spread eastwards across the United Kingdom.\nStorm Éowyn – pronounced \"ay-oh-win\" – and the fifth named storm of the season will undergo rapid development during Thursday as it moves across the Atlantic. It will be fuelled by a very powerful jet stream which is fast moving air high in the atmosphere where wind speeds are around 260mph (418km/h).\nThe exact track that Éowyn takes as it approaches the UK and Ireland will determine where the strongest winds will be.\nIt'll turn windy on Thursday, especially on coasts of west Wales and southern England where there is a yellow Met Office wind warning in force from 07:00 GMT to 18:00.\nHowever, this spell of strong winds with gusts of 50-60mph (80-97km/h) is not connected to Storm Éowyn.\nThe strong winds associated with Éoywn will start on Friday morning.\nMet Office amber severe weather warning covers Northern Ireland, southern Scotland, northern England and North Wales from 06:00 GMT to 21:00 on Friday.\nWind gusts of 60-70mph (97-113km/h) fairly widely inland and 80-90mph (129-145km/h) along more exposed coasts and hills.\nThe Met Office suggest that we could even perhaps see even higher gusts in a few locations.\nElsewhere, yellow warnings have been issued for most of the UK on Friday and continuing across much of Scotland into Saturday.\nAcross northern and western Scotland, parts of the Midlands and southern England, gusts of 50-65mph (80-105km/h) are expected but around coastal areas gusts up to 80mph (129km/h) are likely.\nMet Office warnings could still be adjusted and possibly upgraded ahead of Friday.\nThese gales and severe gales are likely to bring travel disruption and some damage, which could include roof tiles being blown off and power cuts.\nLarge waves are also expected with coastal overtopping.\nHeavy rain is also expected where there is a yellow Met Office rain warning for west Wales and south-west England from midnight to 09:00 GMT Friday.\nWhile it will turn milder for some, especially in the south, it will remain cold enough for snow to fall over hills in Scotland and northern England.\nWith potentially 15-25cm (6-10 in) of snow to fall over the highest ground there is a separate yellow warning for snow from 03:00 GMT to 12:00 on Friday.", "url": "https://www.bbc.com/weather/articles/cr46z2dv606o"}