{"authors": ["BBC Weather"], "date_download": "2025-05-20 13:45:49", "date_modify": "2025-05-20 13:45:49", "date_publish": "2018-01-26 11:53:26", "description": "The BBC Weather website is changing. Here are some tips for getting round the new site.", "filename": "weather_about_42822208_1747748749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/FF2E/production/_99762356_interactive_map.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/weather_about_42822208_1747748749.html", "title": "Top tips for using Weather", "title_page": "Top tips for using Weather - BBC Weather", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Weather has started working with new weather partner MeteoGroup which means we get new data and forecasting information into some of our digital services.\nWe have also redesigned our BBC Weather website and applications on iOS, Android and Kindle so you will see changes over the next few weeks as these are rolled out.\nMore information about what's changing can be found on the BBC's Internet Blog, but here are answers to some frequently asked questions about the new site.\nYour favourite locations do work in a different way on the new site, and we ask you to sign in to add locations because it's the best way to keep them safe and secure.\nHowever, you can find all your recent location searches by tapping on the search field at the top of any BBC Weather page. And you don't have to sign in/register with the BBC to see them.\nIf you do register/sign in, then you can set up your favourites there and keep the same list of places, including your default home location, regardless of what you search for in future. It only takes a few moments and means you can access your stored locations on both computer or tablet, simply by signing in to the BBC.\nJust search for any location and you should see 'Add to my locations' prompt next to the location name. Select this option and you'll be prompted to sign in or register with the BBC. Once signed in, you can always access your favourite stored locations by clicking on the search field at the top of the page. For more information about locations, visit the 'My locations' in Weather page.\nIn the near future, we will continue to make improvements which will allow you to see forecast snapshots from all your favourite locations on the homepage when you are signed in.\nYou can also find out more about how we treat your location data here.\nMaps can be found on any forecast location page. For example, search for Hull and then go to the Hull forecast page. Then just scroll down the page until you can see a map.\nThis shows you our new interactive map for the region around the location you've selected. Select the 'Full screen' button to open the interactive map, zoom or scroll to see weather affecting the whole UK or different parts of the world.\nWe hope you like this new addition to the site. We have worked hard to allow you to manipulate the different data fields by turning them on and off as you feel is helpful to planning your day (using the key and options box on the left) . You can also easily see weather right across the globe.\nWe will endeavour to add more information about precipitation and how it is calculated on the site. In the meantime, here is an explanation about what we mean by precipitation, i.e. rain, snow, hail, and so on.\nAll aspects of predicting the weather are a culmination of determining the most likely state of the weather at a particular place and a particular time. In order to give you the ability to determine the relative chance of precipitation, MeteoGroup use the probability of precipitation (% chance). This ranges from 0% (no chance at all) to 100% (it will be wet).\nSo what does a 20% chance of rain actually mean? It means that out of 100 situations with similar weather, it should rain on 20 of those, and not rain on 80. In a nutshell, it means that, whilst you may get some rain, it's much more likely (but not certain) to stay dry.\nThe probabilities are given for the location chosen, and thus are valid for that location only. As MeteoGroup forecasts take advantage of hourly updates, which include real-time information from radar, satellite, and nearby weather station observations, you may notice the probabilities changing in the short-term (next 2-3 hours). This gives you the chance to spot when, for example, a shower may be approaching your location, as the probabilities will tend to rise.", "url": "https://www.bbc.com/weather/about/42822208"}